["Most people have heard about what will happen if humans keep pumping large amounts of carbon dioxide into the air as we burn more fossil fuels, including warmer temperatures, melting polar caps, rising sea levels, stronger storms and big changes in the types of plants and animals that can survive and thrive in particular regions of the world.", "\"But wait,\" as an evil TV pitchman might gleefully declare, \"there's more.\"", "On June 12, 2013, U.S. Sen. Sheldon Whitehouse, a Democrat from Rhode Island, took to floor of the Senate for one of his regular speeches about the impact of pollution on Earth's climate. This time he focused on a lesser-publicized problem -- the oceans are becoming more acidic.", "\"Our oceans face unprecedented challenges from climate change and carbon pollution,\" he said. \"Oceans have absorbed more than 550 billion tons of our carbon pollution. As a result, they have become 30 percent more acidic. That is a measurement. That is not a theory.\"", "Thirty percent more acidic?", "Our first question was: \"Is it true?\" Our second was: \"If so, what does that mean?\"", "When most people think of measuring acidity, they think of pH, the scale that runs from 0 to 14. (Think back to your school days and the little strips of paper that changed color depending on whether a substance was an acid or a base.)", "\"So,\" you might ask, \"has the pH of the ocean shifted a few points?\"", "Not at all. The pH scale is not a straight-line measure like a yardstick. It's a logarithmic scale, where a one point drop would make a substance 10 times more acidic. (What you're really measuring is the number of hydrogen ions, which determine how acidic something is.)", "Whitehouse's office directed us to several sources -- and we found our own -- reporting that since the mid-18th century, when air pollution became more prevalent, the pH of surface seawater has gone from about 8.2 to about 8.1. (That's a rise in acidity, but sea water would have to drop below 7.0 before it could be officially classified as an acid.)", "Lowering the pH by a tenth of a point translates to a 26-percent rise in hydrogen ion concentration, but some of those science sources say the increase is actually closer to 30 percent.", "The pH scale has been around only since 1909. How do we know what the pH was like in the 1800s or earlier?", "The oceanographers we consulted told us basic chemistry provides the answer.", "Seawater absorbs air, including carbon dioxide. The carbon dioxide interacts with the water to make the ocean more acidic. Researchers have good measurements directly comparing carbon dioxide and pH dating to 1989. They show that surface ocean acidity has risen as carbon dioxide levels in the atmosphere have risen, just as expected.", "To go further back in time, scientists have measured the carbon dioxide concentrations in tiny bubbles of air trapped in ice found in places such as Greenland and Antarctica.", "Those ice cores show that, until the 1850s, the carbon dioxide levels in the atmosphere had not risen above 280 parts per million for most of the last million years or so.", "But in the past century and a half, they’ve been rising steadily, causing an increase in ocean acidity.", "Today, those carbon dioxide levels have occasionally passed 400 parts per million.", "\"It's been mostly in the last 100 years,\" said Steve D'Hondt, an oceanography professor at the University of Rhode Island.", "One other point. The acidity of the entire ocean hasn't changed by the amount Whitehouse citied. The chemical composition of deeper layers shifts much more gradually.", "\"It's been a long time since the deep ocean touched the atmosphere,\" said Andrew Dickson of the Scripps Institution of Oceanography, at the University of California-San Diego. \"So it's not true of the ocean as a whole. It's only true of the surface layer.\"", "That leads us to our second question: what does it mean?", "Because the effects of acidification are currently restricted to the upper 600-1,600 feet of the ocean, where most of the life is found, there's serious concern that small changes in pH will have a big -- and not very healthy -- effect on many ocean species, although some may be unaffected.", "Earth's oceans have been much more acidic in the past -- 110 million years ago the oceans were 400 percent (five times) more acidic. But most of those changes developed over millions of years, giving organisms time to evolve and adapt to the shift. The current rise in acidity is rapid.", "Said University of Rhode Island oceanographer Arthur Spivack, \"We already have a measurable change in ocean pH and we're going into a period where there will be a substantial change.\"", "Our ruling", "U.S. Sen. Sheldon Whitehouse said the oceans \"have become 30 percent more acidic.\"", "He is correct if you look at the increase in the concentration of hydrogen ions since the 1850s in the upper layers of the ocean, where most sea life thrives. We also note that he's describing the change using a measure that heightens the drama for the casual listener. But regardless of how it is characterized, that change is cause for concern if it harms ocean creatures sensitive to changes in pH.", "On the other hand, the deeper ocean has not seen a 30-percent increase.", "Because his statement is accurate but needs clarification and additional information, we rate it Mostly True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "YouTube.com, \"Time to Wake Up: Environmental Leaders Day,\" at the 34-second mark, June 12, 2013, accessed June 25, 2013", "WHOI.edu, \"The pH Scale,\" and \"FAQs about Ocean Acidification,\" undated, accessed July 12, 2013", "Interviews and emails, Barbel Honisch, geochemist, Lamont-Doherty Earth Observatory (July 17-18, 2013); Andrew Dickson, oceanographer, University of California San Diego (July 9-16, 2013); Arthur Spivack and Steve D'Hondt, oceanographers, University of Rhode Island (June 26-July 16, 2013).", "Science, \"Atmospheric Carbon Dioxide Concentration Across the Mid-Pleistocene Transition,\" Figure 1F, June 19, 2009, accessed July 16, 2013", "PMEL.NOAA.gov, \"A primer on pH,\" undated, accessed July 12, 2013", "CDIAC.ORNL.gov, \"800,000-year Ice-Core Records of Atmospheric Carbon Dioxide (CO2),\" Carbon Dioxide Information Analysis Center, Oak Ridge National Laboratory", "LATimes.com, \"Carbon dioxide levels in atmosphere pass 400 milestone, again,\" Los Angeles Times, May 20, 2013, accessed July 17, 2013", "ERSL.NOAA.gov, \"Trends in Atmospheric Carbon Dioxide,\" Earth System Research Laboratory, accessed July 17, 2013", "Darchive.MBLWHOILibrary.org, \"Frequently Asked Questions About Ocean Acidification,\" UK Ocean Acidification Research Programme,\" Sept. 15, 2012, accessed July 2013.", "Newswise,com, \"In CO2-Rich Environment, Some Ocean Dwellers Increase Shell Production,\" Dec. 1, 2009", "SkepticalScience.com, \"Ocean Acidification: global warming's evil twin,\" updated March 19, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]