["On February 8, 2020, filmmaker Vivek Agnihotri tweeted a screenshot which says, ‘Breaking News: Weed kills coronavirus.’ Posting the image, which looks like a ‘news’ broadcast, Agnihotri made a case for legalising cannabis in India. “Cannabis is a magic plant. Till mid-80s it was sold by Govt. Because of Rajiv Gandhi and western Pharma companies it got bad name,” he wrote, ending his tweet with the following appeal: “Make cannabis legal.”", "A few other also claimed that cannabis kills coronavirus after Agnihotri’s tweet.", "Solution to a lot of world’s problems lie in India. But you can’t find them as long as you ridicule our ancient wisdom.", "Cannabis is a magic plant. Till 1980 it was sold by Govt. Becoz of Rajiv Gandhi & West Pharma Companies it got bad name.", "Make #Cannabis legal !!#CoronaVirus pic.twitter.com/ciDsFIwM9x", "— NATIONALISM (@BeingNationali1) February 8, 2020", "A simple reverse-image search revealed that the screenshot shared by Agnihotri does not correspond to a news broadcast but is a meme. It was created on the website en.dopl3r.com.", "The website gives users the option to select a meme temple, a category and add images and text.", "Alt News Science editor Dr Sumaiya Sheikh weighed in on the claim that cannabis, commonly termed as ‘weed’ has antibiotic properties: “There is some ongoing research with natural fibre hemp plants (cannabis plant) to have cannabinoids that show some anti-bacterial activity. The research is ongoing for various biomedical applications. However, unlike bacteria which is a single-celled pathogen, viruses are even smaller pathogens that can have bacteria or other live cells such as human, animal and plant cells for growth and reproduction. There is no evidence that cannabis (hemp plants) can have any effect on coronavirus infections.”", "Hence, not only did Vivek Agnihotri share a meme as ‘news’, but he also circulated potentially dangerous misinformation that cannabis can kill coronavirus. Alt News Science has been dunking both scientific and generic misinformation surrounding the outbreak of coronavirus. You can read our reports here.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]