["Gov. Scott Walker promised to create 250,000 private sector jobs by the end of his four-year term. With less than two years remaining, the governor’s opponents -- and supporters -- are paying increased attention to the count.", "That’s why an item posted April 9, 2013 by the MacIver Institute caught our attention.", "The Madison-based group, which publishes items supportive of conservative causes -- items that are often then cited by other conservatives -- included this headline: \"Gov. Scott Walker more than halfway to 250,000 jobs goal.\"", "That’s a much larger number of jobs created under Walker than we’ve ever heard -- even from the governor himself.", "In December 2012, Walker said the state had created \"just under 100,000 jobs\" since he took office. We rated that statement Pants on Fire.", "Why?", "Walker had combined full and partial year data sets from the Quarterly Census of Employment and Wages compiled by the federal Bureau of Labor Statistics. His staff explained that he was using a \"raw number.\"", "But state experts and the governor’s own staff have long said that while the quarterly census is more accurate than monthly measures, the census data should only be viewed in one-year blocks. That is, January to January, or July to July. In other words, you can’t combine partial years of census data with full years to create a running total, due to major seasonal fluctuations in the workforce.", "Here is what Walker spokesman Cullen Werwie told us when we asked about job numbers in the summer of 2012: \"Please don’t, as John Koskinen, an economist at DOR would say, compare February temperatures to July.\"", "When we asked MacIver  to show us their math, spokesman Nick Novak responded:", "\"We used Bureau of Labor Statistics QCEW figures for each month from January 2011 to September 2012 (the most recent month available).  To get to the number of 137,372, we simply subtracted the January 2011 jobs number from the September 2012 jobs number.\"", "Novak provided a link to a BLS report that showed the two numbers.", "But, this isn’t just a simple math problem. MacIver made two critical errors in their calculations.", "Starting point", "Walker took office at the beginning of January 2011. MacIver used the number for the end of January 2011. To properly measure the governor’s promise, you need to start with the number of jobs that existed at the start of his term. That is a difference of 65,401 jobs.", "Here’s how it plays out the way the MacIver Institute calculated the numbers.", "January 2011 census number: 2,205,584", "September 2012 census number: 2,342,956", "Increase: 137,372.", "Here’s how it plays out with the December 2010 number.", "December 2010 census number: 2,270,985", "September 2012 census number: 2,342,956", "Increase: 71,971", "In summary: MacIver’s math nearly doubles Walker job count because it started counting one month later. In effect, they used a lower starting point, which makes the growth seem larger -- by 65,401 -- than it really is.", "And even that is a bad number.", "Apples to oranges", "There’s a second, more important -- and more familiar -- problem. Like Walker in December,  MacIver failed to line up a year-to-year comparison. It measured February temperatures against July.", "What’s more, the item itself notes that Koskinen, the state economist, told them they should not combine the data sets in this manner:", "While Koskinen called the numbers \"literally true\" the article goes on to note: \"Koskinen said economists typically use the same month from different years to avoid seasonal variations in employment.\"", "Asked about this, Novak said:", "\"In the article we account for the fact that this is not seasonally adjusted and that the chief economist from the Department of Revenue is wary of using data from different months when comparing data year over year.\"", "But they didn’t apply any such disclaimer to their headline, or a very large graphic.", "The claim was retweeted by Madison-based conservative talk show host Vicki McKenna to her 7,114 followers and Milwaukee talker Charlie Sykes posted it on his Right Wisconsin subscription-based website.", "PolitiFact Wisconsin follows Walker’s jobs promise using the Walk-O-Meter, using a method created with guidance from both state and academic economists, including Koskinen. We combine full year census reports with less accurate monthly employment survey results, and show the results in a monthly graphic. Once full-year information becomes available, it is added in to get an ever-stronger number.", "As of February 2013, our latest estimate of the number of jobs created since Walker took office is 63,700.", "Our rating", "The MacIver Institute posted an item that says Wisconsin has 137,372 more private sector jobs than when Gov. Scott Walker first took office, meaning that Walker is more than halfway to his goal of 250,000 jobs.", "The jobs promise will be the No. 1 yardstick used to measure Walker’s performance as governor.", "But the conservative group’s number is wrong, two times over.", "MacIver started with the wrong month of data. That alone nearly doubled the number of jobs they claim were created under Walker.", "They compounded their error by combining full and partial years of data -- even though they (like the governor himself) were told not to do so.", "Pants on Fire.", "MacIver Institute, \"Gov. Scott Walker more than halfway to 250,000 jobs goal,\"April 9, 2013", "Vicki McKenna Twitter account", "RightWisconsin.com", "Bureau of Labor Statistics QCEW State and County Map", "Bureau of Labor Statistics database and calculators by subject", "Wisconsin Department of Workforce Development news release, Aug. 16, 2012", "PolitiFact Wisconsin,\"Gov. Scott Walker says Wisconsin has created almost 100,000 jobs since he took office,\"Dec. 16, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]