["About this rating", "Comedian Ellen DeGeneres has frequently used her platform to speak out against gun violence; in 2016, she signed a petition advocating for background checks and other gun control measures, and in February 2018 — shortly after seventeen people were killed at a high school in Parkland, Florida — she invited some of the surviving students onto her show to talk about the #NeverAgain movement.", "DeGeneres's advocacy for gun control seems to have rubbed some people the wrong way, however. A few disreputable sources have attempted to paint the talk show host as a hypocrite by circulating an image of her in a crowd, along with the claim that she demanded that armed guards accompany her to an anti-gun rally:", "Other versions of this image, such as one posted by the web site DC Whispers, claimed that six guns could be spotted in this photograph:", "This image was not taken at an anti-gun rally. And although some of the individuals in this photograph may indeed be carrying a weapon (most likely the police officers), there is not one single definitive image of a gun. It was actually taken in Boston in August 2011, when DeGeneres was in the city to promote her show:", "A mob of dancing and screaming Ellen DeGeneres fans showed up at Faneuil Hall on Aug. 10 to see the beloved daytime talk show host tape promos for her new time slot. DeGeneres, who will take over Oprah Winfrey's 4 p.m. hour on WCVB-TV Channel 5, spent the morning seeing the sights from a Boston Duck Tours boat, then danced for the thousands of fans who showed up at Quincy Market to welcome her to town. By her side was wife Portia DeGeneres, known professionally as Portia de Rossi. Some may also remember the \"Arrested Development\" actress from the series \"Ally McBeal,\" which just so happened to be about a fictional Boston law firm.", "Boston.com has several other images of the event. The blog Carrots & Cake, which also documented the event, credited the image used in this meme to Twitter user @Kafranklin21, but it appears that the original image has been removed.", "This claim, then, was made up out of the whole cloth by disreputable web sites attempting to smear DeGeneres as a hypocrite. We're also not entirely convinced that the pictured security guard is truly carrying a weapon:", "The item in the guard's pocket might be a gun, but it looks more like a walkie-talkie to us. Regardless, it's the only object in this photograph that even vaguely resembles a firearm.", "We can assume that the police officer is on duty and therefore carrying a weapon, but this...", "this...", "and these...", "...simply are not guns.", "This meme does not show Ellen DeGeneres at an anti-gun rally, nor does it provide any proof that the star \"demanded\" to be protected by armed guards.", "Fox, Jeremy.   \"Visit From Ellen DeGeneres Creates Frenzy at Quincy Market.\"\r\n    Boston.   10 August 2011", "Mizoguchi, Karen.   \"Katy Perry, Ellen DeGeneres Among 133 Stars to Sign Billboard Petition Demanding Gun Control.\"\r\n    People.   23 June 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]