["About this rating", "If you are experiencing distress, please contact the National Suicide Prevention Lifeline at 1-800-273-8255 or visit online here.", "In June 2019, the @SixthFormPoet Twitter account posted a 10-part story that captured the imaginations (and inspired some skepticism) of millions of readers worldwide.", "The account's creator — whose identity is not publicly known but who goes by the name \"Matt\" — is best known for posting throwaway jokes and punny one-liners. But on 9 June he published an apparently earnest account of how a visit to his father's grave led him to meet his wife, by way of a dramatic Christmas Day family annihilation. The following story, and elements of our fact check, contain mentions of suicide and murder that some readers might find disturbing:", "My dad died. Classic start to a funny story. He was buried in a small village in Sussex. I was really close to my dad so I visited his grave a lot. I still do. [DON’T WORRY, IT GETS FUNNIER.] I always took flowers and my mum visited a lot and she always took flowers and my grandparents were still alive then and they always took flowers. My dad’s grave frequently resembled a solid third place at the Chelsea Flower Show. Nice but I felt bad for the guy buried next to my dad. He NEVER had flowers. Died on Christmas Day aged 37, no one left him flowers and now there’s a pop-up florist in the grave next door. So I started buying him flowers. I STARTED BUYING FLOWERS FOR A DECEASED MAN I’D NEVER MET.", "I did this for quite some time, but I never mentioned it to anyone. It was a little private joke with myself, I was making the world a better place one bunch of flowers at a time. I know it sounds weird but I came to think of him as a friend. I wondered if there was a hidden connection between us, something secretly drawing me to him. Maybe we went to the same school, played for the same football club or whatever. So I googled his name, and ten seconds later I found him. His wife didn’t leave him flowers BECAUSE HE’D MURDERED HER. ON CHRISTMAS DAY. After he murdered his wife, he murdered her parents too. And after that he jumped in front of the only train going through Balcombe tunnel that Christmas night. THAT was why no one ever left him flowers. No one except me, of course. I left him flowers. I left him flowers every couple of weeks. Every couple of weeks FOR TWO AND A HALF YEARS.", "I felt terrible for his wife and her parents. Now, I wasn’t going to leave them flowers every couple of weeks for two and a half years but I did feel like I owed them some sort of apology. I found out where they were buried, bought flowers and drove to the cemetery. As I was standing at their graves mumbling apologies, a woman appeared behind me. She wanted to know who I was and why I was leaving flowers for her aunt and grandparents. AWKWARD. I explained and she said ok that’s weird but quite sweet. I said thanks, yes it is a bit weird and oh god I ASKED HER OUT FOR A DRINK. Incredibly, she said yes. Two years later she said yes again when I asked her to marry me because that is how I met my wife.\"", "The story circulated widely on Twitter and formed the basis of numerous news articles, including those published by the U.K. tabloids The Sun and The Mirror, as well as the New Zealand Herald, the Indian news channel News18, and the iHeart Radio website, which made a point of describing the anecdote as \"dark but true.\" @SixthFormPoet had himself introduced the story as being \"ENTIRELY TRUE.\"", "However, the anecdote's dramatic twists and turns, romantic ending, and its viral spread online in the second week of June 2019 prompted multiple inquiries from Snopes readers about the veracity of its claims.", "We have so far been unable to find any evidence that supports the details of @SixthFormPoet's \"graveyard\" story, nor any evidence that definitively disproves them. Until such evidence emerges, we issue a rating of \"Unproven.\"", "However, some elements of the story appear implausible, and it is likely to contain at least a significant measure of fabrication.", "\"10 seconds later I found him\"", "The author claims that he was able to discover the grisly circumstances surrounding the death of the man whose grave he had been visiting within 10 seconds of performing a Google search for the man's name. Although we can't replicate exactly that search because we don't know the man's name, we were unable to find any record of a triple murder and suicide of the kind described in the story, despite using some of the other specific details and keywords included by @SixthFormPoet:", "We searched newspaper archives, spoke with journalists based in Sussex, and consulted local and national law enforcement agencies, as well as local people with a particular knowledge of, and interest in, recent Sussex history.", "Despite these extensive efforts, we found not a single incident that matched the descriptions provided by @SixthFormPoet, even though he claimed to have been able to obtain all those details with a 10-second Google search using only one piece of information, the man's name.", "Also notable is that murder-suicides and family annihilations are relatively rare in the United Kingdom, and such horrific incidents tend to both attract extensive news coverage and stand out in the collective memories of local people. This would likely be especially so if the murder-suicide took place on Christmas Day. And yet, not a single local person whom we consulted had any awareness or memory of such a series of events. As such, the details provided by @SixthFormPoet likely were either mistaken on several counts, or the result of a whole-cloth fabrication.", "\"The only train that Christmas night\"", "As a general rule, passenger trains do not run on Christmas Day in the United Kingdom. In 2007, the Guardian reported that:", "\"Christmas Day service is, in a word, zero. And Boxing Day, next-to-zero. Indeed, so eroded has the timetable become across the whole festive season that Britons now accept this as normal. But why? Can we not have proper railways that carry us around the country seeing (and crucially, fleeing) our loved ones at Christmas? Lack of public demand is the key reason cited by the Association of Train Operating Companies. 'After 1948, Christmas Day train services went into in decline,' it says, with passenger numbers falling throughout the 1950s -- 'one reason being that cars were more accessible.' The last passenger train at Christmas ran in 1964. Following that lead, London Underground's last Christmas Day tube was in 1979.\"", "The man described in @SixthFormPoet's anecdote, therefore, likely would have been unable to take his own life in front of a passenger train in the Balcombe Tunnel (or on any other stretch of railway in the United Kingdom) on any Christmas Day in roughly the last half century.", "However, non-passenger trains do continue to run on Christmas Day in the United Kingdom, as employees of the government-owned company Network Rail perform maintenance and repairs, taking advantage of the lack of passenger traffic on 25 December.", "In principle, someone could possibly commit suicide in front of a non-passenger train in the Balcombe Tunnel on Christmas Day, although it is statistically unlikely (because Network Rail does not routinely perform repairs on the entire rail network, only certain parts) and would also make little sense as a suicide method, since the man would have had to wait by the tracks on the off-chance that a maintenance train might pass by while likely also knowing that no passenger trains were passing that day.", "Although sound logical reasons exist to view the \"Christmas Day train\" element of the story as being highly unlikely, we cannot definitively rule it out as a possibility.", "We contacted @SixthFormPoet through his publisher, asking him for the name of the man whose grave he had been visiting — the piece of information he claims allowed him to quickly discover the details about the murder-suicide that forms the basis of his story. Unfortunately, we did not receive a response of any kind in time for publication.", "Pemberton, Becky.   \"Man Reveals He Met His Wife in a Graveyard After Unknowingly Leaving Flowers for Her Murderer Uncle -- And the Bizarre Story Has Gone Viral.\"\r\n    The Sun.   9 June 2019.", "Lavender, Jane.   \"Incredible Story of How Man Met His Wife and It Involves a Total Stranger's Grave.\"\r\n    The Mirror.   11 June 2019.", "The New Zealand Herald.   \"Man Meets Future Wife After Visiting Her Murdering Uncle's Grave.\"\r\n    11 June 2019.", "Mukherjee, Jashodhara.   \"'How I Met My Wife': This Guy's Love Story Is Straight Out of a Romcom.\"\r\n    News18 India.   11 June 2019.", "Basner, Dave.   \"Man Tweets Dark But True Love Story and It's the Sweetest Thing Ever.\"\r\n    iHeart Radio.   11 June 2019.", "Plommer, Leslie.   \"Why Can't We Have Trains at Christmas?\"\r\n    The Guardian.   20 December 2007.", "Network Rail.   \"Christmas on Track: Thousands of Network Rail Staff to Spend the Holiday Working on Railway Upgrades.\"\r\n    20 December 2018.", "Dan Mac Guill is a former writer for Snopes.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]