["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Supporters of the Democratic health care plan have invoked baseball in their latest television ad that tries to demonize the health insurance industry.\n\nIn the 30-second ad, the liberal group Americans United for Change asks, \"How are professional baseball and insurance companies alike? Baseball and insurance are the only industries exempt from antitrust laws. How are they different? Insurance industry executives are scared of competition. Baseball players aren't. When baseball players fix the games, they get in trouble. When health insurance executives fix the games, they get rich. Time for competition when it comes to health insurance. We need the choice of a public health insurance plan.\"\n\nIn this item, we'll focus on their opening claim, that \"baseball and insurance are the only industries exempt from antitrust laws.\"\n\nLet's first explain what \"antitrust\" means. Antitrust laws protect against anticompetitive conduct by cartels and monopolies. Federal antitrust laws target price-fixing, predatory pricing and mergers that reduce competition. Courts have consistently ruled that the federal government has the authority to pass laws that police competition in \"interstate commerce\" — that is, business activity that crosses borders and ripples through the national economy.\n\nWhile federal antitrust laws do cover most industries, some are exempted, thanks either to the courts or Congress. The Americans United for Change ad cites what is probably the best-known exemption: baseball.", "Baseball's sweeping exemption stems from a 1922 U.S. Supreme Court decision. The justices, presented with an upstart league's lawsuit against the well-established National League, ruled that teams' travel across state lines was not \"essential\" to the business. As a result, the justices ruled, the federal government had no antitrust power over baseball, since games were essentially events held in one state. Most notably, the exemption allows Major League Baseball to prevent teams from moving without the league's consent. In more recent challenges, the high court declined to overturn baseball's exemption, saying it was up to Congress to rescind it. Despite numerous bills, lawmakers have so far declined to do so.\n\nSo, the ad is correct that baseball has an antitrust exemption. Does insurance have one too?\n\nIt does. Insurance — in fact, all kinds of insurance, not just health coverage — is exempt from federal antitrust laws, though these protections are more limited than they are for baseball teams. A 1945 law exempts from federal antitrust law the \"business of insurance\" as long as it is \"regulated by state law.\" However, in some contexts — such as if the conduct involves an agreement to \"boycott, coerce or intimidate\" — federal antitrust law does apply.\n\nThis is hardly an arcane issue. As Congress struggles with health care reform legislation, some lawmakers are seeking to lift health insurers' antitrust exemption. Sen. Patrick Leahy, D-Vt., has introduced the Health Insurance Industry Antitrust Enforcement Act, which would, among other things, \"repeal the federal antitrust exemption for health insurance and medical malpractice insurance companies for flagrant antitrust violations, including price-fixing, bid rigging, and market allocations.\" Reps. Diana DeGette, D-Colo., and John Conyers, D-Mich., have introduced an equivalent measure in the House. Both measures are pending.\n\nEven though baseball and insurance have somewhat different types of antitrust exemptions, we find they are similar enough to justify the ad's pairing of the two. But when the ad says that baseball and insurance are \"the only industries exempt from antitrust laws,\" it's wrong.\n\nFor starters, three additional industries — agricultural cooperatives, fishing cooperatives and maritime shipping — have, like baseball and insurance, what the American Bar Association calls \"general\" antitrust exemptions. Each of these exemptions stem from a law passed by Congress. For example, they permit co-ops, from milk producers to cranberry growers, to jointly market their products, including setting prices and output. (Congress has also exempted labor unions from antitrust law, but unions aren't an \"industry,\" so we won't include them in our calculations.)\n\nAlso, other industries benefit from more limited forms of antitrust exemptions, usually laws that protect specific practices rather than invoking a blanket exemption for business activity.\n\nStudies by the ABA and a federal commission counted almost two dozen such partial exemptions. These govern a wide range of activities, including the actions by broadcasters to curb violence in television shows, efforts by airlines to ease airport congestion, attempts by financially troubled newspapers to merge some functions with competitors, and activities by soft drink producers to draw up exclusive sales territories.\n\nThe Americans United for Change ad is generally correct to equate the antitrust exemptions of baseball and health insurance, but the one for health insurance is more limited. And the ad is incorrect to say that these are the \"only industries exempt from antitrust laws.\" Agricultural and fishing co-ops and maritime shippers have similar exemptions. And a host of other sectors, notably freight rail, have some pretty significant antitrust protections as well. We rate the ad's claim False.", "Americans United for Change, \"  Baseball  ,\" advertisement released Oct. 12, 2009\n\nAmerican Bar Association Section of Antitrust Law,  Federal Statutory Exemptions from Antitrust Law  ,  book  published in 2007\n\nAntitrust Modernization Commission,  final report  of the commission, April 2, 2007\n\nSen. Patrick Leahy, \"Leahy Introduces Bill To Repeal Antitrust Exemption For Health, Medical Malpractice Insurance Companies\"  news release  , Sept. 17, 2009\n\nRep. Diana DeGette, \"DeGette Introduces Bill to Repeal Antitrust Exemption for Health, Medical Malpractice Insurance Companies\"  news release  , Sept. 17, 2009\n\nDow Jones Newswires, \"  House Panel Passes Bill Stripping Rail Antitrust Exemptions  ,\" Sept. 16, 2009\n\nU.S. Supreme Court,   Federal Club v. National League   , decided May 29, 1922\n\nESPN.com, \"  Baseball's antitrust exemption: Q & A  ,\" Dec. 5, 2001 \n\nInterview with Jonathan L. Rubin, partner with the law firm Patton Boggs, Oct. 13, 2009\n\nInterview with Barry Nigro, partner with the law firm Fried, Frank, Harris, Shriver & Jacobson, Oct. 13, 2009\n\nInterview with Jeremy Funk, spokesman for Americans United for Change, Oct. 13, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]