["About this rating", "In April 2019, many social media users reacted in shock and disgust as they came across tweets, Facebook posts, and news articles reporting that Nike had re-signed Michael Vick, a former NFL player who went to prison after pleading guilty for his involvement in a dog fighting ring, to an endorsement deal:", "The linked news articles showcased in the graphic displayed above, announcing that Vick had once again been tabbed to represent the sports apparel brand best known for its athletic footwear, are real. However, the NPR and CNBC reports, as well as the Change.org petition, were all originally published in 2011.", "Michael Vick entered the NFL in 2001 and quickly established himself as a top-tier player with the Atlanta Falcons, earning lucrative endorsement deals from companies such as Nike; but in 2007 Vick was arrested and eventually pleaded guilty to his involvement in a dogfighting ring. In addition to drawing a 23-month prison sentence, the former NFL quarterback was also dropped from many of his business partnership deals:", "Nike started the groundswell on July 19, two days after Vick was indicted, vowing not to roll out his Air Zoom Vick V shoe. Then, emboldened by N.F.L. Commissioner Roger Goodell’s telling Vick not to report to training camp on July 23, Nike suspended his deal without pay; Reebok pulled Vick jerseys from retail shelves; Donruss said it would cut Vick from all future trading card products; and Upper Deck removed his autographed memorabilia from its online store and banished him from this season’s card sets.", "That wasn’t all. In May, during the investigation of dogfighting on his property, AirTran Airways cut him.", "After serving out his prison sentence, Vick returned to the NFL in 2009, playing for the Philadelphia Eagles. A few years later Nike re-signed Vick to an endorsement deal, as noted in this excerpt from a July 2011 CNBC report (which was re-circulated on social media in April 2019):", "CNBC has learned that, in a remarkable move, Nike, which severed Vick’s contract in 2007 after he admitted to his involvement in a dogfighting ring, has re-signed the Philadelphia Eagles quarterback.", "“Michael acknowledges his past mistakes,” said Nike spokesman Derek Kent. “We do not condone those actions, but we support the positive changes he has made to better himself off the field.”", "Vick’s longtime agent Joel Segal told CNBC that “Michael is excited to have a long-term and strong relationship with Nike.” The deal was done by Chicago-based attorney Andrew Stroth.", "Nike had been giving Vick free products since his return to the field after serving 23 months in prison, but wasn’t paying him. Financial consideration on his new contract was not disclosed.", "The brand dropped him in August 2007, halting the release of his fifth signature shoe, the Air Zoom Vick V, and releasing a statement saying that cruelty to animals was “inhumane, abhorrent and unacceptable.”", "It is believed to be the first time in the history of sports marketing that a brand that dumped an athlete came back to re-sign him.", "While it's true that Nike re-hired Michael Vick after he served his prison sentence for his involvement in a dogfighting ring, that news was already outdated by several years when it was widely presented yet again on social media in April 2019.", "Vick  officially retired from the NFL in 2017, and it's unclear if he still has any business ties with Nike. We reached out to the company for more information and will update this article if more information becomes available.", "Peralta, Eyder.   \"Nike Signs Michael Vick to New Endorsement Deal.\"\r\n    NPR.   1 July 2011.", "Rovell, Darren.   \"Exclusive: Nike Re-Signs Michael Vick.\"\r\n    CNBC.   1 July 2011.", "Sandomir, Richard.   \"In Endorsements, No Athlete Is a Sure Thing.\"\r\n    The New York Times.   1 August 2007.", "Associated Press.   \"Nike Re-Signs Vick.\"\r\n    1 July 2011.", "Wagner-McGough, Sean.   \"Michael Vick Officially Retires, Says Vikings 'Dropped the Ball' by Not Signing Him.\"\r\n    CBS Sports.   3 February 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]