["A photograph of a woman holding a placard with anti-RSS slogan was posted by Twitter handle India With RSS. It claims to be an independent initiative by Swamyamsevaks. “What is the relation between fee hike and RSS?”, reads the tweet which attempts to discredit the fee hike protest as a “politically motivated campaign against a particular ideology”. It has garnered over 500 retweets. JNU", "Many other people on Twitter and Facebook shared the image with a message, “ये प्रोटेस्ट तो फीस बढ़ोतरी के विरोध में था, तो फिर ये RSS की तख्ती क्यों. (The protest was against fee hike, then why this boards[placards] of RSS -translated)”", "With the help of reverse image search on Russian search engine Yandex, Alt News found a Catch News article published on February 2, 2016. “#RohithVemula: female eye-witness on horror of being assaulted by Delhi police”, reads the headline of the article which included a first-person account of a PhD student from the university who witnessed the students being allegedly assaulted by the police during a protest march to the RSS headquarters in Jhandewalan, New Delhi. This protest march was organized on what would have been the 27th birth anniversary of the late Hyderabad Central University student Rohith Vermula on January 30. The date coincided with the death anniversary of Mahatma Gandhi. According to the report, some of the students’ group claimed that the RSS was responsible for the deaths of both these men.", "Facebook page of Students Federation of India’s JNU Unit posted a video from the protest wherein some students can be seen holding the placard with the same slogan. SFI is a student body of CPI-M.", "Police, RSS goons beating up students at Rohith protest in Delhi", "Video of the brutal assault by the police and RSS goons against students who marched to the RSS office today (30 January 2016) in protest against the institutional murder of Rohith Vemula at Hyderabad Central University. The students demanded punishment to those who led the harassment and victimisation at the behest of the RSS-BJP which led to the death of Rohith. The students were demanding action against HCU VC Appa Rao and Union ministers Bandaru Dattatreya and Smriti Irani, and they were brutally beaten up by the police, joined in by RSS goons. Many media persons also were beaten up and their cameras smashed by the police. Our fight for justice for Rohith would go on, our struggle against casteism will move forward, battling casteist and communal-fascist forces like the RSS at every step.", "Posted by SFI JNU Unit on Saturday, 30 January 2016", "At 2 seconds in the video on the top portion of the frame, you can spot these placards with the same slogan that reads, “RSS मुर्दाबाद SFI”. The same can be seen in an album of images of the same protest posted on the page.", "We were able to corroborate the location where the image was shot. The image was clicked near ‘Mandir Dargah Baba Shree Pir Ratan Nath Ji’, which can be seen in the Google Map highlighted with a green box. This shows that the viral image belongs to a protest held by the students’ group including SFI outside RSS headquarters.", "In conclusion, a three-year-old photograph from a protest organized by students in the national capital against the RSS was shared with the claim that the recent JNU students’ protest against the fee hike was politically motivated.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]