["“President Trump tackled the virus head on, as leaders should,” says a narrator in the October 10, 2020 advertisement, which then cuts to a clip of Fauci saying: “I can’t imagine that... anybody could be doing more.”", "Fauci, 79, has advised six presidents since becoming head of the National Institute of Allergy and Infectious Diseases in 1984, and led US government efforts to counter diseases including HIV/AIDS. But he has become far more widely known during the coronavirus crisis, which has killed more than 214,00 people in the United States.", "The doctor -- whose direct remarks on failures in America’s response to the virus have drawn him into conflict with Trump -- has been a popular target for disinformation.", "Fauci issued a statement in response to the ad, which uses footage of him from a March 2020 interview on Fox News.", "“In my nearly five decades of public service, I have never publicly endorsed any political candidate,” Fauci said in the statement.", "“The comments attributed to me without my permission in the GOP campaign ad were taken out of context from a broad statement I made months ago about the efforts of federal public health officials,” he said.", "Fauci’s assertion is backed by his full remarks from the interview with Fox’s Mark Levin.", "“I mean, we're talking about all-hands on-deck is that I, I as one of many people on a team, I'm not the only person, since the beginning that we even recognized what this was, I have been devoting almost full time on this -- almost full time,” Fauci said.", "“I'm down at the White House virtually every day with the Task Force. I'm connected by phone throughout the day and into the night. When I say night, I'm talking 12, one, two in the morning. I'm not the only one. There's a whole group of us that are doing that. It's every single day,” he said.", "“So I can't imagine that, that under any circumstances, that anybody could be doing more. I mean, obviously, we're fighting a formidable enemy -- this virus. This virus is a serious issue here.”", "AFP Fact Check has previously debunked a Trump campaign ad that featured doctored images of Joe Biden, as well as the campaign’s false claims that clips showed the Democratic candidate referring to the president’s supporters as the “dregs of society,” and botching the Pledge of Allegiance.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]