["By Saranac Hale Spencer", "Posted on January 10, 2018", "Q: Were a dozen or more women found dead in a freezer with “Black Lives Matter” carved in them?", "A: No. Versions of that false story have been circulating online for almost two years.", "Different versions of an internet hoax that originated almost two years ago are still being published online.", "The claim is as untrue now as it was when it appeared in February 2016. But the stories make no references to dates, so it’s easy for websites to keep reposting them to exploit racial tension.", "The hoax was first published by two different websites, each with its own version.", "A website called Now 8 News ran a story with the headline, “Los Angeles Police: 12 White Female Bodies in Garage Freezer Tagged, ‘Black Lives Matter.’”", "And the now defunct Empire Herald website set the scene in Chicago and used a different body count its story headlined, “Man Arrested After Police Find 19 White Female Bodies In Freezers With ‘Black Lives Matter’ Carved Into Skin.”", "Later, the killings were reimagined to have happened in Greenville, North Carolina, according to a version posted in August 2017 on a website called Tweeterest USA.", "And the Chicago version of the story is now making the rounds on Facebook after it was published Dec. 31 on thefirstamerica.com.", "Several users of the social media site have flagged it as being potentially false. It is.", "But others were less skeptical. A comment posted under a version of the story that ran on a site called Bored Star said: “What in God’s name is wrong with these sick bastards! Black, white, whatever color! We all matter!! You black people think your better??? Well you are very very ignorant & and sick, very sick!!!!!” Another commenter asked, “Why wasn’t this on CNN?”", "It wasn’t reported by CNN, or any other reputable news organization, because the story was completely fabricated.", "Buried at the bottom of the Empire Herald’s “terms of service” page was a short notice that said: “Much of the content contain [sic] on our website is consider [sic] satirical in nature unless otherwise specified.”", "In fact, one of the only details given in its story is the name of an officer at the alleged crime scene. But there is no “Lt. Kyle Jennings” on the police force, Chicago Police News Affairs Officer Patrick McGinnis told FactCheck.org.", "The pictures that ran with the story also are unrelated. One photo shows police at a residential crime scene from years ago, and another shows a rusty old freezer that has been used in online stories since at least 2009 in several languages.", "Similarly, the Los Angeles version of the story that was published on Now 8 News also featured unrelated photos. One is the mugshot of Shandell Willingham, who was charged with rape in Cincinnati, Ohio, in 2015. The other shows Los Angeles County officials removing a refrigerator containing a man’s body from an illegal marijuana growing operation the same year.", "Now 8 News doesn’t include any kind of disclaimer explaining that it isn’t an actual news site, and its name is very close to that of the real CBS affiliate TV station in Las Vegas that goes by 8 News Now.", "Unlike the Empire Herald, which has ceased operating, Now 8 News is still publishing false stories. The phone number listed on its “contact us” page doesn’t work.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Sources", "“Man Arrested After Police Find 19 White Female Bodies In Freezers With ‘Black Lives Matter’ Carved Into Skin.” EmpireHerald.com. 22 Feb 2016.", "“Los Angeles Police: 12 White Female Bodies in Garage Freezer Tagged, ‘Black Lives Matter.'” Now8News.com. 23 Sep 2016.", "“12 White Female Bodies in Garage Freezer Tagged, ‘Black Lives Matter.'” Tweeterest.us. 12 Aug 2017.", "“POLICE FIND 19 WHITE FEMALE BODIES IN FREEZERS WITH ‘BLACK LIVES MATTER’ CARVED INTO SKIN.” TheFirstAmerica.com. 31 Dec 2017.", "Pfeffer, Allison. “Mother charged with trading sex with daughter, 11, for heroin.” WKRC Cincinnati. 23 Mar 2015.", "Moreno, John, et. al. “Police Find Man’s Body Inside Refrigerator, Marijuana Grow Operation at Sun Valley Home.” KTLA 5. 13 Sep 2015.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]