["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has been criticized for calling the new coronavirus as the \"Chinese Virus,\" a term some fear will encourage xenophobia and abuse against Asian Americans. But a recent Facebook post would have you believe the president’s word choice is closer to the truth than news reports say.", "\"Hate to break this to all of the morons who call themselves journalists,\" the March 25 post says. \"COVID literally stands for ‘Chinese Originated Viral Infectious Disease and the number 19 is due to this being the 19th virus to come out of China.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "That’s because it’s literally wrong.", "The 2019 novel coronavirus was first reported in Wuhan, China, on Dec. 31, 2019. The deadly disease caused by this coronavirus has since infected hundreds of thousands of people around the world.", "On Feb. 11, the World Health Organization announced that the name for the disease would be COVID-19 and the complete official name for the virus that causes the disease would be \"severe acute respiratory syndrome coronavirus 2\" or \"SARS-CoV-2.\" Until that point, the virus and the infection had been referred to as the \"2019 novel coronavirus\" or \"2019-nCoV.\"", "\"Having a name matters to prevent the use of other names that can be inaccurate or stigmatizing,\" tweeted Tedros Adhanom Ghebreyesus, director-general of the WHO.", "COVID-19 is an abbreviation of \"coronavirus disease 2019,\" the CDC says. \"CO\" stands for \"corona,\" \"VI\" stands for \"virus\" and \"D\" stands for \"disease.\" The number 19 reflects the year it was identified — 2019.", "We rate this Facebook post Pants on Fire.", "Facebook post, March 25, 2020", "The New York Times, Trump defends using ‘Chinese Virus’ label, ignoring growing criticism, March 18, 2020,", "PolitiFact, Donald Trump calls the coronavirus the ‘Chinese virus.’ Health experts say that’s wrong, March 19, 2020", "World Health Organization, Naming the coronavirus disease (COVID-19) and the virus that causes it, visited March 30, 2020", "Tedros Adhanom Ghebreyesus tweet, Feb. 11, 2020", "Centers for Disease Control and Prevention, Coronavirus disease 2019 (COVID-19), visited March 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]