["Sen. Bernie Sanders, I-Vt., looks around at his 2020 presidential campaign stop at Navy Pier in Chicago, Sunday, March 3, 2019. (AP)", "Editor’s note: This fact-check has been updated with additional information about the photo.", "A Facebook post identifies a man marching with Fidel Castro in Cuba as U.S. Sen. Bernie Sanders, I-Vt.", "It isn't really Sanders.", "\"Fidel Castro, Che Guevara and a young Bernie Sanders marching in Cuba,\" states the cutline underneath a black and white photo of a group of men marching together with their arms linked.", "The post, published on Facebook on Feb. 28, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The photo has a red arrow pointing to a man the Facebook post identifies as Sanders. But we found no evidence that it is Sanders.", "Sanders’ campaign spokesman Josh Orton told PolitiFact that Sanders never met with Castro or Guevara.", "We found the same photo with a different caption using a reverse image search. The caption said, \"Fidel Castro Left next to Osvaldo Dorticós (President of Cuba from 1959 until 1976) with Che Guevara at a 1959 parade in Havana.\" The photo is credited to the World History Archive/Alamy Stock archive.", "Castro ruled Cuba for decades until 2008. Guevara was a major figure in the Cuban revolution led by Castro in the late 1950s.", "Where was Sanders in 1959? That’s the year he graduated from high school in Brooklyn.", "His spokesman said Sanders did not get on an airplane until 1961, when he attended the University of Chicago.", "The same photo of the men marching with a claim that one is Sanders appeared on an undated article by Gishop Gallop, which identifies itself as an entertainment website and has this warning in jest:", "\"Please do not let your children use this site. If something in one of the stories you see here is not true, that would mean it’s fiction. You can still do that without censorship – create fiction. You may see satire and that’s okay, too. If this offends you, you may want to look at a better use of your time than run-of-the-mill indignation. Your Chi will improve. This sentence legally follows the one preceding it.\"", "Another sign that the Gishop Gallop story isn’t authentic is the bio for the author, \"Cleveland Sam,\" which is filled with silly anecdotes about his alleged heroism, such as rescuing a girl from the \"clutches of a herd of llamas\" and saving children from near deaths from \"freak ice cream truck accidents.\"", "The undated story about Sanders in the photo also contains a number of other ridiculous statements about Sanders, including that he was born in Cuba but later fled on a trunk lid of a 1960 Chevrolet converted into a boat.", "After we posted this fact-check, we received an email from American University professor William LeoGrande, an expert on Latin American politics, about the identity of the man in the photo that the Facebook post falsely identified as Sanders.", "LeoGrande told us that the man in the photo was Regino Boti León, minister of the National Economic Council in the first Cuban council of ministers after 1959. The photo was taken March 5, 1960, during a march in memory of the victims of the explosion of the munitions ship La Coubre that Castro believed was sabotaged by the CIA, he said.", "He pointed to a more famous photo from the same march found on Wikimedia. It doesn’t show Boti León’s name in the description but he is listed in the categories at the bottom of the page. Another article about him also shows a photo of him in the march.", "Boti León came to the U.S. with Castro in April 1959 with the expectation of negotiating an economic aid agreement, LeoGrande said.", "\"But Castro forbid his advisers to ask for help and the State Department refused to offer it, so Castro went away empty handed. As the revolution radicalized, Boti was moved off center stage, but he remained loyal to the revolution, serving in a variety of positions until his death,\" he said.", "Professor Ted Henken, a Latino studies professor at Baruch College City College of New York, also confirmed that the photo is of Boti León.", "A cutline under a photo said that Bernie Sanders marched with Fidel Castro and Che Guevara in Cuba.", "The same photo appeared on an entertainment website. A reverse image search showed that the historical photo includes Castro and Guevara at a 1959 parade in Havana, but we found no no evidence that Sanders is one of the men in the photo.", "Experts told us the man is Regino Boti León at a parade in 1960.", "We rate this claim Pants on Fire.", "Facebook Post, Feb. 28, 2019", "Alamy.com, Photo of Fidel Castro and Che Guevara, 1959", "BuzzFeed News, Bernie Sanders Despised Democrats In 1980s, Said A JFK Speech Once Made Him Sick, July 16, 2015", "The Daily Beast, \"When Bernie Sanders Thought Castro and the Sandinistas Could Teach America a Lesson,\" Feb. 28, 2016", "Miami Herald, Bernie Sanders traveled to communist Cuba and urges a 'political revolution.' Will exile Miami take him seriously? Feb. 29, 2016", "The Hill, Sanders defends past praise of Fidel Castro, March 9, 2016", "Politico, ‘He is not going to be the nominee’: Dems slam Sanders over Maduro stance, Feb. 21, 2019", "Slate, Sanders Has a Soft Spot for Latin American Strongmen, Feb. 20, 2019", "CNN, This Brooklyn high school produced Sanders and other political stars, May 2, 2016", "Gishop Gallop, Wikileaks: Bernie Sanders Born In Havana, Cuba", "New York Times, Transcript of the Democratic Presidential Debate in Miami, March 10, 2016", "Univision, Interview with Sen. Bernie Sanders, Feb. 19, 2019", "PolitiFact, Bernie Sanders — socialist or democratic socialist? Aug. 26, 2015", "Interview, Josh Orton, Bernie Sanders campaign spokesman, March 4, 2019", "Interview, Josh Miller-Lewis, Bernie Sanders campaign spokesman, March 5, 2019", "Interview, William LeoGrande, American University Associate Vice Provost for Academic Affairs, Department of Government, March 7, 2019", "Interview, Ted Henken, Latino studies professor at Baruch College City College of New York, March 7, 2019", "Miami Herald, Regino Boti Leon: Castro's first economy minister, July 12, 1999", "Juventud Rebelde, El movimiento telúrico de aquel enero (+ Fotos)", "Critical Past, Aftermath of explosion of French freighter, Le Coubre, in Havana Harbor, Cuba HD Stock Footage", "WikiMedia Commons, File:CheLaCoubreMarch.jpg", "Vanity Fair, LLILIAN LLANES, UNA COLECCIONISTA EN LA CUBA REVOLUCIONARIA, April 3, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]