["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With high-profile support from President Barack Obama, Congress is preparing a major overhaul of the nation's health care system. The details have yet to be revealed, but that hasn't stopped critics in Congress from going on the attack.", "Obama and the Democratic leadership have proposed broad outlines for the overhaul. The centerpiece of their plan remains the employer-based system, where most people have private health insurance through work. To rein in costs, the government would invest in electronic medical records and encourage efficiency and preventive care.", "To get coverage for people who don't have health insurance, the plan would increase eligibility for the poor and children to enroll in initiatives like Medicaid and the State Children’s Health Insurance Program. Finally, the plans seek to create a health insurance exchange, where individuals and small businesses can easily comparison shop for insurance coverage. One of the exchange plans would be a public option run by the government.", "It's the public option that has fueled Republican attacks, leading to charges that it would destroy the private system, that millions would lose their current coverage, and that Democrats don't have a way to pay for it.", "Rep. Mike Pence of Indiana described the Democratic health care plan as \"a government-controlled health care plan that will deprive roughly 120 million Americans of their current health care coverage and lead to federal bureaucrats denying critical care for patients.\"", "That \"120 million\" number jumped out at us. That's a big number, representing roughly three-quarters of those who now have employer-provided health insurance.", "We asked Pence's staff about the number, and they referred us to a report from the Lewin Group, a health care consulting firm. The report ran a number of scenarios, including what would happen if the government offered a public option that was a Medicare-style plan open to everyone. Their model found that 118 million people would choose to drop their private coverage in favor of cheaper public coverage.", "But there's a hitch: That's what the Lewin Group believed would happen under the plans that were the most like Medicare, and if everyone were allowed to enroll. As we noted before, it's possible to set up a public option where only some people are allowed to enroll. Under the Lewin Group's estimates, if you restrict a Medicare-style public option only to individuals and small businesses, only 32 million would leave private coverage. And if the public option is less like Medicare and competes like a private insurer, the number drops further.", "We'll grant that Congress could come up with a Medicare-style plan and open it to everyone, but it doesn't seem likely. Pence appears to be picking the worst number he can choose. And he doesn't mention the fact that under the scenario laid out by the Lewin Group, people would still have health care coverage and their premiums reduced by 30 to 40 percent. He says the government would \"deprive\" people of health insurance, when actually the scenario is that they would choose a different option.", "Even if you believe that an expansive government health care plan would drive private insurers out of business, that still doesn't account for Pence's \"deprive\" claim, because the Lewin report he cites is focused on people who have chosen the government plan, not people who were left to the government plan after private options disappeared.", "Finally, we have to include a caveat about the Lewin Group. The group says it operates with editorial independence, but it is a subsidiary of UnitedHealth Group, which also offers private health insurance.", "Given all this background and explanation, we rated Pence's statement that the government would \"deprive\" 120 million people of their \"current health care coverage\" False.", "https://www.sharethefacts.co/share/d3dff281-ba69-4fa7-b09c-de38ed52a748", "GOP.gov,  Pence: Medicare and Social Security Report Shows Need for Real Reform  , May 12, 2009", "The Lewin Group, \"  The Cost and Coverage Impacts of a Public Plan: Alternative Design Options  ,\" April 6, 2009", "The Urban Institute,  Can a Public Insurance Plan Increase Competition and Lower the Costs of Health Reform?  , March 18, 2009", "The Kaiser Family Foundation and Health Research and Educational Trust,  Health Benefits 2008 Annual Survey", "U.S. Senate Finance Committee,  Health Reform 2009  , (Democratic plan) Nov. 12, 2008", "Health Affairs, \"  The Public-Plan Option: A Roundtable With Stuart Butler, Jacob Hacker, and Len Nichols  ,\" April 30, 2009", "The Urban Institute,  Can a Public Insurance Plan Increase Competition and Lower the Costs of Health Reform?  , March 18, 2009", "Interview with John Holohan of the Urban Institute", "Interview with John Shiels of the Lewin Group", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]