["About this rating", "In August 2018, the Ohio 12th congressional district's voter roll included 164 voters with listed birthdates of 1 January 1800 or 1 January 1900.", "These birthdates are placeholder values for information that some voters were not required to supply at the time they registered; they are not indicative of voter fraud and have no relevance to the results of Ohio's congressional special election.", "Conservative politicians and commentators have been making sweeping claims about voter fraud since before the 2016 U.S. presidential election, when then candidate Donald Trump inflamed groundless speculation that the election would be \"rigged\" in favor of his Democratic rival, Hillary Clinton.", "In May 2017, after his inauguration as president, Trump set up a commission on \"election integrity\" chaired by Vice President Mike Pence and run by Kansas Secretary of State Kris Kobach. Less than a year later, Trump disbanded the commission after a bipartisan backlash against requests for voter registration data, with only two meetings of the commission's members having taken place, and reportedly without uncovering any evidence of a pattern of electoral fraud in the United States.", "(We have scrutinized and debunked multiple false or misleading claims and groundless conspiracy theories about alleged voter fraud, collected here.)", "In August 2018, yet more misleading allegations of electoral fraud were issued, this time in the context of a special U.S. Congressional race in Ohio's 12th congressional district.", "On 8 August, the right-wing web site Breitbart published an article written by Eric Eggers from the Government Accountability Institute, a conservative organization co-founded by former White House strategist Steve Bannon (who also co-founded Breitbart):", "Republican Troy Balderson clings to a narrow margin in last night’s special election for Ohio’s 12th Congressional district, underscoring the impact voter fraud can have in key elections around the country. The separation of 1700 votes, or less than one percent, highlights the recent attempt by Democratic activists to fight efforts to prevent voter fraud from occurring ...", "Consider that 170 registered voters listed as being over 116 years old still existed on the rolls of Ohio’s 12th Congressional when GAI accessed the data last August. That’s 10 percent of Balderson’s current margin of victory, pending provisional ballots. And 72 voters over the age of 116 who “live” in Balderson’s district cast ballots in the 2016 election.", "The separation of 1700 votes, or less than one percent, highlights the recent attempt by Democratic activists to fight efforts to prevent voter fraud from occurring. For the past four years, George Soros has spent millions of dollars trying to weaken Ohio’s election security by funding efforts to both block its implementation of Voter ID and prevent the state from removing inaccurate registrations.", "Soros pledged $5 million to fund Clinton campaign attorney Marc Elias’s efforts to fight voter ID laws in Ohio and two other states ahead of the 2016 election. Elias would file that suit in Ohio on behalf of several groups, including the Ohio Organizing Collaborative, that would have an employee sentenced to prison for voter fraud.", "In 2016, liberal activist groups Demos and the ACLU filed suit against the state of Ohio in an attempt to stop its efforts to remove inaccurate voter registrations from its rolls. Soros gave 1.25 million to Demos in 2016, on top of the more than $3 million he had given in previous years. And Soros has been even more generous with the ACLU, giving over $35 million for Trump related lawsuits.", "The following day, hyperpartisan junk news web sites such as Patriotbeat.com and Truthfeednews.com republished the Breitbart article, adding: \"A newly released report is exposing more voter fraud, and this time it’s happening in Ohio’s 12 District where a special election battle has just been narrowly won by the GOP, thanks to President Trump.\"", "Analysis", "Eggers' suggestion that Ohio’s 12th Congressional district has an unbelieveably high preponderance of registered and voting supercentenarians, and the notion that this phenomenon is indicative of significant voter fraud, don't stand up to scrutiny.", "At the time of the August 2018 Balderson-O'Connor special election, the 12th Congressional district's voter roll did include 164 registered voters ostensibly aged 116 or greater. But the catch is that all but one of those voters had a recorded birth date of either 1800-01-01 or 1900-01-01, a pattern does not suggest voter fraud but rather simple recording error. The far more likely explanation is that these voters' birthdates were not collected when they registered, or their birthdates were not properly entered into the system, or they were not transferred correctly when the voter roll management system was upgraded, and hence those birthdates ended up being set to a default value for that field in the voter database.", "This alternative explanation seems even more likely when one considers that the records for some 54,935 registered voters in that Ohio district bear a registration date of 1900-01-01, an obvious impossibility for voters who weren't even born until well after that date. Again, this pattern simply suggests that some field values in voter registration records were not recorded or have since been lost, so those fields now display a placeholder value in the voter roll database.", "Indeed, a press release from the Ohio Secretary of State's office confirmed that our conjecture was correct:", "State law has not always required Ohioans to provide their date of birth when registering to vote. Prior to June 1974, when House Bill 662 was passed requiring date of birth to register to vote, county boards of election used placeholder dates. This is why some registrations have dates like 1900 or 1800 listed. These individuals met the requirements at the time to become registered voters and remain legally qualified electors today.", "And frankly, the alternative explanation stretches credulity to breaking point: That some person(s) decided to engage in electoral fraud by creating or maintaining scores of fraudulent voter registrations, but they utterly failed to recognize or consider that anyone might think the presence of a cluster of 118- and 218-year-old voters in the same district, all of them born on 1 January, to be the least bit suspect.", "Even if we embraced the discredited hypothesis that the presence of all these supercentenarian \"voters\" on the voter roll were evidence of electoral fraud, the argument that such fraud primarily favors Democrats is undercut by the fact that the party affiliation of these oddly-aged Ohio voters is fairly evenly divided between Democrats and Republicans.", "Of course, it's not possible to determine whom any given registrant voted for in an election (a fraudulent voter could register as a Republican and still cast their ballot for a Democrat), but voters who register as Republicans and are recorded as having voted in Republican primaries are most likely voting for Republicans. So, the broader partisan theories espoused by Eggers about voter fraud (i.e., that fraudulent voters are predominantly Democratic voters, and that liberal or Democratic efforts to oppose \"crackdowns\" on electoral fraud are designed to protect a source of Democratic votes) aren't supported by even this demonstrably erroneous theory.", "Diamond, Jeremy.   \"Trump: 'I'm Afraid the Election's Going to Be Rigged.'\"\r\n    CNN.   2 August 2016.", "Trump, Donald J.   \"Presidential Executive Order on the Establishment of Presidential Advisory Commission on Election Integrity.\"\r\n    White House.   11 May 2017.", "Villeneuve, Marina.   \"Report: Trump Commission Did Not Find Widespread Voter Fraud.\"\r\n    Associated Press.   3 August 2018.", "Eggers, Eric.   \"Expert: 170 Registered Voters in Ohio's 12th District Listed as Over 116 Years Old.\"\r\n     Breitbart.   8 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]