["By Angelo Fichera", "Posted on April 11, 2018", "Q: Did President Trump order a raid on Islamberg, New York, that uncovered weapons?", "A: No. A false story from 2017 links the Muslim community to an unrelated arrest of a man on weapons charges.", "The Muslim settlement of Islamberg in upstate New York has for years been the subject of intrigue and online allegations. Motorcyclists have protested the community, calling it a breeding ground of jihad. A former congressional candidate from Tennessee also was convicted of planning an attack on the community’s mosque.", "Despite statements by law enforcement officials that the community is not home to any “nefarious” activity, suspicions espoused online have lingered — and so too has a fabricated story.", "A tale about a supposed raid of Islamberg ordered by President Donald Trump that unearthed “America’s WORST Nightmare” resurfaced again this month, appearing on two websites with the promise of “more details.” Instead, the articles offered the same, repeatedly debunked claims. Facebook users rightly reported the stories as potentially false.", "At the heart of the false story is a distortion of the 2017 arrest of Ramadan Abdullah in Johnson City, New York. Police found the Johnson City resident to have a trove of weapons and ammunition in a storage unit in the town of Union — about an hour from Islamberg. He was convicted on multiple charges.", "“Trump Orders Raid To NY’s Islamberg After 20yrs They Uncover America’s WORST Nightmare,” reads the April 1 headline of the story published on independentminute.com, which claimed “Abdullah was stockpiling weapons for the compound.”", "But there’s no mention of Trump within the body of the story, and a New York State Police spokesman said the investigation was conducted by State Police, the Johnson City Police Department, and the Broome County District Attorney’s Office — not by federal agencies.", "The bogus story was published on multiple websites last year, including freedomdaily.com, which linked to a July 2017 article on the website of Dennis Michael Lynch, a conservative commentator and filmmaker. That article claimed without proof that the weapons were “intended for” Islamberg, the “headquarters” of the Muslims of America organization.", "But Beau Duffy, the New York State Police spokesman, confirmed in an email to FactCheck.org that there remains no evidence that Abdullah’s weapons were destined for Islamberg. He also said “there is no evidence that he previously resided there.”", "Muslims of America — which does consider Islamberg its headquarters — has publicly said Abdullah, who the group called a “known criminal,” is not a member of its organization.", "The group also has not been deemed a “terrorist organization,” as the false stories claim. But its founder — Pakistani cleric Sheikh Mubarik Gilani — has been linked to Jamaat al-Fuqra, a group that the State Department in a 1999 global terrorism report tied to violent criminal activity in the 1980s. Members, including Gilani, have claimed they have no affiliation with al-Fuqra.", "Officials at the Anti-Defamation League’s Center on Extremism repeatedly have said that there’s little evidence that the Muslims of America, or Islamberg, are sources of extremism. Last year, the Associated Press reported that the center’s director, Oren Segal, “notes that none of the more than 500 people arrested on terror charges since the attacks [on Sept. 11, 2001] have a known affiliation with The Muslims of America.”", "In addition, police say an array of allegations about Islamberg included in the story — including that it’s a “training ground for Muslims terrorists” and was “once used to hide Osama bin Laden from authorities” — are unfounded.", "“They are completely false,” Duffy, the New York State Police spokesman, told us. “We maintain a strong liaison with the Muslim community on Roods Creek Rd. and routinely respond to [it] for calls to service, (medical, fire and suspicious activity), and are invited as guests to their events and have never been denied access to the property.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "“‘American Taliban’s’ Return to Islamberg Will Not Be Met With Counter Protest.” Press Release. The Muslims of America. 11 Jul 2017.", "Borrelli, Anthony. “Guilty of 15 gun charges, Johnson City man sentenced to prison.” The Press & Sun-Bulletin. 8 Feb 2018.", "Borrelli, Anthony. “Shoplifting bust leads to huge weapons cache, police say.” The Press & Sun-Bulletin. 14 Jun 2017.", "“Chattanooga man convicted of plotting terror attack sentenced to nearly 20 years.” WBIR. 15 Jun 2017.", "Duffy, Beau. Director of Public Information, New York State Police. Email sent to FactCheck.org. 9 Apr 2018.", "Gabbatt, Adam. “Five anti-Muslim protesters and 400 peace supporters meet at New York rally.” The Guardian. 16 May 2016.", "Hill, Michael. “Terrorist label frustrates Muslim community in the woods.” Associated Press. 2 Oct 2017.", "Kearney, Laila. “A tranquil Muslim hamlet in the Catskills – until the attack plot.” Reuters. 1 Jun 2015.", "Matheson, Tracy. “Police find weapons stockpile in Muslims of America’s N.Y. Islamberg location.” dennismichaellynch.com. 4 Jul 2017.", "Mauro, Ryan and Martin Mawyer. “Exclusive: Jihadi Cult Associate Arrested in NY With Firearms Stockpile.” The Clarion Project. 2 Jul 2017.", "“Trump Sends Feds To Raid NY’s Islamberg After 20yrs They Uncover America’s WORST Nightmare.” independentminute.com. 1 Apr 2018.", "U.S. Department of State. “Patterns of Global Terrorism, 1999.” April 2000.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]