["About this rating", "On 17 May 2015 the web site IFLScience.org published an article reporting that a scientist who had been missing for more than 20 years had been found hiding in a secret drug lab he'd established in a Minnesota couple's basement:", "A Couple from Cottage Grove, Minnesota discovers a man living inside a secret laboratory inside their basement.  On Tuesday, officers with the Warrington County Sheriffs Office went to the Morgan family's home after receiving a call of a possible break in.  When the officers pulled up they saw the Morgan Family standing by the road.", "They ran up to use and said they heard a man shouting inside their basement and that's when they called it in to 911\u001d Said Captain Bruce Normans with the Warrington County Sheriff's Office.", "Officers say they could hear the man yelling in the basement the moment they entered the Morgan's home.  But when they moved cautiously into the basement they saw nothing but could hear banging sounds coming from behind the northern wall of the Morgan family's basement, specifically echoing from behind a large storage cabinet.", "When the Officers moved the large metal cabinet they uncovered an entry way to a large basement room that was full of various science equipment along with a terrified, elderly man.  The 83 year old man was identified as Dr. Winston Corrigan, a chemistry professor from the University of Minnesota who went missing in the fall of 1984 and was a previous resident of the home.", "There was no truth to the story, however. IFLScience.org was a fake news site that traded on its deliberate similarity to the popular science-based IFLScience.com site to spread fabricated clickbait stories. IFLScience.org used the same layout as the real IFLScience.com site, a form of camouflage that frequently tricked readers into believing that they were reading authentic news stories.", "However, the two sites had several noticeable differences:", "The photograph of \"chemistry professor Dr. Winston Corrigan\" used to accompany the fake article is actually a (color-altered) picture of Gary Sandford Raub, a Seattle transient who was arrested in 2012 for the 1976 stabbing death of a 70-year-old woman in Augusta, the oldest cold case arrest in Maine history:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]