["The misleading video has been shared repeatedly on Facebook, for example here where it has been viewed more than 100,000 times since it was posted February 28, 2019.", "The misleading post has a caption that says: “INDIAN PILOT 'ABHINANDAN' DANCING VIDEO WITH PAKISTANI ARMY\"", "“Abhinandan” refers to Wing Commander Abhinandan Varthaman of the Indian Air Force who was shot down over Pakistan on February 27, 2019, captured by Pakistani forces, and then released to India on March 1, 2019.", "Here is an AFP report on the incident.", "The same misleading video and claim have been posted repeatedly on Facebook, for example here where it has been viewed 63,000 times, and on YouTube, for example here where it has been viewed more than 30,000 times since it was posted March 1, 2019.", "Below is a screenshot of the misleading video on Facebook:", "A reverse image search using keyframes from verification tool InVid led AFP to this YouTube video which was posted online February 23, 2019.", "The video, which has more than 650,000 views, is captioned: “Amazing moments of Pakistan Air Force airbase officer celebrate victory moments with staff on Chita Chola Song.”", "The footage is exactly the same as the misleading videos -- and was posted online four days before Abhinandan was shot down and captured by the Pakistan military.", "In the video, four men can be seen dancing. Below are screenshots of their faces:", "Here is an AFP image of Abhinandan giving a statement while in captivity in Pakistan.", "Below is a screenshot of that image on the AFP Image Forum website:", "Here is an AFP image of coverage of Abhinandan on March 1, 2019, the day he was released.", "Below is a cropped screenshot of that image:", "The two images show Abhinandan had the same distinctive handlebar moustache during his captivity and after his release.", "Here is an AFP story about Abhinandan's facial hair.", "None of the four men who can be seen dancing in the misleading video have this kind of moustache.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]