["Days after Sen. John McCain's campaign started attacking Sen. Barack Obama's past association with the 1970s radical William Ayers, Obama's campaign countered with a 13-minute Web video on McCain's history with convicted banker Charles Keating, Jr.", "The documentary burrows deep into the details of McCain's role in the Keating Five, a quintet of senators investigated for pressuring regulators on Keating's behalf prior to his notoriety as a villain in the late 1980's savings-and-loan crisis.", "This sentence, from a blurb introducing the video on a\n\nWeb site\n\nset up by the Obama campaign on Oct. 6, 2008, best encapsulates their attack:", "\"McCain intervened on behalf of Charles Keating with federal regulators tasked with preventing banking fraud, and championed legislation to delay regulation of the savings and loan industry – actions that allowed Keating to continue his fraud at an incredible cost to taxpayers.\"", "Let's check the evidence.", "Keating and McCain, both former Navy fliers, met at a Navy League dinner in 1981, and became friends and mutual supporters.", "Keating, a prominent Arizona banker, organized fundraisers for McCain's campaigns for the House and later the Senate, and donated $112,000 to McCain by 1987. He also hosted the McCain family at least nine times at his lavish vacation home in Cat Cay, Bahamas.", "\"I genuinely liked him and enjoyed being around him, especially on those occasions when Cindy and I and our oldest child, Meghan, were invited to his family's vacation home in the Bahamas,\" McCain wrote in his 2002 book\n\nWorth the Fighting For: A Memoir\n\n.", "Keating complained frequently to McCain about regulations – and regulators – that he said threatened the success of the Lincoln Savings and Loan, a subsidiary of Keating's American Continental Corp.", "McCain was persuaded to act. On two occasions in 1987, he and fellow Sens. Dennis DeConcini of Arizona, Alan Cranston of California, John Glenn of Ohio and – in the second meeting – Don Riegle of Michigan, (all Democrats aside from McCain), met with federal regulators at Keating's request and asked them to back off Lincoln.", "During the second meeting, the regulators told the senators they suspected Lincoln of criminal misconduct, and intended to refer the matter to the Department of Justice. That took the senators aback – McCain, in particular, did nothing more on the matter after the regulators mentioned criminality, a Senate investigation later found.", "The regulators went on to recommend a criminal investigation of Lincoln, but little came of the recommendation until the government seized the failing institution in 1989. Different players in the drama have different interpretations of whether the senators' involvement delayed the investigation.", "But it is clear that indeed McCain \"intervened on behalf of Charles Keating with federal regulators tasked with preventing banking fraud,\" as the Obama campaign claimed.", "In fact, McCain had intervened on Keating's behalf before.", "Having \"heard frequently from Charlie\" about a proposed savings-and-loan regulation called the \"direct investment rule,\" Mcain tried to fight the regulation or get an exemption for Lincoln, he wrote in his book.", "\"I sent or cosigned as many as five letters to (Federal Home Loan Bank Board Chair) Ed Gray and White House officials, and in January 1985, I cosponsored a House resolution calling for the promulgation of the regulation to be postponed,\" McCain wrote. \"All such efforts came to naught, however. The rule was promulgated on schedule, and Lincoln's application for an exemption was rejected.\"", "So yes, McCain also \"championed legislation to delay regulation of the savings and loan industry,\" the second component of the Obama campaign's claim.", "But here we have a quibble with the Obama campaign. It's hard to see how McCain's championing of the legislation \"allowed Keating to continue his fraud,\" since the legislation failed.", "The Obama campaign did not respond to our requests to defend its claim.", "It's also important to note that the Senate Ethics Committee, after a 14-month investigation into the Keating Five, largely exonerated McCain, citing him only for \"poor judgment.\"", "\"The Committee concludes that Senator McCain exercised poor judgment in intervening with the regulators,\" the committee said in a statement at the conclusion of its investigation in 1991. \"Senator McCain has violated no law of the United States or specific Rule of the United States Senate.\"'", "Nevertheless, revelations about his relationship to Keating tarred McCain. He did not reimburse Keating for $13,433 worth of airfare to Keating's home in the Bahamas until the trips were exposed years later by reporters in Arizona. And reporters also discovered that McCain's wife and her father had invested $359,100 in a shopping center with Keating in 1986.", "Keating was convicted in 1993 of 73 counts of wire and bankruptcy fraud, and served 50 months before the conviction was overturned because the jury had been told of his conviction in state court. In 1999 he pleaded guilty to four counts of fraud and was sentenced to time served.", "The government seizure of Lincoln cost taxpayers more than $2 billion, a sum that many would find \"incredible,\" as the Obama campaign claimed.", "So it's clear that McCain did \"intervene on behalf of Charles Keating with federal regulators\" – language lifted almost directly from the Senate committee report. And McCain also \"championed legislation to delay regulation of the savings and loan industry\" – as he acknowledged in his own book. It's debatable whether the first of those actions \"allowed Keating to continue his fraud,\" and the second certainly didn't, since the legislation didn't pass. But yes, Keating's fraud did exact a huge cost from taxpayers. We find this claim Mostly True.", "Keatingeconomics.com\n\n, accessed Oct. 6, 2008", "Arizona Republic,\n\nMcCain Profie: The Keating Five\n\n, March 1, 2007, accessed Oct. 6, 2008", "New York Times,\n\nTimes Topics: Keating Five\n\n, accessed Oct. 6, 2008", "YouTube.com,\n\nJohn McCain in 2002 Talking About the Keating Five Scandal\n\n, August 31, 2008, accessed Oct. 6, 2008", "New York Times,\n\nSenate Inquiry in Keating Case Tested McCain\n\n, Nov. 21, 1999", "Roll Call, Excerpts from Committee Decisions on Four Senators, Feb. 28, 1991", "Boston Globe, Amid McCain's New Status, Old Scandals Stir, Feb. 28, 2008", "Worth the Fighting For: A Memoir, by John McCain, 2002", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]