["“American are living Uganda because of something. Which something do you think it's coming? (sic),” reads a Facebook post from February 21, 2021. The word “living” is intended to mean “leaving”. The post includes an image of the fabricated letter.", "According to the document, purportedly issued by former US State Department spokesman John Kirby, the United States is evacuating its citizens from Uganda for security reasons.", "“This morning, the United States – in coordination with the United Nations and in consultation with the Ugandan government – are to safely evacuate American citizens from Uganda”, reads part of the hoax letter. The document suggests that citizens remaining in the country should “keep in touch with the Embassy and update their locations and status”.", "The same claim was shared in this Facebook post with a caption in local language Luganda that translates into English as: “I think now you can see where [we as a country] are heading to.”", "A search of the keywords “US evacuation Uganda” on Facebook revealed numerous posts sharing the same document.", "A reverse image search of the document on Google reveals that it first circulated on social media in 2016. The results also reveal that the latest version being shared on social media cropped off the date.", "On February 20, 2016, the US Mission in Uganda published a series of tweets (here, here and here) discrediting the evacuation claim as false.", "“The message claiming the US is evacuating its citizens from #Uganda is false. No such message has been sent, no such decision has been made,” the US Mission in Uganda said in one of its 2016 tweets.", "The fabricated document emerged during the 2016 Uganda presidential election when President Yoweri Museveni was elected for the fifth time, defeating opponent and opposition leader Kizza Besigye.", "At the time, the US State Department had questioned the transparency of the elections owing to Besigye being detained, according to then-spokeperson John Kirby.", "A search on the US Mission in Uganda’s websites reveals that in February 2016, the US did issue an alert urging its citizens to “practice safety and security measures because of the potential for political unrest before, during and after the February 18 national elections”.", "However, there is no evidence on the website that any evacuation notice was published, then or now.", "The fabricated letter circulating was signed with Kirby's name, but he is no longer the State Department’s spokesman. Ned Price holds the position.", "In an email to AFP Fact Check, the spokesperson for the US embassy in Uganda, Anthony Kujawa, confirmed that the letter is not authentic. He said there are no current evacuation notices.", "“The letter is not authentic and its contents are not accurate ... No evacuation notices. We post notices for US citizens on our website\", Kujawa wrote in an email.", "Five years after the fabricated letter first circulated, Uganda experienced similar election troubles in January 2021 when popstar-cum-politician Bobi Wine, the main opponent to Museveni, was arrested multiple times and barred from campaigning freely.", "While the electoral commission declared Museveni the winner, Wine challenged the credibility of the election in court. He dropped his case on February 22.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]