["Concerns over a potential outbreak began rising after this alert began circulating among Nigerian medical professionals on Whatsapp.", "The message -- we’ve been unable as yet to determine its origin -- soon began circulating on Whatsapp in general. Many people were unsure of whether to believe the rumours. Some online posts, including one on Facebook which we’ve archived here, claimed outright that there had been an Ebola outbreak in Lagos.", "Officials confirmed that a passenger was indeed screened for Ebola this week after arriving at Lagos’ airport. She had been vomiting and had a fever, which can be symptoms of Ebola. And she was arriving from DR Congo, where a major Ebola epidemic has left at least 1,400 people dead since last August.", "Ahmad Sa'eid, the national chairman in charge of aviation health, said the woman had travelled from DR Congo “for a church programme in Nigeria”.", "“She was acutely ill, febrile and had [an] episode of vomiting. Her travel history made her a contact suspect for Ebola, and she was promptly isolated,” Sa’eid said via email.", "He added that the woman was taken to the Infectious Diseases Hospital in Lagos -- where medical tests showed that she was NOT carrying Ebola.", "“Results came out this pm, and is NEGATIVE for Ebola. The subject is well now, and has been discharged from hospital,” Sa’eid said.", "Nigeria’s health ministry also said there was no case of Ebola in the country.", "Abdullaziz Abdullahi, permanent secretary at the ministry, said that since the outbreak in DR Congo, “heightened surveillance has been ongoing at the various ports of entry by officials of the Port Health Services division of the ministry to prevent importation into Nigeria”.", "“To this effect, every sick passenger has been properly screened and I can say categorically that none of the patients screened tested positive for Ebola or any deadly disease,” Abdullahi said.", "Nigerian officials are stressing the need for screening at transport hubs as the last Ebola outbreak recorded in Nigeria, in August 2014, came after a passenger arrived the same Lagos airport with the deadly virus. This led to 20 confirmed cases and eight deaths.", "Along with the current resurgence of Ebola in DR Congo, Ugandan officials confirmed last week that three members of a family had tested positive for the virus and one of them, a five-year-old boy, has died. The family had travelled to DR Congo to take care of the children’s grandfather, who also died of Ebola.", "Kenya has experienced a similar scare to Nigeria in recent days. As reported by AFP, a woman initially feared to be carrying Ebola ultimately tested negative.", "But health officials at the Nigeria Centre for Disease Control have stressed that “based on available data, the overall risk of importation of EVD (Ebola Virus Disease) to Nigeria remains low”, an assessment that is in line with that of the World Health Organization.", "Among other factors limiting the risk, “there are no direct commercial flights and no known direct trade routes to Nigeria from Uganda,” the NCDC said via a statement.", "Like the health ministry, the NCDC said that screenings were in place at airports, adding that “emergency operations centres” are up and running at major points of entry in Lagos, Kano, Abuja and Port Harcourt.", "The NCDC offers a few pieces of advice to general members of the public:", "Wash your hands frequently with soap and water, or hand sanitizers when soap and water are not available.", "Avoid handling dead wild animals.", "Avoid physical contact with anyone who has possible symptoms of an infection with an unknown diagnosis.", "Make sure fruits and vegetables are properly washed and peeled before you eat them.", "Despite the outbreak in DR Congo, the World Health Organization is not currently advising against travel to the country. However, it does advise people to seek medical advice before travelling and to practise good hygiene.", "Symptoms of Ebola include fever, weakness, muscle pain, headache and a sore throat. These are usually followed by vomiting, diarrhoea, rash and, in some cases, bleeding.", "People are only infectious after they have developed symptoms. The virus spreads among humans through close contact with the blood, body fluids, secretions or organs of an infected person, or objects contaminated by such fluids.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]