["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Keeping up with schoolwork has become much harder for students and professors laboring under stay-at-home orders. You might believe a story about a fed-up professor who failed all her students after they all refused to turn on their cameras during a Zoom class.", "However, a Facebook post claiming an economics professor failed an entire class as part of an experiment in socialist grading sounds a little less realistic.", "The post from March 28 includes a picture of a classroom next to text that reads:", "\"An economics professor at a local college made a statement that she had never failed a single student before, but had recently failed an entire class. That class had insisted that socialism worked and that no one would be poor and no one would be rich, a great equalizer.\"", "The story ends with students slowly bringing the average down until \"to their great surprise, ALL FAILED and the professor told them that socialism would also ultimately fail.\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is not an original story. There are Facebook posts recounting the same story from 2012. Snopes wrote about this story being attributed to many colleges across the country in chain emails as early as 2009. In 2011, a post from an Australian business blog claimed this \"bogus\" story of \"social loafing\" had been circulating for 15 years before it became a chain email. Confusion about this story has long percolated online with commenters on this post going as far as to congratulate the professor.", "We searched Nexis news archives and found no reports about any such episode at any real-world institutions of higher education. Our searches did turn up a 2011 article from a conservative website that features this story in non-specific terms. The writer presents it as a parable with \"five morals\" as opposed to something \"real-world.\"", "The image in this version of the Facebook post has been widely used, mostly on education blogs and Pinterest boards.", "This story never had real news coverage and has been circulating online as an event at an unspecified \"local college\" for more than 10 years. We rate this Pants on Fire!", "Facebook post, March 28, 2020", "Facebook post, August 31, 2012", "Snopes, Did a Professor Use Grade Averaging to Teach About Socialism?, April 4, 2009", "Macrobusiness, Myth of the socialist classroom experiment, Dec. 3, 2011", "Environmental Economics, Can anyone verify this really happened?, Jan. 27, 2012", "The Commentator, Does socialism work? A classroom experiment, Nov. 17, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]