["Earlier this week, multiple social media users shared a list of names of “13 navy personnel” who were accused of spying for Pakistan. One of the prominent among them was Advocate Prashant Bhushan. On February 18, Bhushan shared a hitherto unknown website by the name of AajTak Media published an article naming the accused in the spy racket busted in Indian Navy. “सतीश मिश्र, दीपक त्रिवेदी, पंकज अय्यर, संजीत कुमार, संजय त्रिपाठी, बबलू सिंह, विकास कुमार, राहुल सिंह, संजय रावत, देवशरण गुप्ता, रिंकू त्यागी, ऋषि मिश्र, वेदराम्। (Satish Mishra, Deepak Trivedi, Pankaj Iyer, Sanjit Kumar, Sanjay Tripathi, Bablu Singh, Vikas Kumar, Rahul Singh, Sanjay Rawat, Devsaran Gupta, Rinku Tyagi, Rishi Mishra, Vedram)”, is the list of the names of the arrested naval officers shared by Bhushan. The tweet has garnered nearly 8,400 retweets so far.", "According to the article by AajTak Media, 13 people including 11 navy personnel have been apprehended who were allegedly involved in the espionage. It further claims that the names of personnel honey-trapped by the Pakistani intelligence agency ISI were made public by ‘news agency’ India Today. It may be noted that the article cited by Bhushan doesn’t list the names mentioned in his tweet.", "INC’s National Campaign in-charge Srivasta tweeted the names and opined, “NO TV DEBATES NO FRONT PAGE HEADLINE Why? Bcos they are not Muslims?”. The tweet has amassed over 13,000 retweets.", "Lord Nazir Ahmed, a Pakistani-origin member of the House of Lords in the UK, too posted the list and questioned the ‘lack’ of media coverage on the issue.", "Lawyer-columnist Dushyant also posted a report by The Print, with the same list. However, the article doesn’t identify a single accused. His tweet has gathered over 2,400 retweets at the time of writing this article. Tweeting the same article, Academic Ashok Swain claimed, “NOT one of them is a Muslim – Most of them are Upper Caste Hindus!”.", "Among other prominent social media users who shared the viral list were TV news panellist Rahul Easwar and the former national executive member of Samajwadi party Preeti Chobey.", "An operation named Dolphin’s Nose was launched by Andhra Pradesh Intelligence Department in association with the Central Intelligence Agencies and Naval Intelligence after it was suspected that certain navy personnel are leaking information to Pakistan.", "Under this operation, a hawala operator and seven navy personnel based in Visakhapatnam, Karwar and Mumbai, were reportedly arrested on December 20, 2019. These seven sailors were arrested following sustained surveillance. The personnel were honey-trapped by an ISI module.", "On January 4, 2020, India Today subsequently reported that three more navy personnel – Rajesh, Lokanda and Nirajan who were serving at Eastern Naval Command in Visakhapatnam – were arrested in the espionage case. The report also identified eight other accused as Sunny Kumar, SK Das, and S Kumar Sarma, Ashok Kumar (Jhunjhun), Ashok Kumar (Jodhpur), V Kumar, Somanath and Ashok Kumar Singh. In total, 11 navy personnel along with 2 other civilians have been arrested in the case so far. The names were earlier reported in a TOI report on December 29, 2019. Alt News was unable to independently verify the names.", "According to a TOI report, NIA had taken custody of 13 people for five days with permission from the court. It identified two more accused – a hawala operator from Mumbai named Sayyed alias Masoom Ali and Sheikh Shahista, a 47-year-old woman who was reportedly the key conduit in routing the money to accused through a hawala channel.", "Shashank Singh, the director of fact-checking organization Fact Hunt, floated one such dubious list of names and intentionally propagated disinformation.", "In conclusion, none of the names of the accused, as reported by the media, match with the list viral on social media. Additionally, it was alleged that all the accused in the case belonged to the Hindu community. However, as mentioned above, there were 13 arrests – 11 naval personnel and 2 civilians. All the naval personnel are reportedly from the Hindu community and two civilians belong to the Muslim community.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]