["A video clip in which a cameraman tracking a race ends up ‘winning’ it has been shared by several social media users.", "Who wins the race? pic.twitter.com/S3uASKyHlq", "— Cricketwallah (@cricketwallah) October 5, 2019", "The 11-second video clip shows a track race. As the athletes come close to the finishing line, the cameraman who is running parallel to them, surges with a dash, ‘finishing’ ahead of the athletes. Actor Amitabh Bachchan is among those who have shared this video. Bachchan quote-tweeted a tweet which shared the video attracting over 2.5 lakh views. The tweet itself has 8,000 likes.", "camera man ko .. https://t.co/0j2DhgzqSH", "— Amitabh Bachchan (@SrBachchan) October 4, 2019", "The video clip represents not an actual race, but a commercial. Alt News searched Google with the keywords ‘Cameraman wins race’, and found this video.", "The video was posted in 2007 by Jack Wynne on Youtube. He described the video as – “A commercial i directed out in South Africa replicating a real Olympic stadium event!“", "Wynne uploaded the video again in 2016, describing it as – “A better version of the Powerade commercial I directed with Jim Canty back in the day, and which seems to be getting a lot of interest again! Set to 480p resolution!”. Powerade is a sports beverage manufactured by The Coca Cola company.", "Jake Wynne is a director, editor and filmmaker based in the UK. He has also featured the commercial on his website.", "A video clip showing an advertisement for an energy drink, in which a cameraman is seen beating athletes in a professional race, has been construed as real and shared on social media.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]