["About this rating", "On 31 December 2015, the British spoof and satire web site NewsThump posted an article parodying the innumerable Facebook-related hoaxes that have been prevalent of late on social media, such as rumors that the social media giant will be making all private posts public, or that the company's CEO, Mark Zuckerberg, is giving away money to users who share a particular message:", "Facebook CEO Mark Zuckerberg has promised every Facebook user $1,000, but only if everyone stops sharing stupid hoaxes on his social network.", "The move comes after timelines have become inundated with ridiculous claims being shared by people stupid enough to think they could get a lot of money for doing literally nothing but sharing a Facebook post.", "Zuckerberg is said to have implemented a new algorithm to track hoaxes, and will make the payment to all Facebook users on the first of February if no new hoaxes are identified.", "Social media being what it is, an image from that spoof was circulated outside the context of the article, which led some Facebook users to inquire about whether what it said was true or not:", "NewsThump describes itself as \"Topical news satire from the UK and around the world. Never letting the truth ruin a good story.\" The spoof includes another made-up quote from \"Simone Williams,\" which alludes to another type of rampant Facebook posts, scams involving fake offers of merchandise giveaways:", "It’s a good offer, but I’ve got one here where I can get a new Range Rover, and all I have to do is share this Facebook post from a dodgy looking page. I’d really hate to miss out if this one is real.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]