["About this rating", "On 13 March 2018, one day before a scheduled nationwide student walkout protesting Congress's inaction on gun violence in the United States, reports surfaced that a teacher trained in the use of firearms had accidentally fired his handgun in a California high school classroom, injuring at least one student.", "According to a local press coverage, the incident occurred during a gun safety class at Seaside High School in Seaside, California. The Monterey County Herald reported:", "Police were called to Seaside High School on Tuesday afternoon after a report that a teacher accidentally fired a hand gun in a classroom full of students.", "The teacher was identified as Dennis Alexander, a reserve police officer for Sand City, according to a press release from the Seaside Police Department. Alexander was believed to have been providing instruction related to public safety awareness when he fired a single shot from a semi-automatic handgun into the ceiling.", "According to Seaside Police Chief Abdul D. Pridgen, a student was struck in the neck by debris or a fragment after the bullet ricocheted off the ceiling. The student was not seriously injured. Pridgen said class resumed after the incident was brought under control.", "The Monterey Peninsula Unified School District (MPUSD) released a statement the same day which read, in part:", "The safety and well-being of students and staff are high priorities for the Monterey Peninsula Unified School District. Today, an accident occurred in the Administration of Justice class at Seaside High School. During class, the teacher, who is also a reserve police officer, accidentally discharged his firearm during a lesson while it was pointed at the ceiling, and debris from the ceiling then fell.", "Upon learning of the incident, school site administration, the District Office, and the Seaside Police Department immediately began investigating, including interviewing students in the class. It was determined that there was no immediate threat to students or staff, and school remained in session.", "Due to the nature of this personnel incident, we are unable to share any other details at this time. The teacher has been placed on administrative leave for the duration of the on-going investigation.", "California law prohibits firearms on campus, and MPUSD’s Board of Education policy prohibits any person other than authorized law enforcement or security personnel from possessing weapons, imitation firearms, or dangerous instruments of any kind in school buildings, on school grounds or buses, or at a school-related or school-sponsored activity away from school, or while going to or coming from school.", "The school district informed us that the teacher has been with Seaside High School since 1994 and formerly taught mathematics, though more recently his only responsibility was teaching the Administration of Justice course during which the accident occurred. MPUSD declined to comment further, noting that the matter is still under investigation and there have been \"multiple and differing accounts of the incident and the response immediately following.\"", "Some early press reports said that as many as three students had suffered superficial injuries, but according to the most recent coverage only one student, a 17-year-old male, was confirmed injured. Chief Abdul D. Pridgen of the Seaside Police Department said the wound was caused by a bullet fragment or debris falling from the ceiling. The student was treated at a local hospital and released.", "MPUSD superintendent Daniel \"PK\" Diffenbaugh told KSBW-TV News that among the questions that need to be answered is why a teacher was pointing a loaded gun at the ceiling in front of students. \"Clearly in this incident protocols were not followed,\" he said.", "Coincidentally, a similar incident occurred the same day at a middle school in Alexandria, Virginia. Police reported that a school resource officer accidentally discharged his pistol while sitting down in his office at George Washington Middle School. No injuries were reported, and the officer, a five-year veteran of the police department, was placed on administrative leave pending an investigation. The accident brought the total number of confirmed gunfire incidents in U.S. schools so far in 2018 to 32, according to the gun control advocacy group Everytown for Gun Safety.", "Both accidents added fuel to an ongoing national debate over proposals by the Trump administration, the National Rifle Association, and other gun rights advocacy groups to arm teachers to defend their students in the event of school shootings. According to a March 2018 poll of National Education Association members, educators \"overwhelmingly reject\" such proposals as \"ill-conceived, preposterous, and dangerous.\" Supporters of the proposals say arming and training teachers and other school personnel would make classrooms more safe, not less.", "Herrera, James.  \"Investigation Continues in Seaside High Teacher's Shooting of Gun in Classroom.\"\r\n  Monterey Herald.  14 March 2018.", "Larson, Amy.  \"Seaside High Teacher Accidentally Fires Gun in Class, Students Injured.\"\r\n  KSBW News.  14 March 2018.", "Moore, Jack.  \"School Resource Officer Accidentally Fires Weapon at Alexandria Middle School.\"\r\n  WTOP News.  13 March 2018.", "Rosenblatt, Kalhan, Chuck, Elizabeth, and Sperling, Jonathan.  \"Students Demand Action on Gun Violence with Nationwide Walkout.\"\r\n  NBC News.  14 March 2018.", "Schmatz, David.  \"Seaside Teacher, Councilman and Reserve Officer Accidentally Discharges Weapon in a Classroom.\"\r\n  Monterey County Weekly.  13 March 2018.", "KRWG News.  \"New NEA National Survey: Educators Overwhelmingly Reject Proposals to Arm Teachers.\"\r\n  13 March 2018.", "Monterey Herald.  \"Police: Seaside High Teacher Believed to Have Accidentally Fired Gun in Class.\"\r\n  13 March 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]