["Najeeb Ahmed, a student of Jawaharlal Nehru University (JNU), had gone missing in October 2016 following a scuffle with ABVP members. The case was investigated and subsequently closed by the CBI. Ever since his disappearance, social media has been thick with rumours that Najeeb had joined the ISIS.", "The above message has been circulated on WhatsApp along with a photograph showing young men posing in front of the ISIS banner. “Our Najeeb, Najeeb of JNU, Najeeb of Azadi gang. Beloved of leftists, he has been placed in ISIS directly from JNU. He has sent his wishes to Rahul ji and Kejri sir ji from Syria (translation)”, says the message. The photograph claims to show Najeeb, who is supposedly in the centre of the photo.", "Alt News has already debunked this claim twice earlier. This time, the rumour started circulating after a tweet by Najeeb’s mother addressed to Prime Minister Narendra Modi, inquiring about her missing son.", "If you are a chowkidar then tell me where is my son Najeeb ?", "Why Abvp goons not arrested ? Why three toped agencies failed to find my son ? #WhereIsNajeeb https://t.co/5GjtKSTIDh", "— Fatima Nafis (@FatimaNafis1) March 16, 2019", "That Najeeb Ahmed has joined the ISIS is a rumour which has been circulating since early 2018. In August 2017, a student of the Vellore Institute of Technology (VIT), Vellore had gone missing and was suspected to have joined the ISIS, investigators had concluded on the basis of text messages the 23-year old had sent to his family before he went missing.", "So as it turned out, news of a Najeeb from VIT, Vellore who was suspected to have joined the ISIS was conflated, deliberately or otherwise, with the disappearance of JNU’s Najeeb Ahmed, and shared widely on social media platforms and WhatsApp. In the past, BJP leaders such as Ram Madhav and Swapan Dasgupta have fallen prey to this misinformation.", "In March 2017, Times of India published an unverified story, according to which ‘sources’ had told the newspaper that JNU’s Najeeb Ahmed was an ISIS sympathiser, revealed by his browsing history. The report claimed that according to police sources, Najeeb used to watch videos of ISIS on YouTube.", "The ‘report’ was picked up and relayed by multiple news organisations, before Delhi Police confirmed that the news was bogus– there was no truth to the report that Najeeb had viewed pro-ISIS videos.", "Alt News reverse searched the image and discovered that the photograph of ISIS fighters used along with the message claiming Najeeb has joined ISIS, was clicked in the year 2015 by Reuters. It is part of a photo album titled ‘Battle For Iraq‘, and was uploaded in March 2015.", "Disinformation about Najeeb Ahmed joining ISIS circulates on social media every few months, despite being debunked.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]