["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A majority vote of the seven Wisconsin Supreme Court justices, rather than seniority, would determine which justice serves as the chief, under a referendum being put to voters on April 7, 2015.", "Wisconsin voters are being asked in the April 7, 2015 election whether to amend the state constitution to change how the chief justice of the Supreme Court is chosen.", "Which raises the question: Do most voters even know how the selection is made? After all, the office of chief justice is never on the ballot.", "Currently, the justice who has served longest on the high court is automatically made chief, and remains in that role as long as he or she is on the court. That process has been in place since an amendment was made to the state constitution in 1889.", "With the referendum, voters decide to keep the seniority system, or instead have the justices choose a chief from among themselves, every two years.", "The liberal Greater Wisconsin Committee, through a group it created called Make Your Vote Count, released a radio ad on March 30, 2015 that urges a vote against the change. The ad is narrated by Janine Geske, a Marquette University law professor who served on the high court from 1993 to 1998.", "\"For 125 years, it's been the votes of the people of Wisconsin determining who serves as chief justice. After all, it’s the people of Wisconsin who elect the Supreme Court,\" Geske says at the start.", "She adds near the end: \"Our democracy and your vote are threatened by a referendum April 7th that takes the choice of chief justice away from the people.\"", "So, is the Greater Wisconsin Committee right -- would the referendum take \"the choice of chief justice\" of the Supreme Court \"away from the people,\" when the voters don’t directly elect a chief justice?", "Political backdrop", "The state high court has seven justices. Voters elect them to 10-year terms in non-partisan spring elections. (Justice Ann Walsh Bradley is running for re-election against Rock County Circuit Judge James Daley on April 7.) Sometimes, a justice gets on the court by being appointed by the governor to fill a vacancy, but then he or she must run for election.", "On the surface, the referendum would merely change the process for deciding which justice has administrative control of the court. But if it passes, it would also have, as the radio ad notes and the Milwaukee Journal Sentinel has reported, political implications. The conservative majority on the court likely would replace Shirley Abrahamson, the court’s leading liberal, as chief justice.", "Referendum", "So, do the voters choose the chief justice? Abrahamson’s example helps sort it out -- though it's important to note she is an exception, having been a member of the Wisconsin Supreme Court longer than anyone.", "Abrahamson was appointed to the Supreme Court in 1976, then won election in 1979 and was re-elected in 1989. She ascended to chief in 1996 when she became the court’s most senior member. When voters subsequently re-elected Abrahamson to the court in 1999 and 2009, they ensured that, as the longest-tenured justice, she would remain the chief.", "The Greater Wisconsin Committee argues that the voters who re-elected Abrahamson wanted her to remain as chief justice.", "But there's no way to know how many felt that way, since there was no actual vote on who would be chief. Some voters might have simply favored Abrahamson over her election opponent for a seat on the court, but may not necessarily have wanted her to be chief justice.", "It's also worth noting that Abrahamson aside, under the current system, voters often don't get to vote for, or against, a sitting chief justice. Here’s a look at the chief justices going back for two decades before Abrahamson became chief, based on \"Portraits of Justice,\" a book published by the Wisconsin Historical Society Press.", "Chief Justice", "Time on Supreme Court as chief justice", "Number of times sought re-election while chief", "Roland Day", "1995-1996", "0; retired from court in 1996", "Nathan Heffernan", "1983-1995", "1; retired from court in 1995", "Bruce Beilfuss", "1976-1983", "0; retired from court in 1983", "Horace Wilkie", "1974-1976", "0; died in 1976", "So that history undermines the idea that voters get much of a say in terms of who is chief justice. Given her longevity, some 19 years as chief, Abrahamson is an unusual case.", "Our rating", "The Greater Wisconsin Committee said an April 7, 2015 referendum would take \"the choice of chief justice\" of the Wisconsin Supreme Court \"away from the people.\"", "Voters elect the Supreme Court justices, but they don’t get to vote for chief justice. Currently, the justice who has served longest is automatically made chief justice. If the chief comes up for re-election for a seat on the court, voters can, in effect, make that person the chief for 10 more years by re-electing him or her to a new 10-year term.", "However, often voters never get such an opportunity. A justice becomes chief by virtue of seniority, but may then leave the court altogether before facing re-election, as has occurred several times in recent history prior to Abrahamson.", "For a statement that contains some element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "WisPolitics.com, radio ad from Greater Wisconsin Committe’s Make Your Vote Count, March 30, 2015", "Wisconsin Legislative Reference Bureau, constitutional amendment brief, January 2015", "Milwaukee Journal Sentinel, \"Groups decry chief justice referendum,\" March 23, 2015", "Wisconsin State Journal, \"Business group bankrolling ‘yes’ vote in Supreme Court referendum,\" March 31, 2015", "Interview, Greater Wisconsin Committee executive director Rich Judge, March 31, 2015", "Milwaukee Journal Sentinel, \"Supreme Court amendment is about good government,\" March 30, 2015", "Wausau Daily Herald, \"How not to choose a chief justice,\" March 30, 2015", "Wisconsin Historical Society Press, \"Portraits of Justice,\" 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]