["The claim was published by a New Zealand-based Facebook user here. The post has been shared more than 140  times.", "The post includes what appears to be a screenshot of an article posted to an unidentified website. The byline reads: “Investment Watch Blog”.", "The article’s headline reads “New Food Bill in New Zealand Takes Away Human Right to Grow Food”.", "The claim has been shared hundreds of times by other Facebook users here, here and here.", "The claim, however, is false; similar claims have circulated online since at least 2014.", "A New Zealand Ministry for Primary Industries spokesperson told AFP via email that “the claims made in the screenshot are entirely false and there is no legislation supporting these claims”.", "The original post referenced in the screenshot written by “The Investment Watch Blog” was published on September 21, 2011, here. A similar claim was published by  far-right conspiracy theorist Alex Jones on his website Infowars here in 2011.", "The posts were published in response to the 2010 New Zealand Food Bill 160-2,  which aimed to introduce new regulations for food production in the country.", "Petitions and websites were set up to voice opposition to the bill. Critics claimed the legislation could seriously limit food production in community gardens, food co-ops and farmers markets.", "The bill stalled from 2010 to 2013, but passed parliament in 2014 after a number of changes were introduced to allay concerns about certain parts of the bill.", "Some of the changes included:", "Similar claims that it’s illegal to grow food in New Zealand have been cropping up on the internet since at least 2014.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]