["This one-minute 41-second video was published on Facebook on May 26, 2020. It has been viewed more than 10,000 times.", "It shows a man lying down on the ground, shouting in Chinese while being surrounded by Indonesian police officers.", "Translated from English to Indonesian-language, the post reads: “PRC Chinese entered through Banyuwangi Airport. Was caught and arrested”.", "Banyuwangi International Airport is located in Banyuwangi regency, East Java province, Indonesia.", "The man in the video was talking in Mandarin to a translator on the phone about money issues. He said: “Hurry up and transfer money to my bank card. RMB. Translator! Translator! Hurry up and transfer me 12,100! My wages...Everyday pay me 50 more. My total working days are 240. Multiples 50. Equals to, 12,100 RMB. Translator, translator, tell Indonesian police, otherwise you just tell Indonesian police, shoot me dead!”", "RMB, or renminbi, is the official currency of China.", "The footage has also been shared more than 3,200 times in other Facebook’s posts here, here, here and here, alongside a similar claim.", "The claim, however, is misleading.", "Keyword searches found this higher-quality video uploaded on YouTube on May 25, 2020. The Indonesian-language title translates to English as: “Video of Cranky Chinese Foreign Worker Hiding Under the Bus, Does Not Want to Go Back to His Country at Banyuwangi Airport”.", "Below is a screenshot comparison between footage in the misleading post (L) and the YouTube video (R):", "Indonesian media Tribunnews.com also uploaded a three-minute 26-second clip here on May 27, 2020, on its YouTube channel, which includes the scene in the misleading video. The title translates to English as: “VIDEO Moments Chinese Foreign Worker Raging in Banyuwangi Airport, Hiding Under the Bus, Claiming Salary Hasn’t Been Paid”.", "The scene in the misleading post can be seen at the 48-second mark of the Tribunnews video.", "Indonesian news outlet Detik published a report about the incident on May 26, 2020, here.", "Translated from Indonesian to English, the first two paragraphs of the report read: “Cui Changqing, a Chinese foreign worker who works at a cement factory in Jember, PT Sinoma Engineering, still stays at Banyuwangi Airport.", "“According to the police, Cui claimed that he had not received his salary when he was working there. His salary had been given to the agency who sent him to work as a foreign worker. He demanded his salary held by the agency to be given to him first.”", "Jember is a regency in East Java province in Indonesia.", "Jember immigration official Kartana told AFP that 146 Chinese foreign workers had been repatriated on May 25, 2020, but Cui stayed behind and is currently staying at the Jember immigration office.", "“He is still at the Jember immigration office because there hasn't been any flight to China. The other 146 have been repatriated,” Kartana said via WhatsApp on June 4, 2020.", "Other Indonesian news outlets, such as Kumparan and Merdeka.com, also reported on the airport incident.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]