["A copy of the Quran was recently set on fire during a demonstration in Norway. It now being claimed on social media, via a video, that an Imam who opposed the burning of the holy book of Islam was attacked by the Norwegian police. The video shows cops and a police dog dragging a man. Several users from Pakistan have shared the clip.", "1/2 Norway. In response of that Imam of this Mosque condemned burning of Quran by non Muslim Norwegian. As Planned by Govt., some policemen came along with a dog&attacked Imam who was reciting Quran.Policemen beat him vigorously put him on d floor and allowed dog to bite. pic.twitter.com/dHYDFG67OS", "— Maj Gen Javed Aslam Tahir, R, SVP PESS (@javedatahir) December 1, 2019", "A keyword search on Google led us to reports from October this year. The incident took place in the Netherlands and is unrelated to the recent Quran burning demonstration in Norway. According to De Telegraaf, the arrested man is a 43-year-old resident from Rotterdam. He was taken by the police after a call was made from the mosque, complaining that the man was being “difficult”.", "Another Dutch publication Algemeen Dagblad (AD) wrote in an October 5 report that the man’s family had called the cops after he was violent with passers-by. An ambulance was also called for him however he was resisting detention. The man tried to grab a policeman’s firearm.", "The video has been shared with a false claim by users from across the world. The post below was made by an individual from Malaysia.", "Norway Burning Al-Quran", "For those that don’t understand urdu Apparently Norway govt started burning Quraans This imaan stood outside the musjid offered free quraans to anyone that needed", "Police entered the musjid while he was reading quraan with shoes and a dog He asked that they remove the shoes and take out the dog", "To protect house of allah he defended. The cops and dog attacked him and beat him up", "The guy speaking asks that the vid should go viral and make this incident known around the world", "Posted by Izham Nayan on Monday, 2 December 2019", "It is in fact viral on Facebook.", "Alt News has also received verification requests on its WhatsApp number.", "A video of a man detained by Rotterdam, Netherlands police for aggressive behaviour was shared with the false claim that an Imam opposing the burning of the Quran in Norway was hounded by cops. Recently, another piece of misinformation was linked to the Quran burning demonstration. An image of a man suffering from bubonic plague was shared with the false claim that his hands were burnt by Allah as punishment for setting ablaze the holy book of Islam.", "[Update: Rotterdam, Netherlands police was referred to as Norway police in this report. The same has been rectified.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]