["As unfounded claims of fraud spread online in the wake of the 2020 election, previous questionable elections are coming back into the spotlight. An Instagram post depicts Georgia Democrat Stacey Abrams beside text that claims her 2018 run for governor was stunted by a dirty politician.", "“Stacy (sic) Abrams had the governorship of Georgia stolen from her by a corrupt Secretary of State who abused his office to suppress the vote and hand himself the election,” the Instagram post by liberal account The Other 98% reads. “What did she do? She rolled up her sleeves, registered 800,000 new voters and is about to flip her state blue.”", "The Other 98% did not respond to USA TODAY’s request for comment.", "Fact check:Post online about Georgia Gov. Brian Kemp's 2018 win is partly false", "In 2018, Abrams ran for governor against Republican Brian Kemp, who at the time was Georgia’s secretary of state. As secretary of state, Kemp was in charge of running the state’s elections.", "During his tenure in that role, he trimmed more than 1.4 million inactive voters, with low-income and minority Georgians most likely to have their registrations canceled, according to the Atlanta Journal Constitution. Over 668,000 of those registrations were canceled in 2017. In the lead-up to the 2018 election, Georgia put 53,000 voter registrations on hold, the majority of them Black voters, for additional screening.", "Charles Bullock, a professor of political science at the University of Georgia, told USA TODAY maintaining the accuracy of voter lists is permitted under law, which often means removing voters, and that the holds would not have stopped those Georgians from voting.", "\"All the person had to do is show up with their photo ID, which everyone has to have, and they would've been allowed to vote,\" he said. \"But by making that claim, maybe that did inspire some more of those people to make sure that they did vote – both Democrats and Republicans.\"", "Kemp did not resign from his role until he’d all but won the election, thus overseeing the election in which he was a candidate. But it's not uncommon for a secretary of state to continue holding that office while running in a race, Bullock said.", "\"Every secretary of state who has run for reelection as secretary of state in Georgia has held onto the office during that,\" he said. \"It's just not that common for a secretary of state to run for governor.\"", "Claims of broken voter machines, showing votes cast for Abrams as registering for Kemp arose, and 85,000 more voters were purged from rolls in the three months leading up to the election. Kemp has repeatedly denied he attempted to suppress the vote, USA TODAY previously reported.", "Abrams lost to Kemp by nearly 55,000 votes in 2018. In her concession, Abrams said the outcome reflected voter suppression.", "\"I acknowledge that former Secretary of State Brian Kemp will be certified as the victor in the 2018 gubernatorial election,\" Abrams said, according to NPR. \"But to watch an elected official who claims to represent the people in this state baldly pin his hopes for election on suppression of the people's democratic right to vote has been truly appalling.\"", "Still, nationally, the turnout in 2018 was higher than average by historical standards, FiveThirtyEight reported. In Georgia in 2018, \"an estimated 55 percent of eligible voters exercised their right to vote, which is about 21 points higher than the state’s 1982-2014 average. That was the biggest change from the average of any state,\" FiveThirtyEight also reported.", "The U.S. House of Representatives Oversight Committee opened an investigation in March 2019 into concerns over voter registration and voter access during the 2018 gubernatorial election and Kemp’s tenure as secretary of state, citing a particular concern of reports that Georgians, particularly people of color, “faced unprecedented challenges with registering to vote and significant barriers to casting their votes” during that election.", "Fact check:Stacey Abrams paid outstanding taxes, but the Rev. Al Sharpton still owes", "In March of this year, the committee, controlled by its Democratic majority, wrote in a memorandum that the Georgia secretary of state's and governor’s offices have acknowledged that they are withholding over 1,400 responsive documents from the committee, having released thousands of already-publicly available documents to lawmakers.", "The committee wrote that despite that, it learned “new, concerning information” about voter suppression in Georgia. After removing more than 500,000 voters from rolls – perhaps the largest single cancellation of voter registrations in U.S. history, according to the Atlanta Journal Constitution – Kemp and a top campaign staffer mocked a press release from a Democratic candidate that warned of systemic voter suppression in October 2017. They forwarded each other the press release, writing the word “us” with laughing and smiling emojis, according to the memorandum. The document lists a number of other areas the committee viewed as concerning.", "Abrams maintains that the 2018 Georgia election process was not fair. She told the New York Times Magazine in April 2019 that while she recognizes Kemp secured enough votes to become governor, she \"does not concede that the process was proper, nor do I condone that process.” Despite that, there is little empirical evidence Kemp stole the election.", "Fact check:Critics satirically redact Trump's tweet to make it falsely appear he admitted defeat", "It’s true that Abrams, through the efforts of her two organizations, Fair Fight and the New Georgia Project, registered upward of 800,000 new voters in the lead-up to the 2020 election, according to Politico. Many have credited Abrams for the state’s apparent shift to being more Democratic.", "“Stacey Abrams had the foresight to rebuild the Democratic Party apparatus in Georgia by identifying the fact that there were a lot of latent voters in the state and by going after them,” Emory University political scientist Andra Gillespie told The 19th. “She showed you could increase competitiveness not by worrying about trying to persuade the unpersuadable and demonstrated a lesson that will be copied in other places.”", "More:Georgia solidifies its swing-state status thanks, in part, to Stacey Abrams", "But Abrams didn’t do it alone. She tweeted Nov. 6 that a number of organizing groups, like Asian Americans Advancing Justice and Black Votes Matter,  deserve credit for being “in the trenches” of making change.", "While Abrams has maintained the 2018 gubernatorial election was unfair and tainted by voter suppression, there’s no empirical evidence that now-Gov. Kemp stole that election from her. She did register over 800,000 new voters in time for the 2020 election, with help from other activists. We rate the claim PARTLY FALSE, because some of it is not supported by our research.", "Thank you for supporting our journalism. Youcan subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]