["The video was published here on Facebook on March 23, 2020. It has been viewed more than 1,200 times.", "The 15-second video appears to be security camera footage with a timestamp which shows 5:23am on March 20, 2020. It shows a man appearing to put his hands inside his shorts before pressing the buttons in the lift.", "Below is a screenshot of the misleading Facebook post:", "The video’s traditional Chinese-language caption translates to English as: “Kai Tak Garden, there's a man with sexually transmitted diseases exposing his genital organ and carrying bacteria”.", "Kai Tak Garden is a residential housing complex located in the Hong Kong district of Kowloon.", "The video was shared as Hong Kong continued to battle the spread of the novel coronavirus, COVID-19, as reported here by AFP.", "The video has also been shared here, here and here on Facebook, alongside a similar claim.", "The claim is false.", "A Google reverse image search using keyframes extracted from the misleading video and a subsequent keyword search found this March 21, 2020 news report published by Singapore-based newspaper The Thaiger. The report's headline reads: “Man arrested for deliberately trying to contaminate Bangkok lift – VIDEO”.", "The report reads in part: “A 32-year-old Thai man in Bangkok has been arrested after being captured on CCTV camera deliberately contaminating an elevator with his saliva and sweat. Bangkok Mass Transit System (BTS) staff told reporters the incident was captured on CCTV at 5:23am Friday.”", "The report was published with this YouTube video, which shows the misleading footage from the one-minute and 11-second mark to the one-minute and 26-second mark.", "Below is a screenshot of the article published by The Thaiger:", "The incident was also reported by Thai newspapers bangkokbiznews here and Kom Chad Luek here, as well as the US news website International Business Times here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]