["The four-minute and 53-second video was published on Facebook here on December 4, 2020.", "The post’s simplified Chinese caption translates partly as: “A US astronaut jumped from 39 kilometres in space with flesh and blood towards the Earth, and bore the falling at a supersonic speed. At the moment of life and death, he challenged the limit of human beings with fearlessness and scientific spirit, which is amazing. It took him four minutes and 20 seconds.”", "The video was shared tens of thousands of times alongside similar claims on Facebook here, here and here; on Twitter here, here and here; and on Weibo here, here and here.", "However, the claim is misleading.", "A keyword search based on the text “RED BULL STRATOS”, which is visible at the video’s 3:46 mark, found that the jumper is in fact Austrian skydiver and pilot Felix Baumgartner, not a US astronaut.", "The same video was published on YouTube by Britain's BBC here on March 17, 2016. The corresponding footage starts from the beginning of the YouTube video to its four-minute mark.", "The YouTube video’s headline reads: “Jumping From Space! - Red Bull Space Dive - BBC”.", "The video’s caption reads: “The moment has finally arrived, it's time for Felix Baumgartner to perform the space dive. Taken from Red Bull Space Dive.”", "Below are three screenshot comparisons between the video shared in the misleading Facebook post (L) and the YouTube video published by BBC (R):", "Baumgartner's stunt -- which broke three world records -- can also be seen on YouTube here in a video posted on Red Bull’s official channel on October 15, 2012.", "More footage of the jump is available on the official Red Bull Stratos website.", "“On October 14, 2012, Austria’s Felix Baumgartner astonished millions watching live around the world with a parachute jump from the edge of space. That galvanizing moment was the culmination of years of work by an elite team determined to find ways to improve aerospace safety, and the mission’s legacy lives on,” reads part of the webpage.", "The jump is also noted on Baumgartner’s personal website here.", "Both Baumgartner’s and Red Bull Stratos’ website list the jump height as roughly 39,000 metres, which the social media posts accurately note.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]