["After the African Union expressed concerns about discrimination against Africans in Guangzhou, a video started circulating on Facebook and Twitter that purports to show a Kenyan couple involved in a fist fight with a Chinese couple in Wuhan. This claim is false: The video was in fact filmed in the Bronx district of New York in front of an Asian restaurant.", "“Kenyan couple exchange blows with a Chinese couple in the streets of Wuhan.... its survival for the fittest,” reads a tweet shared more than 1,200 times since it was posted on April 13, 2020.", "The same claim can be found on Facebook (here, here and here) and Twitter (here, here and here).", "A similar claim was made in French in posts shared on Facebook and Twitter. These posts claimed the incident took place in Guangzhou, a city in southern China.", "Africans living in southern China say they have been victims of arbitrary evictions and discrimination as the country steps up its fight against imported infections, as AFP reported here.", "On April 11, 2020, as reported by AFP, the African Union expressed its \"extreme concern\" about the situation and called on Beijing to take action.", "However, the video circulating on social media has nothing to do with China. In fact, the clip shows a fight in a district of the Bronx in New York and first appeared online on March 18.", "In the video, an Asian woman and two Asian men are seen exchanging blows with a black woman and two black men.", "AFP spotted various visual clues that helped locate the video, including a blue sign with the acronym \"SBH” and a storefront with the word \"PayOMatic\" written in yellow and white on a blue background.", "A keyword search on Google Images allowed us to find a logo resembling the SBH sign in the video. The logo is of the St Barnabas Hospital in the Bronx.", "By conducting a further search for St Barnabas hospital using Google Maps’ “Nearby” tool, we found the “PayOMatic” store located near the hospital. A virtual tour with Street View showed that the store was a short walk from the hospital.", "Several elements spotted at the start of the video (circled in red below) include: the words \"SBH\" and \"PayOmatic\", graffiti on a green garage door, a tree at the edge of the road, white markings on the road, a fire hydrant, then wide sidewalks formed by square concrete slabs.", "We then compared these visual clues to the images available in Street View. The hospital, the PayOmatic logo, the graffiti, the tree, the fire hydrant and the large concrete slabs all are clearly visible by moving the angle of the Street View camera.", "In the last seconds of the video, we can see that the person filming is doing so from behind a window and a glass door. On Street View, there are two restaurants, including a Chinese restaurant, with display cases and glass doors.", "These visual clues allowed us to trace the scene in the video to number 565 on 184th street in New York, rather than Wuhan or Guangzhou in China as posts on Twitter and Facebook claim.", "Using the InVID-WeVerify tool, AFP also discovered that this video was posted on March 18 on Reddit, two weeks before the first reports of Africans describing discrimination in Guangzhou, which AFP wrote about here on April 11, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]