["The three-minute 33-second video has been viewed 5,900 times and shared 339 times after it was published on Facebook here on April 13, 2020. A Portuguese gospel song “Because He Lives” by the singer Fernandinho can be heard playing in the background.", "The post’s Thai-language caption translates to English as: “Poor them! In Italy, people are so frightened that they knelt down on the streets, both crying and praying for the god to forgive their sins #thistimebelievingindoctorsistheonlywaytosurvive #andstayhome”", "Below is a screenshot of the misleading post:", "As of April 22, at least 24,648 people have died in Italy after contracting  COVID-19, World Health Organization figures show.", "The video was also shared alongside a claim it was filmed in Italy on Facebook here, here, here and here.", "The claim is false. A reverse image search using InVID-WeVerify, a digital verification tool, found the clip was filmed outside a church in Belo Horizonte, a major city in southeastern Brazil.", "The footage was published by the church, the Templo dos Anjos, on their YouTube channel here on April 5, 2020. The video’s Portuguese caption translates to English as: “Praying for Brazil and nations in the time of Coronavirus - PR Jerônimo Silveira”.", "Below is a screenshot comparison of the video in the misleading post (L) and the YouTube video (R):", "Google Street View imagery of the Templo dos Anjos in Belo Horizonte also corresponds to the footage shared in the misleading posts.", "Below is a screenshot comparison of the video (L) and the Google Street View imagery of the church (R) with the same entrance sign circled in red:", "Your Living Manna, a non-profit Christian ministry, also published the same video of people praying outside the church in Brazil on their YouTube channel here April 11, 2020.", "The video was titled: “Because Jesus Lives, I Can Face Tomorrow || Prayers for COVID-19, Brazil”.", "\"This prayer was held as a part of the National Day of Prayer and Fasting which the President of Brazil Bolsonaro declared for April 5, 2020, to ‘free Brazil from this coronavirus pandemic’,” Bobby Samuel Ambanattu, the founder of Your Living Manna, told AFP by email on April 15, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]