["The claim appeared in this December 9, 2020, post, along with a photo of Gibran Rakabuming Raka and his wife, Selvi Ananda.", "The Indonesian-language caption translates to English as “Indonesia’s youngest mayor.”", "Gibran, the eldest son of Indonesian President Joko Widodo, has been declared the winner of the 2020 mayoral election of Surakarta, a city in central Java, where his father started his political career as mayor, as reported by Indonesian media Detikcom and CNN Indonesia on December 16, 2020.", "The claim that Gibran is “Indonesia’s youngest mayor” also appears in other posts, such as this one and this one.", "However, the claim is false.", "The current record holder for Indonesia’s youngest mayor is M. Syahrial, who, at the age of 27, took office as mayor of Tanjung Balai, a town in North Sumatra province, in February 2016, according to the Indonesian World Records Museum (MURI).", "Gibran is now 33 years old, according to his mayoral candidacy registration document, listed on the website of Surakarta’s electoral commission.", "Below is a screenshot of Gibran’s registration document, with the relevant section marked in red by AFP:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]