["On December 20, 2019, several people shared an image which shows policemen purportedly holding placards against the National Register of Citizens (NRC) and Citizens Amendment Bill (CAB). The viral image has been posted on Twitter with the text, “हम कहते थे ना…. पुलिस के जवान भी संविधान बचाने के लिए हमारे साथ हैं , सिवाए RSS आतंकियों के (Didn’t we say…police personnel are also with us to save the Constitution, only RSS terrorists are against.)”", "हम कहते थे ना…. पुलिस के जवान भी संविधान बचाने के लिए हमारे साथ हैं , सिवाए चड्डी धारी आतंकियों के 💐@Sajid_khan0786 @Mr_Swatantra @DaudKhan3283 @khalidsalmani1#NoCAB_NoNRC#IndiaRejectsCAB #CABAgainstConstitution pic.twitter.com/JCH5KDQPJd", "— Mainuddin Mohammad Israr (@IsrarMainuddin) December 20, 2019", "Several people have shared the same image on Twitter and Facebook.", "Alt News received several requests to fact-check the images on WhatsApp (98252 55790) and on our official mobile app.", "Another image of alleged protest by police is also being shared. Actor and filmmaker Aparna Sen was among those who shared it.", "The image has been morphed. One can spot the areas where the original image has been edited. In the viral image, the pixelation is clearly visible and highlighted below.", "Alt News did a reverse image search on Google and found a November 5, 2019 article by The Hindu which carried the same photograph. The report is on police protest outside the Delhi Police headquarters. This was a protest in response to the November 4 incident where few lawyers thrashed a policeman at Saket Court, New Delhi.", "The image shared by Aparna Sen is also of the same incident. Alt News found the original photograph in a November 5, 2019 report by Dainik Jagran. In the original photograph, the placard has the words “we want justice”.", "Morphed images of Delhi police personnel protesting after a scuffle with lawyers in November 2019 are now being shared with the false claim that the police joined the protest against CAB and NRC.", "[Update: Aparna Sen’s tweet was added to the fact-check on January 13, 2020.]", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]