["A video of a policeman unable to walk straight falling on the ground is viral on social media. The cop is seen coughing and sneezing profusely. His fellow policemen come to the rescue and call the doctors to the spot. The clip is being shared with the claim that the policeman is infected with coronavirus and the incident took place at Bihar’s Hajipur jail. Facebook page Law chamber of Md Aammar Zaki posted the video with the claim, “Suspected Corona patient in Hajipur Jail”.", "Suspected Corona patient in Hajipur Jail", "Posted by Law Chamber of Md Aammar Zaki on Sunday, 12 April 2020", "Alt News has received requests on its official WhatsApp number to fact-check the video.", "At 5:29 seconds in the video, the text inscribed on the gate reads, “Mandal Kara, Hajipur (Vaishali)”.", "We then performed a keyword search on YouTube and found the same video posted by a channel named Inquilabi Hindustani Live. The title of the video says that it’s a mock drill. However, no other details about the video were specified.", "The video was uploaded by another channel named Vaishali News where the anchor informed that the clip has gone viral on social media with the false claim that a suspected coronavirus patient was found at Hajipur jail. This channel too informed that the incident represents a mock drill. The Quint had earlier fact-checked this video.", "In conclusion, a video of mock drill conducted at a prison in Bihar’s Hajipur has been falsely shared as a real incident showing a coronavirus-infected cop. Last month, Alt News had debunked a mock drill video from Punjab that was also shared as a genuine coronavirus case. Another mock drill video was falsely shared as a coronavirus patient arrested in Uttar Pradesh.", "Note: The number of positive cases of the novel coronavirus in India exceeds 10,800 and close to 360 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 19 lakh confirmed cases and over 1.2 lakh deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "Ketan is Senior Editor at Alt News Hindi.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]