["The 43-second video was published on Facebook here on June 6, 2020. It has been viewed more than 187,000 times and shared 3,500 times since.", "The Indonesian-language post translates to English as: “This is a protest in America. now during the #COVID ー 19 pandemic", "“If in 1 week corpses are lying in America it means coronavirus is malignant and real. but if nothing happened it means think about it yourself.. ??", "“*wisdom of usa protest in covid19 *\n\t#COVID_19\n\t#ChinaVirusKonspirasi”.", "The post circulated as anti-racism protests erupted across the US following the death of Geroge Floyd, an unarmed black man who was killed by police on May 25, 2020, as AFP reported here.", "The footage was also viewed tens of thousands of times alongside similar claims on Facebook here, here, here and here.", "The claim, however, is false.", "Reverse image and keyword Google searches found the same footage was published on January 5, 2020, here on the YouTube channel of English-language news site Al-Masdar News. The clip shows the same video with a 90-degree rotation.", "The clip’s caption reads: “Thousands of people poured into the streets of Ahvaz, Iran on Sunday to bid farewell to the long-time commander of the Islamic Revolutionary Guard Corps' Quds Force, Major-General Qassem Soleimani.”", "Ahvaz is a city in southwestern Iran.", "The same clip, with the same rotation as the video in the misleading post, was also posted on Twitter here on January 5, 2020.", "The tweet reads: “Aerial video of Soleimani funeral in Ahvaz, Millions of mourners flood the streets to pay their respects to Iranian military commander Qassem Soleimani.”", "Below is the screenshot comparison between the clip in the misleading post (L), the misleading footage rotated 90 degrees (C), and the genuine YouTube footage (R):", "On January 5, 2020 – two days after Soleimani was killed in a US drone strike – thousands of mourners packed the streets in Ahvaz to pay respect to the top general, AFP reported here.", "The massive procession in Ahvaz on January 5, 2020, was also reported by Al Jazeera and Storyful.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]