["About this rating", "Vanishing hitchhiker stories as we now tell them date to the turn of the century, but their predecessors go back centuries before that. As time rolled on, the wagons and horses of older times transformed into the cars of today.", "According to folklorist Jan Brunvand, the legend of the vanishing hitchhiker evolved from earlier European stories, usually about travelers on horseback. In Hawaii, the hitchhiker became associated with the ancient volcano goddess Pele. A prototype of the story shows up in the New Testament (Acts 8:26-39), in which an Ethiopian driving a chariot picks up the Apostle Philip, who baptizes him and then disappears.", "The most common version of the legend involves a driver who stops for a strange girl on a highway, then during the course of the ride realizes his hitchhiker has disappeared. Upon arriving at the address the girl had mentioned, the driver learns from her relatives that she has been dead for years:", "A dozen miles outside of Baltimore, the main road from New York (Route Number One) is crossed by another important highway. It is a dangerous intersection, and there is talk of building and underpass for the east-west road. To date, however, the plans exist only on paper. Dr. Eckersall was driving home from a country-club dance late one Saturday night. He slowed up for the intersection, and was surprised to see a lovely young girl, dressed in the sheerest of evening gowns, beckoning him for a lift. He jammed on his brakes, and motioned her to climb into the back seat of his roadster. \"All cluttered up with golf clubs and bags up here in front,\" he explained. \"But what on earth is a youngster like you doing out here all alone at this time of night?\"", "\"It's too long a story to tell you now,\" said the girl. Her voice was sweet and somewhat shrill — like the tinkling of sleigh bells. \"Please, please take me home. I'll explain everything there. The address is ___ North Charles Street. I do hope it's not too far out of your way.\"", "The doctor grunted, and set the car in motion. He drove rapidly to the address she had given him, and as he pulled up before the shuttered house, he said, \"Here we are.\" Then he turned around. The back seat was empty!", "\"What the devil?\" the doctor muttered to himself. The girl couldn't possibly have fallen from the car. Nor could she simply have vanished. He rang insistently on the house bell, confused as he had never been in his life before. At long last the door opened. A gray-haired, very tired-looking man peered out at him.", "\"I can't tell you what an amazing thing has happened,\" began the doctor. \"A young girl gave me this address a while back. I drove her here and . . .\"", "\"Yes, yes, I know,\" said the man wearily. \"This has happened several other Saturday evenings in the past month. That young girl, sir, was my daughter. She was killed in an automobile accident at that intersection where you saw her almost two years ago . . . .\"", "Another popular version stars a hitchhiker who makes a prophesy before vanishing in front of the driver's eyes. Good crops, the end of a war, a natural catastrophe about to strike, or the imminent coming of Jesus have been predicted by these vanishing prophets. At the completion of some of these tales, the driver seeks out the police to report the incident and is told he's the fourth person this has happened to this week.", "Vanishing prophets who predict catastrophes are often said to look like Jesus. This form of the legend often surfaces in the wake of a natural disaster, with the encounter said to have happened maybe all of a week before things went to hell in a handbasket.", "The vanishing prophet set of stories contains a smaller subset in which the prediction of one future event is bolstered by the prediction of a second, equally unbelievable, event which subsequently comes true. The hitchhiker sometimes vanishes after making the predictions:", "In the wake of the anxiety rumors that swept the nation immediately after Pearl Harbor came a pipe-dream rumor which was undoubtedly the most popular of all: the weird tale of the man who picked up a strange woman in his car. Arriving at her destination, his passenger allegedly offered to pay the man for the gas he had used. But the man refused to accept the money, so the woman offered to tell his fortune. And, as the rumor went, mysteriously she told him, \"There will be a dead body in your car before you get home, and Hitler will be dead in six months.\" Supposedly, then, on the way home the man had seen a serious automobile wreck and had taken one of the victims into his car to rush him to the hospital. But the injured person died en route, which left the hopeful implication that Hitler would therefore be dead within the following six months.", "Although this pipe dream sounds foolish, it nevertheless spread throughout the country rapidly. It appeared in widely circulated gossip columns, and a lot of Americans took it seriously. Yet this same rumor, in the setting of the period, to be sure, had appeared in every military conflict since the Napoleonic Wars. And it has been said that the rumor probably goes back into the Middle Ages.", "The appeal of vanishing hitchhiker stories lies in the nature of the encounter — an interaction with a ghost occurs not because the main character went looking for the supernatural, but because it came to him. Such tales underscore the belief that representatives from the spirit world can be encountered at any time and by anyone. Adding to the horror factor is the specter's passing for a living person. That the driver does not recognize it as a ghost during their time together makes it all that more easy to believe we won't recognize a ghost when we meet one, either.", "Variations:", "Vanishing hitchhikers appear in numerous songs and in the 1951 Orson Welles' short film Return to Glennascaul, the 1985 movie Mr. Wrong, and the 1824 Washington Irving novel The Lady With The Velvet Collar. In 1998 K-Mart ran a vanishing hitchhiker commercial to advertise its Route 66 jeans.", "Also told in:", "Healey, Phil and Rick Glanvill.   Now! That's What I Call Urban Myths.\n    London: Virgin Books, 1996.   ISBN 0-86369-969-3   (p. 5).", "Holt, David and Bill Mooney.   Spiders in the Hairdo.\n    Little Rock: August House, 1999.   ISBN 0-87483-525-9   (pp. 67-69).", "The Big Book of Urban Legends.\n    New York: Paradox Press, 1994.   ISBN 1-56389-165-4   (pp. 12-13, 201).", "Brunvand, Jan Harold.   The Baby Train.\r\n    New York: W. W. Norton, 1993.   ISBN 0-393-31208-9   (p. 251).", "Brunvand, Jan Harold.   The Choking Doberman.\r\n    New York: W. W. Norton, 1984.   ISBN 0-393-30321-7   (pp. 210-212).", "Brunvand, Jan Harold.   The Mexican Pet.\r\n    New York: W. W. Norton, 1986.   ISBN 0-393-30542-2   (pp. 49-51).", "Brunvand, Jan Harold.   The Vanishing Hitchhiker.\r\n    New York: W. W. Norton, 1981.   ISBN 0-393-95169-3   (pp. 24-40).", "Cerf, Bennett.   Try and Stop Me.\r\n    New York: Simon and Schuster, 1945   (pp. 281-282).", "Dale, Rodney.   The Tumour in the Whale.\r\n    London: Duckworth, 1978.   ISBN 0-7156-1314-6   (pp. 102-103, 111).", "de Vos, Gail.   Tales, Rumors and Gossip.\r\n    Englewood: Libraries Unlimited, 1996.   ISBN 1-56308-190-3   (pp. 3, 63, 332-357).", "Dorson, Richard.   American Folklore.\r\n    Chicago: Univ. of Chicago Press, 1959   (pp. 249-250).", "Emrich, Duncan.   Folklore on the American Land.\r\n    Boston: Little, Brown, 1972   (pp. 336-338).", "Jacobson, David J.   The Affairs of Dame Rumor.\r\n    New York: Rinehart & Co., 1948   (pp. 378-379).", "Scott, Bill.   Pelicans & Chihuahuas and Other Urban Legends.\r\n    St. Lucia, Queensland: Univ. of Queensland Press, 1996.   ISBN 0-7022-2774-9   (pp. 71, 167).", "American Folklore and Legend.\r\n    Pleasantville, NY: Reader's Digest Assoc. Inc., 1978.   ISBN 0-89577-045-8   (p. 397).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]