["A video which shows a traffic signal being washed up in a heavy downpour is circulating on social media as Hyderabad reels under torrential rains.", "First time in History the signal crossing the road…😁 #HyderabadFloods #HyderabadRain #HyderabadHeavyRains pic.twitter.com/qcDFoThVyu", "— Jagat Darak (@jagat_darak) October 14, 2020", "The video is widespread on both Facebook and Twitter.", "👆First time in History. Signal crossing the road.😁", "👆First time in History. Signal crossing the road.😁", "Posted by Tamilnews Express on Wednesday, 14 October 2020", "Filmmaker Vivek Agnihotri shared the video during Mumbai rains last year and wrote – “Hello Traffic Police of Mumbai, How much fine if the signal crosses the road?” The video drew combined views of over 30,000 from his Facebook and Twitter accounts.", "Hello Traffic Police of Mumbai,", "How much fine if the signal crosses the road? pic.twitter.com/zDQ51YLEng", "— Vivek Ranjan Agnihotri (@vivekagnihotri) September 5, 2019", "The same video was circulated by individual users on both Facebook and Twitter. An individual user Dr Shaharyar shared it on Facebook in August. His post had over 1.2 lakh views and nearly 4,000 shares.", "It was also shared in 2018 with an identical claim.", "Have you seen, Traffic Signal itself, crossing the road… Mumbai Rains.. 😳😢😭", "Posted by Subramaniam Swaminathan on Sunday, 10 June 2018", "A keyword search on YouTube – “traffic signal water” – threw up multiple videos from 2018 which said that the incident occurred in China. Chinese news network CGTN had posted a longer version of the same video on May 11, 2018. The visuals depicted in the 8-second clip currently viral can be seen in the video below from 0:13 seconds onwards.", "According to CGTN, heavy rains in South China’s Yulin City swept down a temporary traffic signal on a flooded street.", "Chinese alphabets visible in the video further corroborate that it was not shot in India. The lights on the signal are working since it runs on solar energy. Solar panels are visible on top of the signal.", "In the midst of Hyderabad witnessing heavy rainfall, several users shared a video from China and attempted to bring it to the notice of the city’s traffic police.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]