["A claim that on January 1, 2021, a new law took effect in Pakistan requiring men to have two marriages has been viewed more than 5 million times on TikTok. The claim is likely satirical; similar claims have circulated in satirical posts in previous years and no such law was enacted in January 2021.", "The video was published here on TikTok on November 5, 2020.", "The superimposed Urdu text on the video translates to English as: “Lawyers of Pakistan, Marriage Bill passed. Two marriages declared mandatory, permission from the first wife is not necessary. Will take effect from 1st January, 2021. Notifications follow.”", "Some TikTok users appeared to believe the claim, posting comments in Urdu-language that translate as “Lies, they said this before too and then nothing” and “Keep your laws to yourself, whatever the Shariah says is better for us. Forget 2, do 4 but fulfill their rights if you have the guts.”", "The video was also posted here on Facebook alongside a similar claim.", "The video’s claim, however, is likely satire.", "Other TikTok users found the news humorous, with one commenter saying in an English literation of Urdu: \"shut your face\".", "Moreover, no such law has been enacted in January 2021, as seen on the National Assembly of Pakistan's official website.", "In Pakistan, it is legal for men to marry up to four wives. The Supreme Court, however, ruled in August 2020 that husbands must seek the approval of the first wife before marrying a second time.", "A similar claim was published on Facebook here in 2018. The post shows an image of a newspaper with an Urdu headline that reads: “Nikkah Bill every male ordered to have 2 marriages, denial will result in jail.”", "The last line of the news story is not entirely legible, however, it identifies this law coming into effect in the district of Malakand in Khyber Pakhtunkhwa (KPK) province due to \"a shortage of males\".", "The superimposed Urdu text at the top of the image translates as: “Hope I don’t cry from happiness”.", "The Urdu caption of the post reiterates the headline of the newspaper with an added line that reads: \"Now that's what I call change.\"", "However, no such law has been enacted anywhere in Pakistan as of January 12, 2021, according to the bills passed by the National Assembly of Pakistan.", "Furthermore, according to the website of Punjab government in Pakistan, the existing Muslim Family Laws Ordinance 1961 states: \"No man, during the subsistence of an existing marriage, shall, except with the previous permission in writing of the Arbitration Council, contract another marriage, nor shall any such marriage contracted without such permission be registered under this Ordinance.\"", "The UK broadcaster BBC also published a report in 2016 here that detailed similar hoax claims about mandatory two marriage laws in Iraq and multiple African countries on account of an alleged shortage in the male populations.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]