["About this rating", "The number of U.S. students killed in school shootings so far this year is greater than the number of U.S. military personnel who have been killed in combat operations.", "The number of active duty U.S. military personnel killed from all causes  so far this year (including training accidents) is greater than the number of people (including adults) killed in school shootings.", "On 18 May 2018, ten people were killed in a mass shooting by a 17-year-old student at Santa Fe High School in Texas. That same day, the Washington Post published an article whose headline proclaimed that so far, the year has been \"deadlier for schoolchildren than deployed service members.\"", "Readers' summaries of the article (and the article itself) varied somewhat in stating whether the central claim referred to all persons killed in school shootings or just students, and whether it referred to all deaths of active duty military personnel or just those occurring in combat zones. But either way, that central claim is largely true.", "If we count only students killed in school shootings up through and including the Santa Fe High School shooting of 18 May 2018, we tally the following figures:", "23 January 2018: 2 students killed at Marshall County High School in Benton, Kentucky.", "14 February 2018: 14 students (and 3 staff members) killed at Stoneman Douglas High School in Parkland, Florida.", "7 March 2018: 1 student killed at Huffman High School in Birmingham, Alabama.", "20 March 2018: 1 student killed at Great Mills High School in Great Mills, Maryland.", "18 May 2018: 8 students (and 2 teachers) killed at Santa Fe High School in Santa Fe, Texas.", "These incidents total 26 students killed in school shootings up through the cutoff date, with another five adults who were also fatally shot, but not included in this tally. (As of 22 May 2018, the Post article also referenced five school shootings that left 31 people dead, but stated that 27 rather than 26 students had been killed. We do not yet know the source of this discrepancy.)", "The number of military deaths occurring during that timeframe was the subject of some debate. Shortly after the article's initial publication, Jared Keller of Task & Purpose (a news site for veterans) noted that statistics the Post obtained from the Department of Defense about military deaths were incomplete:", "“The DoD doesn’t always present a clear picture of accidental mishap-related deaths due to worries about operational security, hence the trouble with [Public Affairs Office] releases,” Keller wrote in an email. “Back in March 2017, Secretary of Defense Jim Mattis even cautioned public affairs officials across the military to ‘be cautious about publicly telegraphing readiness shortfalls’ because ‘communicating that we are broken or not ready to fight invites miscalculation,’ as his spokesman put it at the time.”", "As revised version of the article said that as of May 2018, \"there have been 13 service member fatalities in seven incidents. Seven of those casualties occurred in a helicopter crash in Iraq in March. Three of the total number of military casualties were not related to combat.\"", "These numbers appear to be derived from deaths related to Operation Inherent Resolve (Iraq and Syria) and Operation Freedom’s Sentinel (Afghanistan).", "Five separate incidents in 2018 related to Operation Inherent Resolve resulted in military deaths on the following dates:", "8 January 2018", "19 February 2018", "7 March 2018", "15 March 2018", "and", "30 March 2018.", "Four of these incidents resulted in a single death each, while the fifth (on 15 March 2018) was a crash of an HH-60 Pave Hawk helicopter in western Iraq that left 7 U.S. service members dead.", "Two incidents related to Operation Freedom's Sentinel resulted in military deaths on the following dates:", "1 January 2018", "and", "30 April 2018.", "Each of those incidents resulted in a single death, bringing the overall year-to-date total of U.S. military personnel killed in combat zones to 13. (The first three incidents involving Operation Inherent Resolve linked above each said that the attendant death was \"non-combat related\").", "The revised Post article also referenced an additional 29 year-to-date military deaths tallied by Task & Purpose, all of which occurred in training accidents (including 9 persons killed in a WC-120 crash in Savannah, Georgia), bringing the military death total to 42.", "So as of 18 May 2018, the military vs. school shooting totals stood at:", "All active duty military deaths: 42\nAll combat zone military deaths: 13\nAll school shooting deaths: 31\nAll school shooting student deaths: 26", "In general, the overall number of people (31) and the number of students (26) killed in school shootings through 18 May 2018 was greater than the number of military personnel killed in combat zones (13). If all military deaths (including accidental training deaths) are counted, then that number (42) exceeds the total number of school shooting deaths (31).", "How meaningful these numbers really are is something of a subjective issue. The number of school shooting deaths was skewed upwards because two relatively large mass shootings (Parkland and Santa Fe) took place in roughly the first third of the year, killing 22 students between them. On the other hand, the number of military deaths (both combat and non-combat) was skewed upwards by a few aircraft crashes that each left several service members dead.", "One way of putting these figures in context might be to note that the number of students currently attending high school in the U.S. is a little over 15 million, while U.S. active duty military personnel number just under 1.3 million (with around 18,000 to 20,000 of those personnel deployed to combat zones). As the Post noted of those numbers:", "The figures for 2018 do not suggest schools are more dangerous than combat zones. After all, there are more than 50 million students in public elementary and high schools and only about 1.3 million members of the armed forces. So far in 2018, a member of the military has been about 40 times as likely to be killed as someone is to die in a school shooting....", "Still, some critics might suggest that such a comparison is not an apt one, because members of the military perform a necessary service for which they volunteer to put themselves in harm's way, while the mere act of attending school should not pose any significant danger to children.", "Bump, Philip.   \"2018 Has Been Deadlier For Schoolchildren Than Service Members.\"\r\n    The Washington Post.   18 May 2018.", "Dillon, Nancy and Esha Ray.   \"With Yesterday's Texas Massacre, There Have Now Been More Students or Teachers Killed by Guns in U.S. Schools Than Active-Duty Military Deaths in 2018.\"\r\n    [New York] Daily News.   19 May 2018.", "Franklin, Dallas.   \"These Are The Victims Of Texas’ Santa Fe High School Shooting.\"\r\n    KFOR.com.   21 May 2018.", "Myre, Greg.   \"Under Trump, U.S. Troops In War Zones Are On The Rise.\"\r\n    NPR.   1 December 2017.", "Schuppe, Jon.   \"Birmingham School Shooting: Teen Charged After Girl, 17, Is Killed.\"\r\n    NBC News.   8 March 2018.", "Simms, Barry.   \"Funeral Held For Student Killed In Great Mills High School Shooting.\"\r\n    WBAL.   30 March 2018.", "Starr, Barbara and Ryan Browne.   \"7 Us Service Members Killed In Iraq Helicopter Crash.\"\r\n    CNN.   17 March 2018.", "Yan, Holly, AnneClaire Stapleton and Paul P. Murphy.   \"Kentucky School Shooting: 2 Students Killed, 18 Injured.\"\r\n    CNN.   24 January 2018.", "National Center for Education Statistics.   \"What Are The New Back To School Statistics For 2017?\"\r\n    Accessed 22 May 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    9 January 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    20 February 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    9 March 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    31 March 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    3 January 2018.", "U.S. Department of Defense.   \"DoD Identifies Army Casualty.\"\r\n    1 May 2018.", "U.S. Department of Defense.   \"DoD Identifies Air Force Casualties.\"\r\n    17 March 2018.", "Wikipedia.   \"Stoneman Douglas High School Shooting.\"\r\n    Accessed 22 May 2018.", "Wikipedia.   \"United States Armed Forces.\"\r\n    Accessed 22 May 2018.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]