["About this rating", "In September 2011, the China National Space Administration launched the Tiangong-1,  a 19,000 pound mini-space station used as a technology testbed for a future, full-scale Chinese Space Station. Over the course of three missions, one uncrewed and two crewed spacecraft docked with Tiangong-1. As part of its final mission in June 2013, astronauts conducted  experiments for Chinese school children to watch live on television.", "In March 2016, citing the fact that its use had been extended 2.5 years longer than planned, the Chinese government announced that they had lost the ability to communicate with the Tiangong-1. While Chinese officials were reticent about what that disclosure meant in terms of their ability to control its eventual re-entry, both professional researchers and amateur satellite trackers later concluded that China has no ability to control the station, suggesting there would be no precise way to predict when or where it will meet its ultimate demise.", "As the craft is in a low-Earth orbit, it experiences minuscule drag from atmospheric gas molecules, gradually slowing its speed and lowering its altitude (where, in turn, it experiences even more drag). When operational, this process is controlled by small orbital corrections provided by jet propulsion. Without the ability to send those commands to the station, it would not be possible to control its re-entry precisely.", "Aerospace Corporation, a federally funded research and development center that supports space defense and reconnaissance operations for the United States government performed their own analysis of its orbit, estimating that Tiangong-1 will reenter the atmosphere in “mid March 2018” plus or minus two weeks. Owing to it its large size, Aerospace Corp. argued, there was a significant chance that some pieces of the station could survive and crash onto Earth's surface:", "There is a chance that a small amount of Tiangong-1 debris may survive reentry and impact the ground. Should this happen, any surviving debris would fall within a region that is a few hundred kilometers in size and centered along a point on the Earth that the station passes over.", "While the potential area that the debris would hit is large (anywhere between of 42.7° north and south latitudes), the probability of being struck (or having your property struck) is astronomically low. According to Aerospace Corp, even in the most heavily populated region of the station’s potential impact area present odds lower than those required to win a Powerball jackpot:", "The probability that a specific person (i.e., you) will be struck by Tiangong-1 debris is about one million times smaller than the odds of winning the Powerball jackpot. In the history of spaceflight, no known person has ever been harmed by reentering space debris. Only one person has ever been recorded as being hit by a piece of space debris and, fortunately, she was not injured.", "The 19,000 pound Tiangong-1 will not be the most massive object to break apart in Earth’s upper atmosphere. Russia’s 265,000 pound Mir space station crashed in the Pacific Ocean in 2001 after a planned re-entry and destruction maneuver. NASA’s first space station, the 165,000 pound SkyLab, crashed into rural Australia in 1979 in a largely uncontrolled orbit.", "Throughout the history of spaceflight, Aerospace Corp. estimates that 11.9 million pounds of debris are “thought to have survived reentry, with no reported casualties.”", "Xinhua News Agency.   \"天宫一号正式终止数据服务 全面完成各项在轨试验任务.\"\r\n    21 March 2017.", "Domonoske, Camila.   \"China's 'Heavenly Palace' Space Lab Will Crash Back To Earth.\"\r\n    NPR News.   21 September 2016.", "Philips, Tom, and Malkin, Bonnie.   \"China's Tiangong-1 Space Station 'out of Control' and Will Crash to Earth.”\r\n    The Guardian.   20 September 2016.", "Aerospace Corporation.   \"Tiangong-1 Reentry.\"\r\n    Accessed 8 January 2018.", "Grush, Loren.   \"A Chinese Space Station Is Falling to Earth Next Year — But It’s the Last Thing to Worry About.\"\r\n    The Verge.   31 December 2017.", "NASA APPEL.   \"This Month in NASA History: Skylab Down.\"\r\n    11 July 2013.", "Aerospace Corporation.   \"Spacecraft Reentry Basics.\"\r\n    Accessed 8 January 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]