["About this rating", "Following the Jan. 6, 2021, riots at the U.S. Capitol, a 7-foot-tall, a temporary security fence was erected around the building for 30 days. U.S. Capitol Police Acting Chief Yogananda Pittman announced that improvements to the Capitol security, including \"permanent fencing,\" were necessary.", "As of Jan. 29, no official moves had been made to maintain the temporary barrier indefinitely.", "At the time of writing, it is not known whether the temporary fence will stand for longer than its intended month-long installment or if it or a new fence will be made a permanent fixture.", "A day after the Jan. 6, 2021, insurrection at the U.S. Capitol, law enforcement officials erected a 7-foot “non-scalable fence” around the legislative building with an expectation of keeping the barrier up for at least 30 days — a timeframe that included the Jan. 20 inauguration of U.S. President Joe Biden.", "But in late January, it appeared that such a blockade may become a permanent fixture in the nation’s capital. An Instagram post shared by investigative reporter Scott MacFarlane on Jan. 28, 2021, claimed \"permanent security fencing\" was coming to the Capitol.", "Snopes contacted U.S. Capitol Police (USCP) to confirm whether the agency intended to maintain a permanent fence. We were referred to a Jan. 28 statement issued by Acting Chief Yogananda Pittman that described a series of safety reviews and assessments meant to identify potential security threats.", "“As I noted earlier this week, even before September 11, 2001, security experts argued that more needed to be done to protect the U.S. Capitol. In fact, a 2006 security assessment specifically recommended the installation of a permanent perimeter fence around the Capitol,” said Pittman.", "“In light of recent events, I can unequivocally say that vast improvements to the physical security infrastructure must be made to include permanent fencing, and the availability of ready, back-up forces in close proximity to the Capitol.”", "However, the decision may not be absolute. Pittman continued that the USCP will continue to work with Congress to determine what security improvements will be made, and further details about the height or type of fencing were not released at the time of this writing. It is not immediately clear who will make the final decision about whether a permanent fence will be built, and Snopes contacted USCP for further clarification.", "Not all officials were on board. In a Twitter thread shared on Jan. 28, D.C. Mayor Muriel Bowser expressed support for beefed-up safety measures but opposed permanent fencing:", "“When the time is right, the fencing around the White House and U.S. Capitol, just like the plywood we’ve seen on our business for too long, will be taken down,” she Tweeted, adding that her office looks forward to working with Congress to ensure public access to the Capitol.", "At the time of this writing, it is not clear whether the fence will be taken down after its 30-day installment or if the barrier will become more permanent. We will update this article accordingly.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]