["About this rating", "In a 2019 interview, Harris stated that sex work should be decriminalized but with caveats. This represented a dramatic shift for her, as she had previously supported efforts against decriminalizing sex work.", "However, decriminalization is not the same as legalization. Decriminalization involves removing criminal sanctions on an act or behavior, while legalization is the process of removing legal prohibitions against it.", "Analysts interpret Harris’ shifting stance as an indicator that she may currently support some form of decriminalization, but the exact policies remain to be seen.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "When Democratic U.S. Sen. Kamala Harris was elected to the position of vice president of the United States on Nov. 7, 2020, her past stances and policies received additional scrutiny, particularly from conservative media outlets. An excerpt from one particular interview with The Root in February 2019 was picked apart by a conservative Christian YouTube channel, For Such A Time As This, and shared during the election season to support claims that Harris supported the legalization of prostitution.", "Snopes readers shared with us the following video from March 2019, which shows the host, James Pittman, criticizing Harris for her comments in her interview with The Root. Many readers asked whether it was true that Harris was in favor of legalizing prostitution. We learned that the answer is complicated.", "https://www.youtube.com/watch?v=XOnD9U5UOBE&amp;feature=share&amp;fbclid=IwAR32UzVEsKNUTktRSODi9Lq_DbvbQy4TCr5q7mDV9Srn_ckP037nlap4fgU", "However, Pittman’s analysis misrepresents Harris’ stance on sex work. Pittman claims that by “legalizing” prostitution Harris is imagining an “industry of prostitutes” where people would “not get harmed,” when the act of prostitution itself, he says, is inherently “harming women.”", "But what did Harris actually say in her interview? Below is a partial transcript of the conversation with reporter Terrell Jermaine Starr:", "Starr: Do you think that sex work ought to be decriminalized?", "Harris: I think so, I do. I think that we have to understand though that it is not as simple as that, it is also about and there is an ecosystem around that that includes crimes that harm people and for those issues I do not believe that anybody who hurts another human being or profits off of their exploitation should be admonished or should be free of criminal prosecution. But when you're talking about consenting adults I think that [...] yes we should really consider that we can't criminalize consensual behavior as long as no one is being harmed. But at the point that anyone's being harmed or exploited then I think we have to understand that's a different matter.", "Harris was talking about the decriminalization of sex work and not its legalization. Decriminalization means that carrying out an act or behavior will no longer land that person with a jail sentence or criminal record. Legalization, on the other hand, is the process of removing all legal prohibitions to that act or behavior.", "In the same interview, she addressed her work as the San Francisco district attorney: “I was advocating then that we have to stop arresting these prostitutes, and instead go after the johns and the pimps […] we were criminalizing the women, but not the men who associated with it, who were making money off of it or profiting off of it.”", "She appeared to be propagating what analysts describe as the Nordic model of partially decriminalizing sex work, which criminalizes the buyers of sex and not those who sell it. The intention of such a policy is to cut demand for prostitution by targeting buyers of what many say is an inherently violent and cruel trade. But the results of adopting this model have been mixed around the world, and critics argue that it does not take into account the rights of workers who go into this trade by choice.", "Harris' 2019 comments were a drastic shift from her past actions. Back in 2008 when she was district attorney, she was a vocal opponent of Proposition K, a ballot measure intended to decriminalize prostitution in San Francisco. She called the effort “completely ridiculous” and said, “It would put a welcome mat out for pimps and prostitutes to come on into San Francisco.” Back then she argued that it would expose prostitutes to drugs, guns, and sexual crimes. But supporters of the measure, including sex workers, argued that Prop K would allow them to organize, negotiate for better wages and working conditions, as well as make their occupation safer and more legitimate.", "As California’s attorney general, Harris was also instrumental in curbing websites that hosted classified ads for sexual services like Backpage.com, in an effort to tackle child trafficking. By 2017, the website’s adult section was removed but a New York Times report found that this had done little to address the problem of trafficking on the site. In her 2019 interview with The Root, right before her comments on decriminalizing sex work, she doubled down on her actions against the site:", "Backpage was providing advertisement for the sale of children, of minors. And, unlike Craigslist, which said we’re going to stop doing it, the people who were running Backpage basically thumbed their nose at us and kept doing it, making money off of the sale of youth, and so I called for them to be shut down. And I have no regrets about that. Now, on the issue of providing a safe place for sex workers — I am a huge advocate for that, always have been.", "In 2017 and 2018, as a senator, she supported anti-sex trafficking legislation meant to protect victims of sex trafficking online which also targeted Backpage.com. But anti-trafficking advocates and sex workers said the legislation would exacerbate the problem because it did not distinguish between those who were trafficking victims and those who were legitimate sex workers. Advocates said this would hurt their efforts to help people within the sex trade who were being trafficked. Sex workers argued that this would also harm their source of income and force them to rely on less safe forums to advertise and conduct their services. Indeed, according to The Appeal, the crackdown did make sex workers more vulnerable and marginalized.", "Like many politicians, Harris’ views have changed over time, but many remain mistrustful of this about-face given her track record. Considering that she appears to be advocating for partial decriminalization, the details of how she would go about this are yet to be determined, and her original comments were misrepresented, we rate this claim a “Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]