["A claim widely circulated on social media about the recent bomb blast in Sasaram, Bihar, asserts that the explosion took place inside a mosque where a hundred other bombs were also recovered. From the Facebook account of one Manish Kumar, the post drew close to 4,000 shares.", "Several users have made the same claim with the message, “आज सासाराम में मोची टोला मोहल्ला मस्जिद में बम बनाते ब्लास्ट हुआ 100 की संख्या में बम बारूद गिरफ्तार हुआ इस तरह का लगभग मस्जिद में काम काम चल रहा है सासाराम रोहतास बिहार।”", "On Twitter, a user ‘Akash RSS’, followed by the office of railway minister Piyush Goyal also circulated identical narrative. ‘Akash RSS’ is Akash Soni (@Satynistha) who was earlier featured in an Alt News expose of a fake news website Coverage Times. Soni was also found to be one of the admins of a WhatsApp group harassing NDTV anchor Ravish Kumar in 2017.", "A similar claim suggests that the explosion occurred when bombs were being made inside the mosque “in preparation for the Ram Mandir verdict.” The complete message reads, “सासाराम में मोची टोला मोहल्ला मस्जिद में बम बनाते ब्लास्ट हुआ राम मंदिर की फैसला आने के संबंध में तैयार किया जा रहा हजारों की संख्या में बम बारूद गिरफ्तार हुआ इस तरह का लगभग देश के हर मस्जिद में काम काम चल रहा है सासाराम रोहतास बिहार.” This claim was also shared by a user Janardan Mishra (@JBMIS) followed by Goyal’s office.", "Alt News contacted SDO Sasaram, Raj Kumar Gupta, who informed that the claims floating on social media are “just rumours.” The officer said that the blast did not occur inside the mosque but on a campus outside the place of worship. “There was a single blast where a labourer was wounded. We did not recover any other explosives,” he said while adding that the police are still investigating the matter.", "The incident was widely reported in Hindi media. A report by Hindustan said that the mosque was under repair the past one month. The labourers working in the area had collected waste on a compound outside the mosque. As soon as they set the waste on fire, a blast knocked down three labourers and also the boundary wall of the mosque.", "According to Dainik Jagran, one of the labourers was severely injured. Another report published by the media outlet states that Manish Kumar, whose post was featured earlier in this article, was arrested by the police for “spreading rumours to disrupt social order.”", "An incident of a bomb blast near a mosque in Bihar’s Sasaram was communalised on social media. The claim that the explosion occurred inside the place of worship where a hundred other explosives were found was rubbished by the police. Furthermore, the incident is still under investigation. The police are yet to find the perpetrators and the motive behind the incident.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]