["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A racially charged fake news story about a black man killing white women and putting their corpses on ice has been spread around the Internet for the past year.", "It’s bogus.", "\"Police find 19 white female bodies in freezers with ‘Black Lives Matter’ carved into skin,\" read the headline on a July 20, 2016, post on ViralDevil.com. Facebook users flagged the story as potentially being false, as part of the social media website’s efforts to curtail fake news in users’ news feeds.", "The story said 39-year-old Rasheed Thompson was arrested in Chicago after neighbors reported suspicious activity. Police supposedly found the bodies while searching Thompson’s home.", "The post is made up, and it has changed a bit since first appearing early in 2016.", "The earliest version we found was posted on the fake news site Now8News.com, going back to at least Feb. 18, 2016. It was set in Los Angeles, and involved a man identified only as \"Mathis,\" who hid 12 white women’s bodies in a freezer marked \"Black Lives Matter.\"", "That was followed up the same month by EmpireHerald.com, which wrote the version about Chicago’s Thompson killing 19 women. The original link is gone, but the Internet Archive Wayback Machine has a record of the story.", "EmpireHerald.com, a site filled with fake stories, carries no disclaimers about how its content is fabricated. It first started promoting the story the same day as the News8Now.com post.", "Chicago Man Arrested After Police Find 19 White Female Bodies In Freezers With “Black Lives Matter” Carved Into Skin https://t.co/ITQnWvZZZ9", "This version of the story ended up on several other websites throughout the year. None of the websites identified the story as fake.", "Some of the photographs often used to illustrate the story are of freezers really used to hide bodies, but aren’t of the fictional Thompson or his victims.", "One image showed a chest freezer used by a Japanese man who strangled his wife and hid the body for a decade. Another showed police removing a freezer in which a California man’s body had been hidden after he was killed.", "But this story and its details are fake. We rate it Pants On Fire!", "ViralDevil.com, \"Police Find 19 White Female Bodies In Freezers With \"Black Lives Matter\" Carved Into Skin,\" July 20, 2016", "Daily Mail, \"Company boss strangled his wife to death and kept her fully clothed body in freezer in fish processing plant for TEN YEARS,\" May 30, 2012", "Los Angeles Times, \"Body found in Sun Valley refrigerator ID'd as 30-year-old Van Nuys man,\" Sept. 14, 2015", "Now8News.com, \"Los Angeles Police: 12 White Female Bodies in Garage Freezer Tagged, ‘Black Lives Matter’,\" Feb. 18, 2016", "EmpireHerald.com, \"Man Arrested After Police Find 19 White Female Bodies In Freezers With ‘Black Lives Matter’ Carved Into Skin,\" accessed April 3, 2017, via the Internet Archive Wayback Machine", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]