["About this rating", "Satirists and purveyors of fake news went into overdrive in May 2018 after ABC announced that it was cancelling the hit show Roseanne. The decision came directly after a series of tweets posted by titular star Roseanne Barr containing racist language and a veritable melange of conspiracy theories.", "The Facebook page for satire site The Last Line of Defense added its misinformation into the mix with a claim that ABC's Senior Vice President of Programming Mutafa Ka'Plese was a member of former United States President Barack Obama's \"Choom Gang,\" and that he was the one who ultimately made the decision to cancel the show:", "There are several ways to tell that this meme was created in jest rather than as a genuine attempt to relay factual information. For instance, Mutafa Ka'Plese is a gag name (sound it out syllable by syllable) in the vein of Seymour Butts or Philip McCreviss. The photograph also doesn't show any of the higher-ups working at ABC. This is actually an image of singer Julio Iglesias at an event in Mexico City.", "We couldn't find anyone at ABC with the exact title of \"Senior Vice President of Programming.\" The Executive Vice President of Programming Strategy is Andy Kubitz, and the Senior Vice President of Current Programming is Stephanie Leifer. Regardless, neither of these people made the decision to cancel Roseanne. That honor belongs to ABC Entertainment Group's executive president Channing Dungey, who released a statement that made the reason for the show's cancellation extremely clear:", "Roseanne’s Twitter statement is abhorrent, repugnant and inconsistent with our values, and we have decided to cancel her show.", "Dungey's decision was supported by Disney's chief executive officer Bob Iger.", "Littleton, Cynthia.       \"ABC Entertainment Chief Channing Dungey in Spotlight After ‘Roseanne’ Cancellation.\"\r\n     Variety.       29 May 2018.", "De Moraes, Lisa.       \"Donald Trump Twitter Attacks Bob Iger Again In Wake Of ‘Roseanne’ Cancellation.\"\r\n      Deadline.       31 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]