["About this rating", "On 20 October 2015, the web site The Federalist Papers shared a meme in a post titled \"BRUTAL Meme Reveals Truth About European Socialist Countries\" which included a photograph of a woman and various criticisms about Denmark's general way of life:", "https://www.snopes.com/uploads/2015/10/brutalmeme-568x1024.jpg\n\nThat meme was something of a rebuttal to an earlier, similar graphic that had lauded Denmark's social infrastructure:", "https://www.snopes.com/uploads/2015/10/i-am-a-school-teacher-in-denmark.jpg\n\n(The woman pictured in both these memes is Danish actress Mille Dinesen, her photograph taken from promotional material for the TV show Rita.)", "The text of the \"rebuttal\" meme began by stating:", "I am a school teacher in Denmark making about $61,000/year. We get free education. You don't have to pay for the doctor or the hospital, and students even get paid to learn. It all sounds so great ... right? However, I forgot to mention that nothing is ever free ... The minimum income tax in Denmark is 40%.", "A reliable estimate of the average salary for teachers in Denmark is somewhat tricky to calculate due to variables such as tenure and location. However, a 2014 estimate provided an income figure of just under $42,000 per year for Danish teachers (not $61,000). And it's slightly simplistic to say all healthcare is free in Denmark, as the cost of medical care varies depending upon residency status and coverage level.", "The rebuttal also states that the minimum income tax is 40% in Denmark (where tax revenue indeed comprised 48.6% of the country's GDP in 2013). Taxpayers in Denmark are subject to a progressive tax structure under which total taxes are between 41 to 56 percent of income [PDF]:", "Most personal income is subject to AM tax of 8%. This tax is deducted from the income before the other taxes are calculated. The income tax rates are progressive and comprise state, municipality and church taxes. The lowest tax rate is approx. 36% up to a marginal income tax rate of 51.95% exclusive of church tax. Including AM tax, the rates are 41% and 56%.", "Another portion of the meme indicated that Denmark's citizens were \"deeply dependent\" on welfare to survive, but the country's unemployment rate of 6.3% was not much higher than the United States' 5.3% in the same period.", "The meme continued:", "Also, [we] pay a sales tax of 25%, and on top of that the Government applies duties and fees. A gallon of gasoline is about $10. Tax on a car is 180%, meaning that a car that sells for about $25,000 in the United States (Honda Accord) to an astounding $45,000 in Denmark.", "Value-added tax (VAT) in Denmark is indeed 25%<, though additional \"duties and fees\" weren't specifically described by the meme. Gasoline is typically sold by the liter (not gallon) in Europe overall, and recent estimates provided a cost of $1.69 per liter in Denmark (or just under $6.40 a gallon, not $10). It's true that new cars in Denmark are taxed at 180%, in large part because Denmark (like some other countries) imposes higher costs of operation for private automobiles to encourage residents to use public transport and more energy-efficient and lower-polluting forms of transportation.", "Denmark is the highest-taxed Nation in the World — taxed an average 80% on every dollar earned. Danes have the highest personal debt in the World. Few will ever own a car or a house. Anyone who makes over $80,000 annually pays a personal tax of 68%. This means that people with higher earnings have either found ways to evade the tax or have left the Country, taking their companies with them.", "Definitively selecting a single country to claim the title of \"highest-taxed\" is a slippery endeavor, as the structure of taxation varies significantly from one country to the next. Reports on taxes across the globe (including a popular annual data set released by firm PwC) almost never declare any one country the most-taxed (in a vacuum). Myriad confounding factors (such as relative cost of living, and whether social programs cover basic needs like healthcare) render a binary comparison of that description virtually meaningless. However, a list titled \"These are the 19 countries with the highest tax rates in the world\" (based on the World Economic Forum's latest Global Competitiveness Report), published on October 8, 2015 did not include Denmark among the countries listed.", "By the metric of income tax rates, Organization for Economic Co-operation and Development (OECD) data for 2015 placed Denmark third-highest (behind Belgium and Germany). Similar, earlier data ranked Denmark behind France, Italy, and Croatia. As such, Denmark doesn't even have the highest tax rate in Europe (much less the world).", "We were unable to corroborate the claim that \"80% on every dollar earned\" in Denmark goes toward taxes; and determining which nations could be accurately described as having the highest amount of personal debt in the world again hinges largely on variable factors such as GDP, average income, and number of citizens. (Without specifics, those numbers could easily be distorted by fluctuations in population, for instance.)", "OECD data for 2014 indicated Denmark had the highest percentage of household debt based on percentage of disposable income:", "https://data.oecd.org/chart/5eIo", "That same table placed Denmark mid-to-high for comparative household net worth:", "https://data.oecd.org/chart/5eIp", "In 2013 Denmark's home ownership rate was roughly 63% (versus a comparable 65% in the U.S.), making the statement that \"most residents would never own a home\" not very accurate. Similarly, recent OECD data indicated that there are 70 cars for every 100 Danes (indicating car ownership may be expensive, but it isn't rare). A 2007 New York Times article reported that some young Danes opt to move abroad (creating a skills drain), but that piece focused on individuals and not companies with business roots in the country.", "The meme concludes:", "Denmark's suicide rate for the past five decades has averaged 20.8 per 100,000 people, with a highest rate of 32. The American suicide rate has averaged 11.1 during the last five decades and has never exceeded 12.7. More than 11% of adult Danes -- supposedly the happiest people in the World -- are on antidepressants. Everyone wants the American dream. In Denmark's neo-communism economy, no one will ever own or accomplish anything.", "According to the World Health Organization (WHO)'s most recent statistics, Denmark's suicide rate was 8.8 people per 100,000 (versus 12.1 per 100,000 in the United States) in 2012. WHO data from roughly a decade ago reported a suicide rate of 11.9 per 100,000 people in Denmark (versus 11.0 in the United States). While the U.S. and Denmark maintained similar rates of suicide per capita in years past, Denmark's suicide rate was markedly lower than that of the States by 2012 (and didn't appear to ever have been three times as high).", "Determining which percentage of the Danish population takes antidepressants is currently complicated by the fact that such data aren't readily available as standard metrics on health care reports. A 2013 Guardian article cited< a survey conducted by Eurobarometer indicating that 93 percent of Danes reported never having taken antidepressants in their lives. Presumably, the remaining seven percent weren't all currently taking antidepressants, indicating the meme's claim was likely unsupported.", "OECD data from 2012 indicated that 85 doses of antidepressant medications were dispensed per thousand people per day (DDD) in Denmark. Directly comparable data from the United States with respect to DDD wasn't available (as that metric appears unique to Europe). Estimates suggest that between eight and eleven percent of Americans are on antidepressants [PDF], and the 2013 study \"Depression and Antidepressants: A Nordic Perspective\" suggested fewer Danes than Americans took antidepressants at any given time (while maintaining that Nordic countries exhibited a higher rate of antidepressant use than Europe overall):", "The overall sales of antidepressant drugs in the Nordic countries in 2009 (74.1 DDD/1000 inhabitants per day) is [considerably] higher than the OECD average (52.5), but also higher than for example in the UK (60.9) (20). However, there are great variations between the countries, where Iceland by far has the highest level of antidepressant sales, almost double that in Norway. In total, approximately 2 million Nordic inhabitants were prescribed an antidepressant, almost a share of 8.5% at a total cost of €236 million according to latest available statistics (ranging from 2010 to 2012). Danish medical statistics shows that there were sales of antidepressants in 2011 of €68 million and over 460 000 Danes were prescribed an antidepressant (8.3% of the population) (21).", "With respect to the claims made in the initial meme, it's (again) not entirely true that Danish schoolteachers earn $61,000 per year across the board. It's true that Danes are paid a stipend to go to university, and that college education is free for Danish students (and EU residents studying in that country). As indicated above, healthcare is often administered at no charge to Danes, depending on the service and their coverage status. And to reiterate, portions above addressed the prevalence of home ownership in Denmark, which is roughly equivalent to that of the U.S; personal ownership of vehicles is less common, but by no means rare.", "As for vacation time, workers in Denmark are entitled to five paid weeks of it (as well as additional compensated time off totaling about nine days, from which the \"six weeks\" figure was most likely derived). Denmark's parental leave policies are among the most generous in the world, but 52 weeks (or one year) is on the upper end of leave with partial or total pay:", "The Danish parental leave system is among the most generous and flexible in the EU. Mothers are entitled to 4 weeks of maternity leave before the expected date of birth and 14 weeks of maternity leave after the birth. Fathers are entitled to 2 weeks of paternity leave within the first 14 weeks after the birth. Furthermore, each parent is entitled to 32 weeks of parental leave.", "Parents can receive maternity leave benefits from the State for a maximum of 52 weeks per child if they meet the employment criteria set out in the Maternity Leave Act.", "It's true that pension kicks in for Danes at age 65. The original meme claimed that the average American spent $8,500 per year in deductibles, while the Centers for Disease control placed average total spending per patient per year at $9,255 in 2013. We were unable to find a figure that specifically referenced \"deductibles\" as a health care expenditure-related metric, but the number cited closely matched World Bank figures for per capita health expenditures.", "Cited college costs for students in the United States in the first meme weren't exaggerated either: data from 2014 place the yearly cost of tuition at a low of $18,943 (for in-state public schools) and a high of $42,419 (for out-of-state private schools). If it's surmised that three out of four students attend a local college at the cheaper tuition and one heads off to a private university, the average tuition between those four students would be $24,812.", "Finally, Denmark's novel \"flexicurity\" policy deviates from other European nations' worker protection policies (which are unlike American \"at will employment\" standards). While Danes can be more easily fired than those in other European countries, the country offers robust unemployment insurance compensation to level out labor market fluctuations.", "In short, it's true Denmark's taxes are far higher than those in the United States; but that's offset by significantly reduced costs to citizens for expenditures such as healthcare, education, and child care. A gallon of gas doesn't cost Danes anywhere near $10, but tax on new cars is 180%. We were unable to find any ranking of Denmark as the \"highest-taxed\" nation in the world (or even just Europe), and home ownership rates are near what they are in the U.S. (There are far more privately-owned vehicles in the United States than Denmark, however.) Denmark's suicide rate is lower than that of the U.S., and antidepressant usage is higher among Americans. Finally, while some young Danes moved abroad due to high taxes on income, we were unable to find any evidence that was the case for companies.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]