["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presidential senior adviser Jared Kushner (blue shirt); his wife and President Donald Trump's daughter, Ivanka Trump (next to Kushner); and Donald Trump (far right) visited a school in Orlando, Fla., on March 3, 2017. (AFP)", "U.S. Rep. Mark Pocan says questions about possible ties between President Donald Trump and Russia must be answered before Congress can take up issues such as the Affordable Care Act and tax reform.", "Making his points in a March 3, 2017, Wisconsin Public Television interview, the Madison-area Democrat also made a Russia-related claim about Jared Kushner, Trump’s son-in-law and a senior adviser in his administration, that we want to check.", "The claim came during this exchange between Pocan and Frederica Freyberg, host of the talk show \"Here and Now:\"", "Pocan: When a country like Russia comes in and interferes with our elections, that should bother everybody. And I give people like John McCain and others credit, because they’re saying that. But the fact that Donald Trump acts like nothing happened, makes me even more suspicious of how much he knows and when he knew about it.", "Freyberg: What about other people across the aisle, your peers, are they taking this as seriously as you are?", "Pocan: More and more are, as more of this information comes out. So, I think at first, they also were told, Oh, there’s nothing here to look at, nothing here to look at. But now you find out the son-in-law of the president met with Russian officials at the Trump Tower after having them come in the back door.", "Did Kushner meet with Russian officials at Trump Tower who came in the back door?", "The evidence", "Pocan’s office pointed us to a New York Times news article published the day before Pocan’s interview. It reported that the White House said Kushner had taken part in a meeting with one Russian official.", "According to the Times:", "In December 2016, Michael Flynn, who at the time was Trump’s incoming national security adviser, and Kushner met at Trump Tower with the Russian ambassador, Sergey Kislyak. The purpose was to establish a line of communication between the new administration and the Russian government. Flynn appears to have been \"the main interlocutor with the Russian envoy — the two were in contact during the campaign and the transition, Kislyak and current and former American officials have said.\"", "\"They generally discussed the relationship and it made sense to establish a line of communication,\" said White House spokeswoman Hope Hicks. \"Jared has had meetings with many other foreign countries and representatives — as many as two dozen other foreign countries’ leaders and representatives.\"", "\"It is common and not improper for transition officials to meet with foreign officials,\" the Times article said. \"But all meetings between Trump associates and Russians are now significant as the FBI investigates Russian interference in the American election and whether anyone close to Trump’s campaign was involved.\"", "Kushner’s attendance at the meeting was first reported by the New Yorker magazine. The White House also confirmed the meeting to other news media.", "Pocan’s office also cited a news article in The Telegraph, a British newspaper, that said the Russian diplomat \"reportedly\" entered Trump Tower for the meeting by a back entrance.", "We found a few claims and assumptions that the ambassador entered the building by a rear entrance, but no definitive reports that that was the case.", "Our rating", "Pocan said Kushner \"met with Russian officials at the Trump Tower after having them come in the back door.\"", "It’s been confirmed that Kushner and Flynn met with the Russian ambassador in December 2016 at Trump Tower, but not confirmed that the ambassador entered through a back door of the tower.", "We rate the statement Mostly True.", "Wisconsin Public Television, Mark Pocan interview (3:45), March 3, 2017", "Email, Mark Pocan communications director David Kolovson, March 6, 2017", "New York Times, \"Kushner and Flynn Met With Russian Envoy in December, White House Says,\" March 2, 2017", "The Telegraph, \"Donald Trump brands Democrats ‘hypocrites’ over Russian links,\" March 3, 2017", "PolitiFact National, \"The possible ties between Trump and Russia, explained,\" March 3, 2017", "New Yorker, \"Trump, Putin and the new Cold War,\" March 6, 2017", "The Telegraph, \"Donald Trump brands Democrats ‘hypocrites’ over Russian links,\" March 3, 2017", "Fox News, \"Kushner, Flynn met with Russian ambassador in December,\" March 2, 2017", "ABC News, \"Jared Kushner, Mike Flynn met with Russian ambassador during transition, White House says,\" March 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]