["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Reggae legend Bob Marley's home near Montego Bay, Jamaica (Tampa Bay Times)", "An undated post on CNewsGo.com claimed that President Donald Trump had finally confirmed the rumor of Jamaica becoming a U.S. territory, but the story continues to be nothing more than a hoax.", "The unnamed author claimed Jamaica has become a permanently inhabited territory of the United States with its own organized government as determined by an Organic Act passed by Congress. There is no date provided for the decision, and we could not find any legislation relating to such news.", "This is because Jamaica is its own country, declaring its independence from the United Kingdom and creating its own constitution in 1962. The United States then established diplomatic relations with the country and has maintained them to this day.", "Trump met with Jamaican Ambassador to the United States Audrey Marks in early April, when they discussed bilateral trade, but they made no mention of Jamaica becoming a U.S. territory.", "This story seems to prey on common geographical ignorance; we couldn’t help noticing during our research that a frequently googled question is whether Jamaica is located in the United States. The fourth-largest island in the Caribbean is in fact located about 90 miles south of Cuba. The country does not require visas for visits under six months, but it does require passports from U.S. citizens and permanent residents.", "The rumor dates back to February of this year, when Mediamaxzone.com reported falsely that the Jamaican prime minister had hinted Jamaica would become a U.S. territory. While it has been circulating for a while, it’s time we shed light on this hoax.", "We rate it Pants on Fire!", "Cnewsgo.com, \"Trump welcomes Jamaica as a US territory.\"", "Jamaica Information Services, \"Jamaican History.\"", "U.S. Department of State, \"U.S. Relations with Jamaica,\" Feb. 28, 2017.", "JamaicaObserver.com, \"Trump hails Jamaica’s beauty,\" April 8, 2017.", "CIA World Factbook, \"Jamaica,\" June 15, 2017.", "Mediamaxzone.com, \"Jamaica on its way to becoming a territory of the United States hints the PM Andrew Holness,\" Feb. 17, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]