["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Published April 11, 2008)", "Bill Clinton has been stumping nonstop for his wife, touting her accomplishments and defending her.", "But the former president at times appears to be marching to his own drummer. At a campaign stop on April 10, 2008, in Boonville, Ind., he mused on Hillary Clinton's false account of facing sniper fire on a trip to Bosnia, an incident the candidate would surely prefer to put behind her. And in defending her error, he made even more misstatements of his own.", "As reported by NBC News' Mike Memoli, Bill Clinton said: \"A lot of the way this whole campaign has been covered has amused me. But there was a lot of fulminating because Hillary, one time late at night when she was exhausted, misstated and immediately apologized for it, what happened to her in Bosnia in 1995. Did y'all see all that? Oh, they blew it up.\"", "There are several factual errors here; let's take them one at a time.", "First, it was not \"late at night.\"", "Hillary Clinton made the remarks that got her in trouble on March 17, 2008, before a speech on Iraq when she reminisced about her trip to Bosnia as first lady: \"I remember landing under sniper fire. There was supposed to be some kind of a greeting ceremony at the airport, but instead we just ran with our heads down to get into the vehicles to get to our base.\"", "The speech was scheduled for 9 a.m. The campaign Web site shows that she begins the speech with, \"Good morning.\"", "She also didn't make the remark one time. She said it previously on the campaign trail in Iowa. The\n\nDes Moines Register\n\nreported her saying on Dec. 30, 2007, \"We landed in one of those corkscrew landings and ran out because they said there might be sniper fire. I don't remember anyone offering me tea on the tarmac there.\"", "She also didn't apologize \"immediately.\" She said she misspoke a week later, after the video showing her landing in a calm, orderly fashion had circulated on the Internet and news stories were written about it.", "Finally, the trip took place in 1996, not 1995.", "We asked the Clinton campaign about Bill's comments. \"Senator Clinton appreciates her husband standing up for her, but this was her mistake and she takes responsibility for it,\" said a campaign spokesman.", "In making her case for president, Clinton has regularly pointed to her expertise in foreign policy, noting that she visited more than 80 countries while she was first lady. It's true that she visited a lot of countries, and many of those visits were more substantive than critics want to admit. (\n\nSee our story documenting her travels here\n\n.)", "But we found she also embellished her accomplishments to the point of factual inaccuracy. We found her statements about\n\nChina\n\nand\n\nNorthern Ireland to be Half-True\n\n, her statement on\n\nKosovo refugees to be Barely True\n\n, and her statement on\n\nBosnia to be Pants on Fire wrong.", "Bill Clinton has implied that the media is biased and covers his wife too harshly. In Boonville, he seemed to lament that unfairness by warning, \"And some of them, when they're 60, they'll forget something when they're tired at 11 at night, too.\"", "It seems bizarre that the former president would defend his wife's misstatements with even more of his own, but that appears to be the case. We find his rewriting of campaign history to merit his very own Pants on Fire ruling.", "NBC News,\n\nBill's back on the trail\n\n, April 9, 2008", "Hillary Clinton campaign Web site,\n\nIraq: Hillary's Remarks at the George Washingon University\n\n, March 17, 2008", "CBS News,\n\nClinton embellishes past\n\n, March 25, 2008", "CBS News,\n\n1996 Clinton Bosnia Trip\n\n, March 25, 1996", "CBS News,\n\nNot the Safest Trip, But No Sniper Fire\n\n, March 24, 2008", "Washington Post,\n\nSinbad unloads on Hillary Clinton\n\n, March 11, 2008", "Associated Press,\n\nClinton 'misspoke' about '96 Bosnia trip\n\n, March 25, 2008", "Des Moines Register, \"Clinton touts electability, readiness for 'unexpected,'\" Dec. 30, 2007", "Hillary Clinton, Living History, 2003", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]