["Republican U.S. Sen. Ted Cruz says in an online video ad that he voted for tax relief for victims of Hurricane Harvey in 2017 as his Democratic challenger, Rep. Beto O’Rourke of El Paso, ridiculously voted \"no.\"", "The narrator of Cruz’s August 2018 ad, which features photos of water rescues and Cruz on the scene of the devastating hurricane, says: \"Congressman O’Rourke is so irresponsible that he even voted against hurricane tax relief.\"", "A House roll call shows that O’Rourke, a congressman since 2013, was among 155 representatives to vote against the House’s Sept. 28, 2017, passage of the Disaster Tax Relief and Airport and Airway Extension Act of 2017, for which 264 members, including 43 Democrats, cast \"yea\" votes. The same day, the House concurred with a Senate amendment to the proposal and two days later President Donald Trump signed that into law.", "The measure folded in tax relief for hurricane victims. A September 2017 Houston Chronicle news story on the action, crediting Cruz with leading the effort to pass the legislation, said key provisions--approved two weeks after Congress advanced more than $15 billion in aid to Harvey victims--would permit Harvey victims to access their retirement funds penalty-free, allow victims to easily write off hurricane losses and provide a tax credit of up to $6,000 for employers who hire in a declared disaster area like Harris County, home to hard-hit Houston.", "Also, the story said, charitable giving might be spurred by the measure's waiving of deduction limits. Also, the proposal included language allowing taxpayers to use income from the past year to determine the Earned Income Tax Credit or Child Tax Credit, the story said.", "O'Rourke voted for direct aid", "When we asked O’Rourke’s campaign about his \"no\" vote, spokesman Chris Evans replied by email that O’Rourke, who otherwise voted for direct hurricane relief, voted against the measure singled out by Cruz \"because it dramatically shortchanged Harvey victims by providing significantly smaller tax breaks than those given after Hurricane Sandy,\" which slammed the East Coast in 2012.", "Hold that comparison: The American Institute of CPAs put us in touch with a Louisiana expert, CPA Jerry Schreiber, who told us by phone that Congress didn’t provide tax breaks to victims of Hurricane Sandy.", "Another congressional roll-call vote shows that earlier, on Sept. 25, 2017, O’Rourke joined a sufficient number of House members to keep the act from being immediately considered and passed by the House.", "O'Rourke's explanation for opposition to tax-relief legislation", "After that vote, O’Rourke posted a statement saying that he supported the measure’s main thrust--reauthorizing the Federal Aviation Administration and programs set to expire that week--but voted against the House moving along because \"other initiatives that are critical to the livelihood of our families and neighbors in El Paso were excluded.\"", "O’Rourke’s statement went on:", "\"Without returning this legislation for further improvement, I am not confident Congress would have reauthorized these programs.", "\"For example, H.R. 3823 left out reauthorizing the Children’s Health Insurance Program (CHIP) and Community Health Centers only days before their funding is set to expire. The recent debate on health care in our country has only reinforced the need for quality, affordable care. That simply will not be possible without these two programs that so many children and families in El Paso rely on.", "\"Additionally, the bill would have left victims of recent natural disasters — including Hurricane Harvey — without sufficient assistance as they work to recover and rebuild. The bill provided help in the form of tax breaks at a much lower rate than those provided to victims of both Hurricane Sandy and Hurricane Katrina.", "\"Ultimately, H.R. 3823 failed to pass the House. With less than a week remaining to reauthorize the FAA, CHIP, and Community Health Centers, I urge my colleagues to pass an improved version of this legislation that extends these programs while ensuring that we continue to aid those recovering from Harvey and other recent natural disasters.\"", "Our ruling", "Cruz said O’Rourke irresponsibly voted against tax relief for Hurricane Harvey victims.", "O’Rourke voted against the proposal delivering tax relief though Cruz's statement, suggesting a didn't-care attitude, leaves unsaid that O’Rourke offered some reasons for his opposition and had voted for direct aid to victims.", "We rate this claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "News story, Houston Chronicle, \"Congress passes special tax breaks for hurricane victims,\" updated Oct. 2, 2017", "Congressional records, \"Actions Overview, H.R. 3823,\" \"H R 3823 2/3 YEA-AND-NAY      25-Sep-2017 6:52 PM QUESTION: On Motion to Suspend the Rules and Pass BILL TITLE: Disaster Tax Relief and Airport and Airway Extension Act,\"  \"H R 3823 YEA-AND-NAY      28-Sep-2017 11:24 AM QUESTION:  On Passage BILL TITLE: Disaster Tax Relief and Airport and Airway Extension Act of 2017,\" U.S. Congress (accessed Aug. 28, 2018)", "Email, Chris Evans, communications director, Beto O'Rourke campaign, Aug. 28, 2018", "News story, \"Votes by Ted Cruz, Beto O’Rourke for disaster relief scrutinized as Hurricane Harvey is remembered,\" Dallas Morning News, Aug. 24, 2018", "Beto O’Rourke statement, \"The Airport and Airway Extension Act of 2017 (H.R. 3823),\" Sept. 26, 2017", "Phone interview, Gerard H. Schreiber, Jr., partner, Schreiber & Schreiber, Metairie, Louisiana, Aug. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]