["About this rating", "Space pioneer Sally Ride, who became the first female American astronaut in space, was asked by NASA engineers if 100 tampons would be sufficient for the 14 days she was to spend on the space shuttle Challenger in 1984.", "The story resurfaced in April 2020, when comedienne Marcia Belsky performed a now-viral song about Ride on Comedy Central titled, “Proof that NASA Doesn’t Know Anything About Women.”", "“Remember when NASA sent a woman to space for only six days and they gave her 100 tampons. 100 tampons. And they asked, ‘Will that be enough?’ Because they didn’t know if that was enough,” Belsky sang at her keyboard. “These are our nation’s greatest minds. They are literally rocket scientists.\"", "The video picked up steam once again in November 2020 when social media users expressed similar disbelief at the suggestion of 100 tampons for such a short amount of time.", "It’s true that NASA engineers asked Ride how many tampons she might need during her time in space. But the physicist was quick to set them straight.", "Ride became the first American woman to fly in space when she served as an astronaut on a mission aboard the Challenger space shuttle, which blasted off on June 18, 1983. Her job was to work the robotic arm to help release satellites into space, according to NASA. (Before Ride, Russia sent female cosmonaut Valentina Tereshkova to space in 1963.)", "In a 2002 oral history interview with Rebecca Wright, then coordinator for the NASA Johnson Space Center History Office, Ride was asked what items NASA had added to her flight kit, including the tampons in question.", "“I remember the engineers trying to decide how many tampons should fly on a one-week flight; they asked, ‘Is 100 the right number?’” Ride recalled, according to the transcript. She replied that, “No, that would not be the right number.”", "“They said, ‘Well, we want to be safe,’” continued Ride. “I said, ‘Well, you can cut that in half with no problem at all.’”", "NASA engineers apparently had a history of sending women to space with inadequate supplies. In that same interview, Ride noted that the engineers had also decided that women astronauts would want makeup. So, they designed a makeup kit.", "“The engineers at NASA, in their infinite wisdom, decided that women astronauts would want makeup — so they designed a makeup kit,” Ride was quoted as saying in a January 2018 tweet shared by the NASA History Office.", "It is not uncommon for astronauts to head to space with their own personal hygiene kits, which have been issued as standard equipment for astronauts since the 1960s. These kits typically contain items like a toothbrush, lotion, deodorant, comb, and razor. But in a predominantly male field in the 1980s, experts apparently had limited knowledge in the types of hygiene items that would be necessary for a woman.", "The optional — and unused — makeup kit included eyeliner, mascara, eye shadow, eye makeup remover, blusher, and lip gloss. It went on display in the Human Spaceflight at the Steven F. Udvar-Hazy Center in Chantilly, Virginia, in 2002.", "Women still remain a minority of those who have visited space in the four decades since Ride's 1984 mission. Of more than 500 cosmonauts, astronauts, payload specialists, and space station participants who have been to space, NASA noted that just 65 have been women as of March 2020.", "Correction [Dec. 8, 2020]: A previous version of this article stated that Sally Ride had spent time aboard the International Space Station. In 1983, Ride became the first American woman in space aboard the Challenger’s STS-7 mission. The following year, she launched on another Challenger mission, STS-41-G.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]