["Corrections & Clarifications: This story has been updated to correct the datapoints used in our analysis of the Center for American Progress' post. The fact-check rating has been changed to \"true.\"", "Millions of jobs were lost during Donald Trump's presidency, according to a Nov. 1 Facebook post.", "A chart posted to the Center for American Progress Action Fund page on Facebook showed negative job growth numbers for Trump compared with 12 of his predecessors. Trump is \"the worst jobs president in history\" with job losses totaling 4 million, according to the post's caption.", "Per the chart, Trump is the only president in the last 80 years to net job losses during his presidency. President George W. Bush is the runner-up with 1 million jobs added during his administration. Bush's successor, Barack Obama, is credited with 12 million jobs.", "The nation is in the middle of the worst economic crisis since the Great Depression, according to USA TODAY. But several factors are responsible for historically low job growth. Jesse Lee, senior adviser at CAP, said Trump's performance on jobs performance was rated accordingly.", "\"Yes, there are always multiple intersecting factors responsible for any number of economic indicators across the globe,\" Lee told USA TODAY. \"Every president faces tests, and every president is judged by his reaction to them.\"", "More:Fact check: Biden voted to tax Social Security, wants to reform retirement benefits", "The chart is a product of CAP using data from the Federal Reserve Bank of St. Louis, according to Lee.", "\"By subtracting the number of total nonfarm employees during the first month during which a president served from the number of total nonfarm employees during the last month during which a president served, one can easily replicate our figures,\" he said.", "Total nonfarm employees were 145,627,000 in January 2017 and 141,735,000 in September 2020, according to Federal Reserve Economic Data, or FRED, as seen in this chart showing the number of people employed per decade from 1940 onward. The economy lost just under 4 million employees during Trump's term.", "Lee confirmed that the chart referenced the latest data available by Nov. 1.", "Fact check:False claim that deceased Michigan man voted in 2020", "The pandemic's arrival is clear on the FRED chart of nonfarm payroll, with 152,463,000 Americans employed in February compared to 130,303,000 in April.", "The economic toll of the COVID-19 pandemic wasn't referenced in the CAP chart, but Lee argued such job losses would have been impossible to calculate.", "\"There is an infinite number of caveats that could be argued for or against, but the fact of the matter is that the simple analysis of job growth shows that President Trump is set to be the only president in recorded American history to have presided over net job loss,\" Lee said.", "Or, looked at another way: Despite a five-month decline in the unemployment rate, 6.8 million more people were unemployed in September compared to February, according to an October press release from the Labor Department. That remains 4.4 percentage points higher than before the pandemic took hold. People who reported not looking for work within the last four weeks because of the pandemic accounted for 4.5% of this number, according to a Bureau of Labor Statistics household survey.", "The September numbers from the Labor Department report reflected a bounce-back in the economy; the unemployment rate reached 13.3% in May but fell to 7.9% in September. Nonetheless, this is the highest unemployment rate preceding a presidential election since the government began tracking monthly rates in 1948, according to CNN.", "Tracking job growth figures from Truman to Trump reveals unprecedented job losses during the Trump administration. CAP's assertion that Trump is the worst jobs president in history appears to be true based on available data.", "We rate this claim TRUE, based on our research. More jobs were lost during the Trump administration than any other in history. Approximately 4 million fewer people were employed from January 2017 to September 2020, according to the most recent publicly available data.", "Our fact-check sources:", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]