["This text version of the post published on March 7, 2021, in South Africa has garnered more than 17,000 shares on Facebook. The post claims that  the new hack “sends very hurtful comments to your contacts” but hides the comments from the account-holder themselves.", "An internet search shows that a very similar claim was debunked by verification website Snopes in 2012 and again in March this year by C-Prompt Computers, a Maine-based computer repair company in the United States that specialises in the removal of malware.", "“I’m unaware of any way that the coding could be manipulated such that you can’t see the objectionable content and your friends can,” reads a Facebook post published by C-Prompt Computers. “That would require some kind of access to Facebook’s coding, and your average hacker isn’t going to have that.”", "A Facebook spokesperson confirmed this to AFP Fact Check: “All rumours circulating online around an alleged hack where hurtful comments are posted to a user’s page or sent to their contacts and are not made visible, are simply false.”", "However, it is possible to get hacked on Facebook. To ensure the safety and security of their accounts, Facebook encourages users to set up security features such as login alerts and two-factor authentication.", "Accounts or pages that impersonate other people violate Facebook’s community standards. Users who suspect their account has been hacked can visit this page to secure it.", "Tools and tips for securing a Facebook account are available here and here.", "AFP Fact Check has previously debunked a similar false claim that warned of hackers who post explicit content on people's personal Facebook accounts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]