["Republicans have been pointing out the failures of the Obamacare rollout, telling voters, \"We told you so.\" But the health care law’s problems aren’t a complete boon for the GOP. More and more, they’re getting questions about what their big ideas for health care are.", "Democratic pundit and sometimes political adviser Donna Brazile made that point during an installment of CNN’s Situation Room.", "\"They have a blank slate,\" Brazile said. \"They're not offering an alternative. They're not giving people who are desperately seeking health care an option to even enroll in something that they can afford.\"", "We asked Brazile if she was referring to the approximately 47 million uninsured people in the country and she told us \"Yes. I was referring to those who would qualify for Medicaid, etc.\"", "We wanted to know what the Republican ideas would do to make insurance affordable for people of modest means. So we looked at some of the bills they’ve introduced this session to fact-check Brazile’s statement.", "Ideas on the Republican menu", "Not all but most of the nine bills on our list use the tax code to put more money in citizens’ pockets on the condition that the money will be spent on health care. We found three basic approaches that potentially address insurance affordability.", "Overhauling health care tax deductions", "The most generous  proposal comes from the conservative Republican Study Committee, which put forward a bill with 100 cosponsors.  H.R. 3121 would give a $7,500 deduction to individuals and a $20,000 deduction to families.", "We saw two big catches here. You would need to have insurance in the first place. Plus, the bill would eliminate the biggest tax break households enjoy today, the portion of their premiums paid by their employer. Getting rid of that  $170 billion tax benefit would be a tough sell and a dramatic change to employer-provided insurance.", "Refundable tax credits", "These are like tax deductions, with the big difference that you can claim the credit even if you don’t have taxable income. H.R. 2300 from Rep. Tom Price, R-Ga., offers a maximum tax credit of $5,000 for families making up to 200 percent of the federal poverty level, or about $47,000 a year. The bill covers the cost of the tax credits with a blend of savings from medical malpractice reform, reducing waste, fraud and abuse, and cuts in discretionary spending.", "Health Savings Accounts", "These are accounts that enjoy a trifecta of tax breaks. Money goes in tax-free, the returns on investment accumulates tax-free and some withdrawals are tax-free. Several bills loosen the rules on health savings accounts to allow more people to put more money into them.", "Other ideas", "Additional GOP ideas include medical malpractice reform, allowing small business to form their own insurance buying pools, letting insurers sell policies across state lines and subsidizing state high-risk pools for people who can’t insurance anyplace else. These changes would be significant but would have only an indirect impact on families seeking affordable insurance.", "Assessing the Republican options", "None of the Republican proposals have undergone an intensive independent analysis of how they would help the needy.", "Based on interviews with experts and our research, the two possibilities that would most directly provide affordable insurance are tax deductions and refundable tax credits.", "A tax deduction that would offset payroll taxes could touch many families of limited means. About 50 million taxpayers making less than $40,000 a year pay such taxes. But there’s a chicken-and-egg issue here. Until you have insurance, you can’t get the tax break and the bill doesn’t provide a way to help workers get over that hurdle.", "Plus, the bill relies on the elimination of the tax break on employer-sponsored health insurance. This would represent a radical shift in federal tax policy.", "In terms of feasibility, the majority of analysts we talked to give the edge to the refundable tax credit approach. That does not mean there is a resounding consensus on how much it would achieve.", "The proposal from Price would make credits payable in advance. In other words, you could use the federal credit even if you didn’t have the money up front to pay for insurance.", "While the details are different, this resembles the program put forward by President George W. Bush. A 2005 study of the Bush plan by the Tax Policy Center, a joint project by the Urban Institute and the Brookings Institution, found that \"lower-income individuals experience the largest declines in uninsurance rates\" under the Bush proposal.", "However, of the 45 million people uninsured then, Bush’s $3,000 tax credit plan would have helped only about 2 million people who made less than 200 percent of federal poverty and just a bit over 3 million overall.", "Thomas Buchmueller, a health economist at the University of Michigan, said it is a major undertaking to provide insurance to those who lack the money to pay for it.", "\"Tinkering with tax deductions and making health savings accounts more attractive is not going to change that basic fact,\" Buchmueller said. \"Roughly half of the Affordable Care Act coverage gains come from expanding Medicaid. I don't see anything in these proposals that would do much for the people who will gain Medicaid under the ACA.\"", "Conservative analysts see more promise in the use of refundable tax credits. Nina Owcharenko with the Heritage Foundation, a group that has supported tax credits for many years, wrote in 2005 that this approach could go far to level the playing field, \"especially lower-income individuals who do not fit into today's patchwork health care system.\"", "One of the widest gaps between Democrats and Republicans is the basic understanding of what it means to offer a plan to people of limited means. For Democrats, a plan is an identified insurance policy, whether public, as in expanded Medicaid, or private, as in buying subsidized private insurance through a web-based, highly regulated marketplace. For Republicans, a plan is anything that makes buying insurance more affordable, however the person finds the policy.", "Our ruling", "Brazile said Republicans offer no option for those who are desperate for coverage the chance to enroll in something they can afford. Within a more Democratic definition of a plan, that claim is accurate.", "However, using a broader definition, the Republican plan to use refundable tax credits would likely have some impact on Americans of very limited means. Opinions vary widely on how many Americans this would help, but a program of this sort would do something for a portion of the people Brazile had in mind.", "While the Republican option is full of uncertainty and results might be limited, they are more than nothing.", "Still, supporters of the GOP reforms were unable to point to independent studies to show how much their ideas for tax deductions and tax credits would accomplish, and previous independent analysis suggests they would have a modest impact on reducing uninsurance rates.", "We rate Brazile's claim Mostly True.", "CNN, The Situation Room, Nov. 19, 2013", "Tax Policy Center, Distribution of federal payroll and income tax, 2013", "Fox News, Rep. Price talks about Obamacare failures, Nov. 19, 2013", "Robert Wood Johnson Foundation, Consumer-directed health plans: Do they deliver?, October 2012", "Health Affairs, Growth Of Consumer-Directed Health Plans To One-Half Of All Employer-Sponsored Insurance Could Save $57 Billion Annually, May 2012", "Upjohn Institute for Employment Research, Refundable tax credits for health insurance, July 2005", "American Enterprise Institute, The impact of recent Republican health reform proposals, Sept. 20, 2007", "State Health Access Data Assistance Center, State high-risk pools: An overview, July 2008", "Rand Corporation, Analysis of refundable tax credit, March 28, 2011", "Congressional Budget Office, Analysis of the effect of proposals to limit costs related to medical malpractice, Oct. 9, 2009", "Tax Policy Center, Tax Credits for Health Insurance, June 2005", "Congressional Budget Office, Selected CBO publications related to health care legislation - 2009-2010, December 2010", "California Research Bureau, Overview of federal tax incentives for health insurance, March 2007", "Heritage Foundation, Health care tax credits: The best way to advance affordability, choice and coverage, Nov. 28, 2007", "Bloomberg, A serious Republican health care plan, Sept. 23, 2013", "PolitiFact, GOP health care reform: A simple explanation, updated, Feb. 26, 2010", "Heritage Foundation, Health care tax credits: designing an alternative to employer-based coverage, Nov. 8, 2005", "Texas Public Policy Foundation, How conservatives should talk about Obamacare, Nov. 20, 2013", "Email interview with Stephen Bell, communications director, Republican Study Committee, Nov. 25, 2013", "Email interview with Ryan Murphy, communications director, Rep. Tom Price, Nov. 25, 2013", "Email interview with Tevi Troy, senior fellow, Hudson Institute, Nov 21, 2013", "Email interview with Henry Aaron, economist, Brookings Institution, Nov. 21, 2013", "Email interview with Thomas Buchmueller, economist, University of Michigan, Nov. 21, 2013", "Email interview with Roger Feldman, economist, University of Minnesota, Nov. 22, 2013", "Email interview with William Dow, economist, University of California - Berkeley, Nov. 22, 2013", "Email interview with Donna Brazile, vice chair, Democratic National Committee, Nov. 21, 2013", "Email interview with Bryant Renaud, senior research assistant, Brookings Institution, Nov. 25, 2013", "Republican Study Committee, American Health Care Reform Act, Sept. 18, 2013", "Empowering Patients First Act, June 6, 2013", "Access to Insurance for All Americans Act, Feb. 15, 2013", "Family and Retirement Health Investment Act of 2013, May 23, 2013", "Common Sense Health Reform Americans Actually Want, Sept. 20, 2013", "Helping Sick Americans Now Act, April 15, 2013", "Health Care Price Transparency Promotion Act, March 22, 2013", "Offering Patients True Individualized Options Now Act of 2013, Aug. 1, 2013", "Health Care Choice Act, April 23, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]