["About this rating", "Some students at the University of Wisconsin voluntarily participated in a \"Hijabi for a Day\" event during Islam Appreciation Week.", "The school did not force anyone to participate in the event.", "On 4 December 2016, the web site Conservative Daily Post published an article reporting that school administrators at the University of Wisconsin-Madison demanded that female students wear hijabs, or head scarves, during Islam Appreciation Week:", "Islam week at schools in America, administrators demand females wear hijabs to show support.", "Every journey begins with a single step. And in Wisconsin this week, that first step was to persuade American women to don the garb of traditional Muslims.", "The goal is to get these college-aged women to experience firsthand what it feels and looks like to be a Muslim woman. We’ll leave readers to guess where the final destination of this journey is intended to be.", "The vehicle is “Islam Appreciation Week”, an event hosted by the University of Wisconsin Muslim Student Association and Wisconsin Union Directorate Global Connection.", "It is true that an \"Islam Appreciation Week\" was held at the University of Wisconsin, but no students were forced to wear hijabs.", "The Muslim Student Association hosted several events during Islam Appreciation Week. In addition to the \"Hijabi for a day\" event, the week also included group talks, a day of fasting (followed by a community dinner), and an ice cream social. While these events were open to the entire student body, nobody was required to attend:", "Hijabi For A Day is an event aiming to break stereotypes and address Islamophobia on campus. The hijab is a scarf that covers the head and may cover the neck/chest of a person who chooses to wear it.", "[...]", "We encourage everyone to wear a hijab for the day in order to try to understand what it's like to be hijabi on campus. We hope those who choose to participate will gain a different perspective to life and a better understanding for agency, discrimination and self-identity.", "While the Conservative Daily Post insinuated that the University of Wisconsin-Madison was forcing all female students to wear hijabs during Islam Appreciation Week (approximately 15,000 students), the Daily Cardinal newspaper reported that only 45 non-Muslim students participated in \"Hijabi for a day\":", "For many Muslims on campus, wearing a hijab comes with a number of daily challenges. On Wednesday, 45 non-Muslim participants wore hijabs to try and get a sense of the Hijabi experience.", "Wisconsin Union Directorate Global Connections Director Swetha Saseedhar, along with Muslim Student Association members Noor Hammad and Iffa Bhuiyan, said the goal of the event was to normalize the hijab on UW-Madison’s predominantly white campus.", "WUD Global Connections and the MSA partnered to bring “Hijabi for a Day” to campus after they saw the project conducted nationwide by organizations such as BuzzFeed.", "“People who might not be used to seeing someone they know wearing a hijab might be more inclined to see the beauty of it and not just see it as something that people are oppressed by, but something that people, when they wear it, feel that they have agency,” Saseedhar said.", "The event has been an annual affair at universities across the United States for several years.  Its aim (which has received some criticism) is to promote cross-cultural dialogue and foster mutual understanding and compassion between Muslims and non-Muslims. While some classes offer extra credit or participation points for students who take part in the event, at no point has it ever been compulsory.", "Gibbons, Sammy.   \"‘Hijabi for a Day’ aims to end stigma, provide new perspectives.\"\r\n  &nbsp The Daily Carindal.   30 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]