["“Asking their Government to import 1000 Men from Nigeria to impregnate them. Wow,” reads one post sharing the photos, which we’ve archived here. The post, which has been shared more than 350 times, claims that the women were complaining that their husbands were spending too much time in the bar, leaving them unable to perform their conjugal duties.", "Another Facebook post archived here carried similar claims and was shared more than 200 times.", "Back in 2014, a Kenyan television station did report that women in Taita Taveta County, in the coastal area of the country, were complaining of ‘non-performing’ husbands due to alcoholism.", "However, the images used in these Facebook posts do not have any connection with this issue. All of them were taken at protests, in both Kenya and South Africa, after women were attacked for wearing short skirts.", "A reverse image search located the first picture here, taken by Reuters news agency on November 17, 2014. The caption says the women were protesting in Kenya's capital Nairobi after a woman was beaten and stripped. The assault on the woman -- who was attacked for wearing a miniskirt -- led to the #Mydressmychoice campaign which was reported by international media here, here and here.", "The other two images appearing in the series were clearly taken at the same event -- you can see several of the same women in both of them.", "A reverse image search conducted led us to this picture of a woman seen in both of the pictures, wearing a green top, blue skirt and headscarf. The photo appeared on a South African photographer’s Flickr account on February 29, 2008.", "A caption accompanying the images described the scene: “SOUTH AFRICA...LADIES dressed in mini-skirts marched to the Jack Mincer taxi rank in Noord street Johannesburg, to vent their anger at taxi drivers who sexually molested a girl wearing a mini-skirt.”", "Along with the woman in the green top and blue skirt, you can also see fellow protesters wearing the same red t-shirts in both this photo and the ones used in the Facebook posts.", "The t-shirts are inscribed with the letters APF -- which is the Anti-Privatisation Forum, an organisation established by activists in Johannesburg in July 2000.", "But for conclusive proof that these photos were taken in Johannesburg, we turned to Google Maps.", "This allowed us to pinpoint Plein Street, the site of the Noord taxi rank, where the Flickr caption said the protests took place.", "On Google Maps we were able to identify some distinct similarities proving that the protest did indeed take place in Johannesburg -- not in Kenya as the Facebook posts suggested.", "In both the photo of the woman in green and on Google Maps, you can see the same large skyscraper with a distinctive coloured stripe running across it, and the same green-fronted building to the left of it. You can also see the same distinctively shaped tree and the white canopy to the right.", "So, all three photos used in the Facebook post have been taken out of context to wrongly suggest they show women protesting against a “lack of men”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]