["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Senate Majority Leader Harry Reid, D-Nev., has taken to the floor to attack industrialists and big-money donors Charles and David Koch. Is Reid's most recent claim accurate?", "For weeks, Senate Majority Leader Harry Reid, D-Nev., has been using floor speeches to target Charles and David Koch, the industrialist brothers with libertarian political views who have spent generously -- and gotten others to spend generously -- to support conservative candidates and issues.", "In an April 2, 2014, floor speech, Reid criticized a House budget proposal drawn up by Rep. Paul Ryan, R-Wis., saying it reflected the principles of the Koch brothers and would lower taxes on the wealthy.", "\"Is $80 billion of personal wealth for the Koch brothers enough?\" Reid asked. \"I think most everyone would say yes, it's enough. But not the Koch brothers. They want more. They're the richest people in the world. Individually they're only fifth. Put them together they're the richest in the world.\"", "We wondered: Is that correct? Reid’s office didn’t respond to an inquiry for this story, but we were able to find some answers.", "It’s tricky to say definitively who is richer than who, because of privacy issues and fluctuations in market values. But the longstanding yardstick for measuring the world’s richest people comes from Forbes magazine, which publishes both the Forbes 400 (a list of the 400 richest Americans) and the World’s Billionaires (which tracks more than 1,600 billionaires across the globe).", "Currently, Charles and David Koch, when measured as individuals, are tied for sixth place on the international list, with $40.7 billion each. Combined, their net worth is $81.4 billion, which is higher than the highest-ranking individual on the list -- Microsoft founder Bill Gates, at $77.8 billion. (A third brother, William, has long been estranged from Charles and David, and media accounts about the brothers’ giving patterns generally do not consider him to be part of the \"Koch brothers.\" William is worth an additional $4 billion.)", "So are Charles and David Koch No. 1 in the world? They’re close--but not quite.", "Reid ignored one other family that, collectively, has greater net worth than the Kochs: the Waltons, the heirs to the Walmart fortune. Here’s the rundown, in descending order of their ranking on the Forbes international list:", "9. Christy Walton and family: $38 billion", "10. Jim Walton: $35.6 billion", "11. Alice Walton: $35.1 billion", "12. S. Robson Walton: $35.1 billion", "305. Ann Walton Kroenke: $5.0 billion", "367. Nancy Walton Laurie: $4.2 billion", "Together, the six Waltons have a net worth of $153 billion -- a little less than double the holdings of Charles and David Koch.", "So if Reid is going to put together the Koch brothers, it makes sense to combine the wealth of the Walton family as well. And the Walton family’s wealth is bigger.", "Our ruling", "Reid said the Koch brothers are \"the richest people in the world. Individually they're only fifth. Put them together they're the richest in the world.\" If you look at families -- which is what Reid is essentially doing -- then Charles and David Koch rank second internationally to six members of the Walton family, at least according to Forbes. That’s still pretty close to the top of the list. We rate his statement Mostly True.", "Harry Reid, Senate floor speech, April 2, 2014", "Forbes, the World’s Billionaires, accessed April 2, 2014", "Forbes, the Forbes 400, September 2013", "Village Voice, \"The Other Koch Brother: In the shadow of his brothers' Tea Party fame, Bill Koch seems almost like a normal billionaire,\" Aug. 24 2011", "PolitiFact, \"Bernie Sanders says Walmart heirs own more wealth than bottom 40 percent of Americans,\" July 31, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]