["About this rating", "Amid an ongoing public dispute between President Donald Trump and Rep. Frederica Wilson over the contents of a phone conversation Trump had with Myeshia Johnson, the widow of Sergeant La David Johnson, some conservatives have turned their attention to Wilson's past policies on military veterans.", "On 21 October 2017, the conservative Western Journalism web site reported:", "Rep. Frederica Wilson has cast herself as the champion of veterans and their families with her recent attacks on President Donald Trump over comments he denies making to a Gold Star family.", "However, when it was time to cast a vote for veterans, the record shows that the Florida Democrat has not supported key legislation — or any legislation supporting veterans at all, for that matter.", "The article goes on to accurately describe parts of Wilson's voting pattern on veterans-related legislation but also fails to mention other bills that she has co-sponsored and voted for, which were intended to assist veterans. Thus, the article gives a woefully incomplete and misleading picture of Wilson's legislative history in regards to military veterans.", "The claim, in the Western Journalism article's headline, that Wilson has \"never supported a pro-Veteran bill\" is utterly and demonstrably false.", "The VoteSmart.org web site—cited by Western Journalism, and in an earlier Fox News report—does not exhaustively list every bill which was in any way related to veterans, or had implications, but rather selects \"key votes.\" This incomplete collection is the basis of both articles.", "That VoteSmart.org summary states that since Wilson became a member of the House of Representatives in 2011, she has:", "There are many legislative measures that were not included in the \"key votes\" summary on VoteSmart.org, or in the Western Journalism article. The following is a very small sample of Wilson's participation in legislation intended to help military veterans. An extensive list can be found here.", "Mikelionis, Lukas.  \"Florida Democrat Wilson no Friend of Veterans, Vote Record Shows.\"\r\n  Fox News.  19 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]