["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On May 8, 2020, an article was published to the \"Laughing in Disbelief\" section of the website Patheos positing that U.S. President Donald Trump had tweeted that \"some oldies will have to die\" in order for businesses in the United States to reopen during the COVID-19 coronavirus disease pandemic:", "‘Oldies Will Have To Die’ Tweets Trump", "A besieged President Trump justified the administration’s attempt to squelch the Centers for Disease Control (CDC) guidelines for reopening the country by tweeting “…that’s the price we have to pay. Some oldies will have to die.”", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "The story you were reading is satirical.", "The Oxford Living Dictionary defines satire as:", "The use of humour, irony, exaggeration, or ridicule to expose and criticize people’s stupidity or vices, particularly in the context of contemporary politics and other topical issues.", "Well, there you go. That’s what I try to achieve on Laughing in Disbelief. Under normal circumstances, my humble blog is similar to The Onion. As many of you know, The Onion publishes satirical stories poking fun at everyday problems everyday people face as well as pointing out the hypocrisy of the rich and powerful. Think of Laughing in Disbelief as The Onion on drugs. Like meth. Or bath salts.", "While \"The Laughing in Disbelief\" section of Patheos is clearly marked as satire (the hyperlink in this article for Trump's fake tweet links to the website's satire disclaimer), some readers encountered this image on websites without a disclaimer (such as Newsbreak) or on social media, where it appeared without any satire label.", "While this tweet is certainly fake, Trump has acknowledged that reopening the country could adversely impact some of the population. During a visit to a factory making N95 masks in Arizona on May 5 (yes, the song \"Live and Let Die\" truly played over the loudspeakers), Trump said that some people could be \"affected badly\" as businesses in the United States start to reopen.", "Trump said: \"I’m not saying anything is perfect, and yes, will some people be affected, yes, will some people be affected badly — yes, but we have to get our country open and we have to get it open soon.\"", "For background, here is why we sometimes write about satire/humor.", "Perez, Matt.   \"Trump On Reopening: 'Will Some People Be Affected Badly?—Yes.'\"\r\n    Forbes.   5 May 2020.", "Hall, Andrew.   \"'Oldies Will Have To Die' Tweets Trump.\"\r\n    Patheos.   8 May 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]