["While President-elect Joe Biden and Vice President-elect Kamala Harris won't take office until Jan. 20, posts on social media claim that the moving process has already started.", "A viral video purports to show President Donald Trump speaking about the 2020 election results while movers work in the background.", "\"Movers carry out Trump belongings from the White House as he still complains about the election,\" reads a text over the video.", "Fact or fiction:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "Among those who shared the video are the Instagram account hiphopuniteddaily, and rapper and actor Ludacris, whom USA TODAY reached out to for comment.", "The video originated on Nov. 14, when it was shared to Facebook, Twitter and Instagram by the late-night talk show \"Jimmy Kimmel Live.\"", "The altered video is captioned \"Moving Day at The White House\" and has an ABC watermark on the bottom right corner, which has been cropped out of many versions shared by social media users.", "Kimmel, known for providing political commentaries, has previously shared videos of altered backgrounds behind Trump and recently made joke of Trump's refusal to concede during one of his segments.", "“The big orange guy is said to be feeling blue,” Kimmel said. “He’s gonna understand what it feels like to be evicted from your home in the middle of a pandemic.”", "Fact check: Clip altered to make Barack Obama look confused at Joe Biden campaign event", "Fact check: Claim about Sen. Lindsey Graham's calls to state officials is misleading", "The original video, which was filmed at the White House Rose Garden, has been altered by adding laughter in the background as well as a moving crew throwing boxes and other belongings inside a truck.", "The clip of Trump speaking in the video is authentic, however he was not speaking about the 2020 election results. The video is from Sept. 28, 2019, where he called the impeachment inquiry  the \"single greatest scam in American political history.\"", "\"The Democrats want to take away your guns, they want to take away your health care, they want to take away your vote, they want to take away your freedom, they want to take away your judges,\" Trump says in the video, which he tweeted.", "Trump continues, \"They’re trying to stop me because I’m fighting for you, and I’ll never let that happen.”", "His remarks came after House Speaker Nancy Pelosi, D-Calif., announced that the House would begin a formal impeachment inquiry into Trump, accusing him of abuse of power and obstruction of justice.", "The original video of Trump speaking is also visible on Reuters' website and YouTube.", "Fact check: Claim that voting noncitizens affected 2020 election outcome is unverified", "The video of movers carrying out boxes from the White House as President Donald Trump speaks is satirical and makes a joke of his refusal to concede. The video has been altered to add a moving truck and laughter in the background. While Trump's remarks in the video are authentic, he was not speaking about the 2020 election results; the video was made in September 2019.\"Jimmy Kimmel Live\" added the movers. We rate this claim as SATIRE.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]