["A .22 caliber revolver made by North American Arms is displayed at the NRA Carry Guard Expo at the Wisconsin Center in August 2017. Michael Sears / Milwaukee Journal Sentinel", "The most recent mass shooting, which killed five Capital Gazette newspaper employees in Annapolis, Md., reignited the gun control debate.", "The tragedy brought to mind a claim made earlier this year by Democratic gubernatorial candidate and Madison Mayor Paul Soglin.", "During a March 23, 2018, news conference, Soglin claimed: \"The latest statistics demonstrated that if there is a firearm available, it is 17 times more likely to be used either for suicide or for assaulting a friend, relative, an acquaintance than it is to be used in fending off an intruder.\"", "In light of recent events, we decided to examine Soglin’s claim.", "Guns and the risk of suicide, assault", "When asked to backup the claim, Soglin pointed to a January 2016 article in The Trace, a nonprofit news organization focused on gun issues, titled \"A gun as a defense against terrorists? The stats say it’s more likely to harm your family.\"", "The article cites a statistic we came across frequently during our research -- household gun ownership triples the risk of suicide and doubles the risk of homicide. In addition, the article highlighted a study that found access to firearms increases the likelihood of assaults against family members and others to whom people are close, such as girlfriends or boyfriends, escalating to homicide.", "That 1992 study led by the U.S. Centers for Disease Control and Prevention found death was 12 times more likely if such assaults involved a firearm than if the assault did not involve a firearm.", "However, neither the study nor the article states that guns are 17 times more likely to be used for suicide or assault than they are for self defense.", "So, where did the number come from?", "Well, if Soglin added all of the numbers — three times the risk for suicide, two times the risk for homicide and 12 times more likely for a family and intimate assault to escalate to homicide — he would have gotten 17.", "But the numbers cannot be added together -- family and intimate assaults that escalate to homicide are already accounted for under homicides as whole.", "In addition, none of these numbers compare the use of a gun for self-defense with the risk of homicide or suicide, which was the focus of Soglin’s claim. The studies compare the risk of gun ownership to non ownership.", "Are there other studies that are on point?", "According to a 2014 analysis in the Annals of Medicine that examined 16 published studies, people in the United States with access to a firearm are three times more likely to die by suicide than those who do not have access, and are two times more likely to die by homicide. This study made no mention of family or intimate assaults, and did not make comparisons with self defense.", "We could not find any recent studies comparing how often guns are used for suicide and assault vs. how often they are used for self defense, but there is a 20-year-old study that comes close to corroborating Soglin’s claim.", "That 1998 study by A.L. Kellermann with the Emory University Center for Injury Control said for every time a gun is used in the home for self-defense or legally justifiable shootings, it is used four times in an unintentional shooting, seven times in a criminal assault or homicide and 11 times in an attempted or completed suicide.", "The study found a gun is 18 times more likely to be used in an attempted or completed suicide, homicide or assault than it is for self-defense. But some of these homicides may involve strangers and, therefore, it would not be entirely accurate to say this study supports Soglin’s claim about the danger to known victims.", "What’s more, gun laws, ownership and crime rates have changed since this study was completed, so its findings may be out of date.", "Finally, Soglin’s larger point about guns being used infrequently for self defense is generally accurate.", "A study done using federal crime and victimization statistics by the Violence Policy Center, a Washington, D.C.-based organization dedicated to stopping gun deaths and injuries, found that between 2007 and 2011, there were 29.6 million victims of an attempted or completed violent crime. Of those victims, 235,700 used a firearm as a form of self defense. That means about 0.8 percent of attempted or completed violent crimes involved a victim using a firearm as a form of self-defense.", "Our rating", "Soglin claimed \"If there is a firearm available, it is 17 times more likely to be used either for suicide or for assaulting a friend, relative, an acquaintance than it is to be used in fending off an intruder.\"", "Soglin is on point in stating a gun is much more likely to be used for a suicide, assault or homicide than used in self-defense, but is on less solid ground when it comes to stating exactly how many times more likely.", "That depends on the study, many of which do not differentiate between known and unknown victims. What’s more, recent research is limited.", "Overall, we rate Soglin’s claim Half True.", "Original reporting for this story was done for The Observatory, a University of Wisconsin-Madison School of Journalism fact checking website featuring the work of students.", "Channel 3000, Soglin says legislators fail to address gun violence in Wisconsin, March 23, 2018", "Pew Research Center, Most gun owners cite protection as a major reason for owning a gun, June 21, 2017", "Fairness and Accuracy In Reporting, The Self-Defense Self-Delusion Owning guns doesn’t actually help stop gun violence, March 2013", "Violence Policy Center, Firearm Justifiable Homicides and Non-Fatal Self-Defense Gun Use, June 2015", "Annals of Internal Medicine, The Accessibility of Firearms and Risk for Suicide and Homicide Victimization Among Household Members: A Systematic Review and Meta-analysis, Jan. 21, 2014", "The Trace, A Gun as a Defense Against Terrorists? The Stats Say It’s More Likely to Harm Your Family, Jan. 27, 2016", "Journal of the American Medical Association, Weapon involvement and injury outcomes in family and intimate assaults, June 10,1992", "U.S. Centers for Disease Control and Prevention, National Vital Statistics Reports Volume 66, Number 6, Nov. 27, 2017", "FBI, 2015 Crime in the United States, accessed May 1, 2018", "Journal of Pediatric Surgery, Injuries and deaths due to firearms in the home, August 1998", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]