["About this rating", "Karen Pence did not wear a mask when she joined Vice President Mike Pence on stage at the end of the debate.", "However, Karen Pence did wear a mask while seated in the audience at the debate.", "On Oct. 7, 2020, photographs and videos started to circulate on social media that supposedly showed U.S. second lady Karen Pence standing on the stage at the vice presidential debate without a mask. These images were often accompanied by the accusation that Karen Pence had violated rules implemented by the Commission on Presidential Debates, mandating that everyone in attendance at the debate wear a mask:", "The above-displayed video shows genuine images from the end of the vice presidential debate when Karen Pence and Doug Emhoff joined their partners on stage. While Karen Pence did not wear a mask during this portion of the event, it appears that she was wearing a mask throughout the entire debate as she sat in the audience.", "Wife of Vice President Mike Pence, Karen Pence attends the vice presidential debate in Kingsbury Hall at the University of Utah on October 7, 2020, in Salt Lake City, Utah. (Photo by Justin Sullivan / POOL / AFP) (Photo by JUSTIN SULLIVAN/POOL/AFP via Getty Images)", "A second image provided a slightly wider shot of the people sitting around Karen Pence, showing that they were wearing masks:", "Daughter of US Vice President Mike Pence, Charlotte Pence Bond, and her mother Karen Pence (C rear) attends the vice presidential debate in Kingsbury Hall at the University of Utah on October 7, 2020, in Salt Lake City, Utah. (Photo by Robyn Beck / AFP) (Photo by ROBYN BECK/AFP via Getty Images)", "The issue of wearing a face mask during the debates — something health officials have repeatedly said is key to slowing the spread of COVID-19 — became part of the national conversation following the first presidential debate, when members of U.S. President Donald Trump's family and staff refused to wear face masks while sitting in the audience. Frank Fahrenkopf, head of the Commission on Presidential Debates, spoke to The Washington Post shortly after the first presidential debate, saying: \"The first family came in wearing masks, but they took them off. The rules said you had to wear a mask ... Everyone in that hall was supposed to keep the mask on, other than the president, Biden and Chris Wallace.\"", "The Trump family's failure to wear masks became even more controversial when Trump, first lady Melania, and more than two dozen Republican officials and White House staff members tested positive for coronavirus in the days following the debate.", "In response to the COVID-19 outbreak at the White House, and with growing concern about the safety of the debates, the commission said that they would be more vigilant in enforcing the mask rules at the vice presidential debate. Fahrenkopf addressed the crowd before the start of the vice presidential debate, saying: \"You were told when you entered here that you had to have your mask on. And the rules are that you will keep your masks on.\"", "https://www.c-span.org/video/?c4913400/user-clip-debate-rules-masks", "On Oct. 9, a spokesperson for the second lady released a statement claiming that both campaigns had agreed that spouses would be allowed to remove their masks when they appeared on stage at the end of the debate.", "Kara Brooks, the communications director for the second lady, said:", "\"Second Lady Karen followed an agreement established between both campaigns prior to the debate ... Both sides agreed that the spouses would remove their masks when they walked onto the stage at the end of the debate.”", "We reached out to the Commission on Presidential Debates and the Biden campaign for comment and will update this article if more information becomes available.", "DeMarche, Edmund.   \"Karen Pence’s Office Says Both Sides Agreed to No Masks at End of Debate.\"     Fox News.   9 October 2020.", "Davis, Aaron, Boburg, Shawn, and Dawsey, Josh.   \"Trump’s Debate Guests Refused to Wear Masks, Flouting Rules.\"\r\n    The Washington Post.   2 October 2020.", "Olson, Tyler.   \"Trump Party at Presidential Debate Did Not Wear Masks, Refused Offer From Cleveland Clinic for Face Coverings.\"\r\n    Fox News.   3 October 2020.", "CDC.   \"Use of Masks to Help Slow the Spread of COVID-19.\"\r\n    28 June 2020.", "Nethers, Dave.   \"Commission on Presidential Debates Expected to Review Mask Requirement Enforcement for Future Debates.\"\r\n    WTRF.   5 October 2020.", "Dall, Chris.   \"White House COVID Outbreak Grows as Midwest Hospital Cases Surge.\"\r\n    CIDRAP.   7 October 2020.", "Updated [9 October 2020]: Added statement from Pence spokesperson.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]