["A collage of two photos were posted here on Facebook on January 10, 2021.", "The Indonesian-language post translates to English as: “Praise be to God” and the text superimposed on the photo collage reads: “This is what God wills You are the best protector, O Allah, the survivor of the fall of the SJ182 plane ,, the baby survives in the sea at night ,, thank God, I hope you’ll be healthy and have a long life, kid.”", "Indonesia’s Sriwijaya Air Flight SJ 182, carrying 62 people on board, including 10 children, crashed into the Java Sea on January 9, 2021, shortly after taking off from Jakarta’s airport, AFP reported.", "The same photo collage also shared more than 470 times in other Facebook posts here, here, here and here.", "However, the claim is false.", "Google reverse image and keyword searches found the photo shows a baby who survived a deadly boat accident in Indonesia in July 2018.", "A photo collage was published on this report by local media Suara.com, headlined: “Touching! Mother drowned after giving her life vest to save the baby.”", "The first two paragraphs of the report read: “One baby, 7 months old, was found alive by the SAR and military teams on the waters of Selayar island, South Sulawesi, on Wednesday, July 4, 2018.", "“The baby was a victim of MV Lestari Maju, which sank yesterday, Tuesday, July 3.”", "The photo’s caption reads: “A 7-month-old baby was found by the SAR and Indonesian military teams alive in the waters of Selayar Island, South Sulawesi, Wednesday (4/7/2018).”", "Below is a screenshot comparison between the pictures in the misleading post (L) and Suara.com’s photos (R):", "At least 34 people died and more than 150 were rescued in the ferry disaster, which occured in Selayar island, near Sulawesi island, AFP reported here on July 4, 2018.", "On July 5, 2019, local news site Liputan 6 shared this video of the baby after being rescued from the fatal accident.", "One of the photos previously appeared in posts with a claim that it shows a baby who survived the deadly Lion Air plane crash in Indonesia in October 2018, which has been debunked by AFP here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]