["By Saranac Hale Spencer", "Posted on January 28, 2020", "Social media posts falsely claim that a “Chinese spy team” working in a Canadian government lab sent “pathogens to the Wuhan facility” prior to the coronavirus outbreak in China. Two Canadian agencies have told us those claims are wrong.", "Suggestions have been circulating on social media that a “Chinese spy team” sent the deadly coronavirus to Wuhan, China — the epicenter of the outbreak — from a Canadian research lab.", "However, Eric Morrissette, a spokesman for the Public Health Agency of Canada, told us by email, “this is misinformation and there is no factual basis for claims being made on social media.”", "The false claim appears to have originated on a Texas money manager’s Twitter account. On Jan. 25, Kyle Bass tweeted: “A husband and wife Chinese spy team were recently removed from a Level 4 Infectious Disease facility in Canada for sending pathogens to the Wuhan facility. The husband specialized in coronavirus research.”", "Bass included a link to a CBC News story from July that did not support the claims he made in his tweet. He did not respond to our request for comment.", "The next day, ZeroHedge, a website that has published misinformation before, posted a story with this headline: “Did China Steal Coronavirus From Canada And Weaponize It?”", "A screenshot of Bass’s tweet has also been turned into a meme that is circulating on Facebook.", "As we said, Bass’s tweet includes a link to a July story by CBC News, Canada’s publicly owned news service, that doesn’t support his claim.", "CBC News reported in July that “a researcher with ties to China” had been escorted out of the National Microbiology Lab in Winnipeg. That lab is overseen by the Public Health Agency of Canada. Morrissette, the agency spokesman, told us that, “for privacy reasons,” the agency wouldn’t comment further than to confirm that the tweet was spreading misinformation.", "According to the CBC story, Dr. Xiangguo Qiu was escorted from the lab amid an investigation by the Royal Canadian Mounted Police into a possible “policy breach.”", "The RCMP and the health agency have said repeatedly that there is no threat to public safety.", "That story never mentioned Wuhan or the shipment of “pathogens.”", "A later CBC story, though, cited government travel documents that show Qiu was invited to the Wuhan National Biosafety Laboratory of the Chinese Academy of Sciences. That story, published in October, also says that she visited the “Chinese Academy of Science, Tsinghua University, the Chinese Medical Academy of Science and Beijing Institute of Biotechnology.” And that she “spoke at several conferences, including some organized by the World Health Organization, the Chinese Society of Virology and International Symposium on Emerging Viral Disease.” It also notes that collaboration among scientists is common.", "That CBC story also says nothing of the coronavirus or the shipment of “pathogens.”", "A third CBC story in August reported that the Winnipeg lab had sent two viruses — Ebola and Henipah — to Beijing on March 31. It didn’t connect Qiu, specifically, to that shipment, but it referred to the investigation, saying, “while the Public Health Agency of Canada says all federal policies were followed, there are questions about whether that shipment is part of an ongoing RCMP investigation.”", "But Cpl. Caroline Duval, of the Royal Canadian Mounted Police, told us by email, “There is no connection between the outbreak in China and any RCMP investigation.”", "So, it appears that the tweet was based on some mix — and misrepresentation — of those news reports from 2019.", "But, the fact is, Qiu wasn’t “removed” from the Canadian lab “for sending pathogens to the Wuhan facility,” as the tweet says.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Morrissette, Eric. Spokesman, Public Health Agency of Canada. Email interview. 27 Jan 2020.", "Duval, Caroline. Spokeswoman, Royal Canadian Mounted Police. Email interview. 28 Jan 2020.", "Pauls, Karen. “Chinese researcher escorted from infectious disease lab amid RCMP investigation.” CBC. 14 Jul 2019.", "Pauls, Karen. “Canadian lab’s shipment of Ebola, Henipah viruses to China raises questions.” CBC. 2 Aug 2019.", "Pauls, Karen. “Canadian government scientist under investigation trained staff at Level 4 lab in China.” CBC. 3 Oct 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]