["About this rating", "A casting call for a Latina actress to play \"Donald Trump Executive Assistant Supporter\" was placed on the LA Casting web site.", "The casting call is connected to Donald Trump's campaign.", "On 3 March 2016, actress Siri Corretjer posted the above-displayed image on Facebook, along with an accusation that Donald Trump's campaign was seeking a Latina actress to play the candidate's executive assistant.", "While the casting call is legitimate, there is no evidence connecting it to Donald Trump's campaign.  The original posting, which was first published on LACasting.com on 1 March 2016, does not identify who placed the ad.", "This casting call is not for someone to play Donald Trump's executive assistant on the campaign trail. Rather, this is for a scripted role for a YouTube video, that apparently is intended to \"go viral\":", "We need a Hispanic female actress that can pretend to play Donald Trump's Executive Assistant for this Viral Video. You will be speaking directly to the camera about your experience working for him. This is scripted.", "[...]", "Need someone that is comfortable playing a Mexican Trump Supporter. You will be acting like his ex executive assistant, and will be talking directly to the camera. Lots of dialogue and script to memorize.", "It seems unlikely that the ad was placed by Donald Trump's campaign, as this casting call at one point calls for an actress to play his \"ex executive assistant.\" This verbiage could be a typo, but more likely indicates that this video is part of an anti-Trump campaign, not a pro-Trump one.", "We've reached out to Casting Networks, but have not yet received a response.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]