["A video purportedly of a Congress MLA praising Modi government on demonetization and surgical strike has gone viral on social media. (“कांग्रेसी विधायक राकेश मेघवाल मोदी जी की तारीफ कर रहा था तो उसका माइक छीनने लगे कांग्रेसी” Congress MLA Rakesh Meghwal was praising Modiji then Congressmen started snatching the microphone -translated) A Facebook page, Rohit Sardana Fans club has shared the same video with the aforementioned text. At the time of writing this article, it has been shared more than 6200 times.", "Several other Facebook fan pages have shared this video with the identical narrative including Rubika Liyaquat Fans club, Sudhir Chaudhary Live, Prof. Rakesh Sinha Fans club and आम आमदनी पार्टी.", "In the video, two people can be seen snatching the microphone and stopping the speaker from praising demonetization. Many social media users have shared this same claim.", "A Google search of Rakesh Meghwal showed several news reports on the incident which had taken place in 2016. According to a report, Rakesh Meghwal is a former BJP MLA who was speaking at an event organized by the Bahujan Sangarsh Dal in Nagaur district. Speaking to media, he said that he was invited as a community leader in the gathering. It also must be noted that he was associated with BJP when made the statement in November, 2016.", "In November 2016, Rishi Bagree, who is followed by PM Modi on Twitter claimed that BSP supremo Mayawati had asked her party workers to snatch the mic from a party leader eulogising the Prime Minister. It had garnered close to 5400 retweets and 4000 likes. Notably, it was also retweeted by Madhur Bhandarkar with a comment, “good one”.", "A BSP Neta praised PM Modi in front of Mayawati in her rally for #DeMonetisation She got pissed and asked her workers to snatched his mic pic.twitter.com/WQAYNbdW3z", "— Rishi Bagree 🇮🇳 (@rishibagree) November 21, 2016", "Bagree has got all the possible facts in his tweet wrong. Firstly, it was a event organized by the Bahujan Sangarsh Dal and NOT Bahujan Samaj Party. Secondly, no media reports suggest that BSP chief Mayawati was present at the spot. Thirdly, the man in video is a former BJP MLA and NOT a BSP leader.", "According to a Facebook post by Rakesh Meghwal, he has now filed his nomination as an independent candidate from Parbatsar constituency in the upcoming Rajasthan assembly elections.", "In this instance, a video of political leader previously affiliated with the Bharatiya Janata Party was passed of as a leader of the Congress party going against the party line. Propaganda is on full swing on social media with elections round the corner in five states.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]