["The photos purporting to show the coffins inside a vehicle were published here on Facebook on November 30, 2020. The post has since been deleted.", "Part of the Sinhala-language post translates to English as: “The Red Star comes forward to donate coffins to cremate those killed by Covid-19.", "\"The Red Star announces they are willing to provide coffins free of charge to those from low income families, of any nationality and religion...\"", "The Red Star is a relief organisation run by Sri Lanka’s People’s Liberation Front party, known locally as the Janatha Vimukthi Peramuna (JVP) party.", "The post circulated online following reports that bodies of Covid-19 victims in Sri Lanka were being held at mortuaries for “long periods” due to the families’ inability to provide coffins for the deceased.", "Sri Lanka has made cremations compulsory for coronavirus victims since April 2020, according to this AFP report. This has since prompted protests from the country's minority Muslims who say it goes against Islamic tradition.", "The photos were also shared here and here on Facebook alongside a similar claim.", "The claim is false.", "The People’s Liberation Front party’s Chief of Media Upul Ranjan denied the claims during a phone conversation with AFP on December 1, 2020.", "“We have not initiated any program to donate coffins to victims whose families have refused to provide coffins for the cremation of the bodies,” he said.", "Reverse image searches for the photos in the misleading Facebook post on Google found the original photos published here on a Sri Lankan Facebook page called Newstalk.lk on November 30, 2020.", "The caption reads: \"A Muslim donor comes forward to donate coffins for Covid-19 victims free of charge\". The coffins do not display the Red Star logo.", "Below is a screenshot comparison of the photos in the misleading post (L) and the photos in the November 2020 Facebook post (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]