["About this rating", "On 23 August 2017, the American Badass Facebook page posted a widely-shared message about Cleveland Browns running back Isaiah Crowell:", "This is Isaiah Crowell! He plays for the Cleveland Browns and this is the picture he posted on Instagram! As long as he is allowed to remain in the NFL I will not watch or attend another game! He is a piece of dog shit!", "The post was accompanied by a photograph of Crowell and a screenshot of an artist’s rendering of a hooded man cutting the throat of a police officer.", "We received several enquiries from readers wanting to know whether Crowell did, in fact, post this image to his Instagram account.", "He did, on 6 July 2016. He deleted the image after a few minutes and later apologized repeatedly, to the satisfaction of local police. There has been a certain amount of skepticism on social media about the story because the post is no longer on Crowell’s Instagram feed -- but that's because it was removed, not because it was never there.", "However, many took screenshots of the image, which Cromwell posted with the brief message: \"They give polices [sic] all types of weapons and they continuously choose to kill us. #Weak.\"", "Cleveland Sports Talk/Twitter", "On 11 July 2016, Crowell released the following apology via the Cleveland Browns and on his own Twitter account, according to the Cleveland Plain Dealer. He explained that in the days leading up to the post, he had been emotional about the deaths of two black men: Alton Sterling in Louisiana and Philando Castile in Minnesota. Crowell posted the image before five police officers were shot dead in Dallas, Texas, not afterwards.", "Last week was an emotional and difficult week as we saw extreme acts of violence against black men across our country as well as against police officers in Dallas. I posted an image to Instagram in the midst of that emotion that I shouldn't have and immediately removed it. It was an extremely poor decision and I apologize for that mistake and for offending people.", "My values and beliefs do not match that image. I am outraged and upset by the deaths of Alton Sterling and Philando Castile along with so many others. I am also outraged and saddened by the attacks in Dallas and the deaths of the five honorable police officers (Lorne Ahrens, Michael Krol, Michael J. Smith, Brent Thompson and Patrick Zamarripa) who were providing protection while trying to keep peace.", "We have to be better as a society, it's not about color, it's about what's right and wrong. I was very wrong in posting that image. Every single life matters, every death as a result of violence should be treated with equal outrage and penalty.", "As of 24 August 2017, the apology is no longer on Crowell's Twitter account or on Cleveland Browns web site. We asked the club why the apology appears to have been removed, but did not receive a response in time for publication.", "According to the Plain Dealer, Crowell also posted a video apology to his Facebook account on 13 July 2016 -- which has also since been removed. However, the video is available on YouTube, where the Baby Baby account uploaded it on 13 July 2016:", "Crowell again cited his frustration and upset at police violence against black men, and again apologized for posting the image.", "...I knew I was wrong. I’m sorry, and I hope you will understand that is not who I am. I would never wish violence on anyone, especially a police officer.", "Crowell also pledged to donate his first game check of the season ($35,294, according to the Cleveland Plain Dealer) to the Dallas Fallen Officer Foundation. We asked the Cleveland Browns why this apology video is no longer viewable on Isaiah Crowell’s Facebook page, but we did not receive a response in time for publication.", "The next day, Crowell personally apologized to Cleveland Police Chief Calvin Williams, who told the press that the running back had been “contrite” and “apologetic.”", "He wanted to personally apologize to myself and law enforcement here in northeast Ohio. A young man, in the heat of the moment, made a bad choice, made a bad decision and he's apologizing for that.", "The Cleveland Police Patrolmen’s Association (CPPA) rejected Crowell’s first apology and threatened to refuse to provide security at home games unless Crowell made a \"grand gesture\" of contrition. However, after Crowell’s follow-up video message and pledged donation, the CPPA accepted his apology. CPPA President Stephen Loomis said the group \"appreciated\" the running back’s video statement and that he had \"made things right.\"", "I appreciate the apology and we accept it. People are allowed to make mistakes in life. Our problem was that first apology. It wasn’t sincere. But Isaiah stepped up to the plate to make a personal apology, and we definitely appreciate his donation to the Fallen Officers Foundation.", "I'd love to work with Isaiah in the future. How cool would it be if Isaiah and I attended community events together to really make a difference in the city? We are missing opportunities that we should be seizing as law enforcement and athletes in the city.", "I’m glad we didn’t have to go the route of boycotting Browns games. We would not have enjoyed that. We wanted to give Isaiah the opportunity to make things right, and he did.", "It's not entirely clear why this episode has been given renewed attention more than a year later, but it could be related to the start of a new NFL season, as well as particular focus on the Cleveland Browns, amid an ongoing controversy over the national anthem.", "On 21 August 2017, Crowell was one of 12 Browns players who knelt and prayed during the national anthem, rather than standing, before a preseason game against the New York Giants.", "Cabot, Mary Kay.   \"Browns' Isaiah Crowell: I Was Very Wrong in Posting That Image.\"\r\n    Cleveland Plain Dealer.   11 July 2016.", "Cabot, Mary Kay.   \"Isaiah Crowell's Video Apology Accepted by Cleveland Police Union, Which Won't Boycott Browns Games.\"\r\n    Cleveland Plain Dealer.   13 July 2016.", "WKYC-TV.   \"Cleveland Police Chief: Isaiah Crowell Apologized for Instagram Post.\"\r\n    12 July 2016.", "Shaffer, Cory.   \"Cleveland Police Union Head Threatens to Pull Cops From Browns Games Over Isaiah Crowell's Instagram Post.\"\r\n    Cleveland Plain Dealer.   12 July 2016.", "TMZ.   \"Isaiah Crowell: Cop Org Accepts 2nd Apology - 'It Was Sincere This Time.'\"\r\n     13 July 2016.", "McManamon, Pat.   \"12 Browns Players Kneel in Prayer Over Racial, Social Injustice.\"\r\n    ESPN.   22 August 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]