["The video was shared in this blog post bearing the GMA News logo on January 17, 2021.", "\"24 0RAS: MOTHER OF FLIGHT ATTENDANT CHRISTINE ANGELICA DACERA, GUNNED DOWN,\" the video caption reads.", "“24 Oras” is the flagship nightly newscast of Philippine television network GMA News.", "The two-second video shows a news anchor saying: “Gunned down inside her car…”", "The circumstances behind Dacera’s death on New Year’s Eve 2020 generated massive public interest and is the subject of an ongoing high-profile investigation.", "An identical video was also shared in separate blog posts here, here and here.", "But the claim is false.", "Keyword searches on Google traced the video in the misleading posts to this unrelated GMA News report, which aired on January 26, 2019, a year before Dacera died.", "The report is titled: “24 Oras: Woman gunned down while inside her car in Quezon City\".", "Below is a screenshot comparison of the video in the misleading posts (L) and the 2019 GMA News report (R):", "The shooting incident was also reported here by local radio station Radyo Inquirer.", "Multiple keyword searches did not yield reliable news reports that Dacera’s mother had been gunned down in January 2021.", "A GMA News spokesman also confirmed that the blogs that published the misleading reports are not affiliated with the news organisation.", "“This is an imposter site,” Jaemark Tordecilla, GMA News' editor-in-chief, told AFP in a Viber message on January 18, 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]