["By D'Angelo Gore, Robert Farley, Eugene Kiely and Lori Robertson", "Posted on November 13, 2019", "During the first day of public hearings in the impeachment inquiry into the president’s conduct regarding Ukraine, the ranking members of the House intelligence committee made several statements that lacked context and required more information.", "House Democrats launched the public sessions on Nov. 13, with testimony from William Taylor, the charge d’affaires at the U.S. Embassy in Ukraine, and George Kent, deputy assistant secretary for European and Eurasian affairs in the State Department, both of whom had testified previously to House committees behind closed doors.", "The impeachment inquiry was triggered by a whistleblower complaint that accused President Donald Trump of “using the power of his office to solicit interference from a foreign country in the 2020 U.S. election.” The complaint cites a July 25 phone call that Trump had with the president of Ukraine, Volodymyr Zelensky, in which Trump asked Zelensky to investigate Democrats and a potential campaign rival, Vice President Joe Biden. At the time of the call, the administration was withholding congressionally appropriated security assistance funding to Ukraine.", "Democratic Rep. Adam Schiff, chairman of the House intelligence committee, and Republican Rep. Devin Nunes, the ranking minority member of the committee, highlighted certain events in their opening statements and their questioning:", "In his opening statement, Republican Rep. Devin Nunes dismissed the aid provided to Ukraine by the Obama administration as merely “blankets.” While it’s true that the Obama administration did not provide lethal weaponry to Ukraine, it did provide hundreds of millions of dollars worth of nonlethal military and security aid, such as military training, communications equipment, vehicles, night-vision goggles and counter-mortar radar to detect incoming artillery fire.", "Nunes’ comment came as he took aim at “the politicized bureaucracy,” the “executive branch employees [who] are charged with implementing the policy set by our president.”", "“Despite all their dissatisfaction with President Trump’s Ukraine policy,” Nunes said, “the president approved the supply of weapons to Ukraine, unlike the previous administration, which provided blankets as defense against invading Russians.”", "It’s true that in 2014, Obama balked at providing Ukraine lethal military aid, despite a plea to the U.S. Congress for such assistance by Ukraine’s then-President Petro Poroshenko.", "“Blankets and night vision goggles are important, but one cannot win a war with a blanket,” Poroshenko said then.", "But there was more to the aid than that. According to a Congressional Research Service report in January 2017 — at the end of the Obama presidency — the U.S. had committed more than $1.3 billion in foreign assistance to Ukraine since armed hostilities with Russia arose in late 2013. That included more than $600 million since 2014 in security aid, including training, equipment and advisers, the report stated.", "In March 2016 testimony before the Senate Foreign Relations Committee, the assistant secretary of State for European and Eurasian Affairs, Victoria Nuland, detailed some of the security aid to Ukraine.", "Nuland, March 15, 2016: Since there can be no reform in Ukraine without security, over $266 million of our support has been in the security sector, training nearly 1,200 soldiers and 750 Ukrainian National Guard personnel and providing: 130 HMMWVs, 150 thermal goggles and 585 night vision devices, over 300 secure radios, 5 Explosive Ordnance Disposal robots, 20 counter-mortar radars, and over 100 up-armored civilian SUVs. In FY16, we plan to train and equip more of Ukraine’s border guards, military, and coast guard to help Ukraine secure its border, defend against and deter future attacks, and respond to illicit smuggling.", "Nunes is correct that Trump was the first to provide lethal weaponry to Ukraine. In March 2018, the Trump administration approved the sale of $47 million worth of Javelin antitank missiles and launch units.", "In his closed door testimony before Congress (a transcript of which was later released), William Taylor, the charge d’affaires ad interim at the U.S. Embassy in Ukraine, called that a “substantial improvement” in aid to Ukraine. Taylor said the “serious” weapons would help deter Russians “from trying to grab more territory.”", "“There was also a very strong political message that said that the Americans are willing to provide more than blankets,” Taylor said. (See pages 155-156.)", "Asked about his “blankets” comment to describe aid provided during the Obama administration, Taylor said it was “just kind of the more derogatory version of it, but it was nonlethal weapons. So there was communications equipment, there were vehicles, there were maybe some rations, there were blankets, there were night-vision goggles. So it was a significant package, but it stopped short of weapons.”", "Nunes also said that the original whistleblower “was acknowledged to have a bias against President Trump.” The inspector general of the intelligence community wrote that the whistleblower had “an arguable political bias … in favor of a rival political candidate,” but the IG still concluded, based on his preliminary review, that the whistleblower’s complaint “appears credible.”", "Nunes, Nov. 13: The whistleblower was acknowledged to have a bias against President Trump, and his attorney touted a “coup” against the president and called for his impeachment just weeks after his election.", "We should note that despite some public speculation, the identity of the whistleblower has not formally been revealed. In his complaint, the whistleblower describes himself only as a “non-White House official” who learned about Trump’s phone call with the Ukrainian president “in the course of official interagency business” from “[m]ultiple White House officials with direct knowledge of the call.” The New York Times  said the whistleblower is a CIA officer who was detailed to the National Security Council, though the Times did not identify the official by name.", "In an Aug. 26 letter, Michael Atkinson, the inspector general of the intelligence community, noted that his preliminary review found some indication that the whistleblower had “an arguable political bias.”", "Atkinson, Aug, 26: Further, although the ICIG’s preliminary review identified some indicia of an arguable political bias on the part of the Complainant in favor of a rival political candidate, such evidence did not change my determination that the complaint relating to the urgent concern “appears credible,” particularly given the other information the ICIG obtained during its preliminary review.", "CNN, citing unnamed sources familiar with the investigation, reported that the inspector general’s conclusion was based on the whistleblower being a registered Democrat. Three sources who were privy to Atkinson’s private House testimony told the Washington Examiner the whistleblower also had some sort of prior working relationship with one of the 2020 Democratic presidential candidates.", "On Oct. 9, the whistleblower’s attorneys, Andrew Bakaj and Mark Zaid, released a statement addressing the alleged bias. According to the attorneys, the whistleblower “has never worked for or advised a political candidate, campaign, or party.” They noted that the whistleblower “has spent their entire government career in apolitical, civil servant positions in the Executive Branch” and that “in these positions our client has come into contact with presidential candidates from both parties in their roles as elected officials – not as candidates.”", "“Finally,” they wrote, “the whistleblower is not the story. To date, virtually every substantive allegation has been confirmed by other sources. For that reason the identity of the whistleblower is irrelevant.”", "As for Nunes’ statement that the whistleblower’s attorney “touted a ‘coup’ against the president and called for his impeachment just weeks after his election,” that refers to a tweet that Zaid sent in response to Trump firing acting Attorney General Sally Yates for refusing to defend Trump’s proposed travel ban.", "#coup has started. First of many steps. #rebellion. #impeachment will follow ultimately. #lawyers https://t.co/FiNBQo6v0S", "— Mark S. Zaid (@MarkSZaidEsq) January 31, 2017", "Asked about the tweet, Zaid told Law & Crime: “In the time since that tweet was posted, which was referring to lawyers serving as the force of good to prevent this president from doing harm to our democracy, I’ve probably represented more Republicans, including White House officials, than Democrats. This is nothing more than the continuing partisan deflection to desperately avoid discussing the substance of my client’s whistleblower complaint.”", "Nunes also referred to an episode in late September in which Schiff gave his own dramatic, and embellished, interpretation of Trump’s July 25 phone call with Ukrainian President Volodymyr Zelensky.", "Nunes, Nov. 13: At a prior hearing, Democrats on this commitee read out a purely fictitious rendition of the president’s phone call with President Zelensky. They clearly found the real conversation to be insufficient for their impeachment narrative, so they just made up a new one.", "Nunes is talking about Schiff’s opening remarks prior to the Sept. 26 testimony of Acting Director of National Intelligence Joseph Maguire.", "Schiff gave his interpretation of Trump’s phone conversation with the Ukrainian president, saying this was “the essence of what the president communicates” in his call with Zelensky “in not so many words.” Schiff later said in the hearing that the summary he gave “was meant to be at least part in parody.”", "As we have written before, Schiff did make up some parts of the conversation, claiming, for example, that Trump told Zelensky, “you better listen good. I want you to make up dirt on my political opponent.” The president never asked Zelensky to “make up dirt” on Biden, according to the White House memo on the July 25 phone call. Trump asked Zelensky to investigate, not provide false information.", "But not all of Schiff’s retelling was “purely fictitious,” as Nunes said.", "For instance, Schiff claimed that Trump told Zelensky, “We’ve been very good to your country, very good. No other country has done as much as we have. But you know what? I don’t see much reciprocity here. I hear what you want. I have a favor I want from you though.” That is similar to what Trump told Zelensky, according to the White House-released memo.", "In his opening statement, Schiff said the White House took the “extraordinary step” to move a memo of Trump’s call with Zelensky to a “highly classified server.”", "“After the call, multiple individuals were concerned enough to report it to the National Security Council’s top lawyer,” Schiff said. “The White House would then take the extraordinary step of moving the call record to a highly classified server exclusively reserved for the most sensitive intelligence matters.”", "But Lt. Col. Alexander S. Vindman, a staffer on the White House’s National Security Council, testified on Oct. 29 that it was “not entirely unusual” for that to happen in the Trump administration.", "In his closed-door testimony, Vindman — who was on the phone call — confirmed that the call memo went into a “more secure system.” He said, “As opposed to going into the standard communications system, it went into a different type, a different, more secure system.”", "He was later asked what it meant for the memo to be placed in the more restricted system.", "Question, Oct. 29: Does the fact that it was viewed as being sensitive necessarily mean that it was classified, that it should be classified or put into a system for very highly classified information?", "Vindman: So, sir, I would say that the use of the system is at the discretion oftentimes not of the legal shop or the senior legal counsel; it’s oftentimes actually at the discretion of the directors. And if they want to limit access to it, because they think it’s sensitive or they don’t want it to go out to a broader community, will do that. Whether that’s what it was designed for, you know, it seems it might not be, but that’s not unusual that something would be put into a more restricted circulation.", "Later he was asked if “any other call transcripts or [meeting] summaries that were placed into the more restricted system?”", "“I mentioned that, you know, this is not entirely unusual,” Vindman said. “It doesn’t happen regularly, I think most of these types of things … occur in the normal channels, but I am aware of other communications that have been — yeah — so, without going into the specific incidents, I guess, there are other classified materials.”", "Vindman said it may have been justified to put the call memo in a more restricted system, because an information leak could damage U.S.-Ukraine relations.", "Question: And I’m still trying to understand why it was viewed as being sensitive? Was it sensitive because of national security reasons, or was it sensitive because of other reasons? Was the discussion of the Bidens sensitive to national security, in your mind?", "Vindman: From a foreign policy professional perspective, all of these types of calls would inherently be sensitive. This one may be more so because it could somehow undermine our relationship with the Ukrainians. So, from that standpoint, you know, I guess – – in my mind, it could be justified to put it in the system because, again, if it went out, it could harm our relationship. I think ultimately that call was made — I’m not Sure — the call was made by John Eisenberg, the senior NSC lead counsel, and he did it based on his experience and judgment.", "It may be that the Trump administration handles such call memos differently than other administrations. Kelly Magsamen, a former National Security Council staff member under Presidents George W. Bush and Barack Obama, wrote in a Washington Post op-ed that moving the call memo to the more restricted system was “abnormal and suspicious.”", "“Such special protections are typically reserved for material of the gravest sensitivity: detailed information about covert operations, for example, where exposure can get people killed,” she wrote.", "Nunes said Democrats want to impeach Trump based on the summary of a “pleasant” call between Trump and Zelensky. But there’s more to the impeachment inquiry than just the phone call.", "The impeachment inquiry is gathering evidence on what actions Trump and his aides took before and after the call, including whether the president withheld aid to Ukraine in an effort to pressure Ukrainian to publicly declare that it would investigate the Bidens and alleged Ukraine interference in the 2016 U.S. election.", "Nunes started off his questioning with a statement: “The call summary for which the Democrats want to impeach president Trump is dramatically different from their nefarious depiction of it. What it actually shows is a pleasant exchange between two leaders who discuss mutual cooperation over a range of issues. The Democrats claim this call demonstrates extortion, bribery, and a host of other monstrous crimes being committed against President Zelensky.”", "This mirror’s President Trump’s “perfect call” defense, and his repeated insistence that his innocence would be apparent if people just “READ THE TRANSCRIPT!”", "We’ll let readers decide whether anything that was in the call summary released by the White House amounts to extortion or bribery.", "In the July 25 call, Trump told Zelensky, “I will say that we do a lot for Ukraine. We spend a lot of effort and a lot of time. … The United States has been very ·very good to Ukraine. I wouldn’t say that it’s reciprocal necessarily because things are happening that are not good but the United States has been very very good to Ukraine.”", "Zelensky then thanked Trump for its assistance, and particularly for the impending sale of Javelin missiles.", "Trump then said, “I would like you to do us a favor though because our country has been through a lot and Ukraine knows a lot about it. I would like you to find out what happened with this whole situation with Ukraine, they say CrowdStrike. … The server, they say Ukraine has it.” CrowdStrike is the cybersecurity firm hired by the Democratic National Committee after its computer network was hacked by Russian intelligence officers. And Trump is making an apparent reference to the debunked conspiracy theory that Ukrainians, not Russians, hacked the DNC servers.", "Shortly thereafter, Trump asked Zelensky to meet with his personal attorney Rudy Giuliani and Attorney General William Barr.", "“The other thing,” Trump continued, “there’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great. Biden went around bragging that he stopped the prosecution so if you can look into it … It sounds horrible to me.”", "As we’ve written, Trump has distorted the facts when he has claimed that Joe Biden, as vice president, threatened to withhold “billions of dollars to Ukraine” unless it removed the prosecutor general who “was prosecuting” Biden’s son, Hunter, and Burisma, the Ukrainian gas company on whose board Hunter Biden had served. There’s no evidence Hunter Biden was ever being investigated or prosecuted.", "And, despite Nunes’ claim that Democrats want to impeach Trump based solely on the call summary, the House Democrats’ inquiry casts a much wider net than that.", "Government officials who have testified in the House impeachment probe have said that they believe pressure was exerted both before and after the phone call to get Zelensky to make a public statement that he was opening an investigation into Burisma and the Bidens. That pressure, they said, included the withholding of U.S. security aid, and the dangling of a White House visit for Zelensky. To read more about that, read out story, “What We’ve Learned From Impeachment Inquiry.“", "Nunes also questioned the motives of the whistleblower and the Democratic impeachment inquiry because of contact that the anonymous whistleblower had with the House intelligence committee prior to filing the Aug. 12 complaint alleging misconduct by Trump.", "Nunes, Nov. 13: And most egregiously, the staff of the Democrats on this committee had direct discussions with the whistleblower before his or her complaint was submitted to the inspector general. Republicans can’t get a full account of these contacts because Democrats broke their promise to have the whistleblower testify to this committee. Democrat members hid these contacts from Republicans and then lied about them to the American people on national television.", "The New York Times broke the story on Oct. 2 that Schiff previously knew about “the outlines” of the whistleblower’s concerns. The whistleblower had contacted an intelligence committee aide after passing along concerns to the CIA’s top lawyer and being “[c]oncerned about how that initial avenue for airing his allegations through the C.I.A. was unfolding,” the Times reported.", "But when Schiff was asked about the complaint in a Sept. 17 MSNBC interview, he said, “We have not spoken directly with the whistleblower.”", "A Democratic committee official previously told us Schiff “could have been more clear” but was “referring to the Committee officially interviewing the whistleblower, and himself personally.” It was clearly known, however, that the committee hadn’t officially interviewed the whistleblower at that time.", "Patrick Boland, a spokesman for Schiff and the House intelligence committee, told us in a statement that it is not unusual for whistleblowers to contact the intelligence committee.", "“Like other whistleblowers have done before and since under Republican and Democratic-controlled Committees, the whistleblower contacted the Committee for guidance on how to report possible wrongdoing within the jurisdiction of the Intelligence Community. This is a regular occurrence, given the Committee’s unique oversight role and responsibilities,” he said. “Consistent with the Committee’s longstanding procedures, Committee staff appropriately advised the whistleblower to contact an Inspector General and to seek legal counsel.”", "There’s support for the statement that it’s “a regular occurrence” for whistleblowers to contact congressional committees. A May 2019 Government Accountability Office report said “whistleblowers who contact the Congress typically reach out to oversight committees, the offices of their own representatives or senators, or authorizing committees.”", "Later in the Nov.13 hearing, Republican Rep. Jim Jordan went further than Nunes, claiming that Schiff knows the identity of the whistleblower.", "“Of the 435 members in Congress, you are the only member who knows who that individual is, and your staff is the only staff of any member of Congress who’s had a chance to talk to that individual,” Jordan said to Schiff.", "There is no evidence of that, and Schiff denies it.", "“As the gentleman knows, that’s a false statement,” Schiff responded. “I do not know the identity of the whistleblower and I am determined to make sure that identity is protected.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]