["About this rating", "On 20 October 2018, Twitter user Mike Allen posted a photograph of an injured police officer and stated that the pictured individual had been \"brutalized\" by a member of the migrant caravan that was making its way toward the United States in the fall of 2018:", "Facebook user Jacque Guinan posted a nearly verbatim message which included two additional images of police officers who were also allegedly \"brutalized\" by this caravan of refugees :", "We also found a network of smaller Twitter accounts parroting the same verbatim claim: \"Mexican police are being brutalized by members of this caravan as they attempt to FORCE their way into Mexico\":", "A caravan of migrants fleeing political and social unrest in their home country of Honduras was slowly making its way north in the fall of 2018 with the hopes that its participants could seek asylum in the United States. Some conservative pundits and politicians used this group of migrants to stoke fears about immigration. Florida Representative Matt Gaetz even floated an unfounded conspiracy theory positing (without evidence) that these refugees were being paid by alt-right boogeyman George Soros. President Trump, too, declared (without evidence) that this group consisted of \"criminals\" and \"unknown Middle Easteners.\"", "The above-displayed photographs appear to be yet another attempt to smear this group of refugees and stoke fears over immigration. These pictures do not capture police officers who were brutalized by members of the immigrant caravan making its way toward the United States in October 2018 -- they're all several years old and depict the aftermath of altercations between police officers and protesters in Mexico.", "The main photograph attached to this rumor (showing an officer with a bloodied face) came from a 2012 incident involving students (not migrants) and police officers near Mexico City. Revista Emeequis reported that the students had been staging a protest at the school for more than a week when police officers came in and attempted to evict them from the building. More than 170 students were detained and at least 9 officers were injured during the altercation:", "Mexico City, October 16 (2012). In a series of operations carried out early Monday morning, state and federal authorities detained 176 students from the teacher training schools of Cheran, Arteaga, and Tripetio in Michoacan.", "The arrests occurred as the police officers cleared the school buildings, which for 10 days had been occupied by students protesting against changes in the school curriculum ...", "A spokesman for the state government, Julio Cesar Hernandez, told a news conference that nine federal police officers and one member of the Special Operations Group (GOE) were injured during the operations.", "The two other photographs attached to this rumor were also years-old and unrelated to migrant caravans. The image showing an injured officer on his knees on the street was taken in 2014 in Chilpancingo and was included in a gallery of photographs on the Mexican newspaper El Universal's web site and depicted another violent incident between police and students. According to BBC News, tensions between the police and protesters had been rising since a group of 43 students went missing a few months earlier in September 2014:", "Mexican police have clashed with protesters organising a concert in the city of Chilpancingo in support of a group of 43 students who went missing more than two months ago.", "Police said several officers had been injured, including some who were knocked down by a vehicle.", "The two groups accused each other of starting Sunday's violence.", "The case of the missing students, one of whom has been found dead, has triggered protests across Mexico.", "The other image associated with this rumor was also snapped several years earlier and was in no way related to a Honduran migrant caravan. The photograph displaying an officer with a bloodied lip has been online since at least 2011, when it was shared in articles concerning another altercation between \"police and teachers\":", "State Governor Gabino Cué Monteagudo offered a public apology to the people of Oaxaca for the grievances caused by \"police and teachers\" during their clash in the city's Zócalo and reiterated their willingness to engage in a new dialogue with Section 22 of the SNTE.", "Through a statement, the state government refused to grant the resignations of the Secretary General of Government, Irma Piñeyro Arias; the head of the Secretariat of Public Security, Marco Tulio López Escamilla, and the director of the State Institute of Public Education of Oaxaca (IEEPO), Bernardo Vásquez Colmenares, as demanded by the teachers after the drift and during the mega-march made yesterday in the city From Oaxaca.", "\"The Government of the State disclaims any attempt of aggression or action that seeks to undermine the right to free expression, free transit and association, reserving its power to intervene when public order is affected, as well as physical and patrimonial integrity of third parties.\"", "BBC News.   \"Mexico Missing Students: Protesters Clash with Police.\"\r\n    15 December 2014.", "El Universal.   \"Denuncia PF Ante la PGR a Responsables de Agresiones.\"\r\n    15 December 2014.", "Emeequis.   \"Entfrentamiento Entre Normalistas y Policias en Michoacan Deja Heridos, Detenidos e Incendios - FOTOS.\"\r\n    16 October 2012.", "Gutman, Matt.   \"Trump Asserts Migrant Caravan Headed to US Includes 'Unknown Middle Easterners,' Offers No Evidence.\"\r\n    ABC News.   22 October 2018.", "Durkin Erin.   \"Trump Baselessly Claims Democrats Sre Behind Migrant Caravan.\"\r\n    The Guardian.   19 October 2018.", "Sullivan, Eileen.   \"Trump Claims ‘Criminals and Unknown Middle Easterners’ Are in Caravan of Migrants.\"\r\n    The New York Times.   22 October 2018.", "Oaxaca Entrelineas.   \"Gobierno Estatal se Niega a Destituir a Irma Piñeyro.\"\r\n    17 February 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]