["The photo collage was published here by a New Zealand based Facebook page on June 28, 2020. The post has been shared more than 2,500 times.", "The image shows four black men and one white man in the middle alongside the text “Joshua Chellew, R.I.P”.", "The text superimposed over the top of the image reads in part: “Last week near Atlanta, these four teenage thugs beat the hell out of Joshua Chellew, 36, a guy they just met at a gas station, then threw him into traffic, where he was killed.”", "The image has also been shared on Facebook here, here, here, here and here alongside a similar claim.", "The claim, however, is misleading.", "A reverse image search on Google combined with a keyword search found the four mugshots of the purported assailants were published in this report by the Atlanta branch of US news site Patch.com on July 3, 2013.", "The headline reads: \"Police: Teens Offered No Aid to Mableton Hit-and-Run Victim\".", "Below is a screenshot comparison of the image in the misleading posts (L) and the image in the report published by Patch.com (R):", "The image of Chellew and his alleged assailants also corresponds with the images in this August 2013 news report by NBC-affiliated news site Mableton 11Alive.", "A Google keyword search subsequently found this September 2014 report by US broadcaster CBS, titled “Three convicted, 1 acquitted in Georgia gang beating death”.", "The report states in part: “Three Georgia men were convicted Wednesday in the June 2013 beating death of 36-year-old Joshua Chellew, reports CBS affiliate WGCL. Johnathan Anthony, 19, Antonio Pass, 20, and Jekari Strozier, 21, were found guilty of murder, violating Georgia's street gang and terrorism act, and related charges. Kemonta Bonds, 22, was acquitted of all charges.”", "The case was heard in the Cobb Superior Court and on September 3, 2014, the jury found Anthony, Pass, and Strozier guilty of murder and several other offences. Bonds was acquitted of all charges.", "Here are the verdict documents for Anthony, Pass, Strozier and Bonds.", "Anthony, Pass and Strozier were all sentenced to life in jail for their role in the attack. You can read their sentencing documents here, here and here.", "Chellew was killed in an incident that took place in Cobb County, Georgia, on June 30, 2013, according to this bill of indictment from the state of Georgia.", "On appeal, the Georgia Supreme Court ruling upheld the murder sentences for Anthony, Pass and Strozier, but reversed some of their convictions for \"criminal gang activity\".", "This 2018 document from the Supreme Court of Georgia provides further details about their appeal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]