["About this rating", "On September 28 2016, the conspiracy blog “UFOsightingshotspot” presented two unrelated stories as if they were part of the same news item. One reported on an upcoming supermoon event, and the other discussed a recent seismology study that looked for evidence that lunar cycles may partially predict earthquakes.", "The connection implied by conflation of the two stories, although not explicitly made on the UFO blog, was amplified by other outlets such as the UK's Daily Star tabloid, who wrote:", "The rare event will see the moon come the closest to Earth in 70 years — since January 26, 1948 — at 1.50pm on November 14. And now researchers in Tokyo are reportedly predicting how a major earthquake may be triggered by the huge phenomenon. According to conspiracy site UFOsightinghotspot, research from their study concluded the huge tremors are more likely to wreak havoc during full and new moons.", "Supermoons occur when the Moon is simultaneously full and at the closest point to Earth in its orbit (a phenomenon known as perigee). As reported by NASA, the supermoon on 14 November 2016 will be the largest one (i.e., the one in which the moon approaches closest to Earth) since 1948 and will not be surpassed until 2032.", "The information about the connection between earthquakes and lunar cycles is less set in stone, so to speak. The paper the conspiracy post references is an authentic study published in the 12 September 2016 issue of the scientific journal Nature Geoscience. In that paper’s introduction, the scientists noted that the possible correlation between seismic activity and lunar cycles has been a long-standing debate in seismology:", "The possibility of tidal triggering of earthquakes has been investigated since the 19th century, and numerous studies have examined this topic. Statistically significant correlations between seismicity and tidal stress have been discovered using large data sets, but the correlations are generally limited to special regions or circumstances.", "This study added to that body of research by investigating stress caused by the tidal pull of the moon prior to a number of major earthquakes worldwide, as reported by the Washington Post’s Sarah Kaplan:", "The same gravitational influence that the moon has on the oceans may also trigger earthquakes along Earth's most fragile faults. Researchers at the University of Tokyo calculated the levels of \"tidal stress\" before major earthquakes of the past few decades and found that high levels of stress were often followed by major earthquakes.", "As noted by the researchers, these periods of stress would be most marked during either a full moon or a new moon when the Sun, Earth, and Moon are generally aligned (an orbital arrangement known as a syzygy). In the researcher's model of how tidal stress and earthquakes might interact, those periods of high stress make it more likely that minor, deeper fractures will propagate into larger catastrophic events:", "This suggests that the probability of a tiny rock failure expanding to a gigantic rupture increases with increasing tidal stress levels. We conclude that large earthquakes are more probable during periods of high tidal stress.", "This conclusion is a far cry from the reported suggestion that the 14 November  supermoon, specifically, will cause “tidal” waves and earthquakes, as the study did not make a single mention of these events. The study is also still preliminary:", "“The results are plausible,\" University of Washington seismologist John Vidale told Nature. Vidale was not involved in the research; in fact, he previously helped debunk studies claiming a more tenuous connection between earthquakes and tides.", "But the connection still needs to be verified. Scientists point out that many large earthquakes of the past decade have happened at times when tidal stress wasn't a factor. Whether the phase of the moon can truly help predict large earthquakes remains to be seen.", "Furthermore, the difference in tidal stress caused between a supermoon alignment and a run-of-the-mill syzygy (which occur at periodicities of 14.8 days) is probably negligible since tidal forces themselves are fairly minor, as discussed by Bad Astronomy’s Phil Plait:", "The bullet points are that the Sun has an effect on our tides here on Earth, as does the Moon. When the Sun, Earth, and Moon are near a straight line in space — that is, at new or full Moon — these effects are maximized. We get what are called spring tides, with extra-high high tides, and extra-low low tides.", "If this happens at perigee, the effects are even stronger. The tidal force from the Moon can be as much as 50% greater! While that sounds dangerous, it’s not like we’ll see huge earthquakes and roaring tidal waves from this, because even at their strongest, the tidal forces are fairly weak.", "In 2011, NASA Goddard Space Center chief scientist James Garvin responded to similar questions about a possible supermoon-tectonics connection, concluding that it was unlikely to have much of an effect at all:", "The effects on Earth from a supermoon are minor, and according to the most detailed studies by terrestrial seismologists and volcanologists, the combination of the moon being at its closest to Earth in its orbit, and being in its 'full moon' configuration (relative to the Earth and sun), should not affect the internal energy balance of the Earth since there are lunar tides every day. The Earth has stored a tremendous amount of internal energy within its thin outer shell or crust, and the small differences in the tidal forces exerted by the moon (and sun) are not enough to fundamentally overcome the much larger forces within the planet due to convection (and other aspects of the internal energy balance that drives plate tectonics).", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]