["A post from July 2019 complained that Trump's alleged donation to rebuild the cemeteries was not covered in the news.", "But for the first quarter of 2019, Trump donated his $100,000 salary for the period to the US Department of Agriculture (USDA), it said.", "“President Trump’s 2019 first quarter salary donation went to USDA’s Office of Partnerships & Public Engagement (OPPE), which manages outreach for 1890 and 1994 land-grant universities, Hispanic-serving institutions, youth, veterans, women, new and beginning farmers, faith-based organizations, etc.,” the department told AFP.", "For the second quarter, Trump’s donation went to the Surgeon General’s office, deputy White House press secretary Judd Deere said in a tweet.", "And Trump’s salary for the third quarter was donated to the Office of the Assistant Secretary of Health to help fight the opioid crisis, the White House tweeted.", "The same claim resurfaced on Facebook in February 2020 -- here and here --  as well as in April and May.", "Trump’s salary for the fourth quarter of 2019 and the first quarter of 2020 -- the most recent quarters announced -- both went to the US Department of Health and Human Services (HHS) in an effort to combat the novel coronavirus pandemic.", "The US Department of Veterans Affairs -- which is responsible for the cemeteries -- did receive a donation of $100,000 from the president’s salary in 2018. The money went to support VA’s Caregivers Program, then-press secretary Sarah Sanders said during a briefing at the White House.", "Trump has donated his salary to various departments since taking office, including Education, HHS, and Homeland Security.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]