["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New York State Senate Democratic Leader Andrea Stewart-Cousins claimed New York state has one of the worst voter turnout rates in the country. (Photo: Dan Clark)", "Andrea Stewart-Cousins, the top-ranking Democrat in the New York State Senate, claimed New York state has one of the lowest voter turnout rates in the country.", "New York state, which has the fourth most registered voters among states, historically does not have high voter turnouts, the Westchester Democrat said.", "\"New York consistently ranks as one of the worst voting turnout states in the nation,\" Stewart-Cousins said.", "Democrats in the Senate want Republicans, who control the chamber, to support legislation they believe would increase turnout. More than a dozen bills introduced by Stewart-Cousins and other Democrats would allow automatic voter registration and early voting among other changes.", "Is voter turnout really as bad in New York state as Stewart-Cousins said?", "Presidential election years", "In the November 2016 election, New York state had the eighth-worst voter turnout among states, when 57.2 percent of voting-age citizens went to the polls, according to U.S. Census Bureau figures.", "Before 2016, New York state has ranked in the bottom half of states for voter turnout in all but one election during the last two decades, according to the census figures.", "The state ranked 29th in voter turnout among states in the 1996 presidential election. Some years have been better than others, but the state’s turnout has mostly declined since then.", "2000: New York state ranked 35th in voter turnout at 59 percent.", "2004: The state ranked 42nd, but the turnout rate increased that year to 60.2 percent.", "2008: Turnout dropped to 58.8 percent. The state ranked 43rd that year.", "2012: The state ranked 39th with a turnout rate of 58.7 percent.", "The state has also ranked poorly in most non-presidential election years, when turnout is generally lower in all states.", "1998: New York state ranked 23rd among states, its best ranking in the past two decades with a turnout rate of 48.2 percent.", "2002: The ranking went down to 39th with a turnout rate of 43.6 percent.", "2006: The state ranked 45th at 42.5 percent.", "2010: New York state ranked 37th at 43.6 percent.", "2014: Turnout dipped to 34.4 percent. New York state ranked 48th.", "Except for 2014, the state’s voter turnout rate has not varied much between four-year periods.", "Rates for other low-turnout states have shifted New York state’s ranking each year. Turnout in Georgia, for example, has increased from about 51 percent in 1996 to 60 percent in 2016.", "Other data", "Election data experts also rank New York state near the bottom of states for voter turnout.", "The United States Election Project, with election numbers dating back to 1980, ranked New York state 14th lowest in voter turnout in 2016.", "The project uses different methodology than the Census Bureau to calculate turnout, according to Dr. Michael McDonald, the University of Florida professor who created and manages its database.", "The Census Bureau tracks turnout rates based on self-reporting from people in each state. McDonald, instead, uses the total population of eligible voters in each state drawn from administrative records. He then compares that population with the number of votes for the highest office on the ballot each year.", "New York state ranked in the bottom 10 states for voter turnout in all but two elections over the last decade, according to McDonald’s numbers.", "Our ruling", "Stewart-Cousins said \"New York consistently ranks as one of the worst voting turnout states in the nation.\"", "Voter turnout rates reported by the U.S. Census Bureau and McDonald confirm that claim. New York state has ranked near the bottom of states for voter turnout in most elections over the last few decades.", "We rate her claim True.", "Email conversation with Gary Ginsburg, spokesperson for Stewart-Cousins", "Voter Turnout Data from the U.S. Census Bureau, Accessed Jan. 25, 2017", "Voter Registration Data from the U.S. Census Bureau, Accessed Jan. 26, 2017", "Email conversation with Sean Greene, director of research at the U.S. Election Assistance Commission", "New Voting Restrictions in America, Brennan Center for Justice", "Email conversation with Dr. Michael McDonald, associate professor at the University of Florida", "Additional data from the United States Elections Project from Dr. Michael McDonald", "\"Blue States Make Voting Easier as Red States Add Restrictions\", TIME, Oct. 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]