["About this rating", "Two sheriff’s deputies in Broward County, Florida, where the Parkland school shooting took place in February 2018, passed away in April 2018.", "Neither man \"exposed\" anything about the Parkland school shooting, and local officials have not pegged either man's death as \"suspicious.\"", "On 25 April 2018, the Sheriff's Office in Broward County, Florida, announced the death of sheriff's deputy Marshall Lawrence Peterson, a 28-year veteran of that office:", "It is with a heavy heart that we announce the passing of Deputy Marshall Peterson, a 28-year veteran of the Broward Sheriff's Office, Department of Detention. Deputy Peterson, 53, died at his residence. Thank you for your service, Deputy. pic.twitter.com/ytEwtINkWp", "— Broward Sheriff (@browardsheriff) April 25, 2018", "Conspiracy sites promptly attempted to link Peterson's death with that of Jason Fitzsimons, who passed away on 1 April 2018. Sites such as Your News Wire attempted to connect the two deaths by claiming that both men had \"exposed\" the February 2018 mass shooting at Marjory Stoneman Douglas High School in the Broward County community of Parkland:", "Marshall Peterson, a Broward County Deputy Sheriff who dared to question the official narrative surrounding the Parkland shooting, has been found dead under suspicious circumstances. He was 53.", "A 28-year veteran of the Broward Sheriff’s office, Deputy Peterson is the second Broward County Sheriff’s Deputy to be found dead in sudden and unexpected circumstances in the month following the Parkland massacre. Deputy Jason Fitzsimon, 42, was found dead on his sofa on April 1.", "The two deaths did have several factors in commons: both men worked for the Broward County Sheriff's Office, both passed away relatively young (Fitzsimons was 42, Peterson was 53), and in neither case was a cause of death announced. And neither of the deceased was said to have been suffering from health problems, to have been killed in an accident, or to have been the victim of a homicide.", "However, the lack of stated causes of death, combined with the use of common euphemistic language (Fitzsimons' obituary notes that he \"died unexpectedly,\" while Peterson was said to have \"died at his residence\") suggests suicide as a likely cause of death in each case, rather than a mysterious plot to do in all those who have dared to question the \"official\" narrative of the Parkland shooting.", "Moreover, neither man \"exposed\" anything about that shooting — Fitzsimons simply posted social media criticisms of a number of persons associated with that event (primarily teen activist David Hogg), and Peterson had no connection to the Parkland shooting at all that we could find. (The Broward County Sheriff told us that Fitzsimons' death was not considered \"suspicious\" and had no connection to his social media postings about the high school shooting.)", "The Your News Wire article offered no explanation or information regarding what Peterson might have \"exposed\" about the Marjory Stoneman Douglas High School shooting, or how might have done so. The article simply rehashed elements of Fitzsimons’ death and social media postings without saying much of anything about Peterson at all, beyond noting that he had passed away with no cause of death stated.", "In short, two men died in the same month, with no substantive connection (remarkable or otherwise) between them other than that they were both among the more than 2,800 deputies employed by the Broward County Sheriff's Office.", "Adl-Tabatabai, Sean.   \"Broward County Sheriff Who Exposed Parkland Shooting Found Dead – Media Blackout.\"\r\n    Your News Wire.   13 April 2018.", "Dmitry, Baxter.   \"Second Broward County Sheriff’s Deputy Dead After Exposing Parkland Shooting.\"\r\n    Your News Wire.   29 April 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]