["After Texas Sen. Ted Cruz's trip to Cancun, Mexico, as his home state dealt with an unprecedented winter storm, an image went viral purporting to show a tweet on climate change made by the Republican in 2016.", "The post, shared on Facebook by many users across the platform, claims Cruz, R-Texas, tweeted, \"I'll believe in climate change when Texas freezes over.\"", "The post claims the tweet was sent at 5:44 p.m. on Sept. 8, 2016, and the profile picture and blue checkmark seen in the image matches the one displayed on Cruz's official Twitter profile.", "\"There's always a tweet,\" one Facebook user wrote in a post that has more than 400 shares. \"This 2016 Ted Cruz Tweet did not age well, and it has also frozen solid,\" another user wrote Feb. 19 in a post with more than 800 shares.", "USA TODAY was unable to reach the Facebook users who shared the image for comment.", "Fact check: Company never shared the fake viral tweet about 'Gorilla Glue Girl'", "A search for the purported climate change tweet on Cruz's personal account, @tedcruz, and his official Twitter page, @SenTedCruz, results in no matches.", "There is no record of the tweet on ProPublica's Politwoops database that tracks deleted tweets by elected officials.", "The tweet does not appear in archived versions of Cruz's Twitter page from September 2016 using the Internet Wayback Machine.", "Steve Guest, a communication adviser for Cruz, confirmed to Factcheck.org in an email that the tweet is fabricated. USA TODAY was unable to reach Cruz's office for comment.", "USA TODAY has debunked fabricated tweets attributed to other politicians, including Rep. Alexandria Ocasio-Cortez, D-N.Y., and former President Barack Obama.", "Fact check:Sublimation, not government conspiracy, explains snowmelt videos", "The Republican senator has denied that climate change exists on multiple occasions and claimed that there is no scientific evidence to support global warming.", "\"Climate change is the perfect pseudoscientific theory for a big government politician who wants more power,\" Cruz told NPR in 2015. \"Why? Because it is a theory that can never be disproven.\"", "Cruz has repeatedly argued that there has been “no significant warming whatsoever for the last 18 years,\" based on data from satellites, The Washington Post reported in 2016.", "Fact check:Viral statement claiming to come from Texas power company is fake", "The claim that Ted Cruz tweeted, \"I'll believe in climate change when Texas freezes over\" is FALSE, based on our research. There is no evidence of the tweet on his Twitter pages or archived versions of them, and his office confirmed that it is fabricated. Cruz has made statements questioning climate change.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]