["A video of vehicles driving over a huge pothole on the road has been shared with the claim that it is from Mumbai.", "#vehicles suspension testing in #Mumbai #RoadSafety #MumbaiRains pic.twitter.com/7vO3OqhV0L", "— Titwala.com (@MyTitwala) August 4, 2020", "The video is in fact viral with the claim that it was shot in Mumbai.", "Inspector General (IG) of Bilaspur Police Dipanshu Kabra also tweeted the video and responded to several people that it is from Mumbai.", "सड़क में गड्ढे हों या गड्ढों में सड़क, बस #Suspension हो सबसे कड़क🙄", "Can you guess the city ? pic.twitter.com/h3oy71QRiK", "— Dipanshu Kabra (@ipskabra) August 6, 2020", "Alt News has also received verification requests for the video.", "The bottom right corner of the video carries the logo “小强兄弟 123”.", "A Google search for this keyword led us to a link on Chinese video-sharing website Bilibili where the same video was uploaded in 2017. People behind the camera can be heard conversing in a non-Indian language.", "There are several clues in the video which suggest that it is from China. Shops in the background have banners in Chinese.", "An FAW JH6 truck is visible in the clip. FAW Group is a Chinese state-owned automobile company headquartered in Changchun.", "Therefore a video from China was shared as vehicles driving on a potholed road in Mumbai.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]