["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Posts claim that \"Edward Snowden has revealed that the British and American intelligence and the Mossad (Israel’s intelligence agency) worked together to create the Islamic State of Iraq and Syria (ISIS).”", "Edward Snowden’s 2013 leak of classified NSA documents is perfect fodder for conspiracy theorists -- it has intrigue, still-unreleased documents, and the NSA as \"Big Brother.\"", "So it’s no surprise to see Snowden’s name attached to the increasingly popular idea that America and Israel created ISIS. On July 16, Bahrain’s Gulf Daily News reported that \"Edward Snowden has revealed that the British and American intelligence and the Mossad (Israel’s intelligence agency) worked together to create the Islamic State of Iraq and Syria (ISIS).\" This operation, they said, was codenamed \"Hornet’s Nest.\"", "And as recently as Aug. 18, the Palestinian Authority insisted that the Islamic State is a Zionist plot by the United States and Israel. The United States, though, has been bombing the Islamic State in Iraq for more than a week; not quite ally behavior.", "It would have been easy to dismiss this theory off-hand as another hoax emerging from the general lack of information about the Islamic State -- like the allegations that President Barack Obama released Islamic State leader Abu Bakr al Baghdadi in 2009, which we rated False.", "But we wanted to trace this conspiracy theory to its source to see whether or not it has legs.", "The taxonomy of a hoax", "In their refutation of the Hornet’s Nest story, Time points out that as early as June, Iranian sources have been accusing America of creating the Islamic State. On June 18, the Iranian Fars News Agency quoted Iran’s top commander, Hassan Firouzabadi, blaming the Islamic State on the West.", "\"The (Islamic State) is a move by Israel and the U.S. to create a safe margin for the Zionists against the resistance forces in the region,\" Firouzabadi said. The U.S. and Israel, he continued, are reacting to \"the recent victories of President Bashar Al-Assad in Syria\" and \"in Iraq.\"", "Time -- along with major American news sources, Al Jazeera, Daily News Egypt, the UN, and several other Middle Eastern countries -- say that the Islamic State is an offshoot of al-Qaida. In fact, we wrote last week about how al-Qaida rejected the Islamic State in part because of ideological differences and disputes over authority.", "That’s not to say America is completely blameless when it comes to the Islamic State -- the U.S. wars in Iraq and Afghanistan and the weapons deals it struck to try to bring down Assad may have all played a part in ISIS’s rise. But there’s no evidence of an American, British and Israeli plot to create ISIS.", "Yes, this is a conspiracy theory", "The only lucid defense of the idea that Western intelligence agencies created the Islamic State intentionally comes from the Center for Research on Globalization (CRG), a Canadian website that bills itself as an alternative news source, but has advanced specious conspiracy theories on topics like 9/11, vaccines and global warming.", "Kurt Nimmo, writing for the CRG through InfoWars, had four points defending the plausibility of the idea that America and Israel helped create the Islamic State.", "First, he claims that Baghdadi was radicalized at a U.S. military detention facility from 2005 to 2009. Baghdadi may have been radicalized by his earlier detainment by the United States and his subsequent detainment by the Iraqi government, but the Defense Department says Baghdadi was not a U.S. prisoner during the period that Nimmo mentions.", "Second, Nimmo quotes a Jordanian official claiming that \"the U.S., Turkey and Jordan were running a training base for the Syrian rebels in the Jordanian town of Safawi.\" But that’s a mischaracterization -- the article Nimmo links to clarifies that the fighters \"became members of the ISIS after their training,\" meaning they weren’t trained expressly to be members of the Islamic State.", "Third, Nimmo quotes an article depicting Baghdadi as the latest in a decades-long CIA program of successful mind control, including Rev. Jim Jones, the founder and leader of Peoples Temple. That article actually acknowledges that there’s no record that Baghdadi was \"held and treated by a secret CIA mind-control unit at Camp Bucca from 2004 until 2009,\" but argues that, obviously, those records would have been destroyed. That counts as a conspiracy theory in our book.", "Fourth and finally, Nimmo quotes an Islamic State member who claims that all current al-Qaida affiliates \"work for the CIA,\" with no evidence besides his word.", "So where does Snowden come in?", "If there were documents revealing Operation Hornet’s Nest, they’d probably be in Snowden’s NSA cache -- but they aren’t.", "Two weeks ago, blogger Alan Kurtz went in-depth on the genesis of the Snowden-Islamic State hoax, tracing it to a July 6 post in Arabic on the German domain shababek.de. From there, the claim spread across Middle Eastern papers, including the Fars News Authority and the Islamic Republic News Agency (IRNA), and eventually made it across the Atlantic to the CRG and InfoWars.", "Most of these articles referenced other articles that didn’t name sources, but the IRNA, in response to Time’s critique, pointed toward a story in The Intercept, a startup by journalist Glenn Greenwald. Greenwald’s First Look Media is one of three holders of Snowden’s NSA files, along with The Guardian and Washington Post writer Barton Gellman.", "But, Kurtz points out, there’s no mention of Operation Hornet’s Nest on The Intercept. Greenwald himself tweeted that he’s \"never heard him (Snowden) say any such thing, nor have I ever heard any credible source quoting him saying anything like that.\"", "WikiLeaks and Snowden’s ACLU lawyer Ben Wizner also tweeted refutations of the hoax -- for us, the final nails in the coffin.", "Our ruling", "Middle Eastern publications have been circulating a rumor that Snowden’s NSA leak reveals \"Operation Hornet’s Nest,\" an American, British and Israeli plot to create the Islamic State to destabilize the Middle East.", "This isn’t the first time Iranian publications have mischaracterized the Islamic State as an American creation, but it is the first time Snowden’s name has been attached. Sources with access to Snowden’s documents have directly refuted the hoax. The Islamic State started as an al-Qaida offshoot, and there’s no reason to believe otherwise.", "We rate this claim Pants on Fire!", "Global Research, \"ISIS Leader Abu Bakr Al Baghdadi Trained by Israeli Mossad, NSA Documents Reveal,\" July 16, 2014", "Shalom Life, \"Palestinian Authority Insists that America Created ISIS,\" Aug. 18, 2014", "Time, \"Why Iran Believes the Militant Group ISIS Is an American Plot,\" July 19, 2014", "The Snowden Hoax, \"The Snowden Hoax,\" August 9, 2014", "Infowars, \"Establishment Media Moves to Debunk ISIS CIA Asset Story,\" Aug. 13, 2014", "Islamic Republic News Agency, \"‘Times’ hastily reacts to IRNA report on Daesh,\" July 25, 2014", "Infowars, \"Former Al-Qaeda Commander: ISIS Works for the CIA,\" July 12, 2014", "Press TV, \"Who is Abu Bakr al-Baghdadi?\" July 14, 2014", "World News Daily, \"Blowback! U.S. Trained Islamists Who Joined ISIS,\" June 17, 2014", "Mother Jones, \"Was Iraq’s Top Terrorist Radicalized at a US-Run Prison?\" July 11, 2014", "Twitter @ggreenwald, tweet, Aug. 6, 2014", "Twitter @wikileaks, tweet, Aug. 8, 2014", "Twitter @Ben Wizner, tweet, Aug. 10, 2014", "Global Research, \"Global Warming Media Propaganda,\" Jan. 10, 2014", "Global Research, \"The Vaccine Coverup,\" Jan. 27, 2014", "Global Research, \"The 9/11 Attacks,\" March 12, 2014", "PunditFact, \"David Gregory: Al-Qaida cast off ISIS as ‘too extreme,’\" Aug. 13, 2014", "PunditFact, \"Fox’s Pirro: Obama set ISIS leader free in 2009,\" June 19, 2014", "Wired, \"The most wanted man in the world,\" Aug. 13, 2014", "UN News Centre, \"Adopting resolution, Security Council approved sanctions against militants in Iraq, Syria,\" Aug. 15, 2014", "Arab West Report, \"Egyptian Islamists Respond to ISIS’ Declaration of the ‘Caliphate,’\" Aug. 3, 2014", "Daily News Egypt, \"ISIL advance threatens whole region: Egypt foreign ministry,\" Aug. 10, 2014", "Al Jazeera America, \"Islamic State executes 700 people from Syrian tribe, monitoring group says,\" Aug. 16, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]