["The photo and claim were published on Facebook here on February 27, 2020.", "The post’s caption reads: “All international arrivals flights are cancelled at Karachi airport due Corona virus.”", "Below is a screenshot of the misleading post:", "The novel coronavirus, which has infected more than 94,000 people in 81 countries and territories, has continued to cause widespread travel disruption, as reported here by AFP on March 4, 2020.", "The photo was also shared with an identical claim on Facebook here and here and on Twitter here.", "An uncropped version of the photo, which includes a man standing in front of the flight information display, also circulated on WhatsApp in Pakistan with a similar claim.", "Below is a screenshot of the misleading post on WhatsApp:", "The claim is false.", "Pakistan’s Civil Aviation Authority reported that international flights generally arrived without interruption at Jinnah International Airport on February 27, 2020 in the afternoon, the time that the first misleading Facebook post was published.", "Below is a screenshot of the agency’s flight information page:", "A reverse image search on Google of the photo in the misleading Facebook post also found another photo of a corresponding flight information display that was published on March 1, 2019.", "Below is a screenshot of the photo, which was published on Jinnah International Airport’s Facebook page:", "Below is a comparison of the photo from the misleading post (L) and the March 2019 photo (R) with corresponding cancelled flights noted in red:", "The March 2019 photo was published as part of this Jinnah International Airport post, which showed several photos of empty terminals and suspended operations.", "Pakistan had closed its entire airspace on February 27, 2019 after the military said it shot down two Indian Air Force planes in Pakistani airspace, AFP reported here. The suspension order lasted more than five months, causing major disruptions to civil aviation.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]