["By Jessica McDonald", "Posted on September 16, 2020", "In a series of recent appearances, President Donald Trump continued to wrongly insist that the U.S. compares favorably with Europe on both coronavirus cases and deaths.", "Trump falsely said that Europe’s COVID-19 outbreaks are “much worse” than those in America and that the U.S. has also done “much, much better” on coronavirus deaths, including by having a significantly lower excess mortality rate. While coronavirus cases are increasing in Europe, the U.S.’s per-capita rate is still higher, as is the best estimate of the excess mortality rate.", "Trump has made inaccurate comparisons with Europe before, but in a Sept. 10 press briefing, two weekend campaign rallies in Nevada and a Sept. 15 televised town hall, the president continued to insist that the U.S. compares favorably with Europe on coronavirus cases and deaths.", "“But if you look at the European Union right now, they’re having breakouts like you’ve never seen before,” he said at the briefing. “And, frankly, their numbers are at a level that are much worse than the numbers here.”", "Three days later, at a rally in Henderson, Nevada, Trump focused again on Europe. “Other countries are doing terribly,” he said. “Did you see the statistics of us compared to other countries? Us compared to Europe?”", "It’s true that many countries in Europe are experiencing a surge in coronavirus cases that now rivals or exceeds the number of cases those nations had in the spring. But only a few countries are posting more new cases per capita than the U.S. — and Europe’s rate is about half of America’s.", "According to Oxford University’s Our World in Data, on Sept. 10, the U.S. reported a seven-day average of 106 new coronavirus cases per day per million people, compared with 59 for the European Union and 50 for Europe.", "Only Montenegro, Spain, Andorra, Moldova and France had higher rates of new cases — and at 112 cases per million, France’s rate was only slightly higher, not “much worse” as Trump claimed. Since Montenegro, Moldova and Andorra are not part of the E.U., that means only two E.U. nations, out of 27, had worse outbreaks than the U.S. when adjusted for population.", "When measured cumulatively, only one European nation — the microstate of San Marino — has had more COVID-19 cases per capita than the U.S. As of Sept. 15, America has had 19,803 cases per million people, a rate 3.6 to 3.9 times that of Europe (5,546) and the E.U (5,094).", "Trump also gave inaccurate information about Europe’s COVID-19 mortality. When a reporter noted that many people have died in the U.S., Trump falsely claimed that “we have done much, much better than the European Union.”", "“Yesterday, European nations experienced 50% more deaths than the United States,” Trump incorrectly said earlier in the briefing. “And you don’t hear these things. You don’t hear these statistics.”", "In both Nevada rallies, the president also rolled out his previously debunked claim that Europe has a much higher excess mortality rate than the U.S.", "“Europe’s excess mortality rate is 24% higher,” Trump said on Sept. 12 to a crowd in Minden, Nevada. He repeated the same statistic at an indoor rally in Henderson the next day.", "Trump doubled down on the claim in an ABC News town hall on Sept. 15. “The excess mortality rate is among the best in the whole world,” he boasted. “I mean, I can show you. There’s a chart that just came out a little while ago, excess mortality rate is compared to Europe, compared to other places, it’s about 25% better. In one case, it’s over 60% better.”", "The White House did not explain what figure the president had in mind when he said Europe had “50% more deaths,” but we found that was false by several metrics.", "Our World in Data shows that on Sept. 10, the U.S. had more new coronavirus deaths, whether adjusted for population or not, than both Europe and the E.U. The same was true when using the seven-day average of new deaths.", "Using cumulative numbers on Sept. 10, Europe had more deaths than the U.S. on a raw basis, but only about 11% more — and when taking Europe’s larger population into account, the roles reverse. Per capita, America had 576 deaths per million people, 80% more than the E.U. (318) and 103% more than Europe (282).", "On excess mortality, Trump previously claimed that Europe’s excess mortality rate was 33% or 40% higher than the U.S. Controversial Trump coronavirus adviser Dr. Scott Atlas, who is a senior fellow at Stanford University’s Hoover Institution, also has used 38% in interviews. This time, Trump used 24% and 25% — but the statistic is still wrong.", "As we wrote earlier, excess mortality is an alternative way of estimating the impact of the coronavirus that looks at the actual number of deaths, regardless of cause, compared with a “normal” or expected number of deaths during a given time period.", "Many of the deaths this past spring and summer may be due directly to COVID-19, but some may be due to indirect effects of the pandemic, such as those who may have died from other causes because they avoided seeking medical attention.", "Using updated sources since our last analysis, we found no evidence for Trump’s claim that Europe’s excess mortality rate is 24% or 25% higher than America’s. We performed two calculations, the first comparing estimates of excess deaths from the Centers for Disease Control and Prevention and EuroMOMO, a group monitoring mortality trends in Europe.", "The CDC estimates that between Feb. 1 and Sept. 5, there have been 201,917 to 262,877 excess deaths in the U.S., for a middle estimate of 232,397 excess deaths. For 24 European countries or parts of countries, EuroMOMO estimates there have been 209,144 excess deaths through week 36, or Sept. 6.", "When adjusted for population, those figures work out to show that the U.S. has had 704 excess deaths per million people, slightly more than the EuroMOMO region of Europe’s 680 excess deaths per million.", "Because the EuroMOMO figures only cover a portion of Europe, for a better comparison, we also repeated our analysis using updated figures from the Human Mortality Database. We used data covering 2020 up until June 28 (week 26) because several countries had data only up until that point (Slovenia was once again excluded because it lacked data past week 13).", "For that time period, Europe had 246,620 excess deaths, a 9.9% increase over the number of deaths the continent usually has. The U.S., meanwhile, had 194,936 excess deaths, which is 13.7% more than normal — meaning the American excess death rate is worse, not better, than Europe’s.", "It’s possible Trump’s 24% and 25% figures come from a calculation based on the raw number of excess deaths for both places — using the numbers here, the sheer total for Europe is 26.5% higher than the U.S. The campaign did not respond to our query about where the statistic originated or how it was calculated, and the White House has also never provided additional information, despite repeated inquiries about the figure.", "But if that’s the source of the statistic, it’s nevertheless a skewed and misleading portrait of excess mortality because Europe has a significantly larger population than the U.S. The best indicator to use is the P-score, or the percentage of excess deaths to “normal” deaths, and by that measure America’s 13.7% excess mortality rate is 38% higher than Europe’s 9.9% rate.", "On a per-capita basis, Europe has had 509 excess deaths per million, compared with 590 in the U.S.", "A few European countries do have worse excess mortality rates than the U.S., including Spain, which has the worst rate in the region. By the end of June, Spain’s mortality was 22.1% higher than normal, or 62% higher than America’s rate. But looking further out, through Aug. 23, Spain’s rate fell to 19.3%, or 42% higher than the U.S. As Spain is the most extreme example, Trump is cherry-picking this number — if that’s what he meant when he said in one case the U.S. is “over 60% better.”", "These data once again do not support Trump’s claim that Europe as a whole has significantly more excess death in 2020 than America, and begin to bear out the predictions University of Oxford economists Janine Aron and John Muellbauer made in August, when they said they expected the numbers to worsen for the U.S. as time went on.", "As they noted then, it’s premature to compare excess mortality given the ongoing pandemic, and it’s not entirely fair to relate the U.S. to Europe given America’s younger, less dense population.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]