["On October 21, BJP member Priti Gandhi shared an image of a police officer juxtaposed with a picture of a labourer balancing a stone grinder on her head. She wrote, “Meet Padmashila Tirpude, mother of two kids from Bhandara, Maharashtra. She used to sell heavy stone blocks (सिल-बट्टा) for a living. In 2017, she cleared her MPSC examination & became a police Sub-Inspector. Salute to her confidence & determination. Impossible is nothing!!” This was retweeted over 2,000 times. (archived linked)", "Meet Padmashila Tirpude, mother of two kids from Bhandara, Maharashtra. She used to sell heavy stone blocks (सिल-बट्टा) for a living. In 2017, she cleared her MPSC examination & became a police Sub-Inspector. Salute to her confidence & determination. Impossible is nothing!! pic.twitter.com/nlamiQXp5F", "— Priti Gandhi – प्रीति गांधी (@MrsGandhi) October 21, 2020", "A day later Chhattisgarh-based IPS officer Dipanshu Kabra also posted this image and wrote, “Circumstances can’t stop your success. Luck may put hurdles in your way but how to build a bridge to success is something to be learnt from Bhandara, Maharasthra’s Padmashila Tirpude. She made a living by making stone grinder and selling them and cleared MPAC to become a sub-inspector of police.” This was liked over 1,500 times (archived link). The photo is being circulated on Facebook and Twitter along with the hashtag #पद्मशीला_तिरपुडे (#Padmashila_Tirpude).", "This was also reported by news website ICB24, Patrika, Ambikapur City. In the past few days, several YouTube channels have also been uploading videos about her.", "Alt News performed a keyword search on Google and came across a report by Maharasthra Times (MT) about the two photographs. Padmashila Tirpude has denied that she is the labourer in the picture. In the interview to MT, she revealed that she studied BA from Yashwantrao Chavan Open University and cleared the Maharashtra Public Service Commission (MPSC) exam.", "Tirpude’s success story has been documented by Yashwantrao Chavan Maharashtra Open University (view PDF page 13). It includes the viral image of Tirpude with her family in back and white. As per this essay, her husband was a labourer. This image can be traced to 2013 when Maharasthra-based Sakal News tweeted Tirupde’s family photo with the text, “Labourer’s wife becomes an inspector (मजुराची बायको झाली फौजदार!)”", "Alt News reached out to Maharashtra-based journalists who said that Tirpude is currently serving in Nagpur. Speaking with Alt News, the officer confirmed, “This image [of the labourer] has been shared on social media for a few years now. I’m not the women in the saree but the woman in the police uniform is me.”", "The misleading claims about inspector Tirupde date back to 2017. Facebook user Pravin J Gupta posted the viral image, and it was shared close to 10,000 times. We also found such posts on Twitter from 2017 (1,2).", "This slideshow requires JavaScript.", "An image of Padmashila Tirpude, a Maharasthra-based police officer, has been circulating on social media since 2017 with the claim that she used to make a living by selling stone grinders before becoming a police officer. An image of a labourer was shared to support the claim. Tirpude told Alt News that the story is false.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]