["By Lori Robertson", "Posted on January 8, 2016", "Democratic presidential candidate Bernie Sanders says that the American people “understand that something is profoundly wrong when the 20 richest people in our country own more wealth than the bottom half of the American population — 150 million people.” That statistic is correct, according to an analysis from a left-leaning think tank.", "However, that analysis also found that the bottom 40 percent of Americans have a combined negative net worth. That means that one doesn’t have to be among the top 20 in terms of wealth to have more net worth than millions of Americans.", "In fact, any single individual with a positive net worth — including Sanders — has more wealth than the bottom 40 percent combined.", "Sanders made the claim in a Jan. 5 speech about Wall Street in which he stressed inequality in America, one of his main campaign topics. A reader asked us to “verify the accuracy of this unbelievable statement.” Whether the wealth statistic is “profoundly wrong” or “unbelievable” is of course a matter of opinion. We offer an explanation of the figure and context.", "The Vermont senator is referring to a December 2015 report titled “Billionaire Bonanza: The Forbes 400 and the Rest of Us” by researchers with the Institute for Policy Studies. Sanders’ claim comes from the report’s top key finding: “America’s 20 wealthiest people — a group that could fit comfortably in one single Gulfstream G650 luxury jet –­ now own more wealth than the bottom half of the American population combined, a total of 152 million people in 57 million households,” the report says.", "The report, by the think tank’s Chuck Collins and Josh Hoxie, a former Sanders staffer, bases its numbers for the general population on the Federal Reserve’s 2013 Survey of Consumer Finance. “Wealth” or “net worth” is not a measure of income, but instead the difference between assets and liabilities, or debts, owed. Their figure of 152 million people is extrapolated from the total number of households. The report explains: “The total number of households (115,610,216) multiplied by average persons per household (2.63) divided in half is 152 million people.”", "In the end notes, the report says that the bottom 40 percent of Americans actually have a combined negative net worth, due to a high negative net worth of only the bottom 12 percent. As the report says, this skews that total net worth of the 40 percent — and consequently, the bottom 50 percent, too.", "“Billionaire Bonanza,” end notes: According to our calculations, the bottom 40 percent combined have a negative net worth, a figure that becomes positive in the 41 percentile. Only 12 percent have negative net wealth, but the large negative wealth of the bottom percentiles skews the bottom figures downward.", "This doesn’t mean that the top 20 people haven’t amassed considerable wealth, no matter how the numbers are sliced. The report says that the top 20 people have a combined net worth of $732 billion in 2015. The bottom 50 percent of Americans have a combined net worth of $676.14 billion, also in 2015 numbers. (The report relies on the Federal Reserve’s 2013 numbers and adjusts them for inflation.)", "The top 20 still sit in a class among themselves even if we take out the bottom 12 percent of Americans, whose negative net worth brings the bottom 50 percent’s figure down. Hoxie provided us with figures for each percentile. If that 12 percent were left out, the rest of the bottom half of the population — percentiles 13 through 50 — have a combined net worth of $1 trillion. That’s more than the $732 billion owned by the top 20 people, but that’s also 20 people compared with about 116 million.", "Per capita, the top 20 have $36.6 billion in net worth each. That’s well more than even the 99th percentile, which starts at $7.9 million.", "But the gap Sanders cites is due not only to the wealthiest having so much wealth — it’s due to the poorest, in terms of assets, having negative net worth.", "Since the bottom 40 percent have a combined negative net worth, one only has to have a net worth of zero to be wealthier than that. If your house is worth more than you owe and you have little to no additional debt — or even if you have no assets but no debt — you, too, would be wealthier than the bottom 40 percent combined.", "Sanders, in fact, is wealthier than the bottom 40 percent by this measure. CNN reported in May that Sanders “has an estimated net worth of $330,507, making him the poorest candidate currently in the race.” But that also makes him richer than the bottom 40 percent of the American population combined.", "It’s important to note that having just $1 of positive net worth wouldn’t make someone wealthier than every individual who’s in the bottom 40 percent. The negative net worth for that 40 percent is a combined figure — skewed, again, by the large negative figures for some. The 30th percentile, for instance, starts at $14,800 of net worth.", "Gary Burtless, a senior fellow in economic studies at the Brookings Institution, told us that Sanders’ figure is a striking way of saying what economists say — that wealth is more unequal than income. Burtless said the fact that so many Americans have negative net worth wasn’t surprising — “how many 20-year-olds have positive net worth?” he asked.", "Those 20-somethings may well be earning income, but have no assets and perhaps student loan debt. They may not be suffering, but their balance sheets don’t look so good.", "Burtless gave another example of those counted as having no or negative net worth — senior citizens with no assets and whose monthly Social Security checks don’t count as wealth, by the Federal Reserve’s definition.", "At the other end of the spectrum are the very wealthy, whose total worth, Hoxie noted in an email to us, is difficult to pinpoint. Hoxie and his coauthor, Collins, used the 2015 Forbes Magazine Forbes 400. “It’s incredibly important to keep in mind that the figures for wealth at the top are nearly certain to be significantly underestimated,” he said. “As we cite in our report, the use of offshore tax havens as well as complex trusts by the ultra wealthy make it effectively impossible to truly gauge how much wealth is held by the ultra wealthy.”", "https://www.sharethefacts.co/share/cd7a4c19-8347-4e0e-af4a-dd7d5629cc40", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]