["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The morning before he was scheduled to speak at the Democratic convention in Philadelphia, Vice President Joe Biden made an appearance on MSNBC's Morning Joe program, where the topic quickly turned to foreign policy and Republican presidential nominee Donald Trump.", "\"Some of the things he says, like for example, I know he's trying to be tough but he's going to go out and carpet bomb,\" said Biden.", "\"You want to make friends and influence people in the Middle East? So you're going to go carpet bomb innocent people and bad people at the same time, and that's going to help us fight against ISIS and Daesh?\" Biden said. \"I mean, the things he says are — are — are — make absolutely no sense.\"", "Carpet bombing is the strategy where the military indiscriminately bombs everything within a predetermined area regardless of whether civilians are present.", "A few hours later, at a news conference, Trump said Biden had lied about his position.", "\"I never said I wanted to carpet bomb,\" Trump responded. \"That was Ted Cruz.\"", "Who's correct here?", "We contacted a Biden spokeswoman but didn't receive a reply.", "So we searched the transcripts of major interview shows and Trump rallies and could find no instance where Trump called for carpet bombing.", "Instead, the Republican has repeatedly said he would \"bomb the hell out of ISIS,\" with no reference to carpet bombing or any comparable tactic.", "Some examples: He's said he would \"bomb the hell out of them\" to destroy ISIS's oil-producing capacity, then send in United States oil companies to take that oil because \"there is no Iraq\" (Fox News, June 16, 2015);  \"I'd bomb the hell out of the oil fields. I'd then get Exxon, I'd then get these great oil companies to go in. They would rebuild them so fast your head will spin\" (CNN, July 8, 2015).", "And this July 8, 2015, exchange with NBC's Katy Tur:", "Trump: \"With ISIS, you kill them at the head. You take the oil. That’s where they’re getting their money. If you bomb the hell out of it, you bomb the hell out of it. You’ve got to stop their wealth. They have tremendous wealth.\"", "Tur: \"What about civilians?\"", "Trump: \"I'm talking about oil. I’m talking about oil areas. I'm not talking about civilian areas.\"", "Tur: \"Civilians are near oil areas.\"", "Trump: \"Oh, give me a break, Katy. Go ahead. Next question.\"", "Trump is also correct that Cruz was the candidate who called for carpet bombing.", "The Texas senator proposed the strategy in a Dec. 5, 2015, speech, promising that \"we will utterly destroy ISIS. We will carpet bomb them into oblivion. I don't know if sand can glow in the dark, but we're going to find out.\"", "Cruz repeated it several times throughout the campaign but tried to redefine carpet bombing by saying he did not want civilians to be targeted. (PolitiFact concluded in December 2015 that Cruz's definition, saying that only enemy soldiers would be bombed, was essentially the opposite of carpet bombing.)", "So Trump was right and Biden was wrong.", "We should also note that Biden isn't the only Clinton enthusiast to level that accusation against Trump.", "Four days later, on ABC's This Week with George Stephanopoulos, retired Marine Corps General John Allen, who commanded U.S. forces in Afghanistan, made a similar claim. Allen, who spoke at the Democratic convention, has endorsed Clinton.", "\"What we do have to do, George, is listen to what (Trump) has been saying about our military,\" Allen said. \"He's called it a disaster. He says our military can't win anymore. That's a direct insult to every single man and woman who's wearing the uniform today. He's talked about needing to torture. He's talked about needing to murder the families of alleged terrorists. He's talked about carpet-bombing ISIL.\"", "\"Who do you think is going to (be) carpet-bombed when all that occurs?\" Allen said. \"It's going to be innocent families.\"", "Our ruling", "Biden said that Donald Trump \"is going to go out and carpet bomb.\"", "Trump has made it clear that he's not going to be reluctant to bomb ISIS, but the candidate has not, as far as we could find, called for a practice that includes bombing civilians, which is what carpet bombing can entail. It was another GOP candidate, Ted Cruz, who called for carpet bombing.", "We rate Biden's claim as False.", "https://www.sharethefacts.co/share/f4590925-b207-4146-81aa-f6940c99f7c6", "YouTube, \"Full Speech: Donald Trump Rally in Doral, Florida (July 27, 2016),\" Donald Trump Speeches & Events channel; \"VP Joe Biden On Donald Trump, ISIS, Working Class Voters (Full Interview) | Morning Joe | MSNBC,\" MSNBC channel, both July 27, 2016; \"Ted Cruz at the Rising Tide Summit,\" Ted Cruz channel, Dec. 5, 2015", "Congressional Quarterly, \"Vice President Biden Interviewed on MSNBC,\" July 27, 2016; \"George Stephanopoulos Hosts ABC's 'This Week,'\" July 31, 2016; \"Republican Presidential Candidate Donald Trump Interviewed on Fox News,\" June 16, 2015; \"Republican Presidential Candidate Donald Trump Interviewed on Fox News,\" June 17, 2015; \"GOP Presidential Candidate Donald Trump Interviewed on CNN,\" July 8, 2015; \"GOP Presidential Candidate Donald Trump Interviewed on MSNBC,\" July 8, 2015; \"Jake Tapper Hosts CNN's 'State of the Union,'\" Nov. 22, 2015    (subscription required)", "PolitiFact, \"Ted Cruz misfires on definition of 'carpet bombing' in GOP debate,\" Dec. 16, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]