["Did India’s first Prime Minister Jawaharlal Nehru write a letter to then Prime Minister of Britain Clement Attlee in 1945, referring to Subhas Chandra Bose as a ‘war criminal’? Did Nehru allude to Bose supposedly entering ‘Russian territory’? A facsimile of a letter purportedly written by Nehru and addressed to Attlee has been circulating on social media platforms for the last couple of years.", "On February 15, 2023, while sharing what appears to be a screenshot of a PDF document, BJP leader Tajinder Pal Singh Bagga wrote on Twitter, “The British used to like a traitor like Nehru because he used to lick their boots.” (Originally in Hindi, translated by Alt News)", "नेहरू जैसे देश ग़द्दार को अंग्रेज इसी लिए पसंद करते थे क्यूँकि वो अंग्रेजों के तलवे चाटता था। pic.twitter.com/sN2xjSQWK9", "— Tajinder Pal Singh Bagga (@TajinderBagga) February 15, 2023", "In 2022, RIshi Bagree amplified the same claim.", "That infamous letter of Jawaharlal Nehru to British PM Atlee, calling Netaji Subhas Chandra Bose a “war criminal”. pic.twitter.com/kxaigpA4IK", "— Rishi Bagree (@rishibagree) January 21, 2022", "It was also shared in 2018.", "भगतसिंह सिंह की मर्सी पिटीशन का प्रस्ताव नेहरू ने ठुकराया भगतसिंह को एक दिन पहले फांसी, श्यामा प्रसाद मुखर्जी ने आजाद हिन्द फौज के सिपाहियों को पेंशन का प्रस्ताव रखा नेहरू की नजर में आतंकवादी.? चन्द्र शेखर आजाद नेहरू से मिलकर अल्फ्रेड पार्क में रुके। अंग्रेज पुलिस पहुंच गई कारण? pic.twitter.com/DtTyJQIh8U", "— 💕Sunita Gupta💕 (@Sunitagupta__) October 21, 2018", "The ‘letter’ allegedly written by Nehru castigates the Russians for allowing Bose to enter their country, calling it a ‘clear treachery and betrayal of faith by the Russians’. The letter further exhorts Attlee to ‘take note of it’ and ‘do what you consider proper and fit’. It may be noted that there are several versions of this letter doing the rounds. Alt News found that BJP leader Subramaniam Swamy had made a claim in December 2014 about a letter supposedly dictated by Nehru.", "Prima facie, the image that is shared repeatedly on social media appears to be fake. It is replete with errors. Clement Attlee has been referred to as Clement ‘Attle’, and the first line of the letter states, ‘I understand from reliable source’ (instead of ‘I understand from a reliable source’). The letter is dated December 27, 1945. It surprisingly refers to Russia as ‘an ally of the British-Americans’, when the opposite was true for 1945 when the world was divided into opposing ideological blocs. There are two things worth noting here:", "How true is the claim that India’s first Prime Minister had called Bose a ‘war criminal’? Or that he was cognizant of Bose supposedly being alive and escaping to Russia, referring to the same in his communication with Clement Attlee? Alt News found that a copy of this letter makes an appearance in the files related to Subhas Chandra Bose which were declassified by the NDA government in January 2016.", "File no.915/11/C/6/96 declassified by the PMO contains a letter written by Pradip Bose, the nephew of Subhas Chandra Bose to then Prime Minister Atal Bihari Vajpayee in April 1998. The letter encloses a paper written by Pradip Bose titled, ‘A Note on the Mysteries of Netaji’s Life and Death’. It is this very paper which cites the letter purportedly written by Nehru to Attlee. Apart from the paper by Pradip Bose, the other place where this letter finds mention is the book ‘Subhas Bose and India Today: A New Tryst with Destiny?’ written by Pradip Bose. It has also been referred to in the book ‘Judgement: No Aircrash, No Death’ penned by Lt. Manwati Arya who was part of the Indian National Army (INA).", "It must be taken into account, however, that these are not the words of Jawaharlal Nehru. The letter forms part of the testimony claimed to have been given by Shyamlal Jain, who was the stenographer of Nehru. Jain had supposedly deposed before the G D Khosla commission which was set up in 1970 to look into the mysterious disappearance of Subhas Chandra Bose. The contents of the letter are his recollection of what Nehru had supposedly dictated to him in December 1945. This is mentioned in the book by Pradip Bose.", "Jain’s testimony had supposedly not been accepted by the one-man commission which concluded that Bose had died in the air crash of August 1945 at Taipei in Taiwan. The above testimony doesn’t have the spelling errors that the image that is shared on social media does. This indicates that the image shared on social media is photoshopped so as to make it look like an original old document.", "Jain in his testimony, according to Pradip Bose’s book, had stated that Nehru had dictated the letter on either December 26 or December 27, 1945 at Congress leader Asaf Ali’s residence in Delhi. Alt News decided to dig deeper into this claim to determine the whereabouts of both Jawaharlal Nehru and Asaf Ali on the said days.", "Alt News chanced upon a blog written in 2016 by a social media user @raattai, which chronicled the whereabouts of both Jawaharlal Nehru and Asaf Ali during the days when the letter was purportedly written. This is what we found.", "Asaf Ali", "Congress leader Asaf Ali, at whose residence in Delhi the letter is claimed to have been written, was in Bombay on December 25, 1945. This is confirmed by a report by the Indian Express dated December 27, 1945 which stated that Asaf Ali met Sardar Vallabhbhai Patel on December 26, 1945. Another report mentions that Ali left Bombay for Delhi on December 27, 1945.", "Jawaharlal Nehru", "According to a report by the Indian Express dated December 28, 1945, Jawaharlal Nehru was in Patna, Bihar on December 25, 1945.", "On the same day, Nehru had travelled to Allahabad where he was for the next few days. This becomes clear from a news report by the Indian Express, and corroborated by a letter he wrote to V K Krishna Menon from Allahabad on December 26. The letter is available in ‘Selected works of Jawaharlal Nehru Volume XIV’ available on Nehru Portal, a repository of the works of Jawaharlal Nehru.", "We also found another source, Jawaharlal Nehru Correspondence 1903-1947, which is a compendium of all the letters written by Nehru in the designated time period. Page 36 of this compilation categorically mentions that Nehru had written letters to Burma’s Aung San U on December 26, 1945 and December 27, 1945. In both these letters, his location is specified as Allahabad.", "Records suggest that Nehru was in Allahabad during the end of December, 1945 and NOT in Delhi as claimed by Shyamlal Jain in his testimony. The preface to The Discovery of India was written by Nehru at Anand Bhawan, Allahabad on December 29, 1945.", "The fact of the matter is that the contents of the letter are claimed to be the testimony of Shyamlal Jain before the G D Khosla commission in Pradip Bose’s book. In his testimony, Jain claimed the content to be a dictation given by Nehru on either December 26, 1945 or December 27, 1945 at Congress leader Asaf Ali’s residence in Delhi. Jain had supposedly reproduced it from his memory. It is NOT an original letter written by Nehru. However, historical records suggest that Nehru was in Patna and Allahabad from December 25 to December 29,1945, and Asaf Ali was at Bombay on December 25 and December 26, 1945. The contents of the letter circulating on social media and available in the declassified documents are inconsistent with the whereabouts of both Nehru and Asaf Ali, and do not withstand scrutiny.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]