["About this rating", "On several occasions before he died, former Confederate General Robert E. Lee expressed opposition to proposals to erect Civil War monuments and memorials, including some devoted specifically to the Confederacy.", "It's unclear whether, or to what degree, Lee's antipathy toward Confederate monuments was more pronounced than his antipathy toward building Civil War monuments in general.", "A century-and-a-half-old debate over the propriety of erecting statues and monuments to the Confederacy in the post-Civil War era came back with full force in August 2017 when a white nationalist rally protesting the planned removal of a statue of Confederate General Robert E. Lee in Charlottesville, Virginia, turned violent, culminating in a vehicular attack that killed one person and injured 19.", "The incident sparked an accelerated effort by states and municipalities in various parts of the country to remove such monuments, of which there are approximately 750 spread across the U.S., according to the Southern Poverty Law Center (SPLC). Proponents of their removal say the continued presence of the monuments confers undue dignity on a faction that fought to preserve the institution of slavery and the ethos of white supremacy that underlays it.", "Those who defend the markers, on the other hand — among the most prominent of whom is President Donald Trump — say they deserve to stand as reminders of America's past:", "Sad to see the history and culture of our great country being ripped apart with the removal of our beautiful statues and monuments. You.....", "— Donald J. Trump (@realDonaldTrump) August 17, 2017", "...can't change history, but you can learn from it. Robert E Lee, Stonewall Jackson - who's next, Washington, Jefferson? So foolish! Also...", "— Donald J. Trump (@realDonaldTrump) August 17, 2017", "...the beauty that is being taken out of our cities, towns and parks will be greatly missed and never able to be comparably replaced!", "— Donald J. Trump (@realDonaldTrump) August 17, 2017", "A majority of Americans side with the president, an August 2017 PBS NewsHour/NPR/Marist poll found, with 62 percent of respondents agreeing that such monuments ought to remain in place as \"historical symbols.\"", "One of the most frequently cited voices in opposition to Confederate monuments, ironically, is that of the white, slave-owning Confederate General Robert E. Lee:", "So about that Robert E Lee statue... here's what the man himself said about Civil War monuments: pic.twitter.com/9pZTYiDddX", "— Maddox (@maddoxrules) August 16, 2017", "Even Robert E. Lee opposed monuments to Robert E. Lee https://t.co/hnnist1GYO pic.twitter.com/Pz4cIsNMcj", "— Alexander Clarkson (@APHClarkson) August 17, 2017", "That Lee expressed such views, and did so more than once between the end of the Civil War and his death in 1870 is confirmed by historian and biographer Jonathan Horn, who wrote in 2016:", "In April 1865, after four years of civil war, Lee surrendered the Confederate Army of Northern Virginia and soon afterward accepted the presidency of Washington College in Lexington, Virginia. Letters seeking support for memorial projects received reluctant responses from the general-turned-educator, according to documents at the University of Virginia and the Library of Congress. Lee worried that building memorials so soon after the war would anger the victorious Federals.", "\"As regards the erection of such a monument as is contemplated, my conviction is, that however grateful it would be to the feelings of the South, the attempt in the present condition of the country would have the effect of retarding, instead of accelerating its accomplishment, and of continuing, if not adding to, the difficulties under which the Southern people labour,\" he wrote.", "In June 1866, Lee criticized a plan to build a monument to Gen. Thomas \"Stonewall\" Jackson, whose fatal wounding at Chancellorsville three years prior had deprived the Army of Northern Virginia of its best corps commander. How could Lee ask war-ravaged families to contribute money for memorials when they lacked funds for food? \"I do not think it feasible at this time,\" he wrote.", "It's not strictly accurate to say that Lee's objections to memorializing the Civil War applied only to Confederate monuments, however. A letter he wrote to David McConaughy of the Gettysburg Battlefield Memorial Association in 1869, in which he turned down an invitation to participate in their preservation efforts, made clear his conviction that it was more important for the nation to heal than to perpetuate the memory of the \"civil strife\" it had so recently undergone. The letter was quoted in a 21 November 1957 article in the Chicago Tribune:", "\"My engagements will not permit me to be present, and I believe if there I could not add anything material to the information existing on the subject,\" Lee wrote to David McConaughy. \"I think it well, moreover, not to keep open the sores of war, but to follow the examples of those nations who endeavored to obliterate the marks of civil strife and to commit to oblivion the feelings it engendered.\"", "Horn quotes this passage as well, saying of Lee", "Rather than raising battlefield memorials, he favored erasing battlefields from the landscape altogether.... Lee feared that these reminders of the past would preserve fierce passions for the future. Such emotions threatened his vision for speedy reconciliation. As he saw it, bridging a divided country justified abridging history in places.", "Lee's zeal for North-South reconciliation verged on the evangelical, judging from some of his postwar statements. Another of his biographers, Charles Bracelen Flood, recounted an anecdote that speaks to Lee's conviction that the formerly warring factions — particularly the side that lost, his side, the South — needed to forgive and forget and get on with the business of being Americans:", "Lee knew that the war was over and that everything depended on a new attitude for a new day. He was taken to call on a lady who lived north of Lexington, and she promptly showed him the remains of a tree in her yard. All its limbs had been shot off by Federal artillery fire during Hunter's raid, and its trunk torn by cannonballs. The woman looked at him expectantly as she showed him this memento of what she and her property had endured. Here was a man who would sympathize.", "Lee finally spoke. \"Cut it down, my dear Madam, and forget it.\"", "Little could he have imagined that we would still be debating the issue some 150 years hence.", "Desjardins, Lisa.   \"Robert E. Lee Opposed Confederate Monuments.\"\r\n   PBS NewsHour.   15 August 2017.", "Dubenko, Anna.   \"Right and Left on Removal of Confederate Statues.\"\r\n   The New York Times.   18 August 2017.", "Fellman, Michael.   The Making of Robert E. Lee.\r\n   Baltimore: Johns Hopkins University Press, 2003.   ISBN 9780801874116, p. 299.", "Fisher, John.   \"Letter Bares Lee Opposition to memorial.\"\r\n   Chicago Daily Tribune.   21 November 1957.", "Flood, Charles Bracelen.   Lee: The Last Years.\r\n   Boston: Houghton Mifflin Harcourt, 1998.   ISBN 9780395929742, p. 136.", "Fortin, Jacey.   \"The Statue at the Center of Charlottesville's Storm.\r\n   The New York Times.   13 August 2017.", "Helm, Joe.   \"Charlottesville Prepares for a White Nationalist Rally on Saturday.\"\r\n   The Washington Post.   10 August 2017.", "Horn, Jonathan.   \"What Robert E. Lee Can Teach Us About Confederate Memorials.\"\r\n   CNN.   11 June 2016.", "Morris, Tim.   \"Trump Aligned with Most Americans on Confederate Monuments: Opinion.\"\r\n   The Times Picayune.   18 August 2017.", "Somin, Ilya.   \"Why Slippery Slope Arguments Should Not Stop Us From Removing Confederate Monuments.\"\r\n   The Washington Post.   15 August 2017.", "Stanglin, Doug and Cavallaro, Gabe.   \"1 Dead, 19 Injured as Car Hits Crowd AFter a 'Unite the Right' Rally in Charlottesville; Driver in Custody.\"\r\n   USA Today.   12 August 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]