["About this rating", "In February 2020, we received multiple inquiries from readers about the accuracy of reports which claimed that 2020 Democratic presidential candidate Mike Bloomberg had once said health care providers should not treat elderly patients with cancer due to the improbability of their recovery and as a means of prioritizing treatments for younger patients and stemming a rise in health care costs and hospital overcrowding.", "On Feb. 18, the right-leaning Daily Caller website published an article with the headline \"Mike Bloomberg Said Elderly Cancer Patients Should Be Denied Treatment to Cut Costs.\" The article reported that:", "Billionaire and Democratic presidential candidate Michael Bloomberg said in a 2011 video that elderly cancer patients should be denied treatment in order to cut health care costs. \"All of these costs keep going up, nobody wants to pay any more money, and at the rate we’re going, health care is going to bankrupt us,\" said Bloomberg, who was then New York City’s mayor.", "\"'We’ve got to sit here and say which things we’re going to do, and which things we’re not, nobody wants to do that. Y’know, if you show up with prostate cancer, you’re 95 years old, we should say, ‘Go and enjoy. Have a nice [inaudible]. Live a long life. There’s no cure, and we can’t do anything.’ If you’re a young person, we should do something about it,” Bloomberg said in the video.", "The same article was later republished by the National Interest magazine, and on Feb. 17 the right-leaning Red State blog published an article with a headline that stated \"Bloomberg Suggests Denying Care to Elderly Patient With Cancer Because Not Cost Effective in 2011 Video.\"", "All three articles contained a 40-second video clip of Bloomberg sitting with a group of men, making the following remarks:", "[...] And what things they can't fix right away. If you're bleeding, they'll stop the bleeding, if you need an X-Ray, you're going to have to wait. All of these costs keep going up, nobody wants to pay any more money, and at the rate we're going, health care is going to bankrupt us. So not only do we have a problem, it's going to bankrupt us, and we've got to sit here and say which things we're going to do and which things we're not. Nobody wants to do that. If you show up with prostate cancer and you're 95 years old, we should say 'Go and enjoy, have a nice [inaudible], lead a long life.' There's no cure and you can't do anything. If you're a young person, we should do something about it. Society's not willing to do that yet. So we're going to bankrupt us, and we're not looking at [...]", "Bloomberg undoubtedly made the remarks shown in that video. Although the 40-second clip was cut from longer footage, it was not doctored or further edited. Likewise, the video did not present the remarks in their full and proper context, but that did not serve to substantially alter or misrepresent the sense or meaning of what Bloomberg said. He did indeed propose that, in light of rising health care costs and hospital overcrowding in New York, health care providers should not attempt to treat elderly patients with terminal cancer, instead prioritizing younger patients with better prospects of recovery.", "The conversation shown in the video took place in February 2011. Bloomberg was \"sitting shiva\" (a Jewish mourning ritual) with the family of Rabbi Moshe Segal, a Brooklyn man who, according to his family, spent 73 hours in a New York emergency room before his death. Shimon Gifter, a Brooklyn photographer, recorded more than nine minutes of Bloomberg's visit and posted it to his YouTube channel.", "The full conversation can be viewed below. In the interest of providing as much context as possible, the following is an unedited transcript of the section of the discussion during which Bloomberg made his comments about treating elderly prostate cancer patients. The first few seconds shows Bloomberg entering the room, greeting and shaking hands with Segal's family members, some of whom thank him for his visit. Bloomberg, who was mayor of New York City at that time, sits and observes that the deceased was \"young.\" A brother of Segal replies \"Very young,\" then quickly segues into a conversation about health care:", "Segal's brother: ...I apologize for bringing up conditions in New York City during this [visit], but in light of my brother's death, I must tell you that we have, I know you know this, but from personal experience the overcrowding in the emergency rooms is insane. He was there for 73 hours [inaudible] —", "Bloomberg: It's going to get worse with the health care bill [the Affordable Care Act] and with the governor's cutbacks, because the governor's cutbacks — which, he may not have any choice in all fairness to the governor — but there'd be less money, some of these small hospitals will close, some of these other programs, and people will come to the HHC [New York Health and Hospitals Corporation] hospitals, and that's —", "Segal's brother: — They'll be there for days, [inaudible].", "Bloomberg: Well, they try to decide what things they can fix right away and what things they can't fix right away. If you're bleeding, they'll stop the bleeding, if you need an X-Ray, you're going to have to wait. That's just — all of these costs keep going up, nobody wants to pay any more money, and at the rate we're going, health care is going to bankrupt us. So not only do we have a problem, it's going to bankrupt us, and we've got to sit here and say which things we're going to do and which things we're not. Nobody wants to do that. If you show up with prostate cancer and you're 95 years old, we should say, 'Go and enjoy, have a nice [inaudible], lead a long life.' There's no cure and you can't do anything. If you're a young person, we should do something about it. Society's not willing to do that yet. So we're going to bankrupt us, and we're not looking at prophylactic care. We're not trying to take care of things so we don't get sick. Nobody ever says thank you for keeping you from getting sick, they say thank you if you're sick and we cure you [...].", "We invited Bloomberg's presidential campaign to provide any context, background or additional information that might impinge upon a viewer's understanding of his remarks. We also asked the campaign whether Bloomberg stood by what he said. We did not receive a response of any kind in time for publication.", "Hasson, Peter.  \"Mike Bloomberg Said Elderly Cancer Patients Should Be Denied Treatment to Cut Costs.\"\r\n    The Daily Caller/The National Interest.  18 February 2020.", "Arama, Nick.  \"Bloomberg Suggests Denying Care to Elderly Patient With Cancer Because Not Cost Effective in 2011 Video.\"\r\n    Red State.  17 February 2020.", "The Yeshiva World.  \"While Paying Shiva Call To Segal Family, Bloomberg Says Obamacare Will Make Things Worse.\"\r\n    14 February 2011.", "Added the word \"prostate\" to existing claim statement to more precisely reflect the quote in question.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]