["About this rating", "In 2016, a video went viral that supposedly showed a bear chasing a snowboarder down a mountain. Since that video was fake — it featured computer generated imagery — we were skeptical when we came across a similar video in January 2021 supposedly showing a bear chasing a skier down a mountain.", "This is a real video.", "The Romanian news outlet Digi 24 reported that this video was filmed on a ski slope in Predeal, Romania. The incident was filmed by multiple people on the chairlift who watched the scene unfold below. Digi 24 reports that the people on the chairlift yelled (translated via Google):", "\"Give it faster, give it faster! Come on, the bear is chasing you ! Give it faster! God forbid, don't look back!\"", "Here's another video of the incident:", "The man in the video escaped unharmed.", "Ion Zaharia, the county gendarmerie inspectorate, said that when the person realized what was happening, the skier threw a backpack on the ground. This distracted the bear and allowed the person to ski to safety.", "A video report from Obiectiv 3 shows the bear ending the pursuit after finding the bag.", "Officials on the mountain said that they may — as they have done when similar situations arose in years past — attempt to relocate the bear away from the ski slopes.", "This incident may seem unusual to some viewers as they have been told (incorrectly) that one way to evade a bear is to run (or ski) downhill. Bears, however, can run downhills at surprising speeds. According to the National Wildlife Federation, bears are nearly as fast as horses, and can reach speeds of 35 mph:", "Myth: Bears can’t run downhill.", "If you’re being chased by a bear, don’t run downhill! Bears can run as fast as a horse (35 mph), and they can do it uphill, downhill, and everything in between. A bear can outrun you no matter what, so if you see one in the wild do not try to run away from it. Instead, you should stand tall, wave your arms, and talk loudly but calmly. Back away slowly, but stop moving if the bear follows you.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]