["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Editor's note: This item was initially published May 24, 2013, as a Mostly False because of the limited supporting information we received Sen. Mitch McConnell's office. The office cited a letter sent to Humana, a government contractor for Medicare Advantage. We found that letter provided relatively little support for the senator's claim and rated it Mostly False. After the item was published, we received a note from Michael Cannon of the libertarian CATO Institute, who pointed out that we should have considered a 2010 letter from Sebelius to an insurance industry group. We found that letter actually provided more support for McConnell, even though his office had apparently been unaware of it. On May 28, we changed our rating to Mostly True and archived our previous fact-check here.", "Sen. Mitch McConnell says the Obama administration has created a \"culture of intimidation\" in Washington.", "One example: Obamacare.", "\"Over at HHS back during the Obamacare debate, Secretary (Kathleen) Sebelius sent out a directive to help insurance companies telling them they couldn't inform their policyholders of what they thought the impact of Obamacare would be on them.\" McConnell, R-Ky., said on Meet the Press on May 19, 2013.", "A McConnell spokesman pointed us to a 2009 letter from the Centers for Medicare and Medicaid Services, often known as CMS, to Humana. The agency wrote the letter to respond to mailings that Humana sent to its nearly 1 million Medicare Advantage and Part D patients. In bold type, Humana told its enrollees that \"millions of seniors and disabled individuals could lose many of the important benefits and services that make Medicare Advantage health plans so valuable.\"", "In the letter, CMS told two Humana executives that CMS was concerned that \"this information is misleading and confusing to beneficiaries, represents information to beneficiaries as official communications about the Medicare Advantage program, and is potentially contrary to federal regulations and guidance.\"", "The letter was relatively narrow in scope: It dealt with Humana, as a government contractor, and the information it was giving Medicare beneficiaries.", "It provides little support for McConnell’s claim because it said nothing about private insurance companies communicating with policyholders.", "It’s worth noting, too, that the Obama administration later clarified its rules saying Medicare Advantage contractors could communicate with Medicare beneficiaries about pending legislation as long as they did not use federal money to do so and they got permission from beneficiaries before sending them information about legislation or asking them to join advocacy efforts.", "Then another letter came to our attention.", "The AHIP letter", "Sebelius, the secretary of Health and Human Services, wrote to America’s Health Insurance Plans, or AHIP, on Sept. 9, 2010, a few months after Obamacare became law.", "In the letter, Sebelius accused insurance companies of spreading misinformation by saying Obamacare was to blame for expected premium increases.", "\"Given the importance of the new protections and the facts about their impact on costs, I ask for your help in stopping misinformation and scare tactics about the Affordable Care Act. Moreover, I want AHIP’s members to be put on notice: the Administration, in partnership with states, will not tolerate unjustified rate hikes in the name of consumer protections,\" Sebelius wrote.", "She said insurers would be required to justify any rate increases, that there would be state and federal reviews of increases that don’t appear justified, and insurers that have a record of unjustified increases would be excluded from the insurance exchanges set up by the law.", "Sebelius also disputed the insurance companies’ predictions that Obamacare would necessitate higher premiums and said any cost increases would be offset by savings built into the law.", "When the letter came out in 2010, Michael Cannon, the director of health policy studies at the libertarian CATO Institute, said Sebelius' letter was an attempt to \"intimidate those who say unflattering things about ObamaCare.\"", "\"What business does she have threatening insurers because they disagree with her in public?  ObamaCare gave the HHS secretary considerable new powers. Is one of those the power to regulate what insurers say about ObamaCare? Excluding insurers from ObamaCare’s exchanges is not a minor threat,\" Cannon wrote.", "An HHS spokesman told PolitiFact that the letter was in response to insurance companies using Obamacare as an excuse to raise premiums, and that the law gave the agency the authority to scrutinize excessive premium increases and require justifications from insurance companies.", "But we find Cannon's interpretation more accurate. The letter chastised the insurers for anti-Obamacare messages and threatened them with regulatory action.", "Our ruling", "McConnell said that Sebelius told insurance companies \"they couldn't inform their policyholders of what they thought the impact of Obamacare would be on them.\"", "Her letter to AHIP didn’t go quite that far, but Sebelius was definitely seeking to muzzle the insurers because she felt they were giving false, self-serving information. The letter sought to discourage them with a not-so-subtle threat of regulatory action. Although McConnell was exaggerating that the companies were prohibited from these communications, the talk of regulatory action was significant and could fairly be taken as an attempt to intimidate.", "We rate McConnell's claim Mostly True.", "NBC News, Meet the Press, May 19, 2013, transcript via CQ.com", "Email interview with Michael Cannon, CATO Institute, May 24, 2013", "CATO blog, \"Secretary Sebelius Slips on the Brass Knuckles,\" Sept. 10, 2010", "HHS press release, \"Sebelius calls on health insurers to stop misinformation and unjustified rate increases,\" Sept. 9, 2010", "PolitiFact, \"Medicare officials have treated Humana and AARP inconsistently on how they can communicate with seniors,\" Sept. 30, 2009", "Humana letter to Medicare Advantage customer, 2009", "CMS letter to Humana, Sept. 18, 2009", "Huffington Post, \"Humana Letter: GOP Defends Insurance Company's Misleading Anti-Reform Effort,\" Nov. 23, 2009", "New York Times, \"White House to Let Insurers Warn Medicare Recipients About Pending Health Bills,\" Oct. 17, 2009", "Government Accountability Office, \"Medicare Advantage: CMS Actions Regarding Plans’ Health Reform\nCommunications,\" Sept. 20, 2010", "CMS press release, \"Medicare issues new guidance to insurance companies on Medicare mailings,\" Sept. 21, 2009", "Email interview with Brian Cook, CMS spokesman, May 21-22, 2013", "Email interview with Michael Brumas, spokesman for Sen. Cruz, May 20, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]