["Since voters cast their ballots on Election Day, political observers have started to analyze how various racial and ethnic demographicgroups voted in the presidential contest.", "Len Necefer, an assistant professor of American Indian Studies at the University of Arizona and its Udall Center for Public Policy, offered his take Nov. 6 on Twitter, which other users shared on Facebook.", "Specifically, he analyzed support for President Donald Trump and former Vice President Joe Biden among members of the Navajo Nation.", "\"You want to know how much the Navajo Nation dislikes trump?\" Necefer wrote.", "\"1. of the 85,000 registered voters on Navajo 76,000 voted. 89% turn out.", "\"2. Of those 76,000 voters 74,000 voted for Biden & 2,000 for Trump.", "\"3. Biden's current lead in Arizona sits at about 40,000.\"", "Others shared a similar statistic to the second point – that 97% of the Navajo Nation voted for Biden.", "Tom Steyer, a former Democratic presidential hopeful, wrote on Facebook that \"in the three counties in Arizona that overlap with the Navajo Nation, 97% of the votes went to Joe Biden, securing his victory in the state.\"", "Steyer has not responded to requests for comment from USA TODAY.", "Robert Reich, the secretary of Labor under President Bill Clinton, also shared the 97% statistic on Twitter, which was posted by other users to Instagram. Reich told USA TODAY that he later updated his post on Facebook with more accurate statistics.", "More:Fact check: Post about stolen – and returned – Arizona ballots lacks context", "In a reply to his viral tweet, Necefer credited the statistics to an article last week in the Navajo Times. He also told USA TODAY that he relied on its analysis.", "The article claims that Apache, Coconino and Navajo counties – the three that overlap the Navajo Nation – reported 73,954 votes for Biden, compared with 2,010 votes for Trump.", "It also claims there was a 97% turnout for Biden compared with 51% statewide, so it appears to be the source for Steyer and Reich.", "The Navajo Times included a disclaimer that \"all the votes are not yet counted and all results listed are unofficial.\"", "But the results in the Navajo Times don't hold up against updated state totals, per the state website on Wednesday.", "Apache County reported 22,730 votes for Biden and 11,240 votes for Trump. Coconino County reported 44,609 votes for Biden and 27,043 votes for Trump. And Navajo County reported 23,383 votes for Biden and 27,657 votes for Trump.", "In total, that's 90,722 votes for Biden and 65,940 votes for Trump – about 58% to 42%.", "As for voter turnout, Apache County reported 67.09% turnout, per its website. Coconino County reported 80.62% turnout, per its website. And Navajo County reported 74.18% turnout, per its website.", "County-by-county information isn't a perfect indicator of support among Navajos or Native Americans.", "More:Fact check: States don't have more than 100% voter turnout in an election", "Of the 71,000 residents of Apache County, Native Americans make up 73%. Of the 108,000 residents of Navajo County, 43% are Native American, per the Arizona Republic.", "Both counties also include members of the Hopi Nation, in addition to the Navajo Nation.", "Necefer also told USA TODAY that the three counties \"also include large predominately white communities further south,\" including Winslow, Holbrook and Flagstaff.", "\"So the numbers you reference include those communities as well, which is why they do not line up,\" he wrote in an email. \"Some of these communities vote heavily Republican.\"", "Statewide in Arizona, the population is 6% Native American – about 424,955 people.", "As for the total vote in Arizona, as of Nov. 11, the state website reported 1,655,192 votes for Biden and 1,642,379 for Trump – a lead of 17,131 votes, or 49.44% to 49.05%.", "Eligible voters on the Navajo Nation – which also overlaps with New Mexico and Utah – alone number around 67,000. Precincts within the reservation ranged from 60-90% for Biden, per High Country News.", "Still, it's worth noting that a significant proportion of enrolled members of the tribe live off reservation, and therefore vote elsewhere.", "Though the statistics cited by Necefer were inaccurate, his point about strong Navajo disdain for Trump and support for Biden has been echoed by other community leaders.", "Navajo Nation President Jonathan Nez told the Fronteras Desk that \"overwhelmingly in these tribal nations, it went for Joe Biden and Kamala Harris.”", "Nez also said that events such as a meeting he had with Biden in Phoenix \"really inspired the Native American voters to come out to the polls and cast their votes for change.\"", "More:On the Navajo Nation, COVID-19 death toll is higher than any US state. Here's how you can support community relief.", "Clara Pratt, the tribal engagement director for Biden who was previously the director for the Navajo Washington Office, told the Navajo Times that she was proud of how the Native vote helped defeat Trump.", "“Tribal communities did this,” Pratt said. “We got so much shout-out. Just the attention that has been paid to Indian Country in this campaign is incredible and it’s a real testament to the power of the Native vote.\"", "Maps from the recent election show alignment between Arizona's 22 tribes and areas of the state that went for Democrats.", "“Historically, Native voters have one of the lowest voter turnout rates,” Pratt added. “But the power that we have when we show up, and to do this during a pandemic of all things, it was a testament to how important this election was … to many people.”", "The impact of COVID-19 on the Navajo and Native American communities also played a role in their vote.", "More:Native Americans battle COVID-19 and other voting obstacles as Election Day nears", "In May, the Navajo Nation had the highest per capita rate of COVID-19 cases in the U.S., per the High Country News. At the time, Nez criticized the Trump administration for its botched response to the pandemic.", "Still, not all Navajos are anti-Trump or Democrats.", "Council Delegate Edmund Yazzie – who supported Trump – told the Navajo Times that it's important not to underestimate Navajo Republicans.", "\"The Navajo people, there’s a lot of Republicans too, they’re growing,\" he said. \"We can’t just say ‘Democrat.'\"", "Myron Lizer, the vice president of the Navajo Nation, was also a proud supporter of Trump. He told the Associated Press that Native American values – hard work, family and ranching – align with Republicans more than Democrats.", "Based on our research, the posts are PARTLY FALSE. The statistics in the tweet by Necefer and posts by Steyer and Reich are inaccurate – possibly because they came from an article that cited returns before the full vote count was in. However, it is true that among the three Arizona counties that overlap the Navajo Nation, the vote went 58% to Biden and 42% to Trump. Some individual precincts on the Navajo Nation went up to 90% for Biden.", "Our fact-check sources:", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]