["A report by K24, a private TV station, archived here by AFP, stated that 60-year-old Teresa Estes had agreed to undergo FGM before a traditional wedding ceremony.", "Despite the practice being illegal, FGM is still carried out by rural communities in Kenya, such as the Pokot community in the Rift Valley area.", "Estes had previously lived among the Pokots for almost a decade and decided to hold a traditional wedding ceremony with her American husband in July 2019.", "But the erroneous report stated that she agreed to undergo FGM as part of the ceremony.", "“Cheigar agreed to undergo the cut and fully immerse herself in Pokot culture,” a journalist said, referring to Estes by her supposed nickname \"Cheigar\".", "The video on K24’s YouTube channel was viewed more than 4,000 times, before it was later deleted.", "The description read: “They say home is what you make it. Two foreign missionaries of American origin living in Baringo county today caused a stir after they tied the knot under the Pokot culture, including undergoing Female Genital Mutilation in order to fulfill the marriage customs. The colorful ceremony attracted a huge turnout of eager residents who were curious to witness the cultural spectacle.”", "The report also formed the topic of a discussion on another television show on Switch TV posted on Youtube and generated a number of articles that AFP has archived here, here, here and here.", "The same claims also spread on Facebook where they were shared as facts. Nairobinews, for instance, posted a link to an article on its Facebook page, which has more than 700,000 followers, archived here. It has since removed the story from its website.", "Other Facebook posts can be found here and here.", "Critical tweets shared articles with similar claims and tagged Kenyan authorities, while some online users called for the couple to be deported.", "Visibly shaken, Estes denied the claims that she herself had undergone FGM, which she said were humiliating and undermined her work.", "She said she came to Kenya in August 2010 as a missionary and had focused on preaching the gospel in the village of Chepungus, of some 500-600 residents. She said she helped girls to avoid undergoing FGM and forced marriages.", "“My credibility as a person who rescues girls from FGM is totally destroyed,” Estes said.", "Estes said she decided to hold a traditional wedding ceremony in the community after marrying Tony Estes a year and a half ago.", "“I have lived among these people for years and they consider me to be part of the family. So when my Pokot family heard I was getting married they wanted to have a Pokot wedding. I told my Pokot baba (father) that we will do the wedding but the dowry is just going to be symbolic. We will just have Tony buy a camel, bring gifts in some sodas and other things which we would use to cater for the feast afterward, not a real dowry,” she said.", "“We went through the traditional ceremony, they poured milk on us as a sign of blessing but I did not go through FGM,” she said.", "“FGM (female genital mutilation)  is a barbaric practice that leaves young girls literally scarred for life.  I help find sponsors to put the girls through school,\" reads a statement on her website.", "A day after the reports of Teresa’s circumcision were published, Kenya’s Anti-FGM board released a statement saying the news report was incorrect.", "“Investigations by relevant government agencies has (sic) established that there was a misrepresentation of facts in the purported case and FGM was not part of the ceremony as reported by a certain media house,” the statement read.", "Estes is considering legal action against the K24 television station, noting that she has received no formal apology for the erroneous report.", "“Whatever they did is defamatory. Deleting the video does not amount to an apology. If you slander you need to cover the apology the same way you covered the misleading one,” said her legal representative who was also present during the interview.", "Estes also denied claims in the report that she had permanently settled among the Pokots. She told AFP that she visited regularly but did not live with them in their village.", "She said a claim that her husband had lived among the Pokot for many years was also incorrect and he had first visited Kenya in July, shortly before the ceremony.", "Kenya has officially advanced in the fight against FGM in recent years. The 2014 Kenya Demographic and Health Survey (KDHS) gives the national prevalence of FGM as 21 percent, down from 27 percent in 2008/9 and 32 percent in 2003.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]