["A rumour viral on social media claims that organ smugglers are killing innocents to sell their body parts. The message circulating in Telugu claims that 500 people travelling from Bihar to Jharkhand, disguised as beggars, are killing people to sell their bodies and kidneys to medical colleges and illegal organ trade businesses. The rumour suggests that six to seven perpetrators have been caught by the police.", "Following is the Telugu text of the message – “ఒరిస్సా నుంచి ఈ రోజు అందిన సమాచారం ఏమిటంటే,,,బీహార్ నుంచి జార్ఖండ్ మధ్యలో బిచ్చగాళ్ళ వేషంలో ఒక 500 వందల మంది బయలుదేరారు..మార్గమధ్యంలో ఒంటరిగా దొరికిన వాళ్ళను చంపి మెడికల్ కాలేజీలకు,,మరియు కిడ్నీ ల దందా లకు సరఫరా చేస్తున్నారు…వీరిలో 6,7 మంది పట్టు బడినారు…ఆ 6,7 మందిని విచారిస్తే వారు మేము కాక ఇంకా 500 వందల మంది ఉన్నాం అని ఒప్పుకున్నారు…అందుకే బ్రదర్స్ ఎంత వీలైతే అంత మందికి ఈ మెసేజ్ ని మీ,,మీ ,,మిత్రులకు వాట్సాప్ ఇతరత్రా ద్వారా చేరవేయగలరు. (There are reports from Odisha that 500 people disguised as beggars are travelling between Bihar and Jharkhand. On the way, they are killing people whom they find lonely and supplying bodies to medical colleges and kidney businesses. Six-seven people have been arrested. After interrogation they revealed that they are about 500, so please forward this message to all family members and social media platforms on an urgent basis.)”", "The message seems to be widely shared on WhatsApp, however, Alt News was able to locate a few on Facebook and Twitter as well. A video shared along with the message shows dismembered bodies laid out in a room.", "The same message is also being circulated with photographs of men being escorted by the police. These images had led to mob lynchings in southern states last year.", "The same message is also circulating in Hindi with a similar set of images.", "The message reads, “उड़ीसा से आज खबर मिली है की बिहार से झारखंड होते हुए भिखारी के बेस में पांच सौ लोग निकले है जो रास्ते में जो मिलता है उसको काटकर कलेजे और कीडनी निकाल रहे है जिसमे से छः सात लोग पकड़े गए है .जो पकडे़ गए हैं वही लोग को कडी़ पुछताछ के बाद पांच सौ लोग आने की बात कबुल की है इसलिए हमारे भाईयों मेसेज को आपके जितने परिवार और मेंबर है सबको फॉरवर्ड कीजिये इसमे एक विडयो भी है जो फेसबुक इजाजत नहीं देता (There are reports emerging from Odisha that 500 people disguised as beggars are travelling from Bihar to Jharkhand. Whoever they come across is killed, and the kidney and liver are removed. Six-seven people have been arrested. After interrogation, they revealed that they are about 500 so please forward this message to all family members. There is a video too which Facebook is not giving permission to upload.”", "The same message is also being shared with the video of mutilated bodies.", "Alt News had debunked this message last year. However, it was not circulated along with the video which is currently viral. Breaking down the video into multiple keyframes and reverse-searching individual images on Yandex revealed that the video has been doing rounds on social media at least since 2017. It has been shared in varied foreign languages.", "In March 2019, Agence France-Presse (AFP) had fact-checked a photograph depicting the same events shown in the video. It was then viral as, “kidnapping syndicates in the Philippines targeting people for their organs.” The image had over 1.3 lakh shares.", "AFP cited an article on a website gorebrasil.com, published on January 18, 2017, which carried the same video. According to the Portuguese article translated by AFP, a riot had broken out in Alcaçuz prison in Brazil on January 14, 2017. The people in the video are conversing in Portuguese with a Northeast Brazilian accent.", "At the 20-second mark in the video, a man can be spotted wearing a t-shirt that says, “Polícia Civil”, which is Portuguese for ‘civil police’ in Brazil.", "On January 14, a riot between rival gangs had broken out in Alcaçuz prison which led to the death of at least 30 inmates. Gory images of decapitated bodies were seen in the aftermath of the violence. The incident was widely covered by international media, including The Guardian, AFP, Al Jazeera and BBC, among others.", "“Members of a drug gang started the clash by invading a pavilion in the Alcaçuz prison where rivals rested, Rio Grande do Norte state’s security secretariat said on Sunday,” reported The Guardian. In January 2018, at least 140 inmates had died in gang warfare in the prison.", "“The gangs were believed to be fighting for control of lucrative drug smuggling routes,” reported The New York Times. “Decapitations and mutilations are common in Brazil’s violent, overcrowded prisons, in which 40 per cent of inmates have yet to be sentenced, but the latest wave of brutality has appalled many here,” it furthered.", "While Alcaçuz prison authorities were unresponsive to AFP’s queries about the origin of the video, similar imagery of mutilated bodies were reported in mainstream media.", "The set of images currently viral has been debunked by Alt News several times in the past. They are now viral with a different claim that suggests that a gang of child-kidnappers, who sell body parts in an organ trade racket, are on a prowl in Gujarat. This message is circulating in Gujarati.", "These images have been floating on social media since last year and were debunked by Kannada newspaper Prajavani. The media outlet quoted the Karnataka police who said that the images are 3-4 years old. The police had appealed to people to not believe such rumours circulating on WhatsApp.", "Rumours of kidnappers targeting children for their organs took at least 31 lives in mob-lynchings across the country in the past two years. Such rumours are region-specific, which means that they are circulated in the language familiar to a particular state. Social media users are advised to look for media reports verifying the rumours. The absence of the same is a clear indication that the messages are carrying unverified information.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]