["At 5:41 pm on April 9, Times Now broke a story. The story was that Nirav Modi, accused in the Rs.11000 crore PNB scam has been arrested in Hong Kong.", "“Alright, this is the big breaking news coming in now, Nirav Modi has been arrested in Hong Kong. That is what we are breaking for you first on Times Now. Reports coming in of Nirav Modi arrested in Hong Kong; this could be a major major breakthrough for the security agencies, for the investigative agencies who are trying to get Nirav Modi back in India and face the law”, said the Times Now anchor.", "With the message flashing on the screen, the anchor continued, “Reports just coming in that he has been arrested in Hong Kong. Remember it was a request from the Enforcement Directorate as well to Interpol to go for red corner notice for Nirav Modi. Investigative agencies were pitching hard to get him back in India.” The entire broadcast lasted for about a minute before the channel reverted to its earlier story, with the anchor saying, “Well we will get back to more details on that story but returning to the story that we are tracking on breaking ground, Pakistan exposed on its own soil…”", "Apart from Times Now, regional news channel VTV Gujarati also reported that Modi has been arrested in Hong Kong. It was also reported by news channel TV9 Telugu.", "PNB Fraud : Nirav Modi arrested by Interpol in Hong Kong Source| Vtv News: https://t.co/iFwNK66g9e via @YouTube", "— VTV Gujarati News (@VtvGujarati) April 9, 2018", "This ‘news’ is viral on social media, with a number of Facebook and Twitter users sharing it. The tweet below was posted at 2:34 pm and Alt News found that it is among the earliest instances of this information being shared on Twitter. This tweet was retweeted over 270 times.", "Breaking News : Nirav Modi arrested in Hongkong by Interpol. Details awaited.@republic @ZeeNews @ANI @ndtv @abpnewstv please check.", "— Murali Krishna (@MuralikrishnaE1) April 9, 2018", "Facebook and WhatsApp weren’t immune to this sensational newsbreak either, which spread like wildfire on the social media platform as well as the messaging platform.", "Curiously, Times Now did not return to this ‘big breaking news’. Moreover, 3 hours after Times Now ‘broke’ this news, not a single National Channel has announced Nirav Modi’s arrest. This is because the news that Times Now flashed on Nirav Modi is fake.", "The latest report with regard to Nirav Modi is that the Chinese Government has stated that Hong Kong, where Nirav Modi is apparently stationed, is free to accede to India’s request to arrest the disgraced diamantaire. In fact, even the Times Now website only has news about the possibility of Hong Kong acceding to India’s request and nothing about Nirav Modi being arrested.", "According to the report on Times Now website, Chinese Foreign Ministry spokesman Geng Shuang told a media briefing that “according to the one country two systems and basic law of the HKSAR, under the assistance and authorisation of the central government, the HKSAR can make proper arrangement on judicial mutual assistance with other countries“. He further said. “If India makes relevant request to the HKSAR, we believe the HKSAR will follow the basic law and relevant laws and under relevant judicial agreements with India with the relevant issue“.", "Even though Nirav Modi has not been arrested, this did not deter news channels from blaring this false information without a customary check. Is this yet another instance of WhatsApp setting the agenda for breaking news on a national news channel?", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]