["The photos were shared more than 1,300 times after being published on Facebook here on May 18, 2020.", "The post’s Tagalog-language caption states: “My god! Corona virus is not yet over. Here goes another! / MOMMIES, MOMS, MOTHERS REMINDER !!! / KAWASAKI DISEASE IS SPREADING NOW IN BABIES !!! REMINDER TO MOMS, DO NOT LET BABIES PUT TOYS IN THEIR MOUTHS ,AND MAINTAIN WASHING THE GENITAL AREA AFTER CHANGING DIAPER,HANDS AND MOUTH..WHEN YOU OBSERVE FEVER AND RED RASHES IN THE CHILD'S BODY IMMEDIATELY TAKE THE CHILD TO THE DOCTOR. / CTTO.”", "Kawasaki disease is an illness that is most common in children under five. It can cause fever, rash and the swelling of the hands and feet, among other symptoms, according to the US Centers for Disease Control and Prevention (CDC).", "A similar claim about the disease spreading was also published here, here and here on Facebook.", "However, the claim is misleading.", "A reverse image search on TinEye found one of the photos published on the health advice platform WedMD’s HFMD webpage here.", "It was published alongside a description which states that it shows a skin blister caused by Hand, Foot, and Mouth Disease (HFMD).", "Below is a screenshot comparison showing the photo in the misleading posts (L) and the photo on WebMD’s HFMD webpage (R):", "The second photo does show a skin rash caused by Kawasaki disease and was taken from WebMD’s webpage on the condition here.", "In a Facebook message to AFP on May 19, 2020, Dr. Joey Hernandez, a member of the Philippine Society of Public Health Physicians, confirmed that HFMD and Kawasaki “are two distinct diseases”. He added, however, that patients of both diseases can exhibit similar rashes and eye symptoms.", "On May 15, 2020, the World Health Organization (WHO) announced that health experts are investigating clusters of children in Europe and North America who exhibited a Kawasaki-like syndrome that “may be related to COVID-19”.", "“It is not yet clear the full spectrum of disease, and whether the geographical distribution in Europe and North America reflects a true pattern, or if the condition has simply not been recognized elsewhere,” the WHO statement adds.", "A report in The Lancet, a leading peer-reviewed medical journal, on the Kawasaki-like disease also says that research on the syndrome is ongoing and that it remains unclear if SARS-CoV-2, the virus that causes COVID-19, is a “triggering agent”.", "“It is crucial to reiterate—for parents and health-care workers alike—that children remain minimally affected by SARS-CoV-2 infection overall,” the report notes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]