["One of the posts, which we’ve archived here, has racked up more than 83,000 views on Facebook, according to data provided by the social network. It shows US soldiers in military uniform marching in formation with firearms. The caption states: “3,500 American Troops Now in Cameroon.”  It has been shared more than 720 times since it was first posted on December 15.", "Posts here and here show the same image, alongside another of a Boeing c-17 Globemaster III US military transport plane. They present these pictures as evidence of the removal of Cameroonian soldiers from the two English-speaking regions -- where separatists want to establish an independent country called Ambazonia -- and their replacement by US troops.", "The picture was also shared here, here and also in this post, which has been viewed more than 6,000 times according to Facebook data. This final version of the post tries to link two issues: the supposed US military presence in Cameroon, and the secession of Biafra from Nigeria on the other.", "“The ultimatum given to President (Paul) Biya to immediately vacate his troops from Ambazonia tells you that America doesn't care about sovereignty policy when it comes to defending the right of the oppressed people,”  reads the caption, which was also shared alongside the picture in this post. “The world is very much interested in Biafra, giving us a home and a country will bring peace and reduce high rate of migration and possible Xenophobia rapidly spreading across Africa.”", "Igbo separatists declared an independent republic of Biafra in 1967. More than one million people died in the two-and-a-half year civil war that followed.", "The self-declared state ceased to exist after a final military defeat in 1970, but some groups including the Indigenous People of Biafra (IPOB), predominantly made up of Igbos from southeast Nigeria, continue to call for a separate homeland over alleged marginalisation. IPOB was designated a \"terrorist\" organisation by the Nigerian authorities in 2017.", "Cameroon’s Northwest Region and Southwest Region -- home to a large minority of anglophones in the largely francophone country -- have been gripped by violence since October 2017 when separatist leaders issued a symbolic declaration of independence, triggering a crackdown by security forces.", "More than 3,000 people have died because of the conflict, and more than 500,000 people have fled their homes, according to the International Crisis Group.", "The short answer is that US troops have recently been deployed in Cameroon, but details are thin on the ground.", "US Africa Command (Africom), which coordinates US military operations in Africa, told us 160 troops had been sent to Cameroon “in support of a routine theater security cooperation event”, but did not tell us when or clarify whether they were still on the ground.", "Separately, Africom spokeswoman Lieutenant Christina Gibson told AFP that US troops were in Cameroon “to conduct standard security cooperation activities, which are coordinated with the Cameroonian government for its concurrence,” while “the recent movement of a small number of US forces and aircraft was in support of a routine logistics movement”.", "What about the photo?", "Multiple Google reverse image searches helped AFP to trace the picture of the soldiers to the archives of the Defense Visual Information Distribution Service (DVIDS), a resource for media following US military issues.", "The photo, which was published here, was taken in a multinational formation involving troops from the United States, the United Kingdom, Romania, Croatia and Poland during the opening ceremony of Saber Strike 18 at Wierzbiny, Poland on June 4, 2018. The photo was credited to Specialist Hubert Delany of the US Army.", "A Google search for “U.S. Army photo by Spc. Hubert D. Delany III” reveals a post on the Facebook page of Defense Imagery describing Delany as “a public affairs specialist assigned to the 22nd Mobile Public Affairs Detachment, XVIII Airborne Corps at Fort Bragg, North Carolina”.", "AFP went through the comments on the post and tracked Delany’s Facebook account where he displays the same picture as his header.", "An analysis of the picture using INVID, a verification tool which AFP helped to develop, showed that Delany took the picture on February 5, 2019 -- more than ten months before the claim surfaced on social media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]