["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, Snopes readers asked us to examine the accuracy of claims that \"more than one million\" people had taken part in a demonstration in support of U.S. President Donald Trump, who disputed the result of that year's presidential election a week after Democratic candidate Joe Biden was declared the winner.", "The event, on Nov. 14, was billed variously as the \"Million MAGA March,\" the \"March for Trump\" and \"Stop the Steal DC\", inspired by unfounded or false allegations and conspiracy theories that electoral fraud had played a telling part in President-elect Biden's victory.", "That morning, White House Press Secretary Kayleigh McEnany tweeted out screenshots from live Fox News coverage of the event, adding \"AMAZING! More than one MILLION marchers for President @realDonaldTrump descend on the swamp in support.\"", "Trump himself posted and promoted wildly varying estimates of the attendance at the event. In one tweet, he referred to \"tens of thousands\" of participants, and in another, \"hundreds of thousands.\" He also retweeted a post by right-wing activist and Students for Trump Co-founder Ryan Fournier, who wrote that \"More than a MILLION people showed up\" on Pennsylvania Ave., in the nation's capital:", "Crowd sizes are notoriously difficult to estimate, and Trump's presidency began with a high-profile dispute over the number of people who attended his January 2017 inauguration. Due to the political sensitivities that often surround estimates of crowds at contentious rallies and demonstrations, law enforcement agencies and other official sources in many jurisdictions have increasingly stopped providing such figures.", "In keeping with that trend, the Metropolitan Police Department (MPD) in Washington, D.C., told Snopes \"MPD does not provide numbers on crowd size.\" The Washington Metropolitan Area Transit Authority (WMATA) did not respond to our inquiry.", "In the absence of an impartial and authoritative estimate, we are issuing a rating of \"Unproven\" in relation to the claim that \"more than one million\" people descended upon D.C. for a pro-Trump demonstration on Nov. 14, 2020. However, that estimate is likely to be a significant exaggeration.", "Photographs and videos of crowds are often unreliable indicators of their size, but they are not entirely worthless. We can take pictures of previous gatherings reliably estimated to have contained around one million people, and compare them with pictures of the November 2020 pro-Trump demonstration.", "For example, on Sep. 29, 1979, a crowd estimated to have numbered 1.2 or 1.25 million people (akin to the \"more than one million\" claimed by McEnany, Fournier and others) gathered in the Phoenix Park in Dublin, Ireland, to attend a mass celebrated by Pope John Paul II. At the time, the population of the Republic of Ireland was estimated to be 3.4 million.", "The following images and video footage give a good indication of what a crowd of that size looks like:", "Pope John Paul II (1920 - 2005) as he is driven though waves to the crowd in Phoenix Park after an outdoor Mass, Dublin, Ireland, September 29, 1979. (Photo by Chuck Fishman/Getty Images)", "A general view of the crowds attending the open air mass in Dublin's Phoenix Park by Pope John Paul II. (Photo by PA Images via Getty Images)", "By contrast, the video that accompanied Fournier's \"more than a million\" claim shows a crowd of a significantly smaller extent, distributed much more sparsely:", "Similarly, on Feb. 15, 2003, the Metropolitan Police estimated that around 750,000 people gathered in London's Hyde Park to protest against the then-impending U.S. and U.K.-led military intervention in Iraq. Photographs and video footage of Hyde Park, captured on that day, show significantly larger and more densely packed crowds than those seen on Pennsylvania Avenue during the pro-Trump march, 17 years later:", "Aerial view of Hyde Park during the anti-war march in central London. (Photo by Andrew Parsons - PA Images/PA Images via Getty Images)", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]