["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The hearing room of the House Judiciary Committee on July 25, 1974, as the panel debated impeachment of President Richard Nixon. (AP)", "RELATED: Read all of PolitiFact’s coverage on Donald Trump indictments\n\nA Facebook post claimed that there have been 317 criminal indictments in the administrations of three recent Republican presidents — Donald Trump, Ronald Reagan and Richard Nixon — and only three indictments under three recent Democratic presidents — Barack Obama, Bill Clinton and Jimmy Carter.", "Here’s what the post said about those presidents, whose terms date back to 1969 when Nixon was in office:", "\"Recent administrations with the MOST criminal indictments:", "Trump (Republican) — 215", "Nixon (Republican) — 76", "Reagan (Republican) — 26", "\"Recent administrations with the LEAST criminal indictments:", "Obama (Democrat) — 0", "Carter (Democrat) — 1", "Clinton (Democrat) — 2", "\"Notice a pattern?\"", "Unless an administration official is charged with a crime for acts while in office, it’s not always easy to identify which indictments can be connected to a presidential administration; some administration officials have been indicted for acts in the private sector, some indicted people were involved in presidential campaigns but didn’t work in the administration, etc.", "This claim exaggerates the number of indictments under Trump, in particular, by counting the number of criminal charges filed, rather than the number of people indicted; and it includes the indictments of people who are not part of his administration, such as 25 Russians.", "On the whole, however, the indictments under the three GOP presidents do dwarf those under the three Democrats.", "An indictment is essentially a two-step process in the federal system:", "1. An agency such as the FBI or the IRS investigates possible crimes. If the agency decides to seek criminal charges, the case goes to a grand jury.", "2. The grand jury is designed to be an impartial body of citizens drawn from the community that, with the help of prosecutors, conducts its own investigation, in secret. If the grand jury decides that criminal charges should be filed, an indictment is issued.", "(Conviction, of course, would occur only after a plea bargain or trial.)", "The indictment formally charges a person or persons with a criminal offense or offenses. In other words, one indictment can contain multiple criminal charges against a single individual or against multiple individuals.", "Special Counsel Robert Mueller's investigation into Russian interference in the 2016 U.S. presidential election netted indictments against 34 people and three entities.", "However, 25 of the people indicted are Russian nationals or Russian intelligence officers.", "Only six of the 34 indicated are in Trump’s orbit:", "Paul Manafort (48/25 counts): Former Trump campaign chairman, former lobbyist for Ukrainian officials; crimes alleged not connected to his work for Trump. Convicted of tax and bank fraud. Oct. 30, 2017 indictment (with Gates): Counts 1-6; 10-12: 9. Feb. 13, 2018 indictment: 18. Feb. 22, 2018 superseding indictment (with Gates): Counts 1-5; 10-14; 24-32: 19. Sept. 14, 2018, superseding criminal information: 2.", "Rick Gates (23 counts): Top deputy to Manafort, former lobbyist for Ukrainian officials; crimes alleged not connected to his work for Trump. Pleaded guilty to lying to investigators and financial fraud related to hiding money he earned lobbying for politicians in the Ukraine along with Manafort. Oct. 30, 2017 (with Manafort): Counts 1-2; 7-12: 8. Feb. 22, 2018 superseding indictment (with Manafort) Counts 6-10; 15-32.", "Roger Stone (7 counts): Longtime adviser; Trump campaign official dispatched Stone to get information from WikiLeaks about the thousands of hacked Democratic emails in an effort to damage Hillary Clinton’s 2016 presidential campaign. Convicted of obstructing a congressional inquiry, lying to investigators under oath and trying to block the testimony of a witness whose account would have exposed his lies.", "Michael Cohen (1 count): Longtime Trump lawyer and adviser. Pleaded guilty to a series of criminal charges, including a campaign finance law violation that implicated the president but was unrelated to the Russia interference investigation.", "George Papadopoulos (1 count): Campaign adviser on foreign policy to Trump. Pleaded guilty to lying to the FBI about his efforts to put the Trump campaign in contact with Moscow.", "Michael Flynn (1 count): Campaign adviser to Trump and then briefly his national security adviser. Indicted Nov. 30, 2017. Pleaded guilty to lying to the FBI about his discussions with the Russian ambassador Sergey Kislyak during the presidential transition. Flynn and Kislyak had discussed U.S. sanctions against Russia for election meddling.", "Because of the various indictments filed against Manafort, one could count a total of 48 charges against him. But ultimately he faced 25 charges: He went on trial for 18 charges (and was found guilty of eight of them) and then faced seven more charges (he pleaded guilty to two).", "So, that’s a total of 58 or 81 charges against Trump associates — not 215.", "But the claim we’re checking refers not to individual charges but indictments, of which there are only a half dozen directly tied to Trump.", "We contacted more than a half dozen presidential historians and none said they were aware of a source that lists the number of indictments during the presidential administrations in question.", "But we did find tallies organized a bit differently in a March 2019 article by FiveThirtyEight. The article counted the number of people indicted in cases made by special counsels, from Watergate through Mueller.", "Nixon: 28 key indictments. There were 72 indictments charging 68 people (58 were convicted), all in the Watergate scandal or related investigations. But arguably only 28 of the 68 were part of, or closely tied to, Nixon’s administration. They included two of Nixon’s attorneys general, two White House counsels, two secretaries of treasury and a number of White House aides.", "Click here to see a spreadsheet listing the Watergate indictments.", "Reagan: 33 people indicted. 18 people indicted (16 convicted) in an investigation of fraud, corruption and influence-peddling within the Department of Housing and Urban Development; 14 people, including Caspar Weinberger and Oliver North, charged (11 convicted) in the Iran-contra scandal, an illicit arms deal with Iran orchestrated by members of the administration; and White House aide Lyn Nofziger was charged (his conviction was overturned) over corruption allegations surrounding Wedtech, a military contractor.", "Clinton: 2 officials indicted. Agriculture Secretary Mike Espy was charged (and acquitted) over allegations that he accepted improper gifts from businesses and lobbyists. Housing and Urban Development Secretary Henry Cisneros was convicted (and pardoned) of making false statements to law enforcement about hush money payments to his former mistress.", "Obama: None.", "Carter: None.", "A Facebook post said that there have been 317 criminal indictments under three recent Republican presidents and only three under three recent Democratic presidents.", "The claim is essentially on target for the Democratic presidents, but the comparison to the GOP presidents is overstated, because the numbers of Trump and Nixon administration indictments claimed are greatly exaggerated.", "Even so, with a generous count, there were roughly 142 people indicted in the three GOP presidents — far less than 317, but far more than the two under the Democrats.", "We rate the statement Half True.", "Facebook, post, Dec. 29, 2019", "The Atlantic, \"After Mueller: The Ongoing Investigations Surrounding Trump,\" March 22, 2019", "ABC, \"Here's a breakdown of indictments and cases in Mueller's probe,\" Nov. 15, 2019", "FBI, \"A Brief Description of the Federal Criminal Justice Process,\" accessed Jan. 2, 2020", "New York Times, \"Indicting Roger Stone, Mueller Shows Link Between Trump Campaign and WikiLeaks,\" Jan. 25, 2019", "New York Times, Roger Stone indictment, Jan. 24, 2019", "Paul Manafort indictment, Feb. 13, 2018", "U.S. Department of Justice, Rick Manafort superseding criminal information, Sept. 14, 2018", "New York Times, Paul Manafort and Rick Gates indictment, Oct. 30, 2017", "U.S. Department of Justice, Paul Manafort and Rick Gates superseding indictment, Feb. 22, 2018", "U.S. Department of Justice, Michael Flynn information, Nov. 30, 2017", "U.S. Department of Justice, \"Special Counsel’s Office,\" accessed Jan. 2, 2010", "U.S. Department of Justice, George Papadopoulos criminal information, Oct. 3, 2017", "U.S. Department of Justice, Michael Cohen criminal information", "PolitiFact, \"All of the people facing charges from Mueller’s investigation into Russian meddling,\" March 25, 2019", "Business Insider, \"Here's everyone who has been charged and convicted in the Russia probe so far,\" Nov. 15, 2019", "U.S. Department of Justice, \"Charging,\" accessed Jan. 4, 2020", "Daily Kos, \"Comparing Presidential Administrations by Felony Arrests and Convictions,\" Sept. 18, 2018", "FiveThiryEight, \"Is The Russia Investigation Really Another Watergate?\" March 22, 2019", "Watergate: A Brief History with Documents, edited by historian Stanley Kutler", "Watergate Special Prosecution Report", "Email, New York University Wagner clinical associate professor of public service Timothy Naftali, Dec. 31, 2019", "Email, Wayne State University professor of law Peter Henning, Jan. 3, 2020", "Email, Bowdoin College professor of government and legal studies Andrew Rudalevige, Jan. 2, 2020", "Email, Hofstra University political science professor Meena Bose, Jan. 1, 2020", "Email, University of Virginia Miller Center researcher Ken Hughes, Jan. 1, 2020", "Email, Shirley Anne Warshaw, professor of political science, Gettysburg College, Dec. 31, 2019", "Email, George Washington University historian James Banner, Dec. 31, 2019", "Email, David Greenberg, professor of history and of journalism & media studies at Rutgers University, New Brunswick, Dec. 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]