["An image has been shared thousands of times in multiple posts on Facebook which claim it shows Sri Lankan fruit and vegetables being exported to the US. The claim is misleading; Sri Lankan airport authorities said the image shows a consignment of fruit and vegetables that were exported to Muscat, the capital of Oman.", "The image was published on Facebook here on August 16, 2020. The post was shared more than 3000 times.", "The image features a photo of President Gotabaya Rajapaksa and Prime Minister Mahinda Rajapaksa alongside a photo of a consignment of produce recently exported via Sri Lanka’s Mattala International Airport.", "The Sinhala-language text superimposed on the image translates to English as: “First consignment of locally grown vegetables and fruits to America today. A successful beginning! Cheers!\"", "The Sinhala caption reads: “Successful start! Cheers!”", "A similar claim was also made on Facebook here and here.", "The claim is misleading.", "Upali Kalansooriya, Mattala's chief airport manager, and Ravi De Silva, the assistant manager of airport operations (cargo), told AFP that the consignment exported on August 16 was sent to Muscat, the capital of Oman.", "“The consignment of perishables weighing 3371 kgs were exported to Muscat, Oman on August 16, 2020 via Salam Airways,” De Silva told AFP by phone on August 18.", "He said a consignment of local garments was exported to the US ten days before the Muscat consignment was transported.", "Here is a report by Sri Lankan news site Newswire published on August 16 about the export of fruit and vegetables to Oman.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]