["About this rating", "In the summer of 2018, many Americans were alarmed to read about the phenomenon of young immigrant children, without free legal aid, having to plead their cases before a judge in deportation and asylum cases.  For example, in a 27 June article,the Texas Tribune reported that:", "As the White House faces court orders to reunite families separated at the border, immigrant children as young as 3 are being ordered into court for their own deportation proceedings, according to attorneys in Texas, California and Washington, D.C.", "Requiring unaccompanied minors to go through deportation alone is not a new practice. But in the wake of the Trump administration’s controversial family separation policy, more young children — including toddlers — are being affected than in the past. The 2,000-plus separated children will likely need to deal with court proceedings even as they grapple with the ongoing trauma of being taken from their parents.", "This report prompted inquiries from multiple skeptical and concerned readers asking us if it was true.", "The referenced practice does occur today and has taken place for years. We spoke with immigration attorneys who confirmed that immigrant children subject to deportation or asylum hearings are not entitled to court-appointed lawyers, and they recalled having represented clients as young as two and three years old.", "Background", "In the United States, any defendant in a criminal case is constitutionally entitled to be represented by a court-appointed attorney at no cost if they cannot afford to hire their own. However, this constitutional guarantee does not extend to civil cases or immigration courts (although in some states and some circumstances, state law does entitle individuals to free legal aid in civil cases).", "Instead, those who find themselves before immigration courts, whether adults or children, have the right, if not always the wherewithal, to obtain legal representation from one of a number of non-profit organizations and law firms who work on a pro bono basis.", "Although defendants do not have a right to court-appointed free legal aid in immigration court, the federal government does indirectly contribute to their assistance. The Office for Refugee Resettlement, which is part of the Department of Health and Human Services, contracts with the non-profit Vera Institute for Justice, which in turn sub-contracts with more than a dozen organizations around the country to provide free legal representation and advice to immigrants facing deportation and other legal issues.", "In April 2018, during the same week that U.S. Attorney General Jeff Sessions implemented the \"zero tolerance\" immigration policy, the Executive Office for Immigration Review -- which oversees the U.S. immigration court system -- reportedly informed the Vera Institute that these legal assistance programs were to be put on hold pending a cost-effectiveness review.", "Sessions later announced that the programs would not be paused, but a review of their costs would still be taking place.", "Numbers", "According to statistics collected by Syracuse University, 58,015 unaccompanied children (i.e., juveniles under the age of 18 separated from their legal adult guardians) were subjected to deportation hearings in American immigration courts in 2017.", "That figure was 61,254 in 2016, and 35,113 in 2015. Between 2005 and 2017, some 300,000 unaccompanied children have had to appear in court in deportation hearings, and according to the data around half of children in deportation cases do not have legal representation. A child who doesn't have a lawyer is over four times more likely to receive a removal order (deportation) than a child who does.", "Between 2005 and May 2018, a total of 93,767 children left the United States, either through removal orders or voluntary departure, after being detained and subjected to immigration court deportation proceedings without legal representation.", "The figures from previous years, which related only  to unaccompanied children, can't be directly compared to those from 2018, which do not distinguish between children who arrived into the United States unaccompanied and those who arrived with their parents and families.", "However, we know that the Trump administration's \"zero tolerance\" policy caused at least 2,342 children to be separated from their parents at the border, and since many of these children will be subject to deportation proceedings, it is quite plausible that an increase in the number of unaccompanied children appearing in immigration courts has occurred in 2018.", "Opposition", "In 2014, the American Immigration Council, the American Civil Liberties Union, and other non-profit organizations sued the U.S. government for alleged violations of the due process clause of the Fifth Amendment and the Immigration and Nationality Act, demanding that immigrant children be given court-appointed free legal aid in immigration proceedings.", "Thsee organizations brought suit (J.E.F.M. v. Holder/F.L.B. v. Lynch) on behalf of fourteen immigrant children (some as young as four, three, or even one year old), all of whom were facing deportation hearings, before the case was certified as a class action and the group of plaintiffs expanded to thousands of children in similar circumstances. Attorneys for the children argued that:", "In court, the Department of Homeland Security (“DHS”) is represented by a trained lawyer who argues for the child’s deportation. But no lawyer stands with the child. Every child is required to respond to the charges against him or her, and, in theory, afforded an opportunity to make legal arguments and present evidence on his or her own behalf. But in reality those rights are meaningless because children are not competent to exercise them.", "Each child has attempted to find representation, including through pro bono legal service providers, but none of them have found anyone with the resources to take on their cases. Absent this Court’s intervention, these children were or will be forced to defend themselves pro se under the immigration laws—a legal regime that, as the courts have recognized, rivals the Internal Revenue Code in its complexity.", "The 9th Circuit Court of Appeals rejected the lawsuit in 2016 on a question of jurisdiction and rejected a similar high-profile lawsuit in January 2018, leaving in place the status quo: thousands of children with no right to court-appointed attorneys in immigration court.", "Megan McKenna is communications director at Kids in Need of Defense, a charity devoted specifically to advancing and upholding the rights of children in immigration policy. She told us that the youngest child the organization had formally represented in immigration court was just two years old.", "No rules or guidelines currently in place establish a minimum age below which children can't be forced to defend themselves in court, according to McKenna. The court does provide a translator, if necessary, but most protections and services for children are at the discretion of judges who can, for example, delay a hearing to give a child time to find legal representation but are not obliged to do so.", "McKenna described the process as \"unforgiving,\" adding that \"They're all coming for a very difficult reason. No child would come on their own, hundreds or thousands of miles, unless something was really wrong.\"", "The debate over whether children (as opposed to adults) should be entitled to taxpayer-funded free legal aid in immigration cases partially revolves around the question of whether children, as a category, are less capable than adults of both understanding their circumstances and the questions put to them by a judge, performing the logical processes required to put together an argument on their own behalf, and verbalizing that argument with sufficient clarity and impact.", "In 2016, Jack Weil, a U.S. Justice Department official responsible for training immigration judges, sparked controversy with remarks he made during a deposition in the F.L.B. v Lynch class action case. Weil suggested that three- and four-year-old children could be \"taught immigration law,\" although he later maintained that his comments had been taken out of context.", "During Weil's deposition, ACLU attorney Ahilan Arulanantham questioned him as follows (page 69):", "Arulanantham: It must be true that there's some children that are so young that even if they receive the notice and even if they're given an explanation by the judge, they're still not going to understand what's going on; right?", "Weil: I have to do a case-by-case basis determination. I've taught immigration law literally to three year old and four year olds. It takes a lot of time. It takes a lot of patience. They get it. It's not the most efficient, but it can be done.", "Arulanantham: Are you aware of any experts in child psychology or comparable experts who agree with the assessment that three- and four-year-olds can be taught immigration law?", "Weil: I haven't read any studies one way or the other.", "Arulanantham: What about, like, a one-year-old?", "Weil: I mean, I think there's a point that there has to be communication. There has to be communication at some point.", "We posed a series of questions to the U.S. Department of Justice relating to the presence of children in immigration courts, including whether any rules prevented children with intellectual disabilities from being ordered to defend themselves, what the specific criteria are for a judge to determine whether a child is capable of functioning in court, as well as the number unaccompanied children who have been subject to immigration court proceedings so far in 2018, but did not receive a response by press time.", "Jewett, Christina and Sefari Luthra.   \"Immigrant Toddlers Ordered to Appear in Court Alone.\"\r\n    Texas Tribune/Kaiser Health News.   27 June 2018.", "Abel, Laura K. and Max Rettig.   \"State Statutes Providing for a Right to Counsel in Civil Cases.\"\r\n    Clearinghouse Review: Journal of Poverty Law and Policy.   July-August 2006.", "Executive Office for Immigration Review.   \"Legal Orientation Program for Custodians of Unaccompanied Alien Children.\"\r\n    U.S. Department of Justice.   13 April 2018.", "Sessions, Jeff.   \"Memorandum for Federal Prosecutors Along the Southwest Border.\"\r\n    Office of the U.S. Attorney General.   6 April 2018.", "Sacchetti, Maria.   \"Justice Dept. to Halt Legal-Advice Program for Immigrants in Detention.\"\r\n    The Washington Post.   10 April 2018.", "Sessions, Jeff.   \"Opening Statement of Attorney General Jeff Sessions Before the Senate Appropriations Subcommittee on Commerce, Justice, Science and Related Agencies.\"\r\n    U.S. Department of Justice.   25 April 2018.", "Transactional Records Access Clearinghouse.   \"Juveniles -- Immigration Court Deportation Proceedings.\"\r\n    Syracuse University.   Accessed 2 July 2018.", "MacGuill, Dan.   \"Did Barack Obama Oversee the Separation of 89,000 Children from Their Parents?\"\r\n     Snopes.com.   29 June 2018.", "J.E.F.M. et al.   \"J.E.F.M. et al v. Lynch et al. Third Amended Complaint -- Class Action.\"\r\n    U.S. District Court, Western District of Washington.   4 December 2015.", "Laird, Lorelei.   \"9th Circuit Rejects Bid for Lawyers for Child Immigrants But Calls for a Change in the Law.\"\r\n    ABA Journal.   21 September 2016.", "Cassens Weiss, Debra.   \"9th Circuit Finds Juvenile Facing Deportation Has No Right to Free Lawyer.\"\r\n    ABA Journal.   29 January 2018.", "Markon, Jerry.   \"Can a 3-Year-Old Represent Herself in Immigration Court? This Judge Thinks So.\"\r\n    The Washington Post.   5 March 2016.", "Weil, Jack H.  \"Deposition of Jack H. Weil -- J.E.F.M. et al v. Lynch et al.\"\r\n   < em>U.S. District Court, Western District of Washington.   15 October 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]