["About this rating", "A video purportedly showing an alien boarding a spaceship in a field near the Romanian city of Târgoviște and then flying the UFO over the forest racked up millions of views as it was passed around social media in January 2018.", "The most popular iteration of this video was likely the one posted to the Târgoviște+  Facebook page where it garnered more than 15 million views:", "Although many expressed skepticism about the footage, some were convinced that this video documented an actual alien making a pit stop in Romania.", "This video doesn't actually show an extraterrestrial being.", "For one, internet users couldn't quite agree on where this video supposedly took place. Most claimed that the video was shot in Târgoviște, but others shared this video as if showed an incident outside of Bacău, a Romanian city approximately 300 kilometers to the northeast, while others claimed that the footage showed an alien invasion in Alaska. This is a common trope of internet hoaxes. As the footage is not rooted in reality, the location can be changed to make it more appealing to audiences in various locales.", "But this video was not filmed in Romania or Alaska. This video was posted to the YouTube page \"Alien Unleash\" on 2 January 2018 (the day before the Târgoviște+ video) and was not accompanied by any information about where this incident allegedly took place. Rather, the description for the video was simply a list of relevant keywords:", "Alien, UFO, Real Aliens, 2018, NASA, Thirdphaseofmoon, Spacecraft, Flying Saucer, Humanoid, Area 51, Alien Footage, UFO Sightings, Secureteam10, Grey Alien, Mothership,", "The Alien Unleash YouTube page is full of similar videos. Over the last few months, the YouTube page has published videos purportedly showing dragons, alien abductions, motherships, and UFOs all over the world:", "In fact, they published a a similar (yet much less convincing) video in October 2017 which showed another little grey alien boarding a spaceship:", "This video was not filmed in a field outside of a Romanian city. It originated on an alien-centric YouTube page with a penchant of promoting similar hoax videos.", "Although this particular video was good enough to convince some viewers that it was real, it still contained a few errors which revealed it to be a hoax. When the UFO makes its way over the trees, for instance, it appears that the spacecraft is flying through the trees and not over them:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]