["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, as daily nationwide death tolls from COVID-19 reached new peaks, social media users shared a photograph that appeared to provide a stark illustration of the emotional devastation wrought by the virus.", "On Dec. 3, Arkansas family care doctor Ken Starnes posted a photograph that showed a room full of iPads attached to tripods. He described it in the following way:", "These are iPad stations being prepared for virtual ICU end of life visits by a palliative care doc I know. Jesus.", "Starnes' tweet was shared tens of thousands of times on Twitter and further promoted on Facebook.", "Since the beginning of the pandemic, healthcare professionals across the country have documented the use of video conferencing technology to allow COVID-19 patients to speak to their loved ones, who are typically barred from in-person visits due to hospital policies. In cases where a patient's condition is worsening, many have ultimately said their final goodbyes to loved ones through the medium of Zoom, Skype or FaceTime calls.", "As CNN reported on Dec. 6:", "Some hospitals are stocking enough iPads to rival a modest Apple store. But the reason for this reflects a grim reality: They're being used to connect Covid-19 patients with their families -- sometimes, for the last conversation they'll ever have. When Dr. Mark Shapiro posted about a patient saying goodbye to his family via an iPad, he wanted to communicate to others the severity of this pandemic.", "\"As the ICU (intensive care unit) team makes ready, there's a key step we mustn't forget,\" Shapiro, who is a hospitalist at Santa Rosa Memorial Hospital in California, wrote on Twitter. \"At first he [the patient] says 'No,' but we encourage him. The nurse brings in the iPad. With the last air in his shattered lungs, he says goodbye to his family. Over an internet connection.\"", "Hospitals have been overwhelmed by the thousands of patients coming in every day after contracting coronavirus. Across the US, there's been a shortage of hospital supplies for medical staff and beds for patients. And the contagious nature of the illness has forced hospitals to limit, and often forbid, visitation rights to mitigate its spread. The latest solution has been the implementation of iPad stations and other virtual technology so patients can communicate with their friends and family -- often, for the last time.", "As a result, Starnes' description of the viral photograph he posted appears eminently plausible, and we have found no specific evidence, and no background information, to suggest that he misrepresented what the photograph showed, or that someone else misrepresented its content to him.", "However, we have been unable to verify its authenticity, nor corroborate the accuracy of his descriptions. Snopes sent Starnes a list of questions designed to help us verify the authenticity and provenance of the photograph, and to investigate whether his description of it was accurate. We did not receive a response. If we receive evidence that corroborates or undermines Starnes' claims, we will update this fact check accordingly.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]