["Yet again, multiple Indian media organisations have made a claim based on statistics which they did not bother to verify or read the fine print. “Narendra Modi’s Govt is most trusted in the world”, was a claim made by multiple media organisations yesterday. This claim was made based on certain data that Forbes published yesterday.", "According to Forbes, India topped the list of selected countries which has the most confidence in the Governments. Canada, Turkey and Russia came in the 2nd, 3rd and 4th places according to the data published by Forbes.", "Soon after Forbes published its data, multiple Indian media organisations went to town proclaiming that India came out on top in the index of countries with most confidence in their Government. Here are some of the initial headlines published by various media organisations (Some of these headlines were edited later when multiple people pointed to the full set of data).", "So, is Indian Government indeed the most trusted by its citizens as compared to other countries? No, not really. Had any of the aforementioned media organisations cared to look at the Forbes graphics closely or read the article carefully, they wouldn’t have made the mistake that they did.", "The subheading in the Forbes graphic clearly says, “Confidence in the national government in selected OECD countries (2016)”, the operative word being “selected”. OECD which is an abbreviation for ‘Organisation for Economic Co-operation and Development’ is an intergovernmental economic organisation with 35 member countries. Out of the 35 countries, Forbes had selected 15 countries and their article was based on data for these 15 countries. Had any of the aforementioned media organisations downloaded the original OECD data and seen the trends by comparing India’s data in previous years, they wouldn’t have picked up such bold and screaming headlines. So, what are the facts?", "An organisation called Gallup conducts a yearly poll called the Gallup World Poll. As part of this poll, surveys are conducted across multiple countries. Among the various core items that are covered by the Gallup poll, “Confidence in National Government” is one of the core items. OECD relies on this “Confidence in National Government” poll by Gallup for its section on “Confidence in National Government”. On page 215 in this year’s report, OECD mentions India along with Brazil, China, Indonesia and South Africa and 2 other non OECD member countries while comparing 35 OECD countries.", "The data that Forbes presented is sourced from the OECD report which clearly shows India at 73% ranks third after Switzerland at 80% and Indonesia at 80%. The data can be downloaded from here. The bar chart below is based on this data with Indian being represented by the saffron coloured bar.", "Not only has India not topped the list of countries with most confidence in their national Government, the statistics for the Indian Government show a massive 9% decline from 2007 to 2016 and is captured in the table below.", "India’s position in different years can be seen from the data below:", "The following bar chart captures the confidence in Indian Government over years. The 2007 report in the chart below has been specified in 2016 report hyperlinked above.", "From the data above, it can be seen that India had the lowest ebb in the recent years in 2012 with 55% of the people surveyed having confidence in National Government. This shows why UPA2 Govt was not just ousted but could garner only 44 seats. The highest point seen in recent years was during the UPA1 Govt in 2007 with 82% of the people surveyed having confidence in National Government. This is also in line with UPA2 coming in power in 2009 for the second term. While NDA Government has been consistent at 73% in 2016, 71% in 2015 and 73% in 2014, it is definitely not the most trusted in the world.", "When main stream media pushes out such news without any verification, it has a larger ripple effect than fake news sites. A 10 minute basic google search would have prevented these main stream media organisations from becoming the source of misinformation.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]