["About this rating", "On Aug. 25, 2019, Axios reported that “President Trump has suggested multiple times to senior Homeland Security and national security officials that they explore using nuclear bombs to stop hurricanes from hitting the United States.” Citing “sources who have heard the president's private remarks and been briefed on a National Security Council memorandum that recorded those comments,” Axios described two of those occasions in detail:", "During one hurricane briefing at the White House, Trump said, \"I got it. I got it. Why don't we nuke them?\" according to one source who was there. \"They start forming off the coast of Africa, as they're moving across the Atlantic, we drop a bomb inside the eye of the hurricane and it disrupts it. Why can't we do that?\" the source added, paraphrasing the president's remarks ...", "Trump also raised the idea in another conversation with a senior administration official. A 2017 NSC memo describes that second conversation, in which Trump asked whether the administration should bomb hurricanes to stop them from hitting the homeland. A source briefed on the NSC memo said it does not contain the word \"nuclear\"; it just says the president talked about bombing hurricanes.", "Reacting to the report, Trump declared it to be “fake news,” suggesting the claim that he “wanted to blow up large hurricanes with nuclear weapons prior to reaching shore” was “ridiculous.”", "The story by Axios that President Trump wanted to blow up large hurricanes with nuclear weapons prior to reaching shore is ridiculous. I never said this. Just more FAKE NEWS!", "— Donald J. Trump (@realDonaldTrump) August 26, 2019", "In response, Axios reporter Jonathan Swan, who reported the story with Margaret Talev, tweeted that he stood by what he wrote, reiterating Axios' sourcing:", "I stand by every word in the story. He said this in at least two meetings during the first year and a bit of the presidency, and one of the conversations was memorialized. https://t.co/5qs8o1k4QS", "— Jonathan Swan (@jonathanvswan) August 26, 2019", "Snopes cannot independently verify the claims of anonymous sources cited in the Axios story, or claims contained within documents we have not seen. As such, we rank the claim \"Unproven.\" This rating could change if corroborating information becomes public.", "Swan, Jonathan and Margaret Talev.   “Scoop: Trump Suggested Nuking Hurricanes to Stop Them from Hitting U.S.”\r\n    Axios.   25 August 2019.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]