["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The November column by the PETA Foundation’s Heather Moore was just in time to save you from holiday traditions like roasted ham or cooking your turkey with a little bacon for that extra flavor.", "Citing the World Health Organization’s latest pronouncements on the links between cancer and red meat, Moore’s op-ed piece encouraged \"the meat-eating public\" to give up all animal-based foods and embrace the vegan lifestyle.", "She was nearly finished with her attack on eating pigs and cows when she made this point: \"each vegan spares more than 100 animals every year.\"", "So a non-vegan eats at least 100 animals a year?", "We searched through the PolitiFact archives and found PolitiFact Georgia had fact checked a similar claim in 2011 after the People for the Ethical Treatment of Animals had made Bill Clinton its \"Man of the Year.\"", "On that occasion, PETA claimed a plant-based diet \"spared the lives of nearly 200 animals per year.\" PolitiFact Georgia rated that claim Half True and now PETA, in its Nov. 17 column in The Providence Journal, referred to the same statistic by saying \"more than 100.\"", "PETA’s data hasn’t changed — only the way the data is characterized. After all, \"nearly 200\" is indeed \"more than 100.\"  Moore, in an email, pointed us to virtually the same data and analysis that PolitiFact Georgia reviewed in 2011.", "But now, that information, which is available on the Internet, includes a note about the 2011 PolitiFact ruling that faulted PETA for not saying that small sea creatures such as shellfish made up an overwhelming majority of the nearly 200 \"animals.\"", "The calculation cited by PETA and Moore starts with the total number of animals raised in the United States or imported for American consumption, based on statistics from the U.S. Department of Agriculture, the National Oceanic Atmospheric Administration and other sources,", "Then all the cows, pigs, fish, and fowl, shellfish, lobsters and other crustaceans are divided by the people in the country who eat them. The product of that calculation is the animal death toll for which PETA blames the average American meat eater.", "Chris Hurt, a professor of agricultural economics at Purdue University, told PolitiFact Georgia that, although misleading, he found the statement technically accurate.", "Our ruling", "Perhaps the most misleading thing about Moore’s column is that from the opening sentences onward she writes about pigs and cows and the health risks of meat eating. She doesn’t touch on fish or fowl (or crustaceans) in her argument.", "She concludes: \"Researchers have found that people who eat plant-based meals are between 25 and 50 percent less likely to get cancer, and each vegan spares more than 100 animals every year.", "\"Bacon isn't worth dying for — not for people and certainly not for pigs. With so many tasty vegan foods to enjoy, kicking the meat habit is entirely possible. And it could save your life.\"", "There is no way a reader would know that the 100 animals she refers to are mostly animals that live underwater as opposed to the barnyard animals that she and the World Health Organization warned us not to eat.", "This is the point PolitiFact Georgia made four years ago as noted by her source. And although Moore referred to \"more than 100\" rather than saying \"nearly 200,\" she still fails to provide the context that’s necessary to understand how the number is calculated.", "For that reason, the Half True in 2011 becomes a Mostly False in 2015.", "ProvidenceJournal.com, \"Bacon Addicts Anonymous,\" Nov. 17, 2015, accessed Nov. 19, 2015", "PolitiFact.com, \"PETA claims Clinton saving 200 animals annually,\" Aug. 31, 2011, accessed Nov. 19, 2015", "Email from Heather Moore, Nov. 20, 2015", "Animal Death Count, \"How Many Animals Die to Feed Americans,\" 2011, accessed Nov. 20, 2015", "PETA.org; \"Vegan Diets: Healthy and Humane,\" 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]