["Michael van der Veen walks to the Senate floor through the Senate Reception room on the fourth day of the Senate Impeachment trial on Capitol Hill on Feb 12, 2021, in Washington. (The Washington Post via AP)", "Utah activist John Sullivan was arrested nine days after the Jan. 6 insurrection for allegedly breaking into the U.S. Capitol. However, he denied being part of antifa, a broad coalition of left-wing activists.", "Many suspected members of right-wing groups were arrested around the same time as Sullivan. Photos and video from the riot show that Donald Trump supporters were prevalent in and around the Capitol.", "The FBI has said antifa activists are not suspected in the insurrection.", "On the fourth day of the Senate impeachment trial, a lawyer for former President Donald Trump singled out a left-wing activist as a key instigator of violence at the U.S. Capitol on Jan. 6.", "From the Senate floor, Michael van der Veen blamed \"extremists of various different stripes and political persuasions\" for the insurrection, which took place while Congress counted electoral votes. However, he named one group in particular.", "\"One of the first people arrested was a leader of antifa,\" said van der Veen, a personal injury lawyer. \"Sadly, he was also among the first to be released.\"", "\"Antifa\" is short for anti-fascist. The term refers to a broad left-wing coalition of activists that seek to protest white supremacy and other far-right causes, sometimes by using violence. It is not a single group, but rather an ideology.", "The House of Representatives impeached Trump on Jan. 13 and charged him with \"incitement of insurrection,\" maintaining he stoked doubt over the results of the 2020 election and encouraged protesters in Washington to march toward the Capitol. However, Trump’s defense team says Trump did not direct his followers to participate in the Jan. 6 insurrection — instead, they argue, the crowd was infiltrated by extremists.", "RELATED: A timeline of what Trump said before Jan. 6 Capitol riot", "We’ve debunked several claims that antifa activists were behind the Capitol insurrection, so we wanted to take a closer look at van der Veen’s claim.", "A left-wing activist was arrested nine days after the riot for allegedly breaking into the Capitol. However, he denied being part of the antifa coalition. There is no evidence that antifa activists incited or planned the insurrection. Many members of right-wing groups were arrested around the same time.", "We reached out to van der Veen through his law firm to find out who he was referencing in his comment. We did not get a response. But coverage of arrests following the Capitol riots did describe one controversial left-wing activist from Utah as being among those who stormed the Capitol. His name is John Sullivan, the founder of Insurgence USA, an activist group that says it protests police brutality.", "Sullivan was arrested Jan. 14 and charged with one felony count of interfering with law enforcement in connection with a civil disorder, as well as misdemeanor charges of unlawful entry and disorderly conduct. He was released from jail the next day.", "A U.S. magistrate judge placed strict restrictions on Sullivan. He was banned from using social media and attending protests, given a location monitor, and ordered to remain at his home and look for a job outside of Insurgence USA. He was also prohibited from possessing firearms.", "Sullivan’s Twitter accounts frequently used #antifa, #blm, and other anti-Trump or anti-police hashtags. He has also been filmed using incendiary language in the past. But Sullivan previously told PolitiFact that he’s not part of the antifa coalition. And Sullivan has been singled out before by some left-wing activists as not being fully aligned with their cause. An FBI affidavit filed in support of the criminal complaint did not mention Sullivan being part of any anti-fascist groups, and we could find no other criminal history.", "Many other criminal complaints explicitly tie rioters to right-wing groups including the Three Percenters, Proud Boys and Oath Keepers  — names that van der Veen did not mention on the Senate floor.", "The U.S. Attorney’s Office for the District of Columbia has charged dozens of people with crimes related to the Capitol riot. Some of the suspects were arrested days before Sullivan was taken into custody.", "Take for example Jacob Chansley, a QAnon supporter known as the \"Q Shaman,\" who was arrested Jan. 9 and charged with violent entry, disorderly conduct, and with \"knowingly entering or remaining in any restricted building or grounds without lawful authority.\" Two other men were charged the same day: Adam Johnson of Florida, who was photographed in the Capitol wearing a Trump knit hat, and Derrick Evans, a former Republican member of the West Virginia House of Delegates. Both were arrested prior to Chansley.", "Other rioters sporting right-wing causes were arrested around the same time as Sullivan.", "Kevin Seefried of Delaware was photographed carrying a Confederate battle flag after allegedly breaking into the Senate building through a window. He was taken into custody Jan. 14. Then there’s Robert Packer, who was arrested Jan. 13 in Newport News, Va. Packer was photographed inside the Capitol wearing a sweatshirt emblazoned with \"Camp Auschwitz,\" a reference to the Nazi death camp.", "The Washington Post combed through footage from the insurrection and identified other symbols associated with neo-fascists and extremist groups. Affidavits from the FBI also allege that several suspected rioters had ties to right-wing groups.", "There is no evidence that antifa activists played a similar role.", "The Associated Press reviewed public records for more than 120 people identified at the insurrection and found that they included GOP donors, members of far-right militia, and supporters of QAnon. ProPublica archived more than 500 videos taken Jan. 6 that show people in and around the Capitol wearing Trump apparel and carrying Confederate flags. FBI Assistant Director Steven D'Antuono said during a Jan. 8 press briefing that there was \"no indication\" that antifa activists were involved in the insurrection.", "Van der Veen said during the Senate impeachment trial that after the Capitol insurrection, \"one of the first people arrested was a leader of antifa.\"", "That’s not accurate. There is no evidence that antifa activists were behind the Jan. 6 riot.", "Sullivan was arrested nine days after the insurrection. He posted #antifa on social media, but he has denied being a part of antifa and an affidavit associated with his arrest did not mention him being a part of the coalition. Many other criminal complaints explicitly tie rioters to right-wing groups that van der Veen did not mention.", "His claim contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Associated Press, \"Records show fervent Trump fans fueled US Capitol takeover,\" Jan. 10, 2021", "BuzzFeed News, \"The FBI Says There's No Evidence Of Antifa Involvement In The Capitol Mob,\" Jan. 8, 2021", "C-SPAN, Impeachment Trial, Feb. 12, 2021", "Deseret News, \"Judge releases Utahn charged in U.S. Capitol riot despite objections,\" Jan. 15, 2021", "The New York Times, \"Notable Arrests After the Riot at the Capitol,\" Jan. 10, 2021", "PolitiFact, \"Ask PolitiFact: What is antifa, and why is it all over my timeline?\" July 2, 2021", "PolitiFact, \"A timeline of what Trump said before Jan. 6 Capitol riot,\" Jan. 11, 2021", "PolitiFact, \"Facebook posts wrongly claim left-wing activist, antifa ‘incited’ US Capitol mob,\" Jan. 8, 2021", "PolitiFact, \"FBI investigation of Capitol riot focuses on far-right groups,\" Jan. 20, 2021", "PolitiFact, \"Here’s how we know Trump’s repeated claim of a landslide victory is wrong,\" Jan. 6, 2021", "PolitiFact, \"READ: House article of impeachment against Donald Trump,\" Jan. 13, 2021", "PolitiFact, \"There’s no proof antifa stormed the Capitol. The rumor spread quickly anyway,\" Jan. 7, 2021", "PolitiFact, \"What Donald Trump’s impeachment response leaves out,\" Feb. 2, 2021", "ProPublica, \"What Parler Saw During the Attack on the Capitol,\" Jan. 17, 2021", "UNITED STATES OF AMERICA v. JOHN EARLE SULLIVAN, AFFIDAVIT IN SUPPORT OF CRIMINAL COMPLAINT AND ARREST WARRANT, Jan. 13, 2021", "U.S. Department of Justice, Capitol Breach Cases", "U.S. Department of Justice, \"Three Men Charged in Connection with Events at U.S. Capitol,\" Jan. 9, 2021", "U.S. Department of Justice, \"Two Delaware Men Charged in Federal Court Following Events at the United States Capitol,\" Jan. 14, 2021", "U.S. Department of Justice, \"Two Men Charged in Connection with Events at U.S. Capitol,\" Jan. 10, 2021", "U.S. Department of Justice, \"Utah Man Charged in Federal Court Following Events at the United States Capitol,\" Jan. 14, 2021", "The Washington Post, \"Identifying far-right symbols that appeared at the U.S. Capitol riot,\" Jan. 15, 2021", "Vanity Fair, \"ONE OF TRUMP’S IMPEACHMENT LAWYERS IS A PERSONAL INJURY ATTORNEY WHO SUED TRUMP LAST YEAR,\" Feb. 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]