["About this rating", "Claims of Bibles being found undamaged and intact at the site of disasters (e.g., fires, shipwrecks) that destroyed nearly everything else around them is a common religious trope, one often likened to a modern-day form of miracle.", "One putative instance of that phenomenon which is frequently shared on social media is a photograph of an encrusted book described as an \"ancient Bible\" that was \"found at the bottom of the ocean\" and yet remained \"still readable\":", "In fact, the pictured object was not a Bible, nor was it discovered in the depths of any ocean.  The tome was actually a German-English dictionary used as part of a crystallization experiment described and pictured in a 2014 blog post.", "The experimenter, Catherine McEver, described on her \"Stuff You Can't Have\" blog how seeing crystallized books during a maker studio tour in San Francisco inspired her to engage in some artistic crystallisation experiments of her own using books and other paper ephemera:", "Interest in crystallization was piqued by a maker studio tour in San Francisco, during which I saw artist Alexis Arnold's crystallized books made using 20 Mule Team Borax. They were enchanting and I wanted to know how it was done, but she was charging $400 for a how-to workshop. Upon googling after arriving home I found that the 20 Mule Team Borax website offers the dead-simple instructions for growing crystals absolutely free, and a box of Borax from the local supermarket costs less than $6.", "The formula:\n- Use a glass or porcelain container large enough to immerse whatever object you want to crystallize.\n- Boil water, and make a super saturated solution in your container using 1 cup boiled water per 3 tablespoons Borax.\n- Immerse object (and in the case of the book, arrange pages using chopsticks) and wait for crystals to grow.\n- When you think it's crystallized enough, remove from solution and dry on drying rack. The book shown took less than 24 hours.", "The end result is a fixed object - crystallized and surprisingly heavy.", "McEver performed similar crystallization experiments on objects such as reading glasses, photographs, seashells and rocks, and even fairy dresses.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]