["About this rating", "Following the 14 February 2018 school shooting at Marjory Stoneman Douglas in Parkland Florida, people began posting information about planned school walkouts and protests, frequently with the hashtags #schoolwalkout or #nationalschoolwalkout. Readers wrote in confused about the various dates promoted by different groups.", "Below is a breakdown of planned events.", "On 20 and 21 February 2018, students from at least 50 high schools in South Florida participated in a walkout in one of at least two regional demonstrations staged by students in response to the shooting in Parkland. The Sun Sentinel reported:", "Perhaps the largest crowd came Wednesday [21 February 2018] afternoon when teens from various schools all converged on Marjory Stoneman Douglas High, where authorities say Nikolas Cruz shot and killed 17 people. The demonstrators’ long lines snaked for several city blocks, visible through the aerial images captured by news helicopters. Drivers passing by honked their horns in support ... U.S. Sen. Bill Nelson, D-Fla., was outside Marjory Stoneman praising students. “You all are so strong and you are so articulate,” Nelson told the students as they nodded. “Keep that message going on, because if you don’t, it’ll get swallowed up into the same ol’ same ol’, just like it’s been.”", "14 March 2018", "Women's March Youth EMPOWER, an organization sponsored by the Women's March Network — which planned large-scale protests the day after Donald Trump's inauguration and a year afterwards — is planning a walkout for 14 March. It would be for 17 minutes, one minute for each of the people killed in the Parkland shooting:", "24 March 2018", "Survivors of the 14 February shooting at Margery Stoneman Douglas High School and other students are planning a protest in Washington, D.C., called \"March for Our Lives.\" The event has caught the interest of celebrities, including Oprah Winfrey and George and Amal Clooney, who have donated large amounts of money to the event. \"Sister marches\" will take place in cities around the world.", "20 April 2018", "The most highly publicized walkout appears to be planned for 20 April 2018, the 19th anniversary of the massacre at Columbine High School in Colorado. Details about the event vary across social media from a full-day absence to signing children out (or having students walk out) at the time the Columbine massacre occurred. At least one high school has threatened disciplinary action against any student participating in a school walkout.", "On Facebook, a \"No Kids Left\" event was scheduled for 20 April 2018, which urged parents to keep their children out of school for the entire day:", "Parents and Caregivers, please keep your children out of the classroom on Friday, April 20, 2018, the 19th anniversary of the Columbine HS massacre. This will be a simulation of the extreme outcome if we continue to only offer thoughts & prayers when our children are murdered at school. #nokidsleft", "Together let’s send a message to our representatives & the current administration in Washington to take action. I'm a mom who doesn't know what else to do, but we must do something. Please share this event & RSVP to show your solidarity.", "Please help families who cannot afford to stay home from work by offering your service of child care.", "NOTE: We are working with www.noshootings.com to make the 19th anniversary of the Columbine shooting a day when no kids get shot because no kids will be at school.", "The Twitter account @schoolwalkoutUS, created in February 2018 provided a date of 20 April and clarified that the event was separate from the 24 March demonstrations:", "On Friday, April 20th we want students to attend school and then promptly WALK-OUT at 10:00 am. Sit outside your schools and peacefully protest. Make some noise. Voice your thoughts. \"We are students, we are victims, we are change.\"", "— National School Walkout (@schoolwalkoutUS) February 17, 2018", "We contacted event organizers for clarification, and National School Walkout responded:", "Hello, The Walkout is real. It will take place at 10:00 a.m. on the anniversary of the Columbine killings, April 20th, and will be an opportunity for young people to send a clear message that we will not tolerate inaction on gun violence. Other organizations are planning similar events and protests. We fully endorse those events as well, and we hope that together we can end the violence that terrorizes our country.", "Chokey, Aric, Juan Ortega and Brett Clarkson.   \"'Enough Is Enough,' Students Chant As Thousands Stage Walkouts Across South Florida.\"\r\n    Sun Sentinel.   21 February 2018.", "Williams, David.   \"Schools Threaten To Punish Students Who Join Walkouts Over Gun Control.\"\r\n    CNN.   21 February 2018.", "Women's March.   \"ENOUGH: National School Walkout.\"\r\n    Accessed 22 February 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]