["About this rating", "Many social media users have grown weary of posts that simply seem too good to be true, ones that promise financial rewards to themselves or worthy causes in exchange for simple interactions such as liking or sharing posts.", "This weariness comes with good reason: We've tracked countless of scams and hoaxes promising money (or other rewards) in exchange for tweets, likes, shares, or mentions. So when the hashtag #BellLetsTalk began to trend on Twitter on the morning of 30 January 2019, along with the promise that the telecommunications company Bell Canada would donate 5 cents for every tweet using the hashtag, it wasn't surprising to see some social media users were skeptical of the fundraising effort.", "One reader wrote to us to say: \"This is making its way around Facebook. 'please send this to all ur friends $0.05 will be donated for every send. Bell let’s talk.' Real or fake way to gather info? Thank you for your help.\"", "Bell Canada held their first \"Bell Let's Talk Day\" in 2011 in an effort to raise both money and awareness for mental health issues. In general, on \"Bell Let's Talk Day\" the company promises to donate 5 cents for various social media interactions, including tweeting with the hashtag #bellletstalk, viewing the official \"Bell Let's Talk\" video, or (if you're a Bell Wireless customer) simply sending a text message:", "It’s Bell Let’s Talk Day 2019 and you’re invited to talk, text and get engaged in the conversation on Twitter, Facebook, Instagram and Snapchat all day long to help fight the stigma, call for action and drive Bell’s donations to mental health at no cost to you. Today, we’re ready to surpass 1 billion all-time Bell Let’s Talk Day messages of support for mental health, while Bell’s total funding commitment to mental health is set to top $100 million.", "Here's the official list of the ways that the public can help raise money and awareness for mental health with Bell Canada:", "Join the conversation to drive Bell donations", "It’s easy to be part of the Bell Let’s Talk Day conversation all day long and across multiple communications platforms. Bell donates 5 cents to Canadian mental health programs for each of these interactions, at no extra cost to participants beyond what they would normally pay their service provider for online or phone access:", "At the end of \"Bell Let's Talk Day in 2018,\" the company reported it had committed nearly $7 million to mental health initiatives. Since the first event in 2011, \"Bell Let's Talk Day\" has generated more than 850,000,000 interactions and has triggered close to $100 million in donations:", "Total Bell Let’s Talk Day interactions since the first event in 2011 stand at 867,449,649 and are expected to exceed an all-time total of 1 billion on January 30. Bell’s funding commitment for mental health, including the company’s donations based on Bell Let’s Talk Day engagement plus its original $50-million donation to launch the initiative, is now $93,423,628.80 and expected to surpass a total of $100 million on January 30.", "According to the company, the funds generated during \"Bell Let's Talk Day\" are used to provide grants to various projects and organizations that improve access to mental health care, such as the Strongest Families Institute, Bear Clan Patrol, and the St. Stephen’s Community House.", "Here's the official video for \"Bell Let's Talk Day\":", "BELL LET’S TALK DAY 2019 OFFICIAL VIDEO: Today, every view of this video makes a difference. All you need to do is watch it and Bell will donate 5¢ to mental health initiatives. Share to help spread the word! #BellLetsTalk pic.twitter.com/zVdFiEafYl", "— Bell Let's Talk (@Bell_LetsTalk) January 30, 2019", "Bell Canada.   \"It’s Bell Let’s Talk Day!\"\r\n    30 January 2019.", "Palvetzian, Sevaun.   \"Bell Let’s Talk Day Has Helped Make Mental Health a Top of Mind Issue.\"\r\n    Toronto.com.   28 January 2019.", "Gall, Karissa.   \"On Bell Let’s Talk Day, Psychologist Says Let’s Also Listen.\"\r\n    Nelson Star.   30 January 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]