["Sixteen people from Jammu & Kashmir and Ladakh cleared the Union Public Service Commission (UPSC) examinations 2019, as per media reports. The results were declared on August 4. News18 reported that two candidates from North Kashmir’s Kupwara district, Nadia Beig and Aftab Rasool, also cleared the exams. Two days later, several Facebook and Twitter users claimed that Beig’s Twitter account is full of “anti-national activities”. This was based on tweets by a Twitter account ‘@Nadia_Beigh’ which no longer exists. These screenshots below have been widely shared on social media.", "This slideshow requires JavaScript.", "Twitter account @kapilverma73 posted a tweet-thread on the matter. He referred to Beig’s alleged social media activity and questioned her “loyalty” to the nation. In one of his tweets he wrote, “Her one step can ruin our nation’s relationship with any nation, and a woman who has Pakistani ideology, won’t she have a soft corner for Pakistan? ( इसका एक कदम हमारे देश के किसी भी देश से रिश्ते बिगाड़ सकता है, और पाकिस्तानी आइडियोलॉजी वाली यह महिला क्या पाक के साथ सॉफ्ट कार्नर नहीं रखेगी ?). This tweet-thread gained over 15,000 likes and more than 9,000 retweets cumulatively. (archived link)", "This slideshow requires JavaScript.", "Similarly, other Twitter users also promoted the same claim (1, 2, 3). One of them wrote, “I had saved her tweets because I knew she will delete her account.”", "On August 3, a news website Samachar24x7 published a similar report with the headline — “How will Nadia Beig work as an IAS officer with her anti-national mindset? Will UPSC answer to the country?’ (archived link)", "Alt News has received several requests to fact-check this on WhatsApp (+917600011160) and on our official Android application.", "At first glance, we noticed that Twitter account @Nadia_Beigh spells Nadia’s last name incorrectly. Nadia’s last name is spelt as ‘Beig’ on the UPSC results. The screenshot below is from the UPSC’s official website.", "On August 4, @decibel008 tweeted a screenshot of a 2017 tweet by @Nadia_Beigh which shows a man’s picture with the hashtag #NewProfilePic.", "Hi Nadia Congratulations.. congratulations for fooling people & for getting new followers.", "Nadia ye tweet delete karna reh gaya.. aage se dhyaan rakhna.. IAS wale dimag use karhttps://t.co/dkCAs9Hku6 https://t.co/jZDDLOXolt pic.twitter.com/Q517iJfR5O", "— decibel (@decibel008) August 4, 2020", "Twitter user @@decibel008 also shared a screen recording of the now-deleted account where, at the 9-second mark, another picture of the same man is visible.", "But the information that irrefutably establishes that @Nadia_Beigh is a fake account is that the handle’s previous username was @IndolentUser. This is can be spotted at 18 seconds into the screen recording.", "Every Twitter account has a unique numeric ID which does not change even if the username is altered. The section below explains how we found that @Nadia_Beigh and @IndolentUser have the same numeric ID.", "Step 1: Alt News found archived tweets of @Nadia_Beigh and @IndolentUser on Wayback Machine, a digital archive of the world wide web founded by a US-based Internet Archive. As per the archived tweets of @IndolentUser, the username belongs to ‘Nayeem’.", "Step 2: We accessed HTML source codes of the archived web pages of @Nadia_Beigh’s tweet on August 4 and @IndolentUser’s tweet on July 25. The HTML source code can be viewed by right-clicking on the website, then selecting ‘View Page Source’ as shown below.", "Step 3: We performed a keyword search using the syntax ‘data-user-id’ on the respective source pages (@Nadia_Beigh and @IndolentUser) and found that both Twitter users have the same numeric Twitter ID ‘1860799123’.", "This slideshow requires JavaScript.", "Thus, @Nadia_Beigh was an imposter account of Kashmiri woman Nadia Beig who cracked the 2019 UPSC examinations. The account was believed be to authentic by several social media users including Congress member Salman Nizami (archived link).", "Donate Now", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]