["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential nominee Hillary Clinton takes the stage during the final day of the Democratic National Convention in Philadelphia, PA. (AP)", "During her acceptance speech at the Democratic National Convention, Hillary Clinton touted her experience as secretary of state, including her role in coming to a nuclear agreement with Iran.", "\"I'm proud that we put a lid on Iran's nuclear program without firing a single shot,\" she told the crowd in Philadelphia. \"Now we have to enforce it, and keep supporting Israel's security.\"", "Since the United States has not had any military skirmishes with Iran in the past year, what she said about not firing a shot is clearly true. But what about the part about putting \"a lid on Iran’s nuclear program\"?", "That’s a trickier question. Here, we’ll recap the fact checks we’ve done on the landmark arms-control agreement since it was struck in July 2015.", "In the big picture, the deal lifts international economic sanctions on Iran in exchange for the nation agreeing to curb nuclear technologies and allowing nuclear-weapons inspections for 10 to 25 years.", "A sticking point for critics is that while Iran has to give up 97 percent of its enriched uranium stockpile and most of its centrifuges that could enrich more, that capability is not gone entirely.", "Iran can have a reduced number of operating centrifuges for 10 years, but research and development on advanced centrifuges will be limited. Uranium enrichment is supposed to be kept at levels unsuitable for weapons use for the next 15 years. Iran also can no longer produce plutonium, the other element that could create a bomb.", "To make sure Iran is doing what it agreed to do, international inspectors will monitor known nuclear sites for those 15 years. They also can enter an undeclared site suspected of nuclear use, although Iran could take up to 24 days to allow inspectors into such sites. There’s been plenty of debate about how verifiable such activity can be.", "Surveillance of centrifuge production is slated to last 20 years, and uranium mills and mines will be monitored for 25 years. Iran also has to stick to the Nuclear Non-Proliferation Treaty that it signed in 1974, thereby no longer pursuing nuclear weapons. It must follow further international treaties, as well. Theoretically, Iran must abide by those treaties for good, even after the 25-year inspection time limit passes.", "Several experts have told PolitiFact that as long as Iran adheres to the terms of the agreement, it cannot build a nuclear weapon.", "A key mechanism of the agreement is that it lengthened Iran’s \"breakout time\" — how long it would take Iran to produce a nuclear weapon if it returned to building one. While some estimates put that time at two to three months before the deal, the breakout time is generally considered to be about a year under the terms of the deal.", "Iran \"does not have the uranium enrichment capacity to produce enough bomb-grade material,\" Daryl Kimball, executive director of the Arms Control Association, has told PolitiFact. \"It would take over a year. We would detect any attempt to do that within weeks, if not days.\"", "Richard Nephew, a research scholar and program director for economic statecraft, sanctions and energy markets at Columbia University, told PolitiFact in 2015 that the deal definitely impedes Iran’s nuclear program.", "\"Fifteen years of restrictions and upwards of 20 years of enhanced inspections will hardly facilitate an Iranian nuclear weapon,\" he said.", "However, all of this is contingent on Iran abiding by the agreement in perpetuity -- something that only time will tell.", "Matthew Kroenig of Georgetown University, a foreign policy adviser to the 2012 Mitt Romney presidential campaign, said that once the enrichment limit is gone, that could set the stage for a nuclear weapon.", "Installing more and more sophisticated centrifuges \"would take at least several months,\" he said.", "\"It is hard to know how long this would take because Iran never came clean on its past weaponization work, and we don't know how much progress they might be able to make covertly over the next 15 years,\" he said. \"But again, several months is a reasonable assumption.\"", "Next, it would need to marry the warhead to its ballistic missiles, but given its experience in mounting conventional warheads on its already sizable ballistic missile stockpile, this should be a relatively routine matter, Kroenig said. \"So, in sum, after the limits expire, it would likely still take Iran between several months and a year or so to have an actual deliverable nuclear weapon,\" he said. And \"to build an arsenal of nuclear weapons, it would take several years.\"", "Our ruling", "Clinton said, \"We put a lid on Iran's nuclear program without firing a single shot.\"", "There are lots of uncertainties about how well the accord will hold up over time, and especially what will happen once some of its provisions expire. As the saying goes, there are no guarantees in life.", "Still, most independent experts we have checked with agreed that the deal is both effective on paper and close to the best outcome the United States could have achieved through diplomatic means. So we’re giving it some benefit of the doubt.", "As long as you define \"put a lid on\" as \"keep in check\" -- a definition we think is reasonable -- rather than \"ensure something will never, ever happen,\" then Clinton has a plausible case. We rate her statement Mostly True.", "https://www.sharethefacts.co/share/36d26cd0-52c4-49c6-a2a5-cd7e0d61b130", "Hillary Clinton, speech to the Democratic National Convention in Philadelphia, July 28, 2016", "PolitiFact Florida, \"Deal allows Iran to produce nuclear weapon, U.S. Senate candidate Carlos Beruff says,\" May 11, 2016", "PolitiFact, \"Donald Trump says Iran military will have nuclear weapons as soon as enrichment limits expire,\" March 24, 2016", "PolitiFact, \"Donald Trump says Iran military will have nuclear weapons as soon as enrichment limits expire,\" March 24, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]