["With Election Day just days away and amid an ongoing pandemic, some social media users have claimed that if Democratic presidential nominee Joe Biden is elected, a COVID-19 vaccine would be mandatory.", "“Biden said he will mandate the COVID Vaccine,” reads an Oct. 17 Facebook post. “Trump said he would never mandate the vaccine. Any questions?” USA TODAY reached out to the user for comment.", "An Oct. 9 Instagram post makes a similar claim.", "\"Joe Biden and Kamala Harris believe that they have the right to refuse a vaccine because they do not like the current president,\" the post, shared by user @Bye_bye_big_pharma, reads. It goes on to suggest Democrats want to \"mandate vaccines so that parents don't have the same right to choose for their own children.\"", "The post has received nearly 7,000 likes since it was posted on Oct. 9, and the comments have largely concurred with @Bye_bye_big_pharma's position.", "\"So effing (sic) scary!\" one comment read.", "\"Say no to vaccines especially Covid,\" wrote another.", "The poster did not reply to USA TODAY's request for comment.", "Fact check: COVID-19 vaccine won't be ready in weeks, nor mandatory", "Biden has said if elected he would listen to the advice of experts and public health professionals and that a vaccine mandate would be based on its efficacy.", "While on the campaign trail in September in Wilmington, Delaware, Biden said he is more “hopeful than ever in the power of science” to create a vaccine. However, he added that trust in the vaccine would depend on whether Trump gives “honest answers” on its safety, effectiveness and distribution.", "Speaking to reporters at the event, Biden said he would also rely on experts when it comes to who would have first access to the vaccine. He made no mention of mandating vaccines, according to video footage from the event on C-SPAN.", "During Biden’s Oct. 15 town hall in Philadelphia with ABC News, a voter asked the former vice president if he would mandate that all Americans receive a vaccine if one were approved between now and the end of the year.", "In response, Biden said, “If the body of science is saying that this is what is ready to be done and they're — it's been tested and they've gone through the three phases — yes, I would take it and I'd encourage people to take it.\"", "He added that mandating its use would depend on what kind of positive impact it would have, and “the state of the nature of the vaccine when it comes out and how it’s being distributed.”", "Biden also stated he would consider enforcing COVID-19 vaccines the way the measles vaccine is handled.", "\"You can't come to school until you have a measles shot. You can't,\" Biden said. \"But you can't say, everyone has to do this.\" He added that he would encourage local and state leaders to implement mandates.", "Biden's plan to combat the coronavirus also has no mention of mandating vaccines.", "Fact check: Claims of nationwide protests affecting Biden's poll performance lack context", "During the first vice presidential debate on Oct. 7, Harris was asked if she would be immunized, should the COVID-19 vaccine be approved by the Trump administration.", "\"If the public health professionals, if Dr. Fauci, if the doctors tell us that we should take it, I'll be the first in line to take it. Absolutely,\" the vice presidential nominee said according to a USA TODAY full transcript of the event.", "However, she clarified if the president \"tells us that we should take it, I'm not taking it.\"", "Both Biden and Harris' deference to scientific expertise refers to Trump's repeated attempts to push for a vaccine release in time for the upcoming election.", "In September, Trump went as far as to contradict Centers for Disease Control and Prevention Director Robert Redfield's comment that a vaccine would likely not be available until 2021, and earlier this month, in a video following his hospital release, Trump again claimed a vaccine would be ready \"momentarily.\" But doctors and scientists have refuted that claim.", "Trump's words have gone against what most public health experts believe is a safe and realistic timeline for the vaccine candidates still undergoing clinical trials.", "Redfield said that even once a vaccine is approved, only limited amounts would be initially available.", "Dr. Moncef Slaoui, chief adviser of Operation Warp Speed, the U.S. effort to accelerate vaccine developments, told ABC News that approximately 20 million to 40 million doses of a vaccine — if authorized by the end of the year — would be distributed to a limited population.", "\"Now, not every one in that population can be immunized in December, but the companies will continue to manufacture and produce vaccine doses — and in January, we plan to have about 60 to 80 million doses of those two vaccines,\" Slaoui said.", "During a White House press briefing on Sept. 16, the Trump administration outlined its plan for vaccine distribution once authorized, saying the military is \"lined up.\" No one at the briefing stated that vaccinations would be mandated.", "Dr. Anthony Fauci, the United States' top infectious diseases official, has also previously stated that the government would not make any future COVID-19 vaccine mandatory.", "\"You don't want to mandate and try and force anyone to take a vaccine. We've never done that,\" Fauci said during a video conference organized by George Washington University. \"You can mandate for certain groups of people like health workers, but for the general population you can't.\"", "We rate the claims that Biden and the Democrats would mandate COVID-19 vaccines, and Trump never would, as PARTLY FALSE, based on our research. The Biden COVID-19 plan has no mention of a immunization mandate. Biden has stated that would largely depend on its efficacy and \"when it comes out and how it's being distributed.\" Biden and Fauci have also acknowledged that a president can't enforce a mandate. It is true that the Trump administration's vaccine distribution plan also has no mention of forcing people to get a vaccine.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]