["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A doctored photo claims to show President Donald Trump in blackface, but it's fake.", "As some Virginia Democrats try to fend off accusations of racism in the wake of Gov. Ralph Northam’s admission that he once dressed up in blackface, fake photos of other current and former elected officials have appeared in social media feeds. First there was a picture of a woman in blackface wrongly identified as Hillary Clinton. North Carolina Gov. Roy Cooper was also wrongly ensnared.", "Now, there’s a doctored image of President Donald Trump.", "\"And here we have a picture of President Trump,\" reads the text above a photo of Marla Maples and what looks like Trump wearing blackface. \"Yup, it’s him.\"", "The post was published on Facebook on Feb. 20 and it was quickly flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It is a photo of Trump, but it’s been doctored to look like he was dressed up in blackface. The original, unedited image was taken by photographer Ron Galella on Sept. 9, 1992, when Maples and Trump attended the U.S. Open Tennis Championship in New York City.", "Here, and in other photos from that day, the president doesn’t appear in blackface.", "We rate this post Pants on Fire.", "Facebook post, Feb. 20, 2019", "The Washington Post, \"Virginians are split on governor’s fate amid blackface scandal, poll shows,\" Feb. 9, 2019", "PolitiFact, \"No, Hillary Clinton wasn’t pictured in blackface,\" Feb. 4, 2019", "Getty Images, Marla Maples and Donald Trump during 1992 U.S. Open Tennis Championship, Sept. 9, 1992", "Getty Images, photos of \"Marla Maples, Donald Trump, US Open,\" visited Feb. 21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]