["The aftermath of the presidential election has prompted a cascade of claims of deliberate manipulation of vote counting.", "One Facebook user on Nov. 16 claimed: \"Nevada AG Admits to Changing Signature Verifications Manually for Over 200,000 Votes. Everyone Knows this, right?\"", "At first, the claim seems puzzling, given the gravity of the charge and the fact that Nevada Attorney General Aaron Ford is a Democrat.", "James Dehaven, political reporter for the Reno Gazette-Journal, says he has no knowledge of any such explosive quote by Ford.", "Jon Ralston, a political reporter and editor of The Nevada Independent, says the claim that the attorney general made the statement statement is \"crazy talk.\"", "\"I don’t even know what to say about this because it’s so insane,\" Ralston tells USA TODAY in an email. \"Ford would not have the ability to do this, nor has he ever said he did so.\"", "More:Fact check: What's true and what's false about the 2020 election", "As it turns out, the quote comes from a former Nevada attorney general, Adam Laxalt, a Republican and co-chairman of the Trump campaign in Nevada.", "Laxalt made the charge in an interview with Fox News that was then carried by the Fellow American Daily, with the erroneous headline: \"Nevada AG Admits That They Changed Signature Verification Manually for Over 200,000 Votes\"", "In the interview, Laxalt restates allegations of manipulated voting systems but does not offer hard evidence that specific votes were changed.", "“It’s important to understand first and foremost, how insecure this system is. We have over 600,000 mail-in ballots that have been counted — those are votes that are official in our system. We also know that we have unclean rolls — ballots that have been mailed to dead people, to people who have moved out of state, and people that got a dozen ballots in their homes, etc,” Laxalt said.", "\"We have over 200,000 of those votes have been verified by machine only,\" and then quotes computer experts as saying that changes in the machine's calibrations for comparing signatures  would \"cast grave doubt on the 200,000 signatures that were verified.\"", "More:Nevada Supreme Court certifies Biden's presidential win, praises state's top election official", "The signature verification issue has come up in lawsuits involving the 2020 elections. One brought by the Trump campaign alleged the manipulation of sorting systems in heavily Democratic Clark County to allow for potentially fraudulent mail-in ballots to be rejected and then visually inspected. This purported recalibration of the sort machine, the suit claimed, \"is making it harder for Clark County officials to catch improper or fraudulent mail in ballots as opposed to the rest of Nevada.\"", "Carson City District Court Judge James Wilson this month dismissed an earlier Republican-led effort to block Clark's use of the machines. Wilson said the suit provided \"no evidence\" to support claims of an unlawful vote count.", "The issue was raised again in yet another lawsuit, filed Nov. 17, raising questions about signature verification machines. The suit charges among other things that \"issues\" with machines used to verify signatures \"constitute a malfunction of the machine sufficient to raise reasonable doubt as to the outcome of the election.\"", "The lawsuit, which is still pending, does not include any specific allegation that votes were changed.", "USA TODAY asked the Facebook user for more information on the claim but did not get an immediate response. Freedom American Daily did not respond immediately to an inquiry as to whether it stood by the headline that apparently prompted the Facebook post.", "Based on our research, we rate the claim that Nevada's attorney general admitted to  changing signature verifications manually FALSE. The statement regarding allegations that votes were changed by a signature verification machine was made by the former attorney general of Nevada, a Republican and co-chairman of the Nevada Trump campaign, and not by current Attorney General Aaron Ford, a Democrat.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]