["By Sydney Schaedel", "Posted on June 28, 2017", "Q: Did President Donald Trump sign an executive order that prevents immigrants living in the U.S. without legal permission from receiving welfare?", "A: No. Some bogus websites have twisted the facts about a draft executive order that Trump has not signed.", "Did President Trump sign an executive order that stops illegals from collecting welfare benefits?", "No. The fact is that those living in the U.S. illegally are already ineligible for federal benefits with a few exceptions.", "But a story published on several unreliable websites in February falsely claimed that President Donald Trump “signed an executive order that prevents illegals from using welfare.” Skeptical Facebook users flagged a shorter version of the story published June 19 on President45DonaldTrump.com as possibly fake news.", "Both versions claim that “President Trump signed an executive order according to which any illegal who lives on welfare will be sent home” and that “America will no longer accept people who come here to live on our expense.”", "The stories misrepresent a Jan. 31 Washington Post article that said “the Trump administration is considering a plan to weed out would-be immigrants who are likely to require public assistance, as well as to deport — when possible — immigrants already living in the United States who depend on taxpayer help.” The Post story was about legal immigrants, not those living in the U.S. illegally.", "The Post made it clear that the order was only a draft and hadn’t been signed.", "Washington Post, Jan. 31: The Trump administration is considering a plan to weed out would-be immigrants who are likely to require public assistance, as well as to deport — when possible — immigrants already living in the United States who depend on taxpayer help, according to a draft executive order obtained by The Washington Post.", "A second draft order under consideration calls for a substantial shake-up in the system through which the United States administers immigrant and nonimmigrant visas, with the aim of tightly controlling who enters the country and who can enter the workforce, and reducing the social services burden on U.S. taxpayers.", "The drafts are circulating among administration officials, and it is unclear whether President Trump has decided to move forward with them or when he might sign them if he does decide to put them in place. The White House would not confirm or deny the authenticity of the orders, and White House officials did not respond to requests for comment about the drafts Monday and Tuesday.", "According to the draft text — which is dated Jan. 23 — the order would, among other things, “deny admission to any alien who is likely to become a public charge; identify and remove, as expeditiously as possible, any alien who has become a public charge and is subject to removal; and seek reimbursement from all sponsors of immigrants for the costs of federal means-tested public benefits provided to sponsored immigrants.”", "Federal law already states that “an individual who is likely at any time to become a public charge is inadmissible to the United States and ineligible to become a legal permanent resident.” That’s according to the U.S. Citizenship and Immigration Services, which defines a public charge as “an individual who is likely to become primarily dependent on the government for subsistence, as demonstrated by either the receipt of public cash assistance for income maintenance or institutionalization for long-term care at government expense.”", "The draft order says that has been the rule “for over a century,” but claims that “past administrations in recent years have failed to enforce this policy.”", "In addition, federal law says that an immigrant in the country illegally “is not eligible for any Federal public benefit” with few exceptions. They can only receive emergency medical care; short-term, non-cash emergency disaster relief; limited testing and treatment for communicable diseases; in-kind community programs like soup kitchens or crisis counseling, as specified by the attorney general; and limited housing or community development assistance to those already receiving it in 1996.", "Yet, one version of the viral stories claims, without evidence, that “Former President Barack Obama allowed illegals in America to apply and get on welfare.”", "Trump did declare at a campaign-style rally on June 21 that “I believe the time has come for new immigration rules which say that those seeking admission into our country must be able to support themselves financially and should not use welfare for a period of at least five years.” He added, “And we’ll be putting in legislation to that effect very shortly.”", "That would presumably be in addition to the Personal Responsibility and Work Opportunity Reconciliation Act, which President Bill Clinton signed in 1996. It blocks many legal immigrants from receiving a range of federal benefits for five years.", "Trump’s proposed FY 2018 budget, which was released in May, calls for controlling the cost of benefits paid to immigrant-headed households. But it offered no details on how that would be accomplished beyond reducing the number of refugees, curbing illegal immigration and increasing merit-based legal immigration.", "But Trump has not “signed an executive order that prevents illegals from using welfare.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“President Trump Signed An Executive Order That Prevents Illegals From Using Welfare. Do You Support This?” Readconservatives.news. 24 Feb 2017.", "Conservative Army. “President Trump Signed An Executive Order That Prevents Illegals From Using Welfare.” Usapoliticstoday.com. Accessed 27 Jun 2017.", "Moore, Rachel. “President Trump Signed An Executive Order That Prevents Illegals From Using Welfare.” Worldpoliticus.com. 1 Feb 2017.", "Laney, Joseph. “UPDATE: Trump Announces Addition To Illegal Ban, Any Immigrant Found On Welfare DEPORTED.” Conservativedailypost.com. 31 Jan 2017.", "“President Trump Signed An Executive Order That Prevents Illegals From Using Welfare.” President45donaldtrump.com. 19 Jun 2017.", "Hauslohner, Abigail, and Ross, Janell. “Trump administration circulates more draft immigration restrictions, focusing on protecting U.S. jobs.” Washington Post. 31 Jan 2017.", "Ross, Janell. “Trump draft executive order full of sound and fury on immigration, welfare and deportation.” Washington Post. 2 Feb 2017.", "“Draft executive orders on immigration.” Washington Post. Accessed 27 Jun 2017.", "U.S. Citizenship and Immigration Services. “Public Charge Fact Sheet.” 29 Apr 2011, accessed 27 Jun 2017.", "U.S. Citizenship and Immigration Services. Public Charge. 3 Sep 2009, accessed 27 Jun 2017", "Legal Information Institute. “8 U.S. Code § 1611 – Aliens who are not qualified aliens ineligible for Federal public benefits.” Accessed 27 Jun 2017.", "C-Span.org. “President Trump Remarks in Iowa.” Video. 21 Jun 2017.", "Siskin, Alison. “Noncitizen Eligibility for Federal Public Assistance: Policy Overview.” Congressional Research Service. 12 Dec 2016.", "Federal Register. 2017 Donald Trump Executive Orders. Accessed 27 Jun 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]