["A video has been circulating on social media where a man affectionately kisses a Muslim bride on her cheek. State Joint Secretary of Akhil Bharatiya Vidyarthi Parishad (ABVP) Delhi Anima Sonkar shared the video with the caption, “What will this be called? Because in his most celebrated TV series “Satyamev Jayate” Mr.Secular Aamir Khan did not show any social evil in Islamic society!”", "इसे आसमानी किताब में क्या कहा गया हैं ?", "Because in his most celebrated TV series “Satyamev Jayate” Mr.Secular Aamir Khan did not show any social evil in Islamic society! pic.twitter.com/VfRApKLz2d", "— Anima Sonkar (@AnimaSonkar) August 23, 2020", "BJP Delhi leader Gaurav Khari shared the same video on Facebook and wrote, “After making her sign the Nikahnama, maulvi blessed her in a special manner.”", "ABP News journalist Astha Kaushik shared the video writing, “Even the bride’s mother and friends will not grab her in this manner. Elders give affectionate blessings.” This tweet drew over 7,000 likes and more than 2,000 retweets.", "ऐसा झपट्टा तो दुल्हन की अम्मी-सहेली भी नहीं मारा करतीं🤭😐 …बड़े-बुजुर्ग तो स्नेह से आशीर्वाद दिया करते हैं🙄 pic.twitter.com/D54pBJeUCJ", "— Astha Kaushik (@Asthakaushik05) August 23, 2020", "The clip was also shared by other social media users with similar claims.", "Ye Kyaa Tha Bc? pic.twitter.com/4IKrX1Ucow", "— Prem 🇮🇳 (@Kill__Hour) August 22, 2020", "The man in the video is the bride’s father. On August 19, Facebook page ‘Islamabad style_icon’ had uploaded the video with the caption, “Now my daughter begins a new life… but I want her to know that her father will always be there for her ”", "Now my daughter begins a new life and there will be another person who she’ll turn to for love and protection, but I want her to know that her father will always be there for her ❤️ 📸: @zamalsamanphotography", "Posted by Islamabad style_icon on Tuesday, 18 August 2020", "The page ‘zamalsamanphotography’ (Zamal & Saman Photography) was tagged in the post. The company does bridal and other kinds of photoshoots. It’s based out of Pakistan. After the video went viral, a clarification was posted by the page on Facebook and Instagram which said that the social media claims have upset the bride and her father. The company had also shared the video on their page but took it down after it was used to further a vulgar narrative,", "Guys please stop spreading hate please", "Posted by Zamal & Saman Photography on Wednesday, 19 August 2020", "Speaking with Alt News, Zamal & Saman Photography said they have been the family’s personal photographer for the last three years.", "A video of a father affectionately kissing his daughter on her wedding day was shared on social media with distasteful comments by individuals associated with the BJP.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]