["A collage of photographs is viral on social media with the claim that these are photographs of the Babri masjid, taken from the collection of the British library. All the photos are in black and white.", "#BabriMasjid Photos from British Library. pic.twitter.com/ah747rzGO5", "— Zainab. (@Zainab_216) November 12, 2019", "— Shaykh Abdul Raheem (@ShkhAbdulRaheem) November 10, 2019", "Alt News found these photographs have been circulating online for several years. The Facebook post below, for instance, is of December 2017.", "Babri Masjid Inside pictures joh British Library main hain !!", "Posted by Bhindi Bazaar on Sunday, December 10, 2017", "A total of four photographs have been circulated with the aforementioned claim. Alt News found that except for one, these pictures do not pertain to the now demolished Babri masjid. Let us take a look at each of these photos.", "Alt News reverse-searched the above image and found that it does indeed represent the Babri masjid. The photograph was clicked in the early 1990s, and the credit for the image has been given to ‘The British Library Board’.", "On reverse-searching the above image, Alt News found it is from Turkey. The photograph in question represents the Green mosque, known in Turkish as the Yeşil Camii. It is situated in Bursa, Turkey.", "The above image is not of the Babri masjid, as claimed. Alt News reverse-searched the image and found a like image, posted on the automobile website, Team BHP. It represents a portion of the Ibrahim Rauza, the mausoleum complex located in Bijapur, Karnataka and commissioned by Ibrahim Adil Shah II (1579-1627 CE).", "Alt News found the above photograph of the pillar on the stock photography website Alamy. According to Alamy, the image is of the Noh Gunbad mosque located at Balkh in Afghanistan.", "It may thus be noted that except for one photograph, the rest of the pictures do not represent the Babri masjid.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]