["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "We noticed this blogger meme on Facebook and decided to check it out.", "An unsavory Facebook meme is reigniting alarm about the content of Big Macs.", "According to the meme, the patties at McDonald’s are skimpy on real beef and heavy on \"meat filler,\" which the meme links to cancer. Meat filler is also called \"pink slime\" -- a nickname the beef industry insiders consider pejorative -- and made waves with consumers several years ago after a 2011 episode of Jamie Oliver’s Food Revolution and an 11-part ABC News investigation.", "McDonald’s said back then that it pulled the product from its grills. But a meme circulating this summer suggests otherwise.", "The claim has been around in some form since 2002. One of the most recent versions, sourced from an anonymous blogpost on Raw For Beauty, says \"McDonald’s hamburgers are only 15 percent ‘real beef,’ the other 85 percent is meat filler cleansed with ammonia, which causes stomach and intestinal cancer.\"", "We wanted to know more about this \"meat filler,\" what place, if any, it has in McDonald’s burgers, and if it is linked to cancer.", "Big Mac smack", "First, McDonald’s says it no longer uses the \"meat filler\" in question.", "This claim has been debunked numerous times since 2011, and it has also been addressed multiple times by McDonald’s. In an FAQ about its meats, the fast food giant acknowledged that it once used \"pink slime\" -- or the industry preferred term, \"lean, finely textured beef\" -- in its products but has since stopped the practice:", "\"McDonald’s USA had begun the process of removing it from our supply chain prior to widespread media coverage on its use and it was completely removed from our supply in 2011. While select lean beef trimmings are safe, we decided to stop using the product to align our global standards for beef around the world.\"", "As for what exactly is in the patties, McDonald’s writes, \"Our burgers in the US are made using only 100 percent USDA-inspected beef. There are no preservatives, no fillers, no extenders and no so-called ‘pink slime’ in our beef. The only thing added to our burgers is a bit of salt and pepper during grilling.\"", "The \"pink slime\" rumor oozed its way to Down Under, too, forcing McDonald’s Australia to release a video and tell a concerned customer, \"Rest assured, Dana, it’s not true. Our beef patties are all 100 percent export quality Aussie beef, free of preservatives, additives, fillers and binders.\"", "Despite rising costs of beef, McDonald’s has no plans to reintroduce lean, finely textured beef (the preferred industry term term for what critics call \"pink slime\"), said McDonald’s spokeswoman Lisa McComb.", "Primer on \"meat filler\"", "But what exactly is lean, finely textured beef, and is it considered \"real beef\"?", "When Beef Products Inc., began making the product in 1991, the industry cheered it as revolutionary.", "Essentially, the goal is to get every piece of meat off of the bone, and then sanitize it so it is safe to eat. Here’s how the process works:", "About 25 percent of the carcass remains after taking whole muscle cuts (sirloins, briskets, ribs, etc). The remaining fat trimmings with bits of meat still attached are then put through a heat and centrifuge process, which separates the fat and produces 93 to 97 percent lean meat, according to BPI.", "Because the trimmings often are more susceptible to contamination, the meat is then treated with ammonium hydroxide gas to kill pathogens, like salmonella and E. coli. The U.S. Department of Agriculture does not require ammonium hydroxide to be included in the ingredients, considering it part of the process rather than part of the meat.", "The resulting meat has a finer texture. \"That’s why you wouldn’t have a hamburger that would be made from nothing but LFTB – the texture would be softer,\" said Eric Mittenthal, a spokesperson for the American Meat Institute, a national trade association.", "The lean beef typically comprises no more than 15 percent of a burger, which consumers actually prefer over 100 percent coarse muscle meat, according to Edward Mills, a professor of meat science at Pennsylvania State University. At 25 percent, most people will notice an obvious difference in taste.", "So a burger with 85 percent of the lean product -- the amount pinpointed in the meme -- is not realistic.", "Several meat science professors we interviewed consider this product to be \"real beef,\" even if consumers don’t. That perspective aligns with the U.S. Department of Agriculture definition of meat, which is meat \"derived from advanced meat/bone separation machinery which is comparable in appearance, texture and composition to meat trimmings and similar meat products derived by hand.\"", "Under this definition, lean, finely textured beef -- the official term for \"pink slime\" -- is real beef, and a hamburger containing it could still be labeled 100 percent beef. The USDA does not require disclaimers of lean, finely textured beef in meat labels, but some companies, such as food giant Cargill, have opted to sticker their products if it includes this product.", "A cancer link?", "Now let’s look at the potential health effects of eating this kind of beef. Could it really lead to stomach and intestinal cancer?", "PolitiFact Georgia looked into a claim that \"pink slime\" is safe and rated it Mostly True.", "A 2009 New York Times piece detailed how the much-lauded sanitation process behind lean, finely textured beef was not as effective in killing pathogens as BPI said --  even as the meat spread to school cafeterias through the federal school lunch program. Between 2004 and late 2009, the product tested positive for salmonella 36 times out of 1,000, a rate four times greater than other suppliers, the Times reported.", "The story also quoted a USDA scientist referring to the product as \"pink slime.\" Gerald Zirnstein wrote to USDA colleagues in 2002, \"I do not consider the stuff to be ground beef, and I consider allowing it in ground beef to be a form of fraudulent labeling.\"", "The story raised a lot of eyebrows, spurring petitions and additional coverage from Oliver’s food show and others. McDonald’s joined Taco Bell and Burger King in no longer using meat treated with ammonium hydroxide in 2012, the Daily Mail reported.", "But meat experts said BPI’s product is just as safe -- or unsafe -- as all other beef products.", "The poultry industry has used meat from fat trimmings for 40 years, said Ted LaBuza, a professor of food science at the University of Minnesota. And ammonium hydroxide is used in many food products, such as puddings and cheese, and at levels 10 times higher than in meat, said Mittenthal and Mills.", "We could not find any studies to suggest that ammoniated beef can lead to stomach cancer or other intestinal disease. Even if you eat a burger with lean, finely textured beef every day, \"you wouldn’t even come close\" to posing a serious hazard to your health --  at least, not because of the ammonium hydroxide, said Mills.", "And it’s fairly common to use ammonia and other chemicals -- such as citric acid, which can leave a sour flavor -- to treat meat, LaBuza said.", "Chances of becoming sick are actually lower with beef from McDonald’s compared to a local butcher, who is beholden to less stringent standards than fast food restaurants, he said.", "Our ruling", "An Internet meme accuses McDonald’s of using hamburger meat that contains only 15 percent \"real beef,\" with the rest made up of a \"meat filler cleansed with ammonia, which causes stomach and intestinal cancer.\"", "McDonald’s stopped using the \"filler\" in question -- lean, finely textured beef or its somewhat misleading nickname \"pink slime\" -- back in 2011. When the product was on the grills, the burger most likely contained nowhere near 85 percent of meat filler, as experts said most consumers would notice a difference in taste after 25 percent.", "What’s more, the lean beef does not have any documented links to cancer.", "Email interview with Janeal Yaney, professor of meat science at the University of Arkansas, Aug. 28, 2014", "Interview with Bill Marler, food safety attorney and publisher of Food Safety News, Aug. 28, 2014", "Email Interview with Eric Mittenhal, spokesperson for the American Meat Institute, Aug. 28, 2014", "Email interview with Lisa McComb, spokesperson for McDonald’s, Sept. 2, 2014", "Interview with Ron Adams, professor of marketing at the University of North Florida, Sept. 2, 2014", "Interview with Ted LaBuza, professor of food science at the University of Minnesota, Sept. 2, 2014", "Interview with Edward Mills, professor of meat science at Penn State University, Sept. 3, 2014", "Youtube, Jamie Oliver's Food Revolution: Pink Slime - 70% of America's Beef is Treated with Ammonia, Apr. 12, 2011", "ABC News, Pink Slime and You, Mar. 7, 2012", "Raw for Beauty, McDonald’s Hamburgers are only 15% \"Real Beef\", Apr. 2, 2014", "USDA FSIS, Meat and Poultry Labeling Terms, June 5, 2013", "Cornell University, 9 CFR 319.15 - Miscellaneous beef products, Oct. 31, 2001", "Cargill, Cargill announces new labeling for Finely Textured Beef, Nov. 5, 2013", "New York Times, Safety of Beef Processing Method Is Questioned, Dec. 30, 2009", "Beef Products Inc., History, 2014", "Beef Products Inc., LFTB Frequently Asked Questions, 2014", "USDA FSIS, SAFE AND SUITABLE INGREDIENTS USED IN THE PRODUCTION OF MEAT, POULTRY, AND EGG PRODUCTS, Aug. 5, 2014", "Consumer Federation of America, Statement of Chris Waldrop, Consumer Federation of America’s  Director of Food Policy on Lean Finely Textured Beef, Mar. 26, 2012", "National Consumers League, The undeserved reputation of \"Pink Slime\" is tested again, Sept. 2013", "Daily Mail, Victory for Jamie Oliver in the U.S. as McDonald’s is forced to stop using ‘pink slime’ in its burger recipe, Jan. 27, 2012", "Associated Press, 5 FOOD WRITERS SUBPOENAED IN 'PINK SLIME' LAWSUIT, Jul. 29, 2014", "TIME, The Surprising Reason ‘Pink Slime’ Meat Is Back, Aug. 26, 2014", "Los Angeles Times, Ask Laz Pink slime is back. Question is: Who's using it?, Aug. 15, 2014", "Consumerist, McDonald’s Reminds Customers That It No Longer Uses Pink Slime In Burgers, May 13, 2014", "Business Insider Weekly, McDonald's Addresses Claims About 'Pink Slime' In Its Beef (Again), May 13, 2014", "Snopes, 100% Beef, Apr. 8, 2014", "McDonald’s, Meats, 2014", "Youtube, Is it true your burgers contain meat filler and pink slime?, Mar. 2, 2014", "McDonald’s, Your Questions, 2014", "PolitiFact, Don't call it pink slime, Georgia official says, Apr. 10, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]