["Social media has been abuzz recently with several photos of an artist hard at work making an intricate wood carving. It’s being claimed that he is the famous artisan Gulfan of Uttar Pradesh’s Saharanpur. Netizens are stating that it took the artist six to eight months to make this design of the Masjid-e-Haram. A Facebook user named Mohammad Anas shared the pictures with the same claim on October 9. His post was shared more than 6,000 times at the time of writing. (archived link to the post)", "The photos and accompanying claim have made their way to Twitter as well.", "The famous artisan Gulfam Bhai of Saharanpur has proved by making it that the district Saharanpur is no less than anyone in the world What a beautiful design of Masjid-e-Haram made with Mashaallah wood It took 6 to 8 months to make it.♥️♥️♥️ @Umm_e_Meeran @kausar_nargis @GMK07 pic.twitter.com/cJe8pALaWf", "— Wasim Hashmi (@WasimHa01751071) October 10, 2020", "Alt News also received a request to fact-check the images on our Whatsapp number (+91 76000 11160).", "A reverse image search revealed that the photos actually show a carving of Mecca, considered the holiest city in Islam. We also found that the whole piece was made out of teak wood. The source image was found in a post by a Facebook page called ‘Saudi Buzz’, which also reported that the carving would be completed by the end of 2020.", "Look: Islamic Holy Site Makkah handcrafted from solid teak wood over a period of 6-8 months. The 3 dimensional carving…", "Posted by Saudi Buzz on Tuesday, 6 October 2020", "A few other Facebook pages such as Riyadh Express and Ksa News and Culture also shared the pictures with this information. Both pages attributed the image credits to mahajati.com, a website for a bespoke wood art and decor company whose logo can also be seen in each of the photos. However, Alt News was not able to access the company’s website. While trying to access its Facebook and Instagram pages, we got an error message stating ‘Restricted’. We then found a Whatsapp number for the company given on snapppt.com. Through this, we were able to get in touch with Mohammad Mohdar, the founder and CEO of Mahajati. “This carving was made by my own company. It is a Singapore registered company and our products are delivered worldwide,” said Mohdar. He explained that the ban on Indian users was a protective measure since the company’s designs and photographs had been stolen many times in the past.", "Since Mohdar told Alt News that the Mahajati website was blocked in India, we tried accessing it using VPN (Virtual Private Network) and Tor Browser and confirmed that it had indeed been blocked for IP addresses from the country.", "He shared a screenshot of the Mahajati Instagram feed containing thumbnails of the viral photos.", "The Mahajati logo is also visible on the T-shirts worn by the artist here.", "Therefore, this viral image does not show one Saharanpur artisan Gulfam working on a wooden rendition of the Masjid-e-Haram. It is actually a carving of the city of Mecca, considered holy in Islam, made by artists from Mahajati, a decor company registered in Singapore.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]