["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Facebook users are sharing a supposed quote of Saddam Hussein — and warning that Democrats are using his advice as political strategy.", "\"We cannot defeat America by the sword. America must be defeated within their politics,\" reads the statement attributed to the deceased Iraqi dictator.", "The Feb. 14 Facebook post  goes on to say that Hussein \"was telling the truth and this is exactly what the Democrats are doing by seating one Muslim at a time.\"", "It’s been shared more than 93,000 times and was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Searching for the quote online we found 10 results, but they were from meme websites like me.me or awwmemes.com,", "In 2006, Hussein testified in his defense against charges of crimes against humanity, and he called on Iraqis to join together to defeat the U.S.-led occupation in Iraq, according to C-SPAN. But in reviewing that testimony, we didn’t read anything like the quote that appears on Facebook.", "Searching for the quote in the news archive Nexis we found no results. Nor did we find it searching Google Books, or reviewing online versions of \"Saddam’s War of Words\" and \"The Saddam Tapes,\" which contains annotated transcripts of audio recordings of meetings between Hussein and his allies.", "We reached out to the author of \"The Saddam Tapes\" and others who have studied Iraq and Hussein, but they were all unfamiliar with the quote.", "Kevin Woods, the book’s author, said \"the idea behind the quote is implicit in many of the discussions between Saddam and Tariq Aziz,\" Hussein’s top aide, but that the quote wasn’t something he recognized.", "Samuel Helfont, assistant professor of strategy and policy, U.S. Naval War College, told us in an email that \"it sounds like something he would say, and that was certainly his strategy in the 1990s/early 2000s.\"", "Amatzia Baram, a professor of Middle Eastern history at the University of Haifa in Israel, said the only case where he sees Hussein implying an idea like the statement in the Facebook post stems from his 1990 meeting with April Glaspie, then the U.S. ambassador to Iraq. It was a week before Hussein invaded Kuwait, Baram said, and he told Glaspie that since the Vietnam War, the United States can’t afford casualties but Hussein can. (\"Yours is a society which cannot accept 10,000 dead in one battle,\" he told Glaspie, according to Newsweek.)", "\"The connotation was that American war policies can be influenced through casualties,\" Baram said.", "If evidence emerges that Hussein made the statement attributed to him in the Facebook post, we’ll reconsider our ruling. But lacking any proof that this attribution is accurate, we rate the post False.", "Facebook post, Feb. 14, 2019", "C-SPAN, Saddam Hussein trial, March 15, 2006", "\"The Saddam Tapes: The Inner Workings of a Tyrant’s Regime, 1978-2001,\" Sept. 30, 2011", "\"Saddam’s War of Words: Politics, Religion, and the Iraqi Invasion of Kuwait,\" April 1, 2004", "Newsweek, Saddam’s endgame, Jan. 6, 1991", "The New York Times, U.S. Messages on July 1990 meeting of Hussein and American ambassador, July 31, 1991", "Email interview with Lisa Blaydes, professor of political science, Stanford University, Sept. 23, 2019", "Email interview with Samuel Helfont, assistant professor of strategy and policy, U.S. Naval War College, Sept. 24, 2019", "Email interview with David Patel, associate director for research, Crown Center for Middle East Studies, Brandeis University, Sept. 24, 2019", "Email interview with Joseph Sassoon, Al-Sabah chair in politics and political economy of the Arab world, Georgetown University, Sept. 24, 2019", "Email interview with Amatzia Baram, professor, department of middle east history, University of Haifa, Sept. 24, 2019", "Email interview with David Palkki, assistant professor, department of strategy, Air War College, Sept. 24, 2019", "Email interview with Kevin Woods, deputy director, Joint Advanced Warfighting Division, Institute for Defense Analyses, Sept. 26, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]