["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Energy policy and gas prices garnered a lot of attention in the town-hall style debate between President Barack Obama and Republican challenger Mitt Romney.\n\nRomney accused Obama of stifling domestic production and said he would champion the oil and coal industries. Obama fired back that Romney hasn’t always been such a proponent of coal.\n\n\"Governor, when you were governor of Massachusetts, you stood in front of a coal plant and pointed at it and said, ‘This plant kills,’ and took great pride in shutting it down. And now suddenly you're a big champion of coal,\" Obama said.\n\nPolitiFact Ohio has looked into this bit of Bay State history before, rating a statement similar to this one. We’ll recap.\n\nThe Salem Harbor Power Station\n\nBack on Feb. 5, 2003, Romney made several statements during a showdown over the future of the controversial, coal-burning Salem Harbor Power Station, in the Boston area.\n\nA couple of years earlier, Massachusetts had passed new rules to reduce power plant emissions of nitrogen oxide, sulfur dioxide, carbon dioxide and mercury, to be phased in over several years. The mercury standard would not be finalized until 2004. As governor, Romney supported the rules, as he made clear repeatedly.\n   \nMassachusetts singled out its most egregious polluters as the \"Filthy Five\" plants, including Salem Harbor. Public health and environmental scientists at Harvard studied the emissions from two of the plants in 2000 and concluded that Salem Harbor was responsible for 53 deaths, 570 emergency room visits, 14,400 asthma attacks and 99,000 incidents of upper respiratory symptoms -- all per year.\n   \nLocal residents and others who wanted to keep the Salem Harbor plant open (for jobs and tax revenues) disputed those figures, saying they resulted from unproven modeling. It turned out that the Harvard scientists had revised their figures in 2002, putting premature deaths from Salem Harbor’s pollution at 30 per year and reducing the number of emergency room visits to 400 and the asthma attacks at 2,000, according to the Boston Globe and the Boston Herald.\n   \nBut the scientists stood by the broader conclusion -- that emissions from dirty power plants can be deadly. The Harvard methodology has now been widely replicated and is respected by health scientists, according to several environmental authorities we spoke with. Romney appeared to accept their findings, too.\n\nThe spat with Salem Harbor turned into a testy exchange after Salem Harbor’s then-owner, Pacific Gas and Electric, sought an extension until 2006 to comply with Massachusetts’ emissions rules -- and plant supporters showed up to to demand that the governor back off. Romney was adamant that the company comply by 2004 and appeared at a press conference near the plant to emphasize the point.\n\nHis statements that day show how he felt, and they’re documented in this video: \"I will not create jobs or hold jobs that kill people, and that plant -- that plant kills people.\"\n\nOur ruling\n\nObama said Romney has changed his tune about coal, claiming that in Massachusetts he \"stood in front of a coal plant and pointed at it and said, ‘This plant kills.’\"\n\nRomney was the newly elected governor when a showdown erupted over the coal-burning Salem Harbor Power Station. Obama quoted Romney accurately when he said the governor entered the controversy by saying the plant \"kills people.\"\n\nWe rate his statement True.", "PolitiFact Ohio, \"Barack Obama says Mitt Romney condemned coal-fired power plants as killers,\" Aug. 14, 2012", "Youtube.com, \"Romney in 2003: ‘I Will Not Create Jobs That Kill People’\"\n\nMitt Romney’s comments outside Century Mine, Beallsville, Ohio, Aug. 14, 2012\n   \nObama for America news release, \"Romney’s comments overlook facts on coal,\" Aug. 14, 2012\n   \nEmail exchange with Jessica Kershaw, Obama for America spokeswoman, Aug. 15 and 16, 2012\n   \nEmail exchange, Christopher Maloney, Romney campaign spokesman, Aug. 15 and 16\nCommonwealth of Massachusetts, \"Romney, Healey enforce power plant regulations,\"news release, Feb. 6, 2003\n   \nBoston Globe, \"Romney says Salem plant must clean up, workers decry 2004 deadline,\" by David Arnold, Feb. 6, 2003\n   \nGreenwire, \"Massachusetts: Gov, Romney orders one of ‘Filthy Five; to clean up,\" Feb. 7, 2003\n   \nVideo of Romney in 2003 with comments about coal plants, YouTube\n   \nU.S. EPA data on emissions, Air Markets Program Data and eGRID databases, accessed Aug. 16, 17 and 20, 2012\n   \nEmissions data from EPA, examined by Conservational Law Foundation, Aug. 15, 2012\n   \nCommonwealth of Massachusetts, \"Response to comments for proposed amendments to emission standards for power plants,\" May, 2004\n   \nBoston Herald,  \"PG&E fights cleaning decision; Salem mayor wants proof of gov’s claim,\" by Donna Goodison, Feb. 13, 2003\n   \nTelephone interview with Jonathan Levy, Boston University and Harvard, Aug. 15, 2012\n   \nTelephone interviews with Seth Kaplan, Jonathan Peress and Shanna Cleveland, Conservation Law Center, Aug. 15, 2012\n   \nTelephone interview with John Walke, Natural Resources Defense Council Action Fund, Aug. 17, 2012\n   \nNENC.com, \"Cleaning up Salem Harbor\"\n   \nWall Street Journal, \"For Romney, 2005 was key year of policy shifts,\" by Jonathan Weisman, Nov. 11, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]