["This video was posted here on Facebook on November 11, 2020.", "The one-minute, eight-second clip shows hot water being poured over an apple, revealing a layer of white substance which can be peeled off.", "The Thai-language caption translates to English as: “You must peel apples every time before you eat. Look at this, it is a chemical coat called Paraffin, it will collect and gather in your intestines, which is dangerous.”", "The same video has been shared here, here, here, here and here on Facebook alongside a similar claim.", "The claim, however, is misleading.", "Dr. Kanitha Tananuwong, head of the food technology department in the faculty of science at Chulalongkorn University told AFP that the claim is “false”.", "During a phone conversation on November 16, 2020, she said: “The claim is not true. The wax coating fruits which are 'food grade' are safe to eat and not harmful to your body. Wax is used on fruits to maintain moisture and to prevent them from rotting too fast.”", "Dr. Kanitha said that although most wax coating on fruit are safe to consume, it should be washed before eating. “You may need to wash the fruit well before you eat it but this is not because of the wax, but rather the residues such as insecticide,” she added.", "Dr. Jessada Denduangboripant, a professor from the faculty of biology at Chulalongkorn University said “wax on an apples’ surface is edible” in a Facebook post published here on November 11, 2020.", "“We can safely consume this wax,” he said. “If it cannot be broken down and absorbed by our body’s digestive system, it will come out in our excrement”.", "According to this document published by the US Food and Drug Administration (FDA), waxed fruits and vegetables are safe to consume.", "Part of the document reads: “Components of coatings for fruits and vegetables may consist of food additives regulated under Part 172, where the condition of use permit this use; generally recognized as safe (GRAS) substances.”", "AFP Fact Check previously debunked a similar misleading claim about consuming food grade wax here after it circulated online in the Philippines.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]