["On August 29, Lucknow edition of Amar Ujala, a leading Hindi daily, published four images supposedly showing poor condition of roads in the city. In these images, a person wearing a helmet can be seen posing on pothole-ridden roads. Amar Ujala stated that these images were sent to them by a concerned citizen.", "UP Congress Committee’s social media vice-chairperson Pankhuri Pathak posted two similar-looking images and took a jibe at the ruling BJP government in the state. Pathak had also shared the images with the same claim on her Facebook page.", "गढही में भी नियम क ख्याल बा, अच्छे दिन वालन क भयल बुरा हाल बा। #गड्ढा_मुक्त_उत्तरप्रदेश pic.twitter.com/rx2GnOJv3v", "— Pankhuri Pathak पंखुड़ी पाठक پنکھڑی (@pankhuripathak) August 28, 2020", "In response to her tweet, some people tweeted a screenshot of an Instagram post where it was claimed that the images were from Bilaspur, a city in Congress-ruled Chattisgarh.", "This is from Bilaspur,Chhatishgarh and is ruled by Congress. pic.twitter.com/9dAkvHN8ar", "— Chinese Raoul. (@Bawol_Gandhi) August 28, 2020", "At the same time, some even claimed these images were from Bihar.", "गढही में भी नियम क ख्याल बा, अच्छे दिन वालन क भयल बुरा हाल बा। #गड्ढा_मुक्त_बिहार pic.twitter.com/iw14q39nd8", "— Deepak Rai (@Deepakrai07) August 28, 2020", "With a reverse image search on Russian search engine Yandex, we found the same images posted on a blog (aanavandi.com) on October 14, 2019. Here, the images were said to be from West Bengal.", "In the blog, some more similar images have been posted. One of the images shows a billboard carrying a picture of West Bengal CM Mamata Banerjee along with Bengali text.", "Moreover, the image on the blog seems to be a better quality photograph of the one viral on social media. With a closer look at the images, we were able to spot vehicles that bore a number plate beginning with “WB” suggesting that these are vehicles are registered in West Bengal.", "Upon performing a keyword search in Bengali, we found a report by Dhaka 18 which carried these images. According to the report, images of pothole-ridden roads in Malda were shot by a resident of West Bengal’s English Bazaar Sangeet Roy. It also informed that Roy had posted these images on his Facebook account.", "We found that Sangeet Roy had posted six images on October 13, 2019.", "রথবাড়ি", "Posted by সঙ্গীত রায় on Sunday, 13 October 2019", "Newschecker had earlier fact-checked these images. They are not from Uttar Pradesh, Chattisgarh or Bihar but from West Bengal.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]