["On March 19, BJP Delhi spokesperson Tajinder Pal Singh Bagga tweeted a video of Rahul Gandhi. The Congress leader is seen addressing a crowd and poses the question – “Ask them one thing, do they think unemployment has increased under the BJP rule?” In response, a boy can be heard saying, “It has not increased.” The viral video amassed more than 54,000 views and over 2,000 retweets at the time of writing. (Archive link)", "😂😂😂 pic.twitter.com/3zFEn6CBy6", "— Tajinder Pal Singh Bagga (@TajinderBagga) March 19, 2021", "Twitter user Atul Ahuja shared the clip and wrote, “What an amazing insult.” It racked up more than 22,000 views at the time of writing. (Archive link)", "Gajab beijjati hai yaar 😭😂 pic.twitter.com/sH7kTeWMJ9", "— Atul Ahuja (@atulahuja_) March 19, 2021", "Another Twitter handle called @ModiBharosa also posted this video. (Archive link)", "Gajab Beijjati Hai Yaar 😂😂😂 pic.twitter.com/S3jVe93dkf", "— Modi Bharosa (@ModiBharosa) March 19, 2021", "It is gathering a lot of traction on Facebook and Twitter.", "साला गजब बेइज्जती है यार😭😂", "Posted by Amar Purohit on Friday, March 19, 2021", "Alt News performed a keyword search on YouTube and found a March 19 video uploaded by the Indian National Congress. Rahul Gandhi is dressed in the same clothes as in the viral clip. The video is titled, ‘LIVE: Shri Rahul Gandhi interacts with College Students at Lahowal, Dibrugarh, Assam’. In the hour-long video, visuals from the clip in question appear after the 24:16 mark. The conversation between Rahul Gandhi and the audience member in the white shirt is as follows:", "Rahul Gandhi: “Ask them one thing, do they think unemployment has increased under BJP rule?”", "Student: “It has not increased.”", "Rahul Gandhi: “It has increased?”", "(The rest of the students explain the question to the person in the white shirt.)", "The student then says something in Assamese which is translated by another student – “He is saying that unemployment has increased.”", "It is noteworthy that the audience member in the white shirt, who first denied that unemployment has increased, speaks Assamese and is not fluent in Hindi. At 17:23, he talks to Rahul Gandhi in Assamese. The student did not understand Gandhi’s question and changed his answer to ‘unemployment has increased’ when the same was translated for him. Gandhi then asked him another question – “Why has unemployment increased during the BJP’s time” to which the youth again answers in Assamese – “Providing employment to the public is not part of the BJP’s ideology. They think the industry has to do all this. If the youth do not get jobs how will they move forward?”", "If one carefully listens to their conversation, it is clear that the student is critical of the BJP government.", "A clipped video of Rahul Gandhi’s interaction with students in Assam was shared by BJP Delhi spokesperson Tajinder Pal Singh Bagga.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]