["By Isabella Fertel", "Posted on September 20, 2019", "An outdated meme posted to Facebook this month falsely claims that the Trump administration is without a defense secretary, an interior secretary, an ambassador to the United Nations and a Secret Service director.", "A meme circulating on Facebook includes some inaccurate information regarding vacancies in President Donald Trump’s administration.", "The meme, which was posted on Facebook on Sept. 15, reads, “TRUMP CURRENTLY HAS: No Secret Service Director, no Homeland Security Director, no ICE Director, no Secretary of Defense, no Secretary of the Interior, no UN Ambassador, no White House Chief of Staff AND NO CLUE HOW TO RUN AMERICA.”", "It’s a cropped version of a meme that the liberal Facebook group Occupy Democrats posted back on April 9. Occupy Democrats credited that information to comedy writer Nick Jack Pappas, who tweeted out those same claims on April 8 and called Trump “an isolationist within his own administration.”", "At the time of Pappas’ tweet, the claims were mostly accurate. The Trump administration was, in fact, going through a period of significant turnover (and still is).", "However, over half of these claims are now false because four of the seven positions have been filled on a permanent basis. Only three of the positions cited are still occupied by individuals in an “acting” role, a title that Trump says he likes and gives him “great flexibility.”", "We’ll go through each of the claims below.", "“No Secret Service Director”", "That’s false. James Murray is the Secret Service director.", "The White House announced on April 8 that Randolph “Tex” Alles would depart as director in May. At the same time, however, it was announced that Murray would replace Alles. Murray was sworn in on May 1, so there was never a gap between Secret Service directors.", "“No Homeland Security Director”", "Alles’ announced departure came shortly after former Homeland Security Secretary Kirstjen Nielsen’s decision to leave the Trump administration. Nielsen posted her letter of resignation online on April 7. Trump designated then-Customs and Border Protection Commissioner Kevin McAleenan as acting secretary of Homeland Security — a position he still holds.", "“No ICE Director”", "Nielsen’s resignation came only days after Trump announced that he was withdrawing his nomination for director of Immigration and Customs Enforcement, Ronald Vitiello, who had been serving as the agency’s acting director since June 2018. Trump told reporters that he wanted to go “in a tougher direction” with his pick. Then he nominated Mark Morgan to be the next ICE director, but he was never confirmed by the Senate. Morgan served as acting director until he moved to Customs and Border Protection and was replaced by the man who currently holds the title of acting director, Matthew Albence.", "“No Secretary of Defense”", "That’s false. Mark Esper is secretary of the Department of Defense.", "When Pappas sent his tweet, Patrick Shanahan was the acting secretary of defense, a position he assumed after the outgoing defense secretary, Gen. James Mattis, left the department on Jan. 1. Esper replaced Shanahan as acting secretary in June. A month later, on July 23, Esper was overwhelmingly approved by the Senate 90-8 and sworn in as the new defense secretary.", "“No Secretary of the Interior”", "That’s false. David Bernhardt is secretary of the Department of the Interior.", "He was confirmed by the Senate, 56-41, two days after Occupy Democrats posted its meme in April. Prior to that, Bernhardt had been performing the duties in an acting capacity since Ryan Zinke resigned as interior secretary in December.", "“No UN Ambassador”", "That’s false. Kelly Craft, Trump’s former ambassador to Canada, is the U.S. representative to the United Nations.", "She was nominated to that post by Trump on Feb. 22, but was not confirmed by the Senate until July 31. She replaced former U.N. Ambassador Nikki Haley, who announced her resignation in October. After Haley vacated her post at the end of December, Jonathan Cohen served as the acting ambassador until Craft took office.", "“No White House Chief of Staff”", "Trump hasn’t had a permanent chief of staff since Gen. John Kelly stepped down in December. That same month, Trump announced that Mick Mulvaney, the director of the Office of Management and Budget, would become his acting chief staff — and he still is.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Acting Commissioner Mark A. Morgan.” U.S. Customs and Border Protection. Accessed 20 Sep 2019.", "White House. “Remarks by President Trump Before Marine One Departure.” 5 Apr 2019.", "“Ambassador Kelly Craft.” United States Mission to the United Nations. Accessed 20 Sep 2019.", "“Ambassador Nikki R. Haley.” U.S. House of Representatives Document Repository. Accessed 20 Sep 2019.", "Nielsen, Kirstjen M. Secretary, U.S. Department of Homeland Security. Letter sent to President Donald Trump. 7 April 2019.", "“Dr. Mark T. Esper.” U.S. Department of Defense. Accessed 20 Sep 2019.", "“ICE Leadership.” U.S. Immigration and Customs Enforcement. Accessed 20 Sep 2019.", "“James M. Murray.” Department of Homeland Security. Accessed 20 Sep 2019.", "“James N. Mattis.” U.S. Department of Defense. Accessed 20 Sep 2019.", "“Kevin K. McAleenan.” Department of Homeland Security. Accessed 20 Sep 2019.", "Keith, Tamara. “‘I Wasn’t Naive’: Getting Fired In The Trump Administration.” NPR. 12 Sep 2019.", "“Kirstjen M. Nielsen, Secretary of Homeland Security, 2017 – 2019.” Department of Homeland Security. Accessed 20 Sep 2019.", "Miller, Zeke, Long, Colleen and Jill Colvin. “Secret Service head Alles leaving, career official tapped.” AP News. 8 Apr 2019.", "“Mulvaney, Mick, (1967- ).” Biographical Directory of the United States Congress. Accessed 20 Sep 2019.", "“Patrick M. Shanahan.” U.S. Department of Defense. Accessed 20 Sep 2019.", "“Randolph D. “Tex” Alles.” Department of Homeland Security. Accessed 20 Sep 2019.", "“Remarks by President Trump During Visit to the Border Wall.” Whitehouse.gov. Accessed 20 Sep 2019.", "Sands, Geneva, and Kelly, Caroline. “Mark Morgan takes over as acting director of ICE.” CNN. 28 May 2019.", "“Secretary David Bernhardt.” U.S. Department of the Interior. Accessed 20 Sep 2019.", "“Secretary Nielsen Announces Ronald D. Vitiello to Serve as Acting Director of U.S. Immigration and Customs Enforcement.” Department of Homeland Security. Accessed 20 Sep 2019.", "Wolf, Zachary B. “Why Trump can’t fill the gaping holes in his government.” CNN. 10 Sep 2019.", "“Zinke, Ryan, (1961- ).” Biographical Directory of the United States Congress. Accessed 20 Sep 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]