["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ever heard of  Medi-scare? It’s political slang that means attacking opponents for their plans to rein in Medicare spending.", "Republicans say they’re victims of Medi-scare because Democrats keep distorting their recent proposal, a plan to turn Medicare into a program where seniors buy their own health insurance plans and the federal government pays part of the tab. The plan wouldn’t apply to anyone 55 or older, but would start for new enrollees in 2022. Still, it would be a dramatic change from the current system, where the government pays doctors and hospitals directly. A Democrat won a close special election in upstate New York on May 24 after campaigning against the plan, prompting Republicans to complain that Democrats were demagoguing the plan.", "Boo hoo, say Democrats like Debbie Wasserman Schultz. It was just last year that Republicans tried to scare seniors by telling them the health care law would gut Medicare spending, said Wasserman Schultz, who was recently named head of the Democratic National Committee.", "\"It's the pot calling the kettle black when it comes to who's engaging in Medi-scare,\" said Wasserman Schultz in an interview on MSNBC on May 25. \"The Republicans leading up to the 2010 election actually fabricated what Democrats did to Medicare. In fact, we added 12 years of solvency to Medicare and ensured that it would be better for seniors overall. And what the Republicans have done under Paul Ryan's plan is actually end Medicare as we know it, turn into it into a voucher program. There's no running from that.\"", "We documented a slew of Mediscare ads against Democrats during the 2010 election cycle. But we were interested in the wonkier question of whether the health care law did indeed add 12 years of solvency to Medicare. Solvency in this case means the money flowing into Medicare covers 100 percent of the bills for patient care.", "We started researching the issue, and at first, Wasserman Schultz seemed on solid ground. In August 2010, the Medicare Board of Trustees reported that the health care law did indeed add 12 years of solvency to Medicare Part A, the portion of Medicare that covers hospitalization. It also improved the financial outlook for Part B, which covers physicians’ services and other care. The report specifically credited the Democratic health care law, the Patient Protection and Affordable Care Act, passed earlier that year.", "We should note those estimates come with a few warnings. The report itself says that projecting health care costs into the future includes many uncertainties. Additionally, the report doesn’t include changes that Congress will likely make to current law, especially the predictable increases in payments to physicians known as the doc fix. Also, the independent chief actuary for Medicare questioned whether the projected cost savings were realistic.", "But overall, the board of trustees report is an official estimate for the Medicare program, the reports are put together with a consistent, detailed methodology, and its annual reports are usually referred to by both parties.", "The bigger problem with Wasserman Schultz's statement is that just a few weeks ago, the board of trustees issued a new report that revised its estimates for the health care law. Instead of adding 12 years of solvency, the board concluded, the law will only add eight years of solvency. Starting in 2024, the program will need either new revenues or reduced expenses to meet all of its obligations. The board said the shortfall was because of the continuing economic slowdown, which has reduced the Medicare program’s income from taxes, and a few other lesser factors.", "So Wasserman Schultz’s number is off by about a third.", "Nevertheless, her overall point, that the Democrats’ health reform law added to the overall solvency of Medicare, is correct. The 2011 report included the same warnings that estimating health care savings for the future is an uncertain process, but it also concluded that the financial outlook for Medicare is \"substantially improved as a result of the changes in the Affordable Care Act.\"", "The law reduced spending and increased revenues in several ways. It slows increases in payments to hospitals and nursing homes. It raises Medicare hospital taxes for high earners. And it introduces several new programs aimed at steering the health system away from paying doctors and hospitals per procedure (\"fee for service\") and instead paying for good outcomes.", "When we contacted her office, a spokesman said that the number may have been off, but the point was still right. \"The important thing is that Democrats moved to substantially extend the life of the Medicare Trust Fund while also making broad improvements to Medicare,\" said spokesman Jonathan Beeton.", "To summarize, Wasserman Schultz said that the Democratic health care law \"added 12 years of solvency to Medicare.\" She’s off on the number, citing an older, more optimistic report. The latest estimate indicates Medicare will only have eight additional years of solvency, one-third less than the previous estimate. But she’s right that the Affordable Care Act improved the financial outlook for Medicare, and that Democrats have successfully passed legislation to reduce future spending for the program. So we rate her statement Half True.", "MSNBC, interview with Debbie Wasserman Schultz, May 25, 2011, accessed via Nexis", "Centers for Medicare and Medicaid Services, Medicare Trustees report shows substantial improvement in financial status as a result of Affordable Care Act, Aug. 5, 2010", "U.S. Department of Health and Human Services, Trustees Announce Solvency of Medicare Trust Fund Extended By 12 Years to 2029, Aug. 5, 2010", "Centers for Medicare and Medicaid Services, Trustees report shows Medicare remains viable, but challenges remain, May 13, 2011", "PolitiFact Texas, Lamar Smith says that the Obama administration said the health care overhaul would reduce costs, but now acknowledge it will dramatically increase costs, Jan. 23, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]