["Rep. Alexandria Ocasio-Cortez, D-N.Y., has supported raising the minimum wage, forgiving student loan debt and increasing taxes for the wealthy.", "Now, in recent social media posts, Facebook users are raising questions about the New", "York congresswoman’s personal wealth.", "In a post shared more than 14,000 times, a Facebook user claims that Ocasio-Cortez “was broke” when she was first elected to Congress in 2018 but now has a net worth of more than $1 million.", "“How does that happen???” the user asked.", "Fact or fiction?:We're fact checking the news and sending it to your inbox. Sign up to get that here.", "Financial disclosures that members of Congress are required to file show that it didn’t. Ocasio-Cortez reported assets of between $2,003 and $31,000 in her most recent financial disclosure, filed in September 2020, and student loan debt between $15,000 and $50,000.", "While an analysis of financial disclosures by the Center for Responsive Politics last year found that the majority of members of Congress are millionaires, Ocasio-Cortez would not be one of them.", "Two Facebook users who shared the post did not respond to requests for comment.", "Ocasio-Cortez’s story of bartender-turned-congresswoman after upending an incumbent Democrat in a safely blue New York district is well documented. Through most of her 20s, Ocasio-Cortez “lived paycheck to paycheck,” according to Time.", "When she took office in 2019, Ocasio-Cortez reported in her first financial disclosure that she had a checking account, a brokerage account and a 401(k) plan through the National Hispanic Institute that were worth between $3,003 and $45,000.", "Her student loan debt through the U.S. Department of Education at the time was listed as between $15,001 and $50,000. During a September 2019 hearing on student loan debt, Ocasio-Cortez said she made a payment that had reduced her student loan debt to $19,000.", "Income from the taco restaurant where she tended bar and from her 2018 congressional campaign totaled $25,463. Members of Congress are paid $174,000 a year.", "Fact check:Viral posts make false claims about Friday the 13th, the next full moon", "After that report, the Center for Responsive Politics’ OpenSecrets.org ranked Ocasio-Cortez as one of the poorest members of Congress, where more than half of members have a net worth of at least $1 million.", "The congresswoman filed her next financial disclosure in September 2020. By then, she reported that the same three accounts held between $2,003 and $31,000 and that her student loan debt remained the same at between $15,001 and $50,000.", "Based on the $19,000 in student loan debt Ocasio-Cortez said she had in September 2019, she could be in the hole to the tune of nearly $17,000. Or her she could be worth up to $12,000.", "Ocasio-Cortez spokeswoman Lauren Hitt said the financial disclosure reports are accurate but provided no additional comment.", "While financial disclosures show that Ocasio-Cortez’s personal wealth has not skyrocketed during her time in Congress, her political fundraising has taken off alongside her national profile, according to Federal Elections Commission filings.", "During the 2020 election cycle, Ocasio-Cortez’s reelection campaign spent $17.3 million after raking in $21.2 million. That left her with about $4.3 million in her campaign coffers, according to the FEC.", "When she scored a surprise victory during the 2018 Democratic primary, Ocasio-Cortez spent about $1.8 million of the $2.2 million she raised.", "The Courage to Change political action committee the congresswoman launched last year to back progressive candidates challenging incumbent Democrats spent about $335,000 out of the $842,000 it raised, according to the FEC.", "She also raised about $5 million in February for Texans hit by a winter storm that left millions in the state without power, CNN reported.", "We rate the claim that Rep. Alexandria Ocasio-Cortez has racked up more than $1 million in net worth as a member of Congress FALSE, based on our research. In her most recent financial disclosure, filed in September 2020, Ocasio-Cortez reported between $2,003 and $31,000 in assets, compared with student loan debt of between $15,000 and $50,000.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]