["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Fraud by its very nature tries to hide from view. So when Rep. Peter Roskam, R-Ill., talked about how big the problem is for the Medicare program, he gave himself some wiggle room.", "Roskam was talking to Fox News about a bill he has that would borrow tools used in the credit card industry to pare down the tens of billions of dollars that criminal gangs and unscrupulous operators pocket from the federal government’s health care program for the elderly.", "\"Worldwide credit card transactions, the credit card fraud rate is 0.04 percent,\" Roskam told Fox News. \"Compared to almost 8 percent, 9 percent, 10 percent of Medicare fraud.\"", "When PolitiFact checked the size of Medicare fraud five years ago, we quickly discovered that hard and fast numbers are hard to come by. In this fact-check, we’ll examine Roskam’s estimate of 8 to 10 percent and see what sources he relies on.", "Before we dive into Medicare fraud, a review of credit card studies shows that Roskam is pretty much on the mark when he speaks of a 0.04 percent rate. A 2010 report from the Federal Reserve Bank of Kansas City gives a fraud rate of 0.05 percent for U.S. issued cards, both debit and credit. Roskam’s office pointed us to a trade publication, the Nilson Report, that cites an international rate of 0.04 percent rate.", "On Medicare, Roskam’s office cited a Government Accountability Office report, a watchdog website created by an executive order from President Barack Obama, and an article from the U.S. Administration on Aging. All three give us rates that range from 7.9 percent to 8.5 percent for the largest Medicare program, and up to 11 percent for a smaller program, Medicare Advantage.", "While the fraud rates fall into Roskam’s range, none of them is talking about fraud alone. Rather, they address the much broader category of improper payments. If a doctor orders too many tests, or provides a service but submits the wrong payment code, those come under the umbrella of improper payments.", "Out and out fraud is not as large as improper payments, but it can be egregious. The FBI recently charged 25 people in Miami for allegedly bribing Medicare beneficiaries and then using their account numbers to bill for services that were unnecessary or never provided. The government says the scheme netted the conspirators about $44 million.", "Malcolm Sparrow, professor of public management and a specialist in corruption control at Harvard’s Kennedy School, told us that fraud and improper payments are far from identical.", "\"There is a serious problem with conflating these different types of overpayment,\" Sparrow said. \"They are quite different in origin and require very different types of control mechanisms.\"", "When we raised this with Roskam’s office, his staff sent us several examples where Roskam has spoken collectively of fraud, waste and abuse. On Fox News, however, he spoke only of fraud.", "PolitiFact also found a study that restores a measure of credibility to Roskam’s estimate. Donald Berwick, a former head of the Centers of Medicare and Medicaid Services or CMS, the agency that runs Medicare, collaborated with an analyst at RAND to produce a landmark paper in 2012 in JAMA, the Journal of the American Medical Association.", "That paper offers three estimates of fraud in the Medicare and Medicaid programs: a low of 3 percent, a medium of 6 percent and a high of 10 percent. CMS told us they have no official estimate of fraud but pointed us to this study, and they cited FBI figures that mirror the numbers in this paper.", "If it turns out that the high end of the range in the JAMA article is correct, then Roskam is in the right ballpark.", "Of course, nobody knows for sure because fraud is a crime, and criminals don’t advertise their work.", "Two caveats for policy makers", "The JAMA article doesn’t stop at Medicare and Medicaid. It also looks at fraud in the health care sector as a whole, both public and private. The fraud rates don’t change much when the private sector is included.", "For Sparrow at Harvard, this is no surprise.", "\"The systems and structures they use for control are the same, across public, private, and not-for-profit programs,\" Sparrow said. \"They all tend to share the same strengths and weaknesses, and are roughly equally vulnerable.\"", "Put another way, the nature of the American health care system lends itself to a certain level of fraud, and the Medicare program is no more and no less susceptible to this type of crime.", "Sparrow says this also suggests the comparison to the credit card industry might be less useful than might appear. In the first place, the transactions are much simpler. When a thief tries a scam with a credit card, the card holder tends to notice by the next bill. In general, this kind of fraud is more easily detected and tracked. But Sparrow says there’s a bigger difference.", "\"The losses are borne by banks,\" he said. That creates a powerful incentive, in real time, to control the problem. In health care, the incentives are \"more diffuse and ambiguous.\"", "Our ruling", "Roskam said the Medicare fraud rate is 8 to 10 percent. His office pointed us to various documents that analyzed the problem of improper payments, an issue that mixes fraud together with nominally legal activities such as referring patients for more tests than are necessary. This suggested Roskam was using an inflated estimate of fraud. However, a recent study tends, in the worst-case analysis, to support Roskam’s figures.", "Roskam’s comparison to credit cards overlooks many key differences between the structures of the health care and credit card industries, and it tends to obscure the systematic nature of fraud in health care, whether public or private. But Roskam is right that credit card fraud is a tiny percentage of all transactions.", "We rate the statement Mostly True.", "Fox News, Transcript, June 12, 2013", "Email interview, Meagan Holder, spokesperson for Rep. Peter Roskam, June 14, 2013", "Federal Reserve Bank of Kansas City, The changing nature of card payment fraud, 2nd Quarter, 2010", "Business Wire, U.S. leads the world in credit card fraud, report states The Nilson Report, November 21, 2011", "Payment Accuracy, Medicare Fee-for-Service", "Government Accountability Office, High risk list: Medicare program", "Senior Medicare Patrol, Medicare/Medicaid improper payments exceed $64 billion a year, May 2012", "Government Accountability Office, Medicare: Progress made to deter fraud but more could be done, June 8, 2012", "Email interview, Tony Salter, Centers for Medicare and Medicaid Services, June 14, 2013", "The Medicare News Group, How much money is lost to Medicare fraud", "Health Affairs, Eliminating fraud and abuse, July 31, 2013", "Email interview with Malcolm Sparrow, Professor of Practice of Public Management, Harvard Kennedy School, June 14, 2013", "Federal Bureau of Investigation, Medicare fraud strike force charges 89 individuals for approximately $223 million in false billing, May 14, 2013", "Federal Bureau of Investigation, Financial crimes report: 2009", "The Department of Health and Human Services and the Department of Justice Health Care Fraud and Abuse Control Program Annual Report for Fiscal Year 2012", "Congressional Budget Office, Medicare - 2013 Baseline, May 14, 2013", "Congressional Budget Office, Medicaid - February 2013 Baseline, February, 2013", "Email interview with Michael Williams, Director, Communications & Membership at", "National Health Care Anti-Fraud Association", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]