["The false claim has circulated widely on Facebook, for example here, where it has been shared more than 9,000 times since it was uploaded on March 3, 2019, and here, where it has been shared more than 10,000 times.", "The author of the misleading post claims to be “a VCM technician” in Davao, a city in the southern Philippines. “VCM” is an acronym for vote counting machine.", "Below is a screenshot of the post:", "An English translation of the post says: “Repost! Don't vote for LITO LAPID. I was once a VCM technician here in Davao tell the people you know, your friends, etc. not to vote for lito lapid because the ink of the pen will seep through from the front page where the name of MAR ROXAS is… if you shade lapid, what will appear in the receipt is mar roxas even if you shaded lapid…that is what happened in the final testing and sealing here… if ever the wrong name will appear on the receipt, inform the BEI so they can include it in their minutes. Pls. spread…Guys, kindly spread..thru msgr only. Forwarded", "The post contains two photos, the top image shows Lito Lapid, a candidate for the National People's Coalition.", "The lower image shows Manuel “Mar” Roxas, a candidate for the opposition Liberal Party.", "Lapid and Roxas are both running for one of the 12 senate seats available in the upcoming mid-term elections.", "The misleading posts claim that in the final testing and sealing of vote counting machines it was discovered that ink will seep through the ballot papers meaning votes cast for senatorial candidate Lito Lapid will be counted as a vote for Manuel ‘Mar’ Roxas.", "The final testing and sealing of vote counting machines for the Philippines’ upcoming election has not yet been carried out, according to this document from the Philippines Commission on Elections.", "Vote counting machines will be tested and sealed between May 6 and May 10, 2019, the document says on page 22.", "According to a template of the ballot that will be used, which can be seen here on the election commission's official website, Lapid is listed No. 40 on the list, Roxas No.57.", "The names are both on the same page, as can be seen in this screenshot of the ballot template:", "James Jimenez, the spokesman of the Commission on Elections, said in a tweet on March 4, 2019, that the misleading posts were false.", "Magsisinungaling lang, mali-mali pa. una, parehong front page ang Lapid at Roxas. Paano “tatagos?” 2nd, hindi magkahilera ang ovals sa front at back page. Paano maging problema ang “tagos?” At, huy! Wala pang final testing & sealing na nagaganap! Masyado ka advance magisip! LOL pic.twitter.com/T4wu8iU4KO", "When translated to English, the tweet says: “You will just lie, you will even do it erroneously. first, both the names of Lapid and Roxas are on the front page. How will it \"seep through?\" 2nd, the ovals in the front and back page are not on the same columns. How will the permeation of shades be a problem? And hey! The final testing and sealing has not been done yet! You think too much in advance! LOL”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]