["The photo was published here in a Facebook post on October 8, 2019.", "It has been shared more than 3,500 times.", "The post’s Hindi-language caption translates to English as: “Brothers, the woman in this photo is the wife of industrialist Adani and the man who has bowed down (sold out) is PM of our country. Why doesn't he fall at her feet.”", "Adani refers to Indian industrialist Gautam Adani, the founder and chairman of Indian energy giant Adani Group.", "Narendra Modi is the prime minister of India.", "Below is a screenshot of the misleading Facebook post:", "The photo has been shared on Facebook here, here and here, and on Twitter here, here, here and here alongside a similar claim.", "The claim is false; the photo has circulated in media reports since at least September 2014 when Modi visited the southern city of Tumkur to inaugurate a project.", "A reverse image search on Google found the same photo published here on Twitter on September 25, 2014.", "The tweet’s caption states: “This is how PM @narendramodi greeted Tumkur Mayor Geeta Rudresh when she came to welcome him.”", "Rudresh is the then mayor of Tumkur, or Tumakuru, an industrial city in the southern Indian state of Karnataka.", "The same photo was also published on September 25, 2014, here on Facebook alongside a similar description, and here by Karnataka newspaper Vijaya Karnataka.", "Below is a screenshot of the Vijaya Karnataka report:", "The first paragraph of the Kannada-language report translates to English as: “Intrigued by Prime Minister Modi's visit, the peace process has opened up. The mega food park has been opened without any political confusion and conflicts.”", "The event was also featured here on Modi’s personal website.", "Below is a screenshot of a photo on Modi's website that shows him at the inaugural event:", "Rudresh is married to a T.V. Rudresh, whereas Adani's wife is Priti Adani.", "Below is a screenshot comparison of this photo of Geeta Rudresh (L) and this photo of Priti Adani:", "T.V. Rudresh, who identified himself as Geetha Rudresh’s husband, told a journalist at AFP’s Delhi bureau by phone on October 15, 2019, that the photo showed his wife meeting Modi in September 2014.", "“My wife Geetha Rudresh was serving as mayor of the Tumkur city at the time PM Modi visited the city to inaugurate a mega food park,” he told AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]