["About this rating", "Disability rights advocate Helen Keller — who was blind and deaf — flew a four-engine Douglas Skymaster airplane over the Mediterranean Sea while traveling from Rome to Paris in 1946.", "Though the flight took place nearly 90 years ago, Keller’s voyage went viral in December 2020 when TikTok user krunk19 sarcastically claimed that the activist was a “liar” and a “monster”. (Note: krunk19’s profile stated that his comments were “purely satire.”)", "“All right, so we’ve got to talk about this whole Helen Keller thing because I’ve had enough. I’ve heard it my whole life. She’s deaf. She’s blind. She’s amazing,” he said. “No. Guess what. She lied. She’s a liar. Her and that monster Anne Sullivan pulled the wool over our eyes and nobody has thought to question it.”", "Krunk19, who also appears to go by the name Keith, also jokingly claimed that a blind and deaf woman could not sign her name (she could) or author 12 books (she wrote 14 books and over 475 speeches and essays).", "“That’s not even a realistic number for someone who has all of their senses,” he said. At the time of publication, the video had been shared more than 19,000 times", "Keller’s signature scanned from the book, “The Story of Helen Keller.” Public Domain", "Among her more well-known advocacy accomplishments, it is true that Keller also once flew a plane, according to a June 1946 newspaper article archived by the American Foundation for the Blind titled, “Wonderful Helen Keller Flies a ‘Plane.”", "According to the article, the Alabama-born Keller piloted the four-engine airplane for 20 minutes as it flew over the Mediterranean Sea. Keller told the Glasgow-based reporter that she had piloted the plane “through hand ‘talk’” between herself and her companion, Polly Thomson.", "“She sat in the co-pilot’s seat with the pilot beside her, and I relayed to her his instructions,” Thomson reportedly said. “The plane crew were amazed at her sensitive touch on the controls. There was no shaking or vibration. She just sat there and flew the plane calmly and steadily.”", "Keller reportedly said that it “was wonderful to feel the delicate movement of the aircraft through the controls.”", "An unrelated video shared on YouTube by the Helen Keller Channel showed the woman flying in a bi-plane over southern California in 1919.", "Updated [Dec. 29, 2020]: A previous version of this article inaccurately described Keller in her adult years as \"mute.\"", "Correction [Jan. 15, 2021]: Helen Keller flew a plane over the Mediterranean Sea in 1946, not 1936 as erroneously stated in a previous version of this article.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]