["The image was posted on Facebook here on January 10, 2020. It has since been shared more than 190 times.", "The screenshot includes a BBC Persian logo, two photos of US flag draped coffins, a photo of a military base in Iraq and a satellite image.", "The image also includes a purported English translation of the post, which reads “The bodies of American forces arrived from Iraq to New York!\n\tNews says that most of us forces have become coal.\n\tThey cannot be identified and transfer!”", "Below is a screenshot of the misleading Facebook post:", "The Facebook post’s Urdu caption translates as: “BBC Persian has published the photos of the coffins of the Americans who died in an attack by Iran. According to it (BBC Persian) some Americans’ (bodies) were totally charred and it was impossible to identify them. These coffins have been sent from Iran to New York. Riffat Wani.\"", "The same image was also shared alongside a similar claim on Facebook here, here and here.", "The claim is false. BBC Persian accurately reported here and here that no US or coalition forces were killed in the Iranian missile attack, which was launched in retaliation for the US assassination of top Iranian military commander Qasem Soleimani.", "The BBC Persian logo on the network’s official Facebook page is different to the one seen in the misleading Facebook post, which appears to have been lifted from this inactive imposter account.", "The photos in the purported screenshot have also been used in a misleading context.", "The first photo showing flag draped coffins on a grassy field has circulated in reports since 2005 about an anti-war demonstration in Fayetteville, North Carolina, USA. The picture was published in this blog post on March 21, 2005.", "Below is a screenshot of the blog post:", "This Getty Images photo published on March 19, 2005 purports to show the same anti-war demonstration in Fayetteville.", "The misleading Facebook post’s second photo showing coffins on a plane was published by The Seattle Times on April 18, 2004.", "The image sparked a national debate over the Iraq war. It gained further notice after the photographer, who was a military contractor working on the transport plane, was dismissed for sharing the photo with the press, the Times reported.", "Below is a screenshot of the photo on the Times’ front page:", "The photo was also listed here by TIME magazine as one of the 100 most influential photographs of all time.", "The third photo in the misleading Facebook post is a file photo of the Ain al-Asad military base in Iraq, which houses US troops and was attacked by Iranian missiles on January 8, 2020. It was published by the Associated Press here on December 29, 2019.", "Below is a screenshot of the AP photo:", "The photo’s caption reads: “FILE - In this Sunday, Dec. 29, 2019 file photo taken from a helicopter shows Ain al-Asad air base in the western Anbar desert, Iraq. Iran struck back at the United States for the killing of a top Iranian general early Wednesday, Jan. 8, 2020, firing a series of ballistic missiles at Iraqi bases, including Ain al-Asad air base, housing U.S. troops in a major escalation that brought the two longtime foes closer to war. (AP Photo/Nasser Nasser, File)”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]