["About this rating", "In February 2021, online advertisements appeared to falsely claim that Matt Lauer was long-time journalist Katie Couric's husband. Couric and Lauer previously worked together on the \"Today\" show on NBC. She left the program in 2006.", "In November 2017, Lauer was fired from his NBC job as a co-anchor on \"Today\" for \"inappropriate sexual behavior.\"", "The misleading ads pictured Couric and Lauer together with various texts. For example, one of the ads read: \"[Photos] Meet The Man Katie Couric Is Romantically Involved With In 2021.\"", "Another ad said something similar: \"[Photos] Meet Katie Couric's Husband.\"", "Both ads were misleading clickbait that led to lengthy slideshow articles. The first one took readers to the Sport Pirate website. Couric and her real husband, John Molner, appeared after more than 80 pages.", "The second ad went to the Refinance Gold website. It took 266 clicks to reach the page with Couric and Molner:", "American TV royalty and CBS Evening News host Katie Couric lost her first husband, Jay Monahan in 1998, as he passed away from colon cancer. But she did find love again with John Molner. Apparently, she asked her friend to set her up with a doctor, but they though [sic] that she would be a better match with their banker firmed, John.", "In 2012, Molner finally called Katie to set up a date and they fell for each other. The couple has been happily married since 2014, and have a blended family now, as each of them have two kids from their previous marriage.", "Lauer never showed up in either story. The strange inclusion of Lauer appeared to simply be a strategy by the advertisers to draw in readers with a misleading picture.", "It's true that Couric's first husband, Jay Monahan, died of colon cancer in 1998. He was 42 years old. Over the years, she posted remembrances on social media:", "She left NBC in 2006 to host the \"CBS Evening News.\" At CBS News, she also contributed as a correspondent on \"60 Minutes.\" She later worked for ABC News and Yahoo! News.", "In 2014, Couric announced on Twitter that she and John Molner had married:", "In the past, Couric and her current husband hosted a cooking show called \"Full Plate.\" As of February 2021, she was hosting the podcast, \"Next Question with Katie Couric.\"", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]