["A screenshot of an India Today broadcast with the time stamp 8:10 pm has gone viral. It shows Prime Minister Narendra Modi addressing the country on the coronavirus pandemic. The text flashed on the screen reads – “All-India Lockdown Increased Till 04th May.”", "Alt News has received several requests to fact-check the viral screenshot on WhatsApp (+91 76000 11160) and on our official Android application.", "On March 24, PM Modi had ordered a nationwide lockdown for 21 days, barring essential services, as a preventive measure to tackle the coronavirus pandemic. The 30-minute address was televised at 8 pm by nearly every news channel. Alt News watched this address on India Today‘s YouTube channel and found that the viral image is a still taken at the 9:40-minute mark. However, it has been morphed to add false information that the lockdown has been extended till May 4.", "As evident, both the clips are similar – PM Modi’s photograph, the blurbs ‘COVID-19 BREAKING’ and ‘PM ADDRESSES NATION’ are exactly the same including the font.", "However, the news flash in the middle and bottom of the screen have been altered.", "1. While the original informs of an ‘all-India lockdown from midnight’, the morphed one has changed this to falsely read – ‘All-India lockdown increased till May 4’.", "2. The sentence ‘India under lockdown’ has been altered to ‘India under lockdown dates increased’.", "3. ‘PM Modi announces nationwide lockdown’ falsely reads ‘PM announces to shut down everything till 04 May’ in the morphed graphic.", "4. It is also noteworthy that there’s uniformity in the font size and texture in the original graphic. The same cannot be said about the morphed one.", "There are no reports of PM Modi announcing an extension of the 21-day lockdown (March 25 to April 14). In his latest address made on April 3, the Prime Minister appealed to citizens to switch off all lights at 9 pm on April 5 and ignite diyas, candles or torches from the balconies and doorsteps of their homes. This, he claimed, is an effort to dispel the darkness caused by the pandemic and give hope to the poor, the ones most vulnerable to the crisis.", "Recently, Alt News fact-checked two images resembling a still from a TV news channel circulated to falsely claim that Home Minister Amit Shah tested positive for coronavirus.", "Note: The number of positive cases of the novel coronavirus in India exceeds 5,000 and more than 150 deaths have so far been reported. The government has imposed a complete restriction on movement apart from essential services to tackle the pandemic. Globally, more than 14 lakh confirmed cases and over 80,000 deaths have been reported. There is a sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]