["Donald Trump, shown here campaigning in Wisconsin, has been criticized for some of his Trump-brand products being made overseas. (Milwaukee Journal Sentinel photo)", "On his first campaign trip to Wisconsin as Hillary Clinton’s running mate, Tim Kaine was introduced at a Milwaukee brewery by U.S. Sen. Tammy Baldwin, who drew contrasts between the Democratic ticket and Republican presidential nominee Donald Trump.", "\"I know with Tim Kaine as vice president and Hillary Clinton in the White House, we will have partners bringing the focus back on good-paying jobs for all Americans,\" Baldwin said on Aug. 5, 2016, the same day Trump visited Green Bay.", "\"Now, while Donald trump has a long history of exporting jobs overseas, I know that Tim Kaine and Hillary Clinton will bring back good-paying jobs right here to Milwaukee. They will crack down on countries that cheat, like China. We need a vice president and a president who will go to bat for Wisconsin businesses, not look to send more jobs overseas.\"", "Does Trump have a long record of exporting jobs overseas?", "Creating jobs overseas rather than in the United States -- yes.", "Moving existing U.S. jobs overseas -- no.", "Made over there", "Let’s begin by noting Trump has employed many people in the United States. (CNNMoney put the figure at 34,000.) He serves as an executive for more than 500 companies; his Trump Organization owns a portfolio of buildings, hotels and golf courses in the United States (and around the world).", "But he also sells many Trump-label products that are made overseas, as shown by three previous fact checks by our partners, and by our own online browsing.", "Trump cuff links, sport coats, shirts, eyeglasses, lamps, mirrors and neckties are made in China. Some of the ties are also made in Indonesia and Vietnam and some of the shirts in Bangladesh. Trump suits are made in Mexico, India and China.", "Trump vodka, distilled in the Netherlands. Furniture, made in Turkey. And his crystal barware, made in Slovenia (the home country of his wife, Melania).", "But when Clinton said Trump \"doesn't make a thing in America,\" PolitiFact Pennsylvania’s rating was False. His campaign gear, some of his and other Trump-brand products, including bedding, cologne, Trump Natural Spring Water and Trump Wine are made in the United States.", "And PunditFact in October 2015 rated as Pants on Fire a claim that Trump’s iconic campaign hats are made in China (they’re made in America).", "The rest of the claim", "As for the rest of Baldwin’s claim, Trump did decide to have some of his products manufactured overseas, rather than in America.", "As the Washington Post reported, Trump in 2004 signed a deal with Phillips-Van Heusen, a manufacturer of affordable shirts. It was one of the first of many merchandise-licensing arrangements in which he attached his name to products made by foreign workers and sold in the United States. (PVH said in 2015 it was dropping the Trump line.)", "But it’s misleading to say he exported jobs, in that it’s not as though he created those jobs in the United States and then moved them overseas.", "Trump has complained that China manipulates its currency, making it more expensive to make products outside of China.", "Our rating", "Baldwin said Trump \"has a long history of exporting jobs overseas.\"", "For more than a decade, Trump-brand products such as his clothing have been made overseas, although those were jobs that were created overseas, not U.S. jobs that were moved.", "We rate Baldwin’s statement Half True.", "DARNWI.com, Tammy Baldwin remarks (6:20), Aug. 5, 2016", "Email, Tammy Baldwin campaign political director Scott Spector, Aug. 10, 2016", "Email, Donald Trump campaign spokesman Stephen Smith, Aug. 10, 2016", "Email, Donald Trump campaign communications coordinator Michael Abboud, Aug. 10, 2016", "PolitiFact National, \"At DNC, Hillary Clinton slams Donald Trump for making products overseas,\" July 29, 2016", "PolitiFact Pennsylvania, \"Sorry, Hillary: Trump actually has made a few things in the USA,\" Aug. 1, 2016", "PunditFact, \"Fact-checking the Funny Or Die video about Trump-brand products made overseas (Mostly True),\" July 25, 2016", "PolitiFact Virginia, \"Tom Perez erroneously tags all Trump products with 'Made in China' label (Mostly False),\" June 27, 2016", "Trump.com, Merchandise pages, accessed Aug. 10, 2016", "Washington Post, \"Trump has profited from foreign labor he says is killing U.S. jobs,\" March 13, 2016", "CNN, \"Donald Trump sought cheap labor overseas for clothing lines,\" May 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]