["On Dec. 3, John Wyatt Morgan took to Facebook to post about a school bus found in Arizona.", "He said he had stopped at a gas station off State Route 85 in Buckeye, Arizona, for a cup of coffee when he noticed a commotion around a nearby school bus.", "\"The place was crawling with police and investigators! Turns out the bus broke down in the early hours of the morning,\" he wrote. \"They opened the back doors and the bus is completely packed with voter machines!\"", "He accompanied the post with three photos: a photo of the bus with a few officers; a photo of a machine that appears to be inside the bus; and a close-up of a sticker on the machine that reads \"Election Systems & Software.\"", "User Ed Vignaroli also posted the photos and claim to Facebook, where it was shared thousands of times.", "\"They found an abandoned bus just off of East Hwy 85 with NV plates in Buckeye AZ that was FILLED WITH THE MISSING AZ VOTER MACHINES!\" he wrote.", "Morgan and Vignaroli have not responded to requests from USA TODAY for comment.", "Fact check:A 37-vote change in Georgia was the result of human error, not vote-flipping", "It's true that police were called to investigate a bus at the gas station. But the machines that were found in the back of the bus were not voting machines, or in any way election-related.", "On Dec. 4, the Buckeye, Arizona, Police Department posted a statement to its Facebook page to debunk the rumor.", "\"Both the Buckeye Police Department and an investigator from the Attorney General’s office responded to this 'suspicious bus,'\" its post read. \"It was determined the bus was full of office equipment purchased at a surplus sale, complete with invoices and receipts. The information in the original post is inaccurate.\"", "An employee at the gas station also told the Associated Press that the contents of the bus were not election-related.", "\"It was just printers and blank paper,\" the employee said.", "Though the photo that Morgan posted showed a machine with a sticker that reads \"Election Systems & Software,\" the machine in question was not a voting machine, per the company that manufactured it.", "Katina Granger — a public relations manager for Election Systems & Software of Omaha, Nebraska — confirmed to USA TODAY that the item in the photo is actually a printer.", "“The item seen in the photo is not a voting machine or a tabulation machine,” she wrote. “The label you see in the photo is affixed to a printer.”", "Fact check:Trump lost the 2020 presidential election", "Based on our research, the claim that a school bus full of voting machines was discovered in Arizona is FALSE. The Buckeye Police Department confirmed that the bus contained \"office equipment,\" not voting machines. Election Systems & Software, which manufactured the machine photographed inside of the bus, also identified the item as a printer, not a voting or tabulation machine.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]