["About this rating", "Parler is currently partially online with technical support from a Russian company.", "Parler is not back to its previous functionality, and it remains unclear where the website will ultimately be hosted and by what company, if and when it does come back.", "Parler's CEO vowed the social media platform would return, but that hasn't happened as of this writing.", "In late January 2021, Snopes readers asked about social media posts claiming that the social media platform Parler was being hosted by servers located in Russia after being booted off Amazon Web Services in the wake of the attack on the U.S. Capitol on Jan. 6, 2021:", "Parler was a social media platform favored by supporters of former U.S. President Donald Trump. Amazon pulled the plug on its hosting services citing violent rhetoric, causing Parler to go offline. As of this writing, Parler is in a holding pattern. It's partially back up, but as a static webpage with a \"technical difficulties\" notification and a handful of messages from conservative personalities like Fox News host Sean Hannity, podcaster Dan Bongino, and Parler CEO John Matze, vowing the site's return.", "Citing public records, multiple reputable news outlets reported that Parler was using the company DDoS-Guard, headquartered in Russia, for some support functions, like shielding it from DDoS attacks. A search of domain registry look-up tools shows Parler's domain is currently registered with Epik, which Endgadget reported is known for supporting other extremist websites like the white supremacist site Daily Stormer. It remains unclear where and by what company Parler will ultimately be hosted, if it returns to its full operation as promised by Matze.", "Cyber security expert Chris Vickery told Snopes Epik is acting as a directory, but DDoS-Guard controls Parler's IP address. And as The New York Times reported, \"If Parler routes its web traffic through DDoS-Guard when its full website returns, the experts said, Russian law could enable the Russian government to surveil Parler’s users.\"", "Vickery also told us that, \"internet traffic routing companies physically located within the Russian Federation must comply with a Russian law known as SORM.\"", "The Russian phrase for which SORM is an acronym translates to English as \"System for Operative Investigative Activities.\" As Vickery explained:", "\"SORM gives the government of the Russian Federation access and monitoring power over all network traffic. It requires companies, such as DDoS-guard to allow for the interception and decryption of internet communications and provides means of extra-judicial access to that information for many branches of the Russian government.\"", "Therefore, Vickery told us, DDoS-Guard must be routing Parler traffic, \"or (at minimum) mirrored copies of the traffic, through hardware available for monitoring by the Russian Government.\"", "That, Vickery added, requires DDoS-Guard to \"decrypt and give access to government entities which act in ways adverse to the interests of Parler's user base.\" In other words, Parler users' data would be exposed to the Russian government.", "For background, a mob of Trump supporters broke into the U.S. Capitol on Jan. 6, 2021, as members of Congress were formalizing the electoral win of U.S. President Joe Biden. Congress, along with former U.S. Vice President Mike Pence, were forced to evacuate within moments of being spotted by rioters, some of whom were set on harming them. Five people were killed, including U.S. Capitol Police Officer Brian Sicknick.", "Parler, a platform popular among the far right, faced heavy criticism due to open calls for violence posted to its platform. It was completely down after Amazon dropped its hosting service — but then popped back up in a limited capacity on Jan. 18.", "Social media posts claiming that Parler was able to get back online with the help of a Russian-owned company garnered a lot of attention. The Russian government's involvement in American political affairs have been a source of concern since it became public knowledge that the Kremlin launched an interference campaign in the 2016 U.S. election with the goal of getting Trump elected.", "Updated to note that investigators now say the cause and manner of Sicknick's death are still under investigation.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]