["About this rating", "Six people were arrested on Feb. 1, 2021, after defacing the iconic Hollywood sign by covering the letters W and D with large tarps, both bearing the letter B, to spell out \"Hollyboob.\"", "In a Feb. 1 tweet, Los Angeles Police Department (LAPD) Captain Steve Lurie confirmed that six individuals had been arrested for trespassing.", "\"Los Angeles landmarks are precious to those of us @LAPDHollywood and this was way uncool (not to mention the terrain is quite steep & dangerous),\" wrote Lurie.", "The Los Angeles Times first reported that LAPD security personnel saw five men and one woman on video surveillance at around 1:15 p.m., after which point a helicopter responded to the area. Officers and park rangers met the individuals and placed them under arrest. Snopes spoke with a representative from the Hollywood Sign Trust, the 501(c)3 organization that privately maintains the sign, who confirmed the details. While there is no security footage of the culprits scaling the fence, law enforcement officials believe that is how they entered based on the topography of the area.", "“Through the efforts of LAPD’s Hollywood Division and the Park Rangers in Griffith Park, the Sign’s security and video monitoring system stopped the vandalism today,” said Mark Panatier, chair of the Hollywood Sign Trust, in an email to Snopes.", "“It is unfortunate that there are those who think modifying the sign is good sport but this renowned icon is to be appreciated not demeaned.”", "In an email to Snopes, the LAPD confirmed that all six individuals were cited with misdemeanor trespassing and will be released. Reportedly, the sign wasn’t damaged so no vandalism charges will be pursued. The New York Times identified the organizer of the escapade as 27-year-old Julia Rose, who was joined by Jack Tenney, a 26-year-old former professional surfer. Though the Los Angeles Times reported that the stunt was meant to raise awareness for breast cancer, Rose told Snopes that the stunt was to draw attention to a dispute she had with Instagram, who she said had suspended her account.", "The Hollywood sign is not accessible to the public and is surrounded by a secure fence equipped with more than a dozen security cameras that are monitored by law enforcement around the clock. It is surrounded by Griffith Park, a more than 4,000-acre municipal park overseen by the Los Angeles Department of Recreation and Parks.", "It took Griffith Park rangers approximately three hours to clean up the plastic tarps, according to the Hollywood Sign Trust.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]