["About this rating", "The transition team for the newly elected Obama administration in 2008 did compile a list of potential Muslim and Asian-American candidates for cabinet posts.", "The story about the list was published in 2016 and lacked both timely relevance and context as it recirculated for unknown reasons in 2019.", "In mid-April 2019, a dated story from the Daily Caller website began circulating on social media for unclear reasons. The story, originally published on 24 October 2016, bore the headline, \"LEAKED: Obama Team Kept List of Muslims For Top Jobs, Excluded Non-Muslims.\"", "The story is based on the contents of a stolen email leaked by document-dumping platform WikiLeaks. It was part of a now-infamous trove of Democratic National Committee (DNC) messages that were hacked and spilled online in the lead-up to the 2016 presidential election. The Daily Caller in 2016 reported:", "The newest batch of John Podesta’s hacked emails released by Wikileaks shows Obama’s transition team kept lists of Muslim and Asian candidates for jobs in the administration.", "According to an email chain from 2008, John Podesta received lists of exclusively Muslims and Asians to be considered for jobs in the Obama administration. The email chain revealed that in this process, Middle Eastern Christians were purposefully excluded, or set aside in a separate list, with an aide writing,", "\"In the candidates for top jobs, I excluded those with some Arab American background but who are not Muslim (e.g., George Mitchell). Many Lebanese Americans, for example, are Christian. In the last list (of outside boards/commissions), most who are listed appear to be Muslim American, except that a handful (where noted) may be Arab American but of uncertain religion (esp. Christian).\"", "It is both true and unsurprising that per the leaked email, dated 17 October 2008, non-Muslims were excluded from a list of potential Muslim candidates to be considered for Obama administration posts. What the Daily Caller story failed to elucidate is whether lists of candidates from other demographic groups were compiled to promote general diversity in the Obama administration's ranks. Because agency heads during Obama's presidency came from various backgrounds, it's safe to say non-Muslims were not \"excluded\" from consideration for top posts.", "Many took to social media in spring of 2019 to suggest that the information was both new, and that the effort to hire Muslim people to administration cabinet positions was somehow nefarious.", "As noted earlier, the story is not new and lacks key context.", "It was published roughly two weeks before the November 2016 election and was itself based on a document that at the time was eight years old. The email was forwarded to Podesta, who at the time served as co-chair of President-elect Obama's transition team, from Gayle Smith, who worked in the White House under both Obama and President Bill Clinton. The forwarded message included commentary on a list of potential candidates compiled by attorney and former Obama administration official Preeta Bansal to be considered for \"top Administration jobs, sub-cabinet jobs, and outside boards/agencies/policy committees.\"", "The desire for a cabinet that contains demographic representation reflecting the American populace isn't unique to the Obama administration. In 2000, NBC News reported on similar aspirations by Obama's predecessor, then-President-elect George W. Bush. \"People that work hard and make the right decisions in life can achieve anything they want in America,\" Bush is quoted as saying at the time.", "Bush went on to select Colin Powell and Condoleezza Rice to serve as consecutive Secretaries of State. They were the first African-American man and woman to hold that high-ranking post.", "The old Daily Caller story about the WikiLeaks document may have gained sudden online momentum because the organization's founder, Julian Assange, has been in the news. He was arrested in London on 11 April 2019 and faces extradition to the U.S. on charges that he conspired to hack a Pentagon computer in 2010. Assange, who initially faced extradition to Sweden where he was accused of sexual assault, has been holed up in the Ecuadorian embassy in Britain for seven years to avoid arrest, long fearing extradition to the United States.", "But the Ecuadorian government, citing a string of alleged grievances from discourteous behavior to using its property for international espionage, evicted Assange and suspended the citizenship it bestowed upon him, making his arrest possible and bringing the long saga to an end.", "WikiLeaks played a key role in the morass of disinformation that flooded cyberspace in the 2016 election cycle, both pumping out troves of emails stolen from the DNC by Russian hackers and fanning the flames of a false conspiracy theory that alleged murdered DNC staffer Seth Rich, not Russian operatives, hacked the DNC.", "Because WikiLeaks activities vis-a-vis the election harmed the efforts of President Donald Trump's opponent Hillary Clinton, Trump and some of his supporters professed their support for the organization. After Assange's arrest, however, some prominent supporters, including Trump, have backed away, with the president stating, \"I know nothing about WikiLeaks. It's not my thing ... It's not my deal in life.\"", "Datoc, Christian. \"Assange: Election Showed ‘Liberal Press’ Is ‘Not Very Important,’ and They Can’t Handle It.\"\r\n  DailyCaller.com. 16 December 2016.", "Caruso, Justin. \"LEAKED: Obama Team Kept List of Muslims For Top Jobs, Excluded Non-Muslims.\"\r\n  DailyCaller.com. 24 October 2016.", "NBC Nightly News. \"George W. Bush Selects Diverse Cabinet.\"\r\n  17 December 2000.", "Liu, Amy. \"In Cabinet, Where Diversity Occurs Is Important.\"\r\n  San Antonio Express-News. 18 January 2017.", "Savage, Charlie, et al. \"Julian Assange Arrested in London as U.S. Unseals Hacking Conspiracy Indictment.\"\r\n  The New York Times. 11 April 2019.", "The Guardian. \"Donald Trump: 'I Know Nothing About WikiLeaks' - Video.\"\r\n  11 April 2019.", "Harris, Shaun, and Miller, Greg. \"Trump, Who Once Said He ‘Loved’ WikiLeaks, Claims to Know Nothing About the Group.\"\r\n  Washington Post. 11 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]