["About this rating", "Some 28 million ballots sent out to voters over the course of four elections from 2012 to 2018 were neither returned as undeliverable nor returned by voters.", "The 28 million figure primarily represents uncast (rather than \"missing\") ballots and is not indicative of widespread voter fraud (nor necessarily indicative of the potential for such).", "On April 24, 2020, the RealClearPolitics website published an article by Mark Hemingway headlined \"28 Million Mail-In Ballots Went Missing in Last Four Elections.\"  Drawing on a report from the Public Interest Legal Foundation (PILF), which was in turn drawn from data compiled by the U.S. Election Assistance Commission (EAC), the RealClearPolitics article sought to raise the alarm about the supposed election fraud perils of the mail-in balloting process:", "Between 2012 and 2018, 28.3 million mail-in ballots remain unaccounted for, according to data from the federal Election Assistance Commission. The missing ballots amount to nearly one in five of all absentee ballots and ballots mailed to voters residing in states that do elections exclusively by mail.", "States and local authorities simply have no idea what happened to these ballots since they were mailed – and the figure of 28 million missing ballots is likely even higher because some areas in the country, notably Chicago, did not respond to the federal agency’s survey questions. This figure does not include ballots that were spoiled, undeliverable, or came back for any reason.", "Although there is no evidence that the millions of missing ballots were used fraudulently, the Public Interest Legal Foundation, which compiled the public data provided from the Election Assistance Commission, says that the sheer volume of them raises serious doubts about election security.", "The headline and opening of the article, particularly in their use of the word \"missing,\" left many readers with the impression that millions and millions of voters expected to receive ballots in the mail that mysteriously never arrived, or filled out and mailed in ballots that simply vanished without ever being counted.", "But as the EAC observed in response, those 28 million \"missing\" ballots were ones that were \"neither returned undeliverable nor returned from voter” -- in other words, ballots mailed out in multiple states over the course of four elections that were not marked and sent back. Declaring such ballots \"missing\" is, as many others noted, akin to declaring all the millions of Americans who don't bother showing up at polling places each election (some 40 to 60% of the eligible voting population) as \"missing\":", "Article author Mark Hemingway used the term \"missing\" to describe ballots that were mailed out to voters but not cast by those voters. By this logic, all of the over 250 million votes not cast by in-person Election Day voters from 2012-2018 are also \"missing.\" Conflating voters choosing not to cast their ballot with \"missing\" ballots is a fundamental flaw in the argument ... The simple fact is: an un-cast ballot is not a missing ballot.", "Or, as Pro Publica's Electionland quoted an expert on the subject:", "“Election officials ‘know’ what happened to those ballots,” said Paul Gronke, a professor at Reed College, who is the director of the Early Voting Information Center, a research group based there. “They were received by eligible citizens and not filled out. Where are they now? Most likely, in landfills,” Gronke said by email.", "But is it true, as RealClearPolitics claims, that \"The potential to affect elections by chasing down unused mail-in ballots and make sure they get counted – using methods that may or may not be legal – is great\" and that \"There’s little doubt that as the number of mail-in ballots increases, so does fraud\"? As to the former point, the article stated up front that \"there is no evidence that the millions of missing ballots were used fraudulently,\" and as to the latter point, the article offered nothing more than a link to an 8-year-old New York Times article about absentee voting. On the other hand, the National Vote at Home Institute (NVAIH) pointed out that methods for tracking mail-in ballots have become increasingly more widespread and sophisticated:", "What the article does not cover is that since voting by mailed-out ballot has become more prevalent, there are many best practices in use that prevent the sort of wide-scale ballot mishandling that Hemingway suggests.", "As election officials work to ensure that mailed ballots get to voters in the first place, jurisdictions now extensively partner with the USPS's National Change of Address (NCOA) program as well as ERIC (the Electronic Registration Information Center) to keep their voter address files current. Mailed-out ballots are non-forwardable, so there can't be millions of ballots floating around within the USPS. They are returned to the election office.", "Since voting by mailed-out ballot has become more prevalent, 36 states have instituted \"ballot tracking\" where both the voter and election officials can see where the ballot is en route to and from the voter, just as you would [track] a package. If the ballot really does \"go missing,\" the voter can be notified and obtain a new one. But the data shows ballot misplacement rarely happens in the way that Hemingway insinuates.", "In the high mailed-out ballot states, well over 50% of cast ballots are returned at secure ballot drop boxes or at staffed \"vote centers\" that look like traditional polling places, but without the lines.", "More recent analysis of the vote-by-mail (VBM) process suggests that \"as with all forms of voter fraud, documented instances of fraud related to VBM are rare\":", "Another question surrounding VBM is whether it increases voter fraud. There are two major features of VBM that raise these concerns. First, the ballot is cast outside the public eye, and thus the opportunities for coercion and voter impersonation are greater. Second, the transmission path for VBM ballots is not as secure as traditional in-person ballots. These concerns relate both to ballots being intercepted and ballots being requested without the voter’s permission.", "As with all forms of voter fraud, documented instances of fraud related to VBM are rare. However, even many scholars who argue that fraud is generally rare agree that fraud with VBM voting seems to be more frequent than with in-person voting.", "Fair Vote.   \"Voter Turnout.\"\r\n    Accessed 21 May 2020.", "Public Interest Legal Foundation.   \"Report: 28 Million Mail Ballots Went Missing in Past Decade.\"\r\n    13 April 2020.", "National Vote at Home Institute.   \"There Were NOT 28 Million 'Missing' Mailed Ballots.\"\r\n    27 April 2020.", "MIT Election Data Science Lab.   \"Voting by Mail and Absentee Voting.\"\r\n    Accessed 21 May 2020.", "Willis, Derek.   \"A Conservative Legal Group Significantly Miscalculated Data in a Report on Mail-In Voting.\"\r\n    Electionland.   2 May 2020.", "Hemingway, Mark.   \"28 Million Mail-In Ballots Went Missing in Last Four Elections.\"\r\n    RealClearPolitics.   24 April 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]