["Several Facebook users have shared an image of French President Emmanuel Macron and Turkish President Recep Tayyip Erdogan along with the claim that the latter refused to shake hands with the former. This image has been shared after President Erdogan criticised the French President’s remarks on Islam. Last month, President Erdogan also recommended boycotting French goods.", "The image has been shared with the text, “Turkey president Rajab Tayub Erdogan refused to handshake with France president Macron.” The text misspells the Turkish president’s name,", "A Facebook user shared this image on November 5. (archived link)", "Other Facebook users also posted this image.", "Alt News performed a reverse image research on Google and found multiple articles that carried the viral image including CNN Arabic on October 26. A second reverse image search on TinEye revealed that the picture was uploaded on Getty Images in 2018.", "“French President Emmanuel Macron (L) meets with his counterpart Turkish President Recep Tayyip Erdogan at the UN headquarters during the annual United Nations General Assembly in New York City on September 25, 2018,” read the Getty Image caption. It has been credited to photographer Ludovic Marin from AFP.", "On the same day, another picture of the two Presidents shaking hands was uploaded on Getty Images.", "It was also tweeted by Republic of Turkey Directorate of Communications on September 26, 2018. Turkey-based Rûdaw Media Group uploaded a clip of the handshake as well.", "President @RT_Erdogan met with President Macron of France, Prime Minister May of the United Kingdom, President Kitarović of Croatia, President Pahor of Slovenia, President Nyusi of Mozambique and Prime Minister Tsipras of Greece in New York. pic.twitter.com/6Y73ofxhbK", "— Republic of Turkey Directorate of Communications (@Communications) September 26, 2018", "Therefore a 2018 image of French President Emmanuel Macron and Turkish President Recep Tayyip Erdogan at UN headquarters in New York City was shared with the false claim that the two did not shake hands. The image was linked to the recent tensions between France and Turkey after President Macron’s remarks on Islam and French teacher Samuel Paty’s beheading by a Muslim fundamentalist.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]