["The state of Texas is still reeling from a historic mid-February snowstorm that overtaxed its power grid. More than 4 million people waited several days in frigid temperatures for power to be restored, USA TODAY reported.", "Heidi Cruz, a high-ranking executive at investment banking company Goldman Sachs and wife of Sen. Ted Cruz, R-Texas, shares part of the blame for the outages, claims a Feb. 21 Facebook post.", "\"DO YOU KNOW Heidi Cruz, Ted's wife, is managing director of Goldman Sachs. They over see the Texas utilities,\" the post states.", "USA TODAY reached out to the poster for comment.", "The Cruz family made headlines in the aftermath of the Texas snowstorm for traveling to Mexico on Feb. 17, according to USA TODAY. Millions of Texans were still without power on the day of their departure.", "Cruz faced criticism from his Democratic counterparts and the media and returned to Texas a day after landing in Cancun. The senator called the trip \"a mistake,\" USA TODAY reported.", "Fact check:Image claiming to show 2016 Ted Cruz tweet on climate change and Texas is fabricated", "Heidi Cruz began working as a vice president at the global investment conglomerate Goldman, Sachs & Co. in 2005, according to her LinkedIn page. She was promoted to managing director in 2012, according to a profile in Greater Houston Partnership.", "Cruz was described as the \"family breadwinner\" in a 2018 profile in The Atlantic. She took unpaid leave from her job in 2015 to campaign for Ted Cruz when he ran for the 2016 Republican nomination for president, according to the story.", "Fact check:DOE granted request for Texas electricity generators to exceed emissions limits", "Suspected ties between the investment banking firm and Texas energy surfaced on Twitter this month. A Feb. 20 tweet claimed Goldman Sachs, and by extension Heidi Cruz, has a \"controlling interest in several Texas energy utilities.\"", "\"Some of these social media comments may be referring to an investment made by a Goldman Sachs fund as part of a private equity consortium that bought TXU in 2007, but following the company’s bankruptcy years ago we no longer had a stake,'' Leslie Shribman, a spokesperson for Goldman Sachs, told USA TODAY.", "TXU Corp., a Dallas-based energy company, was acquired for $45 billion in 2007 by Goldman Sachs and private equity firms Kohlberg Kravis Roberts & Co. and Texas Pacific Group, according to a company press release published on wsj.com.", "The energy company was renamed Energy Future Holdings after the acquisition. The falling price of natural gas, as well as the cost of taking the company private, soon took a toll on EFC. The company collapsed seven years later after subsidiary Texas Competitive Electric Holdings filed for bankruptcy, The Motley Fool reported in 2015.", "The EFH website provides no further updates.", "A representative from Goldman Sachs told Newsweek that the investment bank does not have a controlling stake in any U.S. energy company.", "About 90% of the state's power is managed by the nonprofit Electric Reliability Council of Texas, or ERCOT, according to the Austin American-Statesman.", "Fact check:Posts falsely claim Biden gave China control of U.S. power grid", "The claim that Goldman Sachs executive Heidi Cruz, wife of Sen. Ted Cruz, R-Texas, works for a company that oversees Texas' utilities is PARTLY FALSE. It is true that Cruz is a managing director at Goldman Sachs, but the company has no present ties to Texas utility companies. Goldman Sachs was one of three investors that acquired a Texas energy company in 2007, but the company went bankrupt seven years later.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]