["U.S. Rep. Matt Cartwright shakes hands with Michael Precone (right) after a meeting with medicare and medicaid recipients in Scranton Tuesday, July 31, 2018.", "Republican Jim Bognet, a candidate to represent Pennsylvania’s 8th Congressional District, accused his Democratic opponent of proposing to defund the Wilkes-Barre police.", "Speaking during a listening session sponsored by the Black Scranton Project and local chapters of the NAACP, Cartwright was asked if it’s possible to move money from a municipality’s budget for police to another area, and he responded “absolutely yes.”", "During that same listening session. Cartwright said he does not believe police forces should be defunded or disbanded.", "The Republican seeking to unseat U.S. Rep. Matt Cartwright, a Democrat who represents northeastern Pennsylvania’s 8th Congressional District, blasted him in a news release for calling to \"defund the police.\"", "\"Cartwright proposes to defund the Wilkes-Barre police,\" the June 12 email from the Jim Bognet for Congress campaign said. Bognet is a consultant and former Trump administration official from Hazleton who previously worked for the Export-Import Bank of the United States.", "We wondered whether Cartwright, whose reelection bid in a district Trump carried in 2016 and is expected to be one of the state’s most competitive, really backs a movement that the president and his allies have seized on as an example of Democratic overreach.", "He does not.", "During a virtual listening session he hosted last month with the Black Scranton Project and the Wilkes-Barre and Monroe County chapters of the NAACP, Cartwright was asked whether he supports calls to defund the police, a movement that has gained steam in some progressive circles in the weeks since the police killing of George Floyd.", "His response was clear.", "\"There have been voices calling for defunding and disbanding police forces. I personally do not agree with that,\" Cartwright said, advocating instead for new investment in law enforcement officer training and an expansion of community policing.", "An audio clip of the exchange is available on Cartwright’s Facebook page.", "\"I think that’s the answer,\" he continued. \"The idea of defunding, I don’t agree with that.\"", "The Bognet campaign news release accusing Cartwright of supporting the movement linked to another audio clip of the congressman speaking during that same virtual listening session. The clip appears on the YouTube channel of the Congressional Leadership Fund, which works to elect Republicans to Congress.", "In this clip, a listening session participant can be heard telling Cartwright that Wilkes-Barre funds its police force more generously than several other departments, and asks if there’s a way to reallocate some of those funds.", "\"The answer is absolutely yes,\" Cartwright says. \"How you spend tax money is one of the biggest issues in representative democracy.\"", "Alex Wilkes, a spokesperson for the Bognet campaign, said Cartwright’s response to the participant’s question is proof that he wants to defund the Wilkes-Barre police department. Matt Slavoski, a spokesman for Cartwright, said the congressman’s response should be interpreted as affirmation that local governments decide how to spend taxpayer money.", "\"This was a process question,\" said Slavoski, who noted that CLF has targeted Cartwright before.", "The Bognet campaign said that \"Cartwright proposes to defund the Wilkes-Barre police.\"", "He does not. Instead, he explained to a participant in a recent virtual listening session that public officials in places like Wilkes-Barre, and in Congress, have the power to decide how public funds are spent on the police, as for any other public agency.", "During the same event, Cartwright said explicitly that he does not agree with the idea of defunding the police. We rate the statement False.", "Bognet for Congress Press Release, \"Cartwright Proposes To Defund The Wilkes-Barre Police,\" June 12, 2020", "Bognet for Congress website, \"Why I’m running,\" accessed July 8, 2020", "Politics PA, \"Pennsylvania Congressional Vulnerability: April 2020 Ratings,\" April 15, 2020", "Congressman Matt Cartwright Facebook page, \"Opposition to Defunding or Disbanding Police,\" June 12, 2020", "CLFSuperPAC YouTube channel, \"Cartwright on Funding Police,\" June 11, 2020", "Congressional Leadership Fund, \"About CLF,\" accessed July 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]