["Prior to serving as Housing and Urban Development secretary under former President Donald Trump, Ben Carson was a neurosurgeon who performed the first successful operation of separating twins conjoined at the head.", "One user recently took to Facebook to share images claiming to be of the twins Carson separated in his groundbreaking 1987 surgery, Benjamin and Patrick Binder, then and now.", "\"THESE ARE THE CONJOINED TWINS THAT 'DR BEN CARSON' SEPARATED IN 1987!\" reads a March 16 post with over 600 shares.", "Accompanying the text are two photos: one of two small babies attached at the head, and another of the purported twins as older healthy adults posing in front of a car.", "The post first went viral in March 2016, in a Facebook post with 244,000 shares; similar versions of the claim resurfaced in June 2019 and October 2020.", "USA TODAY reached out to the Facebook users for comment.", "Fact check:No changes planned to Social Security benefits for immigrant workers", "A reverse Google image search reveals that neither photo included in the post shows the conjoined twins that Carson separated.", "The first image of the babies portrays Krista and Tatiana Hogan. It was captured by photographer John Lehmann on March 2, 2007, for The Globe and Mail, according to the National Newspaper Awards site.", "\"Twenty-one-year-old Felicia Simms kisses her daughters who are conjoined twins Tatiana (L) and her sister Krista at their home in Vernon, B.C.,\" reads the caption of the photo, which is featured in The Globe and Mail's 2009 \"Decade in Images.\"", "Krista and Tatiana Hogan have connected skulls and a connection called \"thalamic bridge\" by their neurosurgeon Douglas Cochrane.", "Get these in your inbox: We're fact-checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "\"This connection, along with the massive amount of connected skull and other tissue has ruled out any prospect of attempting to separate them,\" according to Psychology Today.", "The second photo is of Carson and Cramer Gormley, who are identical twins from Michigan, according to a 2008 article from Michigan Live. There are no reports that the two were ever conjoined.", "Fact check: Video of Biden with reporters on White House lawn is unaltered", "Benjamin and Patrick Binder were born connected at the head and separated at age 7 months after a 22-hour surgery on Sept. 6, 1987, by Ben Carson and a team of doctors, the Associated Press reported in 1989.", "Two years after the surgery, one of the anesthesiologists who participated in the surgery said Patrick was in \"a vegetative state\" while Benjamin was improving but was \"clearly not normal and developmentally delayed.\"", "In 2015, The Washington Post reported that the twins were \"hopelessly delayed\" and Benjamin would moan occasionally while Patrick remained silent. Peter Parlagi, the brother of the boys' mother, told the Post that Patrick died within the past decade and Benjamin cannot speak but is doing \"relatively well.\"", "Fact check: Facebook post claiming to be from Atlanta spa shooting suspect is fake", "An image claiming to show the conjoined twins separated by Ben Carson in 1987 is FALSE, based on our research. The first image included in the post is a photo of Krista and Tatiana Hogan who were unable to be separated and the second photo is two identical twins from Michigan that were never conjoined.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]