["About this rating", "On Nov. 29, 2020, a Facebook page purporting to represent Costco, a chain of membership-only warehouse stores, posted a message offering a free grocery box to anyone who shared and commented on their post.", "The message was purportedly written by Costco's CEO Craig Jelinek (whose name was misspelled \"Jelinekand\" in this scam Facebook post due to a typo):", "My name is Craig Jelinekand I'm the CEO of Costco Inc. To celebrate our 35th Birthday, Every single person who shaᴦes and comments in the next 24hrs will get one of these Christmas Food Box delivered straight to their door on Monday 30th November. Each Food box contains groceries worth of $250 and a $35 Costco voucher. Make sure you validate your entry.", "Limit 1 Food box per person.", "This message was not posted on Costco's official page and it was not written by the company's CEO. This is a scam that was shared by an imposter Facebook page. A nearly identical version of this scam (with Aldi swapped in for Costco) was also shared on social media in November 2020.", "Costco has not commented on this scam offer yet, but Aldi posted a message to Facebook alerting their customers about the scam:", "Hey ALDI fans! Looks like another Facebook scam is making its way around. We can confirm it is a scam and the page has no affiliation with ALDI. We're sorry for any confusion this may have caused!\nWe have been working with Facebook since yesterday to get the page taken down, but we'd love your help! Please share this post to help us spread the word and always be sure to look for the blue check mark by our name for authenticity!", "One indication that this \"free Costco grocery box\" offer is a scam is that it did not originate on Costco's Facebook page. Rather, this message was shared to a page called \"Costco US,\" whereas Costco's real page is called \"Costco.\" Here's a screenshot of the real page (left) that has a verified symbol and the fake page (right), which does not.", "Social media users could have also clicked the \"Page Transparency\" button on Facebook to unearth some more details about this fake page. In this case, the page transparency button reveals that the scam \"Costco US\" page was created on Nov. 29, the same day that this \"free grocery box\" scam started to circulate. It would be unusual, to say the least, for Costco to start an entirely new page (one that its shoppers do not know about) in order to host a giveaway.", "A reverse image search on the included photos also shows that this page is not on the up-and-up. The image supposedly showing \"free Costco grocery boxes\" is actually several years old and did not originally show boxes adorned with the \"Costco\" logo. The original image (below) shows plain cardboard boxes. The scammers inserted a digital version of the Costco logo in order to make it seem like the store was truly giving away boxes of groceries. A similar scam involving the grocery store Aldi also used a doctored version of this image:", "The best way to tell that this offer is a scam, however, is to ask yourself a simple question: Does it seem too good to be true?", "This type of scam is commonplace on social media. A fraudulent page (in this case a fake Costco page) posts an especially appealing offer (free grocery boxes) and then asks social media users to like, share, or comment on the post. This ensures that the scam message will spread to as many people as possible, which gives the fraudsters a better chance of success. \"Success,\" in this case, is people being tricked into parting with personal information, such as email addresses, passwords, or credit card numbers.", "We've had many occasions to alert readers to this kind of fraud:", "These types of viral “coupon” scams often involve websites and social media pages set up to mimic those of legitimate companies. Users who respond to those fake offers are required to share a website link or social media post in order to spread the scam more widely and lure in additional victims. Then those users are presented with a “survey” that extracts personal information such as email addresses, telephone numbers, dates of birth, and even sometimes credit card numbers. Finally, those who want to claim their “free” gift cards or coupons eventually learn they must first sign up to purchase a number of costly goods, services, or subscriptions.", "The Better Business Bureau offers consumers several general tips to avoid getting scammed:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]