["About this rating", "Newspaper clippings featuring a story about a German football club being banned from playing in 1934 after failing to give the Nazi salute are genuine.", "The German team was not protesting the Nazi regime; the incident happened in France; the team was only banned from playing games outside of Germany.", "How long the ban was enforced.", "A debate over forced patriotism in the United States once again emerged in late May 2018, after the National Football League announced that all players on the field during the pre-game ceremonies must stand for the national anthem. Some social media users compared the decision — which was designed to discourage players from protesting against social injustice and racial inequality by kneeling — to a seemingly similar incident that involved a German football club and the Nazi salute.", "For example, FreeThoughtBlogs.com presented a newspaper clipping containing a story about the Karlsruhe Football Club receiving a twelve-month ban after they failed to give the Nazi salute before a match in 1934 with the sarcastic caption \"totally irrelevant\":", "Totally irrelevant", "I’m sure this old newspaper clipping from 1934 has nothing to do with current events. Nothing at all.", "This is a genuine newspaper clipping. It was published in the Australian newspaper the Advocate on 9 January 1934, and was archived (and digitized) by the National Library of Australia.  We also found several other versions of this story in a variety of newspapers, such as the New York Daily News and the Montana Standard.", "However, viewers who merely glanced at this clipping may have been left with a few misconceptions. This incident took place in France, not Germany, and unlike the NFL players who knelt during the national anthem in the United States, this team was not protesting the Nazi regime. In fact, FC Karlsruhe was one of the teams who readily adhered to Nazi policies (such as expelling Jewish players) in the 1930s.", "The Karlsruhe Football Club was scheduled to play in Metz, France on Christmas day in 1933. The French players reportedly threatened not to play the match if the Germans used the Nazi salute. The Karlsruhe players were also also reportedly worried that the salute could cause fans to riot, and decided to forego the Nazi salute in order to play the match; when word reached Berlin, the team was banned from playing outside of Germany for a year.", "We compiled a few of the reports that we managed to find below:", "It appears that this ban included all German teams from playing matches in France. Furthermore, several of these newspaper clippings state that the ban would be enforced until the \"incident had been settled.\" We were unable to find any follow-up reports about this incident, so it's unclear if this ban lasted through all of 1934.", "What is clear, however, is that Hitler's influence over the world of sports was on the rise in the 1930s. The German Football Association was encouraging teams to expel their Jewish players; swastikas were displayed in German stadiums; and players were required to give the Hitler salute before and after games:", "...Football training resembled military exercise and young males were recruited by the Hitler Youth. Astoundingly, some welcomed these radical changes, such as Wiener Sportklub, a club with a national past, and SK Rapid and WAC, which appointed Nazi officials to their management so to make possible the use of young players for key matches and even postpone their military service. As Nazism tightened its control of football, the foreign names of more clubs were translated in German, players that served the military had to wear insignia of their branch or services, swastikas were displayed in all football grounds and every footballer had to give the 'German sports salute' before and after games.", "The German Football Association made an audacious statement in Kicker, a sports magazine founded by a Jew named Walter Bensemann, which encouraged prejudice among its affiliated clubs at the expense of their Jewish members. While some clubs like FV Karlsruhe, 1. FC Nurnberg and Eintracht Frankfurt rushed to implement the \"recommendations\" of the National Football Assocaition and rid themselves of Jews, Bayern Munich never failed to challenge the regime and declare their support to Kurt Landuaer, the club's former Jewish president ... On the whole, German football and the national association, in particular, contributed with effect to Adolph Hitler's stay in power.", "The newspaper clipping featuring a story about a German football club receiving a ban after its players failed to give a Nazi salute is genuine, but certain details about this story remain uncertain.", "Advocate.   \"Failed to Give Nazi salute: German Football Club Banned for 12 Months. .\"\r\n    9 January 1934.", "Kassimeris, Christos.   \"European Football in Black and White: Tackling Racism in Football.\"\r\n    Lexington Books, 2008.   (p. 25, 26).", "Kassimeris, Christos.   \"European Football in Black and White: Tackling Racism in Football.\"\r\n    Lexington Books, 2008.   (p. 25).", "Free Thoughts Blog.   \"Totally Irrelevant.\"\r\n    25 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]