["The claim was published here on a Malay-language blog site.", "The April 14, 2020 report’s headline translates to English as: “Covid-19: Mortuary worker accidentally burned by colleague.”", "Below is a screenshot of the misleading report:", "The first three paragraphs of the article translate to English as: “A service worker at New York, Funeral & Cremation died yesterday, accidentally burned by one of his colleagues.", "“According to police officials, Michael Jones, 48, decided to sleep after being exhausted working for sixteen hours straight because of too many dead bodies to handle.", "“When he was asleep, another worker thought he was a body of a 52-year-old who died due to respiratory issues and moved him to the crematory.”", "The claim was also made on Facebook here and on Twitter here. The claim was also shared in Tamil and English here.", "The claim is false; the story originated on a satirical website.", "The same story was published in this April 11, 2020, article on the US-based satire website the Weekly Inquirer. The report is headlined: “NEW YORK, NY: EXHAUSTED FUNERAL HOME EMPLOYEE CREMATED BY MISTAKE WHILE TAKING A NAP.”", "At the bottom of the webpage, a notice reads: “Disclaimer: This is satire.”", "As of April 28, 2020, there have been no credible media or police reports detailing any accidental cremations in New York City during the COVID-19 crisis.", "The same story has also been published elsewhere in articles that claim the same incident occurred in different US states.", "The Weekly Inquirer published a similar satirical article here claiming an accidental cremation occured in Louisiana. In February 2020, the claim was published in the same format under different URLs in articles that purported to report the same incident in Texas and Missouri. The story was even published in March 2017 here on a different satirical website.", "The photo at the top of the satirical report, which shows people in hazmat suits removing a body, was taken from this Bloomberg article published on April 10, 2020. The image is credited to Bloomberg and Angus Mordant, a New York-based photographer.", "The photo’s caption in the Bloomberg report reads: “Medical workers move the body of a deceased patient to a refrigerated overflow morgue outside a medical center in Brooklyn, New York on April 3.”", "Below is a screenshot comparison of the Weekly Inquirer article (L) and the Bloomberg article (R):", "Snopes, a US-based fact-checking organization, also debunked the claims in 2017 here and in 2020 here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]