["Cece Guida, 19, top, of New York City, pushes on Sam Reddick, 20, of Evansville, Ind., as spring break revelers look on during a game of chicken fight on the beach, Tuesday, March 17, 2020, in Pompano Beach, Fla. (AP)", "Some college students on spring break have ignored the public health warnings to not congregate in large groups, but experts say young people are vulnerable to coronavirus, too.", "The CDC reported that between mid-February and mid-March, 20% of the hospitalizations for coronavirus were for patients age 20-44 and 18% were age 45-54.", "The CDC cautioned that the data is preliminary and limited.", "With plenty of college students congregating for spring break, Sen. Marco Rubio, R-Fla., warned on Twitter that coronavirus is not only afflicting the elderly.", "\"We only have 3 months of information on  #Covid_19,\" Rubio tweeted March 19 to his 4 million followers. \"We have created the perception that younger people have nothing to worry about. We now need to stop saying that. In the U.S. 38% of those hospitalized are under 35. In France half of those in the ICU are under 65.\"", "We only have 3 months of information on #Covid_19We have created the perception that younger people have nothing to worry about. We now need to stop saying that.In the U.S. 38% of those hospitalized are under 35.In France half of those in the ICU are under 65.", "Rubio’s overall point that younger people are vulnerable has merit. But his U.S. number is wrong.", "For the record, his numbers on France were correct. The head of France’s national health agency said March 15 that 50% of people in intensive care are under 60 or under age 65. But we wanted to focus on the U.S. numbers.", "Experts warn that U.S. hospitalization data is preliminary, which means the numbers could change in the coming weeks as testing becomes more widespread.", "One day before Rubio’s tweet, the CDC reported there were 508 patients known to have been hospitalized as a result of coronavirus. The hospitalizations represented 12% of U.S. cases between Feb. 12 and March 16.", "The data did not include an age group breakdown specific to those under 35. What the CDC did report was that 20% of those hospitalized were ages 20-44, and 18% were 45-54. If we add up those two age groups, we get a total of 38%. We asked Rubio’s spokespersons if that was the 38% he was referencing, but we did not get a response.", "Major news outlets including the New York Times and NPR used that 38% statistic to point out that younger populations are also vulnerable to coronavirus. That’s an important message amid spring break, as some college students have ignored the recommendations to avoid large gatherings and have poured onto beaches in Florida, leading many counties or cities to close beaches.", "The CDC data shows that the elderly have the highest fatality rate.", "The March 18 report by the CDC states that the figures are based on preliminary data and include several limitations, including that data on age and outcomes, including hospitalization, were missing for between 9% and 53% of the cases. Also, further follow-up is needed to determine the outcomes among active cases and data on other risk factors, including if patients had underlying health conditions.", "\"At the current point, the data is too fluid to have confidence in the accuracy of any statement regarding how COVID-19 affects different age groups,\" said Volker Mai, a University of Florida epidemiologist.", "However, Mai said, it’s important to clear up any misperception that young people are immune from the disease. Younger populations are at risk of contracting COVID-19, especially young people with underlying conditions.", "\"Since we are just at the start of the epidemic here, we don’t have enough data to make strong conclusions about age-specific risk of serious illness and/or death in the U.S. yet,\" said Cindy Prins, a professor of epidemiology at the University of Florida, in an email.", "The reason, Prins said, is a lack or lag in testing", "Rubio tweeted \"in the U.S. 38% of those hospitalized are under 35.\"", "We could not find any current data that matches Rubio’s tweet. It is possible that he was citing widely reported data that included people up to age 54.", "The CDC reported that 20% of the hospitalizations were ages 20-44 and 18% were 45-54. But the data is preliminary, so it’s challenging to draw conclusions at this stage about the ages of people hospitalized.", "Rubio’s office didn’t get back to us but we have to wonder if the mistake in his tweet amounted to a simple transcription error.", "Rubio does have a point that younger people are vulnerable to coronavirus — it’s not only older people who have been hospitalized. But because the data point is wrong, we rate this statement Mostly False.", "Sen. Marco Rubio, Tweet, March 19, 2020", "U.S. Centers for Disease Control and Prevention, Severe Outcomes Among Patients with Coronavirus Disease 2019 (COVID-19) — United States, February 12–March 16, 2020, March 18, 2020", "CNN, More than half of coronavirus cases in France under intensive care are below the age of 60, March 15, 2020", "New York Times, Younger Adults Make Up Big Portion of Coronavirus Hospitalizations in U.S., March 18, 2020", "Washington Post, Younger adults are large percentage of coronavirus hospitalizations in United States, according to new CDC data, March 19, 2020", "NPR, Coronavirus Hits Older People Hardest. But Millennials, Gen Xers Can Be Vulnerable, March 19, 2020", "Email interview, Volker Mai, University of Florida Associate Professor, Department of Epidemiology, March 20, 2020", "Email interview, Cindy Prins, University of Florida, Master of Public Health Program Director | Assistant Dean for Educational Affairs | Clinical Associate Professor of Epidemiology, March 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]