["About this rating", "In the 1800s, the most common method to make popcorn, according to \"John Russell Bartlett's Dictionary of Americanisms,\" was to place the corn on a shovel and hold it over a fire until it started to pop. Since then, a number of more convenient ways have been conjured up to cook this popular snack food. In the 1840s, a man named Daniel Browne found the best way to make popcorn was in a frying pan with butter or lard. In the 1890s, Charles Cretors invented the first  popcorn machine, and just under a century later, the first microwavable popcorn bag was introduced.", "While many popcorn-related innovations have focused on convenience, a viral video in December 2019 supposedly showed a new complicated (yet eloquent) method to pop popcorn with a blowtorch, a hairdryer, and a little patience:", "https://vimeo.com/382160612", "This is not genuine footage of a kernel of corn being popped by a blowtorch. This is a short film created by Zita Bernet and Rafael Sommerhalder of Crictor Films that employs a variety of creative editing, animating, and compositing techniques.", "Sommerhalder told us in an email that all of the elements seen in the above-displayed film are real, and that the film doesn't technically use any computer-generated images. However, these objects were not filmed together in concert. They filmed the individual elements and then edited them together to create this cinematic illusion.", "For example, the turbulent orange flame that appears when roasting the kernel actually comes from a piece of burning wood. More importantly, the piece of popcorn seen floating above the hairdryer was created by filming a piece of popcorn that was stuck to a spinning motor:", "Here’s how we did it.", "All the elements were filmed for real:", "All these elements were combined and animated in Adobe After Effects.", "So strictly speaking there is no CGI involved (as in computer generated, 3D rendered elements) but a bit of editing, animation and compositing.", "We made this not to deceive but to create an enjoyable, entertaining little film (our New Years greeting card). It had to be believable enough to work, and maybe it’s the little doubt that makes it really stick in peoples minds.", "Sommerhalder also shared a behind-the-scenes video that showed the floating piece of popcorn before any editing took place:", "In short, this viral video does not show a new ingenious way to pop popcorn. This is a short film that employs a variety of creative filmmaking techniques.", "Avey, Tori.   \"Popcorn: A 'Pop' History.\"\r\n    The History Kitchen.   29 October 2013.", "Bartlett, Josh Russel.   \"Dictionary of Americanisms: A Glossary of Words and Phrases Usually Regarded as Peculiar to the United States.\"\r\n    Little Brown.   1877.", "\"Microwave Key to Popcorn War.\"   New York Times.\r\n    22 June 1987.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]