["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Josh Pade referenced his tax background and said as governor he wants to put together a bipartisan group to reform the state’s tax code.", "Josh Pade was a latecomer to the crowded Democratic governor’s race.", "The Kenosha lawyer has not been a major factor in the polls, or the fundraising tallies.", "But we were struck by a claim Pade made June 1, 2018, in an interview on WisconsinEye, since it went right to the tax cuts Republican Gov. Scott Walker touts as a major achievement.", "When asked what he would do about the state’s struggling middle class, Pade referenced his tax background and said as governor he wants to put together a bipartisan group to reform the state’s tax code.", "He also said this: \"Scott Walker touts his tax cuts. Unfortunately Wisconsin’s still one of the highest-taxed states in the country.\"", "Is he right about Wisconsin’s tax status?", "The evidence", "When we asked Pade’s campaign to provide backup for the statement, spokeswoman Kate Cooney pointed us to a study by Wallethub, a personal finance website, that ranked Wisconsin as 46th in effective tax rate (Number 1 being the lowest).", "\"We do acknowledge that other measurements of taxation have shown a lowered trend over time beginning before Governor Walker took office, but those studies are not as comprehensive in their data sets,\" said Cooney. \"We have also pointed out the tax burden as a percentage of income in Wisconsin is often lower on the most wealthiest income brackets than those with lower income.\"", "A spokesman for Walker’s campaign declined to offer any evidence on the issue, so we checked with a variety of experts and other rankings.", "Since Pade’s statement referred to taxes in general, we’ll start with what experts said about the overall tax burden.", "Tamarine Cornelius, a research analyst at the Wisconsin Budget Project: She said the state ranks somewhere in the middle when looking at state and local taxes -- 20th when measured on a per-state resident basis in 2015 and 21st when measured as a share of personal income.", "\"Measured either way, state and local taxes in Wisconsin are actually below the national average,\" she said, noting that when fees are included it drops Wisconsin’s rank even further.", "\"In Wisconsin, residents pay lower fees than residents in many other states,\" she said.", "Tax Foundation: A 2018 report from the Tax Foundation, an independent tax policy nonprofit, also shows Wisconsin in the middle of the pack with a rank of 18 for state tax collections per capita for 2016.", "Richard Auxier, a research associate with the Urban-Brookings Tax Policy Center at the Urban Institute: \"It looks like it’s a stretch to say Wisconsin is one of the highest taxed states in the country,\" he said. He mentioned the state’s \"somewhat progressive\" income tax rates, noting the top rate isn’t that high compared to other states; the existence of an Earned Income Tax Credit, though it isn’t as large as some others; and an average, if not low, sales tax rate compared to other states.", "So, all three put Wisconsin in the middle of the pack, not \"one of the highest.\"", "Why does the Wallethub study differ?", "Cornelius said she had concerns with how Wallethub did its analysis. She noted thestate Legislative Fiscal Bureau had determined the amount of property taxes paid on a median-valued house in Wisconsin to be $2,830. Cornelius said the Wallethub study \"overestimated property taxes on a median-valued house by 27%.\"", "Specific taxes", "What about Wisconsin’s rank for specific taxes?", "On property taxes, we contacted senior research analyst Adam Langley from the Lincoln Institute of Land Policy, a nonprofit focused on economic, social and environmental components of land.", "He pointed us to a ranking of states by property tax collection as a percentage of personal income from the Tax Policy Center’s State and Local Data Query Systembased on a survey of state and local governments. Wisconsin ranked 12th at 3.7 percent.", "He also pointed to an analysis his group did using U.S. Census Bureau data. That  analysis examined the median property tax bill as a percentage of the median household income for homeowners for 2015. Wisconsin ranked eighth at 4.6 percent.", "\"Property taxes are definitely higher in most New England states, New Jersey and Illinois than they are in Wisconsin,\" Langley said, \"Depending on the specific measure of property taxes used for the comparison, there are several more states that also have higher property taxes than Wisconsin.\"", "On income taxes, Auxier called Wisconsin’s income taxes \"somewhat progressive\" and referenced the state Department of Revenue’s tax rates and an Urban Institute summary of U.S. Census Bureau data.", "Auxier said Wisconsin’s four brackets, with a top rate on income above $329,810 for married filers, are relatively progressive because half the states that have an income tax have one flat rate or a threshold for their top rate on income below $40,000, which is \"essentially flat.\"", "Auxier said the most important thing to keep in mind when thinking about state taxes is different people pay different taxes. This is why statements saying one state is the highest-taxed are not that simple.", "He referenced an Urban Institute study he co-authored that estimated what each state’s revenue would look like with a tax system based on national average tax rates. Results showed \"Wisconsin’s actual taxes raise about as much revenue as it would with the average system,\" Auxier said.", "Our rating", "Pade said \"Wisconsin's still one of the highest-taxed states in the country.\"", "The study his campaign provided as evidence was from an organization that does not specialize in tax analysis and experts we spoke with were skeptical of how the study was done.", "In any case, the statement was too broad to be accurate. Specific taxes may rank higher than others, and the rankings might vary for different income groups. But the claim was about taxes in general.", "And, in general, the state is now more middle of the pack.", "We rate his statement Mostly False.", "WisconsinEye: Interview with Josh Pade, June 1, 2018", "Wallethub: 2018 Tax Rates by State, provided by Pade’s campaign", "Kate Coony, press secretary for Josh Pade’s campaign", "Tamarine Cornelius, research analyst at the Wisconsin Budget Project", "Wisconsin Budget Project: Middle of the Pack: Wisconsin Government Revenue is Similar to that of Other States", "Tax Foundation: 2018 Facts and Figures: How Does Your State Compare?", "Richard Auxier, research associate with the Urban-Brookings Tax Policy Center at the Urban Institute", "Urban Institute: Individual Income Taxes", "Tax Policy Center: State EITC as Percentage of the Federal EITC", "Tax Policy Center: State Sales Tax Rates", "Legislative Fiscal Bureau: Joint Finance Committee Tax Bill Estimates for a Median-Valued Home for 2017(18) and 2018(19) Compared to Prior Year Estimates", "Urban Institute: Data Query System", "State of Wisconsin Department of Revenue: Tax Rates", "Tax Policy Center: Is your state’s tax system punching above or below its weight?", "Urban Institute: Assessing Fiscal Capacities of States", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]