["About this rating", "The final week of April 2017 saw an outburst of vitriol on Facebook and Twitter in reaction to comments allegedly tweeted by Chelsea Clinton defending the practice of female genital mutilation.", "The World Health Organization defines female genital mutilation (FGM) as \"all procedures that involve partial or total removal of the external female genitalia, or other injury to the female genital organs for non-medical reasons.\"", "\"Genital mutilation is a culturally loaded, racist term,\" Clinton supposedly wrote. \"The correct term is genital cutting, and has many health benefits.\"", "Here is a brief sampling of the kind of responses that appeared on Twitter:", "@ChelseaClinton is an Advocate for Female Genital Mutilation. This is Extremely Disturbing, Sickening! #Women #FGM @WHO @womenshealth pic.twitter.com/0krdEW64JE", "— Green Diplomacy (@GreenDiplomacy) April 28, 2017", "Liberals are mind numb. Chelsea Clinton on twitter writes genital mutilation is racist term should be genital cutting im with #muslims", "— Real News Wire (@realnewswire) April 28, 2017", "@ChelseaClinton since you approve of genital cutting (genital mutilation) when will your daughter be getting her genitals cut?", "— J T loves COVFEFE (@JodiTarvin) April 27, 2017", "Interestingly, the majority of these retorts were addressed to Clinton's verified Twitter account (@ChelseaClinton), even though no such tweet ever issued from it. Based on what we were able to find in the public record, Chelsea Clinton has never suggested that female genital mutilation (FGM) be called anything other than what it is, nor claimed that FGM has \"health benefits,\" nor taken anything less than a strong stand against it.", "For example, she unambiguously tweeted, not two weeks before this controversy erupted, that female genital mutilation must be eradicated wherever it's found:", "Tragic that #FGM occurs in the U.S. or anywhere. We must #endFGM. Learn more about what the world needs to do here: https://t.co/FKgDNw4fe6 https://t.co/6Y18kZYbOW", "— Chelsea Clinton (@ChelseaClinton) April 13, 2017", "The only \"evidence\" that Chelsea Clinton has ever said anything to the contrary is this purported screenshot of a 26 April 2017 tweet from the \"@ClintonChelsea\" account (note the reversal of first and last names), which is not verified and does not belong to Chelsea Clinton:", "As one would expect, Clinton did not react favorably to scores of people tweeting that she or her daughter ought to be subjected to genital mutilation, especially given that the message in which she allegedly expressed support for it was a hoax:", "Both this fake account & replies to it are often vile. Repeatedly have asked @Twitter to suspend. Asking again here. pic.twitter.com/UNBQOYWJnB", "— Chelsea Clinton (@ChelseaClinton) April 29, 2017", "We don't know who created the hoax, but we can speculate with a fair degree of certainty what inspired it: a 21 April 2017 reply by a New York Times editor to readers questioning the use of the phrase \"genital cutting\" instead of \"genital mutilation\" in an article about a case reported in Michigan:", "We asked Celia Dugger, the editor of Health and Science, to explain he reasoning behind the decision.", "I began writing about this back in 1996 when I was an immigration reporter on the Metro desk covering the asylum case of Fauziya Kassindja. I decided in the course of reporting that case — especially after a reporting trip to Togo, her home country, and the Ivory Coast — to call it genital cutting rather than mutilation. I never minced words in describing exactly what form of cutting was involved, and there are many gradations of severity, and the terrible damage it did, and stayed away from the euphemistic circumcision, but chose to use the less culturally loaded term, genital cutting. There's a gulf between the Western (and some African) advocates who campaign against the practice and the people who follow the rite, and I felt the language use widened that chasm.", "The editor, Celia Dugger, not only expressed a preference for the term \"genital cutting\" (as Chelsea Clinton supposedly did in the tweet), but defended her choice by characterizing it as a \"less culturally loaded term.\" In terms of timing, the fake Clinton tweet appeared only a few days after the New York Times editorial comment, a fact some partisans attempted to use to their advantage:", "Chelsea & the NY Times decides to sugar coat Female Genital Mutilation, is there nothing sacred to the PC Nut Jobs?! https://t.co/BOnQ5McZps pic.twitter.com/zaibFD62Um", "— JC Shannon (@BillClintonTHOF) April 28, 2017", "Despite such claims, all the outrage surrounding Clinton's alleged comments about FGM was (and remains) pointless, however. The tweet was a hoax.", "Clinton, Chelsea.   \"3 Ways We Can Stop Violence Against Women and Girls.\"\r\n   Huffington Post.   3 March 2015.", "Fortin, Jacey.   \"Michigan Doctor Is Accused of Genital Cutting of 2 Girls.\"\r\n   The New York Times.   13 April 2017.", "Spayd, Liz and Gershkovich, Evan.   \"Friday Mailbag: A Patriots Photo Lets Trump Score a Point.\"\r\n   The New York Times.   21 April 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]