["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump argued against calls by some Democrats to abolish Immigration and Customs Enforcement, saying he’s watched the agency \"liberate\" towns from the violent MS-13 gang.", "\"The Democrats are making a strong push to abolish ICE, one of the smartest, toughest and most spirited law enforcement groups of men and women that I have ever seen. I have watched ICE liberate towns from the grasp of MS-13 & clean out the toughest of situations. They are great!\" Trump tweeted June 30.", "(Read more about the growing calls to abolish U.S. Immigration and Customs Enforcement.)", "Trump repeated the message in a July 5 tweet, \"Every day, the brave men and women of ICE are liberating communities from savage gangs like MS-13. We will NOT stand for these vile Democrat smears in law enforcement. We will always stand proudly with the BRAVE HEROES of ICE and BORDER PATROL!\"", "We wondered: Has ICE freed towns from MS-13’s dominion, as Trump claimed?", "Trump’s tweet did not say which towns had been liberated, or when. ICE referred PolitiFact to the White House for comment. The White House did not respond to repeated requests for clarity.", "We searched for facts to support the statement but did not find any.", "MS-13, or Mara Salvatrucha, operates in at least 40 states with an estimated 10,000 U.S.-based members. The street gang \"has a large presence\" in New York, Virginia, and the Washington, D.C. metropolitan area, the U.S. Justice Department has said.", "The FBI does not have a breakdown of their presence by state or location, said FBI spokeswoman Nora Scheland.", "Trump’s use of \"liberate\" suggested that towns had been under the rule or full control of MS-13. But neither the White House or ICE have named such towns. Experts on sociology and gang research told PolitiFact they were unaware of U.S. towns wholly controlled by the gang, and that Trump’s wording sounded like political hyperbole.", "\"This is hyperbolic and misleading language,\" said Jorja Leap, an adjunct professor of social welfare and director of the Health and Social Justice Partnership at UCLA Luskin School of Public Affairs. \"Liberation is usually the terminology of military forces — as in, the Allies liberated France from the Nazis.\"", "\"The claim is sort of outrageous and rather difficult to support since no U.S. government or state government has identified a city over which we lost sovereignty or control,\" said Fulton T. Armstrong, a research fellow at the Center for Latin American and Latino Studies at American University.", "\"MS-13 in certain cities have made inroads, in certain neighborhoods and schools, but to say entire towns have been under MS-13 control, that simply has never been substantiated,\" Armstrong added. \"In the absence of any evidence, one would have to say it's either a gross exaggeration if not a fabrication, because we've never known that.\"", "It would be a major accomplishment if a town got rid of MS-13’s presence, said David C. Pyrooz, an assistant professor of sociology at the University of Colorado, Boulder. \"But most gang crackdowns or raids only temporarily improve the condition of communities by reducing crime and fear, since the underlying factors giving rise to gangs and violence go unchanged by these police practices,\" Pyrooz said.", "News outlets have reported on MS-13’s brutal violence, its recruitment efforts, and the fear its members instill largely in immigrant communities and minors who come to the United States illegally without a parent or guardian.", "MS-13’s primary target is the immigrant community, though there have been cases where non-immigrants have also been victims, said Joseph Kolb, executive director of the Southwest Gang Information Center, which accumulates and shares gang-related information and training with law enforcement at local, state and federal level.", "MS-13 gang members have been charged in the 2016 murders of New York teenagers Kayla Cuevas and Nisa Mickens, who were walking together in their hometown.", "\"MS-13, they don’t control towns, but they control niches in towns,\" Kolb said. MS-13, like any ethnic or racial gang, have higher levels of crime in certain areas and flourish in the communities that they live in, Kolb said.", "Trump generally omits the fact that MS-13’s main targets are immigrants.", "Hundreds of gang members from MS-13 and others have been arrested in ICE-led operations over recent years. It’s worth noting that ICE isn’t necessarily the only law enforcement unit going after gang members.", "Established in 2005, Operation Community Shield is ICE’s anti-gang enforcement initiative that works with other federal, state and local law enforcement agencies. \"Gang-related enforcement activity is much more effective in areas where the partnership between ICE (Homeland Security Investigations) and local law enforcement is strongest,\" ICE’s website said.", "A six-week ICE-led gang operation that ended in May 2017 resulted in the arrest of 1,378 people (1,095 confirmed as gang members and affiliates). The majority of the arrested were U.S. citizens. And of the 1,378 arrested, 104 were MS-13 gang members, according to ICE.", "ICE’s Homeland Security Investigations division arrested nearly 800 MS-13 gang members in fiscal year 2017 and 405 in the first-quarter for fiscal year 2018, the agency previously told PolitiFact.", "Attorney General Jeff Sessions in October 2017 also said he was designating MS-13 as a priority for the Organized Crime Drug Enforcement Task Forces. The coalition includes ICE, the FBI, Internal Revenue Service, the Bureau of Alcohol, Tobacco, Firearms and Explosives, U.S. Department of Labor Inspector General, and others.", "\"Large gang crackdowns, especially those involving violent gangs, often include multiple agencies,\" Pyrooz said. \"It would be rare, although not necessarily impossible, for a raid to occur without the assistance of local police, owing to the ground-level intelligence that police have on the gang dynamics in a city.\"", "Trump tweeted, \"I have watched ICE liberate towns from the grasp of MS-13.\"", "Neither ICE nor the White House identified towns that had been under MS-13 rule and were then liberated by ICE. Experts said the gang targets niches or immigrant communities within larger jurisdictions, and did not have entire towns within its violent grasp. Raids by law enforcement temporarily improve the safety of communities, but usually do not act as permanent solutions because the underlying circumstances of gang violence remain.", "With no evidence to support it, Trump’s statement rates False.", "Twitter @realdonaldtrump, tweet June 30, 2018 tweet, July 5, 2018", "PolitiFact, 'Abolish ICE' movement is growing. Is the agency's disbanding likely?, July 3, 2018", "U.S. Justice Department, Department of Justice Fact Sheet on MS-13, April 18, 2017", "FBI, How We’re Ganging Up on MS-13 And What You Can Do To Help, July 13, 2005", "U.S. Justice Department, Six MS-13 Members Born in El Salvador Indicted in Maryland on Charges Ranging From Racketeering Conspiracy, Murder, and Attempted Murder, March 29, 2018", "Email interview, FBI spokeswoman Nora Scheland, July 3-5, 2018", "Email interview, Jorja Leap, an adjunct professor of social welfare and director of the Health and Social Justice Partnership at UCLA Luskin School of Public Affairs, July 6, 2018", "Email interview, David C. Pyrooz, an assistant professor of sociology at the University of Colorado, Boulder, July 5, 2018", "Email interview, Thomas Ward, associate professor (teaching) of anthropology at USC, July 5, 2018", "Phone interview, Joseph Kolb, executive director of the Southwest Gang Information Center, July 5, 2018", "Phone interview, Fulton T. Armstrong, a research fellow at the Center for Latin American and Latino Studies at American University, July 7, 2018", "Washington Post, A 14-year-old told of a teen’s killing by MS-13. Then, he disappeared too., Dec. 8, 2017", "Washington Post, ‘People here live in fear’: MS-13 menaces a community seven miles from the White House, Dec. 20, 2017", "Newsday.com, Victim’s mother weeps as MS-13 defendants appear in court, Dec. 11, 2017", "ICE.gov, Operation Community Shield", "ICE.gov, ICE-led gang surge nets 1,378 arrests nationwide, May 11, 2017", "U.S. Department of Justice, Attorney General Jeff Sessions Gives Key Department of Justice Task Force New Tools to Dismantle MS-13, Oct. 23, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]