["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post from \"Being Liberal\" attacked Sens. Marco Rubio and Rand Paul.", "A new Facebook meme paints two leading Republicans as anti-science because of their alleged views of the age of the Earth.", "The Facebook group Being Liberal posted a picture March 10, 2014, featuring side-by-side images of Sen. Marco Rubio, R-Fla., and Sen. Rand Paul, R-Ky., looking somewhat sheepish. Bolded text under the images describes the senators’ views on the age of the Earth and the extinction of the dinosaurs.", "According to the meme, Rubio \"believes Earth (is) 9,000 years old,\" and \"humans hunted dinosaurs to extinction.\" Paul, the image proclaims, says the Earth is 10,000 years old and believes \"God made dinosaurs disappear to make space for humans.\" The post received about 5,500 likes and was shared more than 4,000 times.", "Upon seeing this, we couldn’t resist digging in and finding out just what these two senators believe about the age of the Earth and the demise of the dinosaurs.", "Rubio", "It seems the backing for the claim about Rubio comes from a November 2012 interview with GQ magazine, when Michael Hainey asked, \"How old do you think the Earth is?\"", "Rubio didn’t directly answer the question, instead saying, \"I'm not a scientist, man. I can tell you what recorded history says, I can tell you what the Bible says, but I think that's a dispute amongst theologians, and I think it has nothing to do with the gross domestic product or economic growth of the United States.\"", "He later called the planet’s age \"one of the great mysteries.\"", "The comment drew criticism around the Internet, sparking a string of opinion pieces from blogs and mainstream news organizations alike. Commentators specifically wondered about Rubio’s answer because of his position on the Senate Commerce, Science, and Transportation Committee.", "Rubio clarified his answer in another interview, this time with Politico on Dec. 5, 2012.", "\"First of all, let me tell you about the answer I gave. The answer I gave was actually trying to make the same point the president made a few years ago, and that is there is no scientific debate on the age of the Earth. I mean, it’s established, pretty definitively. It’s 4 and a half… at least four and half billion years old. I was referring to a theological debate, which is a pretty healthy debate,\" Rubio said.", "So, Rubio didn’t actually peg the age of the Earth at 9,000 years in the GQ interview, and even gave the widely accepted scientific answer in the later interview with Politico.", "Paul", "We had to go all the way back to 2010 to find a statement from Paul about the age of the Earth. It turned out to be even more vague than Rubio’s answer to GQ.", "In June 2010, Paul gave a speech at a Christian Homeschool Educators of Kentucky meeting, after which he took questions from the audience.", "One audience member asked the then-candidate for Senate, \"Was there a point in life that you became Christian that you recognized? And also, how old is the world?\"", "Paul joked at first, saying he was only taking \"easy questions,\" and then described the origins of his faith. He then said he would \"pass\" on the question concerning the age of the Earth.", "Other than that, Paul hasn’t made public comments on his opinions about when the Earth came to be.", "Our ruling", "Being Liberal’s Facebook post claimed Rubio and Paul believe the Earth is 9,000 and 10,000 years old, respectively. While both men have made vague statements concerning their beliefs about the age of the Earth, neither has publicly cited the figures claimed in the post, and Rubio has even given the widely held scientific answer to the question.", "As for the senators’ views on the fate of the dinosaurs, we’ll take a page from Rubio’s playbook and call it one of the world’s great mysteries, because it doesn’t appear either has said anything in public regarding the issue.", "So there are no public statements to back up the Facebook post’s claim, and Rubio has even said the direct opposite. We rate this claim Pants on Fire.", "Being Liberal, Facebook image, March 10, 2014", "GQ Magazine, \"All Eyez on Him,\" December 2012", "Think Progress, \"Rubio on Age of Earth,\" December 5, 2012, via YouTube", "Kentucky Insider, \"Rand Paul At Christian Home Schoolers Conference - Part 2,\" June 27, 2010, via YouTube", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]