["A video of a group of people from the Muslim community chanting ‘Bharat Mata ki Jai’ has been shared on social media with the claim that this march was taken out in Kashmir. It is noteworthy that the government on August 5 deemed Article 370 of the Constitution, which grants special status to Jammu and Kashmir, ineffective.", "കശ്മീരിലെ മുസ്ലീം ജനത പാകിസ്ഥാൻ തീവ്രവാദികളുടെ അടിമത്തത്തിൽ നിന്നും മോചിതരാകുന്ന നയനാനന്ദകരമായ കാഴ്ച", "Posted by Sreekumar Gopalapillai on Friday, 9 August 2019", "The video has been widely floated using a Malayalam caption – “കശ്മീരിലെ മുസ്ലീം ജനത പാകിസ്ഥാൻ തീവ്രവാദികളുടെ അടിമത്തത്തിൽ നിന്നും മോചിതരാകുന്ന നയനാനന്ദകരമായ കാഴ്ച (Freedom from the captivity of Pakistani militants in Kashmir.)”", "An identical English caption has also been used to circulate the clip. Another English caption shared with the video says, “Jammu and Kashmir State : A beautiful scene. Bharath Mata ki Jai.”", "A twitter user, Hemir Desai, who is followed by railway minister Piyush Goyal’s office, also shared the video claiming that the procession is the effect of “abolishment of Article 370.”", "Secular Religion who once Opposed to Say BHARAT MATA KI JAY n", "VANDE MATARAM are now Chanting with INDIA Flag.", "Effect of Abolishment of Article 370 n 35 #KashmirHamaraHai #KashmirMeinTiranga pic.twitter.com/51Z0pmXp21", "— Hemir Desai (@hemirdesai) August 9, 2019", "Alt News broke the video into multiple frames and reserve-searched one of the images on Google which led us to a Twitter handle that had shared the same video earlier in February this year. He claimed that this procession was taken out by Bohra Muslims in Bangalore in the memory of martyred CRPF jawans.", "Bohra Muslims near Bannerghatta Road area in Bangalore took out procession in memory of martyred CRPF jawans. VANDE MATHARAM, JAI HIND 🇮🇳🇮🇳🇮🇳🙏🙏🙏 #PulwamaAttack pic.twitter.com/gz5IJG6qEJ", "— Subba Rao🇮🇳🇮🇳 (@yessirtns) February 22, 2019", "Upon searching for the video with specific keywords, we also found the same clip on YouTube uploaded as a procession taken out by Bohra Muslims in Bannerghatta, Bangalore. Apart from pro-India slogans, people can also be heard chanting – “Shaheed Jawan Amar Rahe” – which hints that the rally was indeed taken in support of martyred soldiers.", "Furthermore, at about 15 seconds into the video, the name of the complex behind the procession is visible. It says – ‘Burhani Flora’.", "Burhani Flora is an apartment complex located in Bangalore’s Bohra Layout, Gottigere.", "It is thus established that video was not shot in Kashmir but Bangalore. It is unrelated to the recent unrest in J&K owing to the government’s decision to scrap Jammu and Kashmir of statehood and special status under Article 370 of the Indian Constitution.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]