["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An extensive political tirade criticizing Democrats and liberals recently went viral on Facebook – and claims that actor and comedian Tim Allen wrote the whole thing.", "The nearly 500-word post includes numerous observations attributed to the actor and has gotten almost 5,000 shares since being posted Sept. 1.", "The post features a photo of Allen with his alleged statement written as the caption. For the purposes of brevity, we will not post the entire passage attributed to Allen, but it begins:", "\"Tim Allen is credited with writing this ... Here are some interesting points to think about prior to 2020, especially to my friends on the fence, like moderate Democrats, Libertarians and Independents and the never Trump Republicans and those thinking of ‘walking away’ from the Democratic party … Women are upset at Trump’s naughty words -- they also bought 80 million copies of 50 Shades of Gray … Not one feminist has defended Sarah Sanders. It seems women’s rights only matter if those women are liberal … No Border Walls. No voter ID laws. Did you figure it out yet?..\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) That’s because there’s no evidence the actor actually said this.", "Before we get to that, we want to note that we have fact-checked some of the claims made in the statement:", "No, House Democrats did not vote to allow noncitizens to vote as part of HR 1", "Will Trump's border wall cost less than Obamacare website?", "Complex tale involving Hillary Clinton, uranium and Russia resurfaces", "A meme about migrant cell phone use at the U.S. border takes an AP photo out of context", "No, the Green New Deal doesn't aim to end air travel, as Florida Sen. Rick Scott says", "Newt Gingrich misleading in saying Bill Clinton paid $850,000 'penalty'", "But as to whether Tim Allen – a Republican who has been open about his conservative viewpoints in interviews – actually said or wrote this, a review of all the available evidence indicates the answer is no.", "Not one media organization reported that Allen authored the post and the statement was not posted to any of Allen’s official social media accounts.", "Claims that Allen said this began surfacing in late August 2019, when other fact-checking organizations came across similar posts.", "But it appears that days before social media posts began crediting Allen with the statement, a version of it was posted on the Facebook page of singer Ted Nugent, who is also known to be a vocal conservative.", "A day later, the message was shared by a Facebook user who is coincidentally named Tim Allen, but is not the actor.", "It is likely the actor was misattributed after another man with the same name shared it.", "We rate this False.", "Facebook post, Sept. 1, 2019", "Facebook post, Aug. 24, 2019", "Facebook post, Aug. 25, 2019", "Tim Allen Twitter and Facebook, Accessed Sept. 6, 2019", "Snopes, Did the Comedian Tim Allen Write a Viral Facebook Attack on Democrats?, Sept. 4, 2019", "TruthorFiction.com, Tim Allen ‘Trump 2020 or America Is Dead’ Commentary, Sept. 4, 2019", "Entertainment Weekly, Tim Allen gets candid about politics and Trump: 'I'm kind of an anarchist', Sept. 13, 2018", "Vanity Fair, Tim Allen: There’s \"Nothing More Dangerous Than a Likable Conservative Character\", Sept. 27, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]