["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A common and perhaps reasonable assumption is that people who are poor don’t have jobs.", "But in an Aug. 7, 2013, infographic on its website, the left-leaning Oregon Center for Public Policy wrote that \"7 out of 10 Oregon families living in poverty have at least one parent who works.\"", "Was this the debunking of a common myth about those in poverty? Do a full 70 percent of Oregon families in poverty have a parent who works?", "We first rang Chuck Sheketoff, the executive director of the Silverton-based center, who said that the figure was part of the center’s June 27, 2013, \"Working But Still Poor\" fact sheet. \"Work is not a sure path out of poverty,\" it said.", "A pie chart on the second page says that 69 percent of families in poverty were \"working families,\" composed of 22 percent who had \"at least one parent working full time\" and 47 percent who had \"at least one parent working less than full time.\" About 31 percent of the families had no parent working.", "The numbers were from the center’s analysis of the U.S. Census Bureau’s 2011 American Community Survey data.", "Sheketoff pointed us to Jason Gettel, the center’s policy analyst who crunched those numbers. Gettel explained that he used DataFerrett, a free data analysis program promoted on the Census Bureau’s website. DataFerrett allows users to analyze all of the survey responses to carve out data in different ways.", "\"We wanted to see what proportion of families in poverty had a worker present to show that people do live in poverty despite the fact that they work,\" Gettel said. \"They’re there because some jobs pay too little, or they’ve been laid off for some period of time, but not because they don’t put forth a work effort.\"", "Gettel walked us through DataFerrett and showed us how he selected certain variables in order to limit the survey responses to arrive at the \"7 out of 10\" number.", "He limited the data to only the Oregon families who are in poverty with a related child. He then searched for types of work experience by different family members, such as \"householder worked full-time in the past 12 months and spouse worked full time in the past 12 months\" or \"female householder worked less than full-time in the past 12 months and no spouse present.\"", "Finally, the numbers were weighted to more accurately reflect statewide numbers, since the American Community Survey does not count as many people as the 2010 U.S. Census.", "The analysis showed that there were 437,991 families with children in Oregon. Of those, 86,255 were in poverty. This is the pool of Oregon families we would use for further calculations.", "Next we did some simple addition and subtraction. We first added up the 3,042 families where neither the householder nor the spouse worked; the 4,429 families where single male householders did not work; and the 19,339 families where single female householders did not work.", "This showed us that 26,810 of the 86,255 Oregon families with children had a parent who did not work in the previous year, roughly 31 percent. Put another way, 59,445 Oregon families with children in poverty — 69 percent — had a parent who worked at least part time in the previous year.", "It’s worth noting here that the Census data only breaks down work experience by three different types and only over a 12-month period: full-time work, less than full-time work, or no work.", "That means somebody who last worked a one-month retail job during the 2012 holiday season would qualify as a less than full-time worker.", "We’re not sure that most people count that as a parent who works. Indeed, government officials generally categorize people unemployed for six months or longer as \"long-term unemployed.\"", "We also want to note that \"poverty\" is defined as the federal poverty threshold. For 2011, that threshold was $18,123 for a single parent with two children and $22,811 for a two-parent family with two children. The threshold varies depending on the number of adults and children and whether the adults are under 65 years old.", "Next we wanted to verify that Gettel had used the right variables to arrive at the right numbers. DataFerrett, to put it nicely, is not the most intuitive program for the average user.", "We called the U.S. Census Bureau, where a survey statistician in the poverty statistics branch also used DataFerrett to check our variables and numbers.", "\"The process that was used was the correct process,\" said Robert Bernstein, a bureau spokesman. \"The end result was this 69 percent figure.\"", "Lastly, we wondered if similar studies had been done. Again, we turned to the Census Bureau.", "One table indicated that nearly 64 percent of Oregon families with income below the poverty level in the previous year had a worker in the family. Those data were from the 2011 American Community Survey.", "Another 2011 Census table based on national data showed that, of the 33.1 million people in families in poverty, 21.1 million individuals were in families with at least one worker — about 64 percent.", "Neither of those studies was limited to families with children.", "We looked at some other studies, too, and saw similar percentages. None of these studies is a perfect apples-to-apples comparison to the Oregon Center for Public Policy’s data, but they show that the Oregon center’s numbers are within range of what similar studies have found.", "The Oregon Center for Public Policy wrote that \"7 out of 10 Oregon families living in poverty have at least one parent who works.\"", "We checked Gettel’s analysis and confirmed his results. We also confirmed the analysis and numbers with the U.S. Census Bureau.", "While the numbers are accurate, under the survey design, somebody classified by federal employment officials as \"long-term unemployed\" could be counted as working under the Census definition. We think that’s an important clarification.", "We rate this statement Mostly True.", "\"Most poor Oregon families are working families,\" infographic, Oregon Center for Public Policy, Aug. 7, 2013", "\"Working But Still Poor,\" fact sheet, Oregon Center for Public Policy, June 27, 2013", "Interview with Chuck Sheketoff, executive director, Oregon Center for Public Policy, Aug. 30, 2013", "Interviews and e-mails with Jason Gettel, policy analyst, Oregon Center for Public Policy, Aug. 30, Sept. 3 and 9, 2013", "American Community Survey, U.S. Census Bureau, 2011 data", "Interviews with Robert Bernstein, spokesman, U.S. Census Bureau, Sept. 4 and 6, 2013", "Interview with John Charles, president and CEO, Cascade Policy Institute, Sept. 6, 2013", "Poverty thresholds by size of family and number of children,\" U.S. Census Bureau, 2011 figures", "\"Poverty status in the past 12 months of families by family type by work experience of householder and spouse,\" table, U.S. Census Bureau, 2011 American Community Survey 1-year estimates", "\"People in families by number of working family members and family structure,\" table, U.S. Census Bureau, Current Population Survey, 2012 Annual Social and Economic Supplement", "\"Poverty Despite Work in Minnesota,\" Minnesota Budget Project, June 2000", "\"Poverty Despite Work in Kentucky,\" Center on Budget and Policy Priorities, April 1999", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]