["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jim Rubens arrives on set as from left are US Senate candidates Bob Smith and Scott Brown just prior to the taping of CloseUp with Josh McElveen at WMUR studios in Manchester on Friday. Thomas Roy/Union Leader", "When New Hampshire Republican Jim Rubens came face-to-face with Scott Brown in the race for a U.S. Senate seat, Rubens didn’t waste any time going on the attack.", "\"In 2011, you voted with president Obama 70 percent of the time,\" Rubens said to Brown, his GOP primary opponent, in his opening remarks during a June 20, 2014, forum televised on WMUR-TV.", "It was a line that underscored criticism from Brown’s opponents about the strength of Brown’s conservative beliefs.", "Brown has touted his bipartisan credentials in the past, and while representing Massachusetts in the U.S. Senate from 2010-2012, Brown developed a track record as one of the lawmakers most willing to reach across the aisle.", "But did Brown really support Democratic President Barack Obama’s agenda 70 percent of the time, as Rubens stated?", "This isn’t the first time a candidate’s record of support for Obama has been invoked in the U.S. Senate race in New Hampshire.", "For instance, Brown has claimed several times that the Democrat who currently holds the seat, U.S. Sen. Jeanne Shaheen, voted with Obama 99 percent of the time. PolitiFact New Hampshire previously ruled that claim Mostly True, based on research conducted by the publication Congressional Quarterly.", "In its annual Vote Studies, CQ examines voting patterns for every member of Congress and sorts them in ways that allow comparisons. One of those ways is an examination of presidential support, or the number of votes by each lawmaker on bills on which the sitting president has staked a position.", "The 2011 CQ analysis found that, out of the pool of votes on which Obama took a clear position that year, Brown’s vote matched the president’s stance 69.6 percent of the time. That score is in line with the claim Rubens made.", "Out of all Republicans in the Senate, only Maine Sen. Susan Collins recorded a higher presidential support score that year, based on CQ’s analysis.", "Brown’s presidential support score was somewhat lower during his first year in office. In 2010, CQ determined, Brown supported Obama’s positions about 60.7 percent of the time. The number rose to about 78 percent during Brown’s final year in office in 2012.", "It’s important to note that there are limitations to gauging any politician’s support for the president based solely on the small number of votes represented in the CQ analysis.", "In 2011, for example, the Senate took 235 roll call votes. CQ registers Obama as having taken a clear stance on only 89 of those votes, most of which were taken on presidential nominations.", "After he was criticized by Rubens, Brown pointed out that he was proud to join Obama in supporting pieces of legislation such as the VOW to Hire Heroes Act, which provides tax incentives for businesses that hire unemployed veterans.", "Brown’s campaign also pointed out that Brown’s presidential support score in the 2011 CQ analysis placed him midway between the average Republican and average Democrat in the Senate.", "According to CQ’s figures, the average Senate Republican voted with the president 53 percent of the time, while the average Democrat supported the president 92 percent of the time.", "Our ruling", "Rubens said that when Brown was serving in the U.S. Senate in 2011, Brown voted with President Obama 70 percent of the time.", "In 2011, Brown took the same position as the president 69.6 percent of the time when Obama outlined a clear position, based on analysis by Congressional Quarterly. Rounding off, Rubens was right on the money. But it’s important to note the president doesn’t take a clear position on all legislation and outlined his position on only 38 percent of the roll call votes taken in 2011.", "Overall, the number is accurate, but needs additional clarification. We rate this claim Mostly True.", "WMUR-TV, \"CloseUP: GOP Senate candidate forum, Part 1,\" June 22, 2014.", "Email interview with Brian Tilton, communications director for Jim Rubens, June 23, 2014.", "Email interview with Elizabeth Guyton, spokeswoman for Scott Brown, June 23, 2014.", "PolitiFact NH, \"Scott Brown says he was the most bipartisan senator,\" March 27, 2014.", "PolitiFact NH, \"NH GOP says Jeanne Shaheen votes with Obama 99 percent of the time,\" April 14, 2014.", "MassLive.com, \"Study: Scott Brown 2nd-most bipartisan senator in 2011,\"", "Boston.com, After awkward encounter, Scott Brown and Jeanne Shaheen resume attacks in New Hampshire US senate race, March 30, 2014.", "The Telegraph of Nashua, \"Scott Brown speaks to Nashua Republicans, plays up \"strong\" NH ties,\" May 9, 2014.", "CQ Weekly, Vote Studies 2010, accessed April 2014.", "CQ Weekly, Vote Studies 2011, accessed April 2014.", "CQ Weekly, Vote Studies 2012, accessed April 2014.", "U.S. Senate Roll Call Votes 112th Congress - 1st Session (2011), accessed June 23, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]