["A video of former Prime Minister Manmohan Singh and Congress leader Sonia Gandhi swapping chairs is being shared with the claim that the ex-PM was made to vacate his seat for Gandhi.", "A user named Manoj Srivastava (@ManojSr60583090) shared the video. In the tweet text, he said that Congress leader Sonia Gandhi had made Singh get up from the PM’s seat and sit on a peon’s chair. Hence, the Congress should not talk about showing respect to someone, he added.", "*कांग्रेस के लिए सम्मान की बात करना*", "*शोभा नहीं देता है*", "*सोनिया मान्यो एंटोनीयो*", "*ने प्रोटोकॉल के अंतरगत*", "*मनमोहन सिंह को*", "*पीएम की कुर्सी से उठाकर*", "*चपरासी वाली कुर्सी पर बैठा दिया*", "*और खुद बैठ गई*", "*गुलाम देखता रह गया कुछ नहीं बोला*", "*धिक्कार है ऐसे प्रधानमंत्री पर* pic.twitter.com/DxADPNkghH", "— Manoj Srivastava (@ManojSr60583090) May 27, 2023", "The video was shared recently by several Twitter users with similar captions. Among them are Saurabh Srivastava (@Saurabh37244583), सनातनी प्रियंका 🚩🚩(@Mukeshk34257693) and Anup Kapoor (@AnupKapoor).", "The video has been viral in the psst as well. In 2020, Twitter user @Muralik79739498 uploaded the video with the caption, “First time I am seeing a PM being told to move to other chair.”", "Pathetic way of bureaucracy. First time I am seeing a PM being told to move to other chair. Imagine the kind of hold she had in entire 10 years of rule. We always respect the chair. https://t.co/wTpjqzmz3A pic.twitter.com/CdotTWsY0F", "— Murali Jai Hind🇮🇳 (@Muralik79739498) September 26, 2020", "The clip has been doing the rounds on social media at least since 2017.", "Pathetic way of bureaucracy. First time I am seeing a PM being told to move to other chair. Imagine the kind of hold she had in entire 10 years of rule. We always respect the chair", "கொடும டா சாமி … காங்கிரஸ் ஆட்சியில் பிரதமருக்கு வழங்கப்பட்ட மரியாதை. …😮😮😮😮 pic.twitter.com/Cey2eJwWDV", "— Vibin Raj 🇮🇳 (@VibinRaj_0224) November 22, 2017", "A keyword search ‘Manmohan Singh Sonia Gandhi seat’ on YouTube throws up a 2011 report by India TV as the first result.", "The channel reported that during a UPA meeting, Sonia Gandhi sat on the seat assigned to Manmohan Singh by the Special Protection Group (SPG). “When Special Protection Group officials noticed this, they first requested Sonia Gandhi to vacate the PM’s seat, and another official told the PM in his ear that he should shift to Sonia Gandhi’s seat,” reported India TV.", "SPG is an elite force that provides security to the Prime Minister, former PMs and their family members. The SPG Act was amended twice to bring down the period of automatic protection to one year “from the date on which the former prime minister ceased to hold office” and beyond one year based on the level of threat as decided by the government.", "According to the SPG protocol, protected persons have to sit in their designated seats which is why Sonia Gandhi had to swap her place with Manmohan Singh as she inadvertently sat on the PM’s designated seat.", "So, it is clear that the 2011 video is frequently shared to claim that the former Prime Minister was disrespected.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]