["About this rating", "On Jan. 30, 2020, the World News Daily Report published an article positing that an Irish \"midget\" had extorted sex from more than two dozen women by promising them a pot of gold.", "Irish Midget Accused of Posing as a Leprechaun to Extort Sex from 26 Women in Exchange for a Pot of Gold", "A 3-foot-and-4-inches-tall Irishman was arrested this morning for allegedly taking advantage of credulous women by posing as a leprechaun and extorting sexual favors in exchange for a fictional “pot of gold hidden at the end of a rainbow”.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "World News Daily Report assumes all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any person, living, dead or undead, is purely a miracle.", "Despite this piece of fiction having dubious origins and ridiculous premise, this rumor continued circulating on social media long after its publication date. In January of 2021, for instance, the image of this supposed larping leprechaun (at the top of this article) received more than 20,000 upvotes, and hit the front page of Reddit.", "This image, however, doesn't actually show a person who tricked women into having sex by promising them a pot full of gold. This image actually shows a man (who is not a dwarf) at an annual redhead convention in Ireland in 2016.", "For background, here is why we sometimes write about satire/humor.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]