["About this rating", "In March 2016, a story about the purported last words and actions of a doomed Russian Special Forces officer went viral:", "According to the Russian news web site Pravda.ru, that officer, Lt. Alexander Prokhorenko, was acting as a joint terminal attack controller in Syria when he was surrounded by ISIS forces:", "Prokhorenko: They are outside, conduct the airstrike now please hurry, this is the end, tell my family I love them and i died fighting for my motherland.", "Command: Negative, return to the green line.", "Prokhorenko: Unable command, I am surrounded, they are outside, I don’t want them to take me and parade me, conduct the airstrike, they will make a mockery of me and this uniform. I want to die with dignity and take all these bastards with me. please my last wish, conduct the airstrike, they will kill me either way.", "Command: Please confirm your request.", "Prokhorenko : They [are] outside, this is the end commander, thank you, tell my family and my country I love them. Tell them I was brave and I fought until I could no longer. Please take care of my family, avenge my death, good bye commander, tell my family I love them!", "Command: [No response, orders the airstrike]", "According to reports published by Russian news media, Prokherenko was indeed killed in Palmyra in late March 2016:", "The soldier died heroically, [bringing fire down on himself], after having been found by terrorists and surrounded.", "The parents and wife of Alexander Prokhorenko were notified, and the entire village [of Gorodki] mourned with loved ones, friends, classmates and co-workers of the Russian officer.", "I admire the heroism of the simple rural boy who was able to put the implementation of the objectives and the preservation of our lives above his,\" said one of the friends of Alexander Prokhorenko.", "The Russian government had unequivocally and repeatedly denied that there were any combat forces, special or otherwise, participating in ground fighting in Palmyra, Syria, but that narrative was contradicted on 17 March 2016 when Amaq News Agency (an ISIS propaganda arm) published photographs that appeared to show dead Russian soldiers in Syria.", "Shortly thereafter, the Russian government publicly admitted that they had soldiers on the ground in and around Palmyra, and stories of the \"Russian Rambo,\" Prokherenko, began to appear in Russian news media:", "\"A Russian special operations forces [SOF] officer was killed near a town of Palmyra while guiding Russian warplanes to IS [previously ISIS/ISIL] targets,\" a military source at Russia's airbase Khmeimim told Interfax news agency.", "The source added that the special forces operator was on a mission near Palmyra for at least a week, detecting the terrorists' most important targets and providing coordinates for Russian warplanes to strike.", "\"The officer died as a hero, calling a strike onto himself after he was compromised and surrounded by terrorists,\" the source added.", "The purported transcript of Prokherenko's final words to his family and his country appeared not long afterward, but we've unable to track down either the original source of the transcript or a copy of the recording from which it was supposedly taken.  Italian debunker David Puente has traced the story's online origin to a 26 March 2016 posting from a Facebook user who appears to be not in Russia, but in Bangladesh.", "The \"soldier who dies bravely fighting against impossible odds\" story is a common one in wartime, and it's true that wartime does bring out reserves of courage (and horrendous acts of cruelty) in people who are either unintentionally caught up or active participants in it. However, it's also true that conflict involves the spread of propaganda, whether it's about how brave your side is, or how cowardly and base the other side has become.  Russia is a master at soft propaganda: the country has opened several news organizations (such as Russia Today and Sputnik News) that are owned and operated by its government and exist specifically to combat what they term biased international media — a common practice among countries who wish to improve their images outside their borders.", "(We note here that doomed \"last words\" transcripts have proved especially popular among readers, and that Pravda.ru has published its share of outlandish stories over the years, such as \"Aliens Forced Americans Out from the Moon,\" \"Time Machine Built in Europe, Russian Scientists Say,\" and \"Alien and Human Skulls Found on Mars.\")", "The image of the hero soldier is a popular and effective one, particularly if the hero is an underdog 25-year-old with a beautiful pregnant wife at home (whose lavish and very polished wedding video just appeared online — uploaded by a Russian reporter — around the same time as this transcript), and who died in a courageous last stand against an enemy that is almost universally reviled.", "Of course, just because something makes a good story doesn't mean it's untrue. It's difficult to figure out which the case of 25-year-old Lieutenant Alexander Prokherenko might be: That he existed and was killed in Syria seems to be vetted information, but the information that surfaced afterward could either be genuine or an example of the news media serving as a battleground in yet another proxy war (this one of information), with each salvo playing out and reverberating in the English-language press, aided and abetted by news outlets that uncritically print stories guaranteed to bring in pageviews regardless of whether or not they are genuine.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]