["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the public waited for details about the Chattanooga, Tenn., shooting attack that left five servicemen dead, anti-Islam activist Pamela Geller claimed that an ISIS supporter knew about the shooting before it happened.", "The shooting started at a military recruiting center on July 16, 2015, at 10:45 a.m. local time.", "Geller said the tweet from an ISIS supporter with #Chattanooga came 11 minutes before the attack at 10:34 a.m. (That supporter’s account has since been suspended.)", "Geller thought she was on to something, and the story spread to Robert Spencer’s \"Jihad Watch\" before taking off across other media channels.", "But the ISIS \"warning\" tweet wasn’t a warning so much as eerie post-attack commentary.", "What happened shows what can go wrong when you jump to conclusions about Twitter’s timestamps.", "The ISIS supporter’s tweet was actually published at 10:34 a.m. Pacific Standard Time, which means it was shared almost three hours after the shooting began.", "This became clear by Thursday evening, when Bret Baier shared on The O’Reilly Factor that the ISIS tweet was posted after the shooting took place. (The liberal website Media Matters for America published a timeline of the events as they spread on Fox News; the ISIS-tweet narrative lasted several hours.)", "The ISIS tweet spread like wildfire before people noticed the real timestamp of the pro-ISIS tweet.", "In an interview with PunditFact, Geller said that at the time she wrote her tweet, she was not aware that \"Twitter's time stamping was not uniform.\"", "\"I updated the post when new information became available,\" Geller said.", "We have not been able to find any additional tweets from Geller indicating the incorrect timestamp from her first tweet, which is still still published online.", "Geller did post an update to one of her website articles about the ISIS tweet and timestamp issue. Another article on her website has not yet been updated.", "Authorities are still investigating whether there is an ISIS connection. The shooter, Muhammad Youssef Abdulazeez, was killed by police.", "On her website, Geller points out that the ISIS tweet was posted before the shooter was named or \"before we knew that the killer was a devout Muslim waging jihad,\" which to her is enough proof that the shooting was at least ISIS-inspired.", "Other news sources have been more careful in describing Abdulazeez’s possible motivations or allegiances. ABC News described Abdulazeez as a \"disturbed (and) suicidal\" man who wrote about \"becoming a martyr.\" Still, Abdulazeez apparently called ISIS a \"stupid group … completely against Islam\" during a conversation with a friend, according to CNN.", "There are also different interpretations of Abdulazeez’s seven-month trip to Jordan. Family members said the trip was intended to \"get (Abdulazeez) away from bad influences in the U.S.\" A government source told CBS that Abdulazeez did not travel outside of Jordan during his visit and there is no proof of him visiting Iraq or Syria. But a close friend of Abdulazeez said he changed after coming back.", "Our ruling", "Geller claimed that an ISIS supporter tweeted ahead of the Chattanooga shooting. The claim gained a lot of traction before it became clear that the tweet happened a few hours after the shooting.", "Geller updated the original post, but it did little to stuff the rumor back into the bag.", "We rate the claim False.", "CNN, \"Fifth service member dies after Chattanooga shooting,\" July 18, 2015", "Media Matters for America, \"TIMELINE: How Fox Got It Wrong In Its Rush To Link The Chattanooga Shooting To An ISIS Tweet,\" July 17, 2015", "Twitter, Pamela Geller, July 16, 2015", "Twitter, Terek Fatah, July 16, 2015", "Twitter, Eric Clay, July 17, 2015", "Twitter, Breaking911, July 16, 2015", "Jihad Watch, \"ISIS tweets \"Chattanooga\" as gunman begins shooting there; 4 murdered,\" July 16, 2015", "Pamela Geller’s Website, \"4 MARINES SHOT DEAD, 1 COP DOWN in Multiple Terror Attacks on US Military Bases in #Chattanooga, ISIS Tweeted Warning,\" July 16, 2015", "Pamela Geller’s Website, \"FIRST PHOTOS: Chattanooga Jihad Murderer Muhammad Youssef Abdulazeez: Five things you need to know,\" July 16, 2015", "Pamela Geller’s Website, \"House Homeland Security Chairman says Chattanooga shooter WAS ‘ISIS-INSPIRED,’ warns of OTHER attacks,\" July 17, 2015", "ABC News, \"Chattanooga Shooting: FBI Recovers Gunman's Disturbing Diary,\" July 20, 2015", "CBS News, \"Chattanooga gunman's kin encouraged his trip to Jordan,\" July 20, 2015", "CNN, \"Chattanooga shooting: New details emerge about the gunman,\" July 20, 2015", "CNN, \"4 guns seized after Chattanooga shooting, official says,\" July 18, 2015", "Email interview with Pamela Geller, President of the American Freedom Defense Initiative and Stop Islamization of America, July 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]