["The one minute, 37 second video was published to Facebook here on July 22, 2019. It has been viewed more than 2,000 times.", "It shows a bearded man accosting staff in a bakery, angrily showing them baked goods in a box, then shouting in Urdu and sending other products flying across the counter. Urdu is the national language of Pakistan, as detailed on this government website.", "The Facebook post's caption states: “Pista house old city Hyderabad”.", "Pista House is a popular bakery and Indian sweet shop in Hyderabad, a city in southern India.", "Below is a screenshot of the misleading Facebook post:", "The same clip was also viewed hundreds of times elsewhere on Facebook with similar claims that the incident took place at Hyderabad’s Pista House bakery, for example here and here.", "Other Facebook posts – for example here and here – combined the same video with a claim that it showed Moti Bakery in Ahmedabad, a city in western India.", "Both claims are false; the video was actually filmed at Treats Bakery in the southern Pakistani city of Karachi.", "Examining the video closely found the words 'Treats Bakery' written on the front of the counter and a ‘Treats’ logo on pink stickers on food packets.", "Below are two screenshots from the video showing the bakery’s name written on counter and food packets:", "Keyword searches on Google and Facebook for ‘Treats Bakery’ found this Facebook page for a bakery in Karachi.", "The shop’s logo on its Facebook page matches the logo seen in the misleading video.", "Below is a screenshot comparison of a close-up screenshot of one of the pink logo stickers in the misleading video (L) and a screenshot of the logo on the bakery’s Facebook page (R):", "Further keyword searches for “Treats Bakery Karachi” found this video, published to YouTube on July 21, 2019, which features the same bearded customer standing with other men.", "The video was published by local Indian news organisation Hyderabad Deccan News. Its title states: “Treats Bakery, Karachi, Pakistan gave expired food Items to customers”.", "The caption states: “Treats Bakery, Karachi, Pakistan gave expired food Items to customers. Case booked & Inspected by food safety officials. Few people's on Social Media trying to link Treat Bakery with Brand @Pista House Hyd. Please Note: Case will be booked if any fake news forwarded”.", "That video is embedded below:", "In the video, a person in a black cap and grey shirt introduces himself in Urdu as local food safety officer of Sindh Food Authority, Mohammed Tehseen.", "He says: “We received complaints through social media that a kid started vomiting after eating expired food. We reached the shop along with police officials within half an hour and took action. The complainant, as well as the bakery’s owners, are with us and they will explain to you further.”", "The customer from the misleading Facebook posts, who appears alongside two other people, said to be the owners of the bakery, says: “I am the father of the kid. A sudden incident took place yesterday. It was a misunderstanding. Actually, the kid had eaten something which stuck in his throat and he started vomiting. We later realised that it was the (tomato) ketchup and not blood. I don’t have any problem as such, but I would like to appreciate the officials of the Sindh Food Authority for their timely action”.", "Treats bakery owner Tahir Siddiqui told AFP by phone on August 7: \"Food authorities checked everything at the bakery and found nothing wrong.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]