["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There has been no change in the way Social Security payments are classified or defined.", "The term “benefits” has always been associated with the program.", "A popular social media post resurfaces an old claim that states the standard Social Security check is now, or will soon be, reclassified as a \"federal benefit payment.\"", "But this is not new. The term \"benefits\" has been used in relation to the program’s disbursements since it began in the 1930s.", "The post displays a photo of a Social Security card with \"1946 - 1964,\" which signifies the time period in which the baby boomer generation was born. Accompanying the image is a long string of text that’s been circulating the internet in one form or another in email chains since at least 2012.", "Part of that text says: \"The government is now referring to our Social Security checks as a ‘Federal Benefit Payment.’ This isn't a benefit. It is our money paid out of our earned income! Not only did we all contribute to Social Security but our employers did too.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Social Security program has long been defined as a federal benefit-based program that employers and employees contribute to. The term is also applied to other government programs, such as Social Security Disability Insurance and Medicare.", "We also could find no information on the Social Security Administration’s website that says  disbursements are being officially re-classified.", "The rest of the text is filled with inaccurate calculations and assumptions about how Social Security contributions work. (For example, it says Social Security contributions total \"15% of our income before taxes\" and uses the figure to make various calculations. But, besides the fact that the rate has varied over the years, Social Security contributions for employees and employers isn’t, and has never been, 15%. The current rate is 12.4%, with 6.2% paid by the employee and 6.2% paid by the employer.)", "A social media post says that the government is reclassifying Social Security checks as  ‘federal benefit payments.\"", "There is no new designation for the disbursements. Social Security checks have always been considered federal benefit payments.", "We rate this False.", "Facebook post, Dec. 27, 2019", "Social Security Administration, Social Security & Medicare Tax Rates, Accessed Feb. 28, 2020", "IRS.gov, Topic No. 751 Social Security and Medicare Withholding Rates, Accessed Feb. 28, 2020", "Snopes, Social Security as ‘Federal Benefit Payments’, July 23, 2012", "Social Security Administration, The Social Security Act of 1935, Accessed Feb. 28, 2020", "Social Security Administration, Retirement Benefits, 2020", "Social Security Administration, Frequently Asked Questions, Accessed Feb. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]