["By Angelo Fichera", "Posted on June 2, 2020", "A tweet shared widely online during the protests sparked by the death of George Floyd — espousing a plan to bring violence to “residential areas… the white hoods” — was made to appear to be from antifa, the anti-fascist coalition. But the account behind the tweet was actually linked to a white nationalist group, according to Twitter.", "During the protests sparked by the death of George Floyd, a tweet shared widely online — espousing a plan to bring violence to “residential areas… the white hoods” — was made to appear to be from antifa, the anti-fascist coalition.", "“ALERT,” the May 31 tweet from “@ANTIFA_US” read. “Tonight’s the night, Comrades.”", "The tweet landed in the context of nationwide protests spurred by the May 25 death of Floyd, a 46-year-old black man, in police custody. The Minneapolis officer seen kneeling on Floyd’s neck in a viral video — a white man who was one of four officers fired over the death — has been charged with killing Floyd.", "“Tonight… we move into the residential areas… the white hoods…. and we take what’s ours,” the tweet declared. It also used the misspelled hashtag “#BlacklivesMaters.”", "But Twitter says that the account, suspended May 31, was actually connected to a white nationalist group, Identity Evropa (also known as the American Identity Movement).", "“This account violated our platform manipulation and spam policy, specifically the creation of fake accounts,” a Twitter spokesperson told us. “We took action after the account sent a Tweet inciting violence and broke the Twitter Rules.”", "Twitter explicitly identified the account as being connected to Identity Evropa and said it had taken previous action against other fake accounts tied to the group.", "NBC News first reported the group behind the account.", "There are no archived versions of the account prior to its suspension available on the Internet Archive’s Wayback Machine. A screenshot of the account shows it was set up in May 2020 and that its flag contained the letters “IE” and its location was listed as “iE.”", "Despite Twitter suspending the account, screenshots of the tweet in question circulated widely on Facebook. It was further shared in stories such as one on the website ConcealedNation.org, which also gained traction on Facebook. And new posts of the screenshot have continued to surface even though the tweet promised the events to occur on May 31.", "It’s unclear the exact role antifa — known for using violent tactics — has played in the current demonstrations across the country. But President Donald Trump has targeted the group, claiming he would designate antifa as a domestic terrorist organization, even though there is no such official federal designation, as we’ve previously explained.", "“I want the organizers of this terror to be on notice that you will face severe criminal penalties and lengthy sentences in jail,” Trump said during a June 1 address about the protests. “This includes antifa and others who are leading instigators of this violence.”", "Writing in the Washington Post, Mark Bray, a historian at Rutgers University and author of “Antifa: The Anti-Fascist Handbook,” said he suspects some members of antifa groups have been involved in the protests but that there aren’t enough to be responsible for all of the acts of destruction.", "Bray explained that “antifa itself is not an overarching organization with a chain of command.”", "“Based on my research into antifa groups, I believe it’s true that most, if not all, members do wholeheartedly support militant self-defense against the police and the targeted destruction of police and capitalist property that has accompanied it this week,” he wrote.", "Bray said he was “also confident that some members of antifa groups have participated in a variety of forms of resistance during this dramatic rebellion. Yet it is impossible to ascertain the exact number of people who belong to antifa groups because members hide their political activities from law enforcement and the far right, and concerns about infiltration and high expectations of commitment keep the sizes of groups rather small. Basically, there are nowhere near enough anarchists and members of antifa groups to have accomplished such breathtaking destruction on their own.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Bray, Mark. “Antifa isn’t the problem. Trump’s bluster is a distraction from police violence.” Washington Post. 1 Jun 2020.", "Collins, Ben, et. al. “White nationalist group posing as antifa called for violence on Twitter.” NBC News. 1 Jun 2020.", "“Identity Evropa.” Anti-Defamation League. Accessed 2 Jun 2020.", "Robertson, Lori. “Trump Can’t Designate Antifa — or Any Movement — Domestic Terrorist Organization.” FactCheck.org. 1 Jun 2020.", "“Statement by the President.” WhiteHouse.gov. 1 Jun 2020.", "“Who are Antifa?” Anti-Defamation League. Accessed 2 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]