["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Army Europe Deputy Commanding General Andrew M. Rohling addresses the media during a press conference in Berlin, Jan. 14, 2020, on the Defender 2020 military exercise.", "• The U.S. had been scheduled to send 20,000 troops to Europe at the start of 2020 in preparation for a multinational strategic exercise with European allies. The exercise was scaled back due to COVID-19 concerns.", "• There is no evidence the troops deployed to Europe were excavating secret military bases, freeing children or arresting members of the “deep state.”", "Social media users are circulating claims that thousands of U.S. troops were deployed to Europe in March to rescue children and arrest members of the \"deep state.\"", "The claims are part of a 15-minute video riddled with conspiracy theories about everything from hydroxychloroquine to Bill Gates’ investments.", "\"In March 2020, the United States deployed 30,000 troops to Europe to assist with the excavation of 'DUMBS' — also known as Deep Underground Military Bases,\" the unidentified narrator of the video said. \"This was action to free child-trafficked children and arrest deep state cabal members.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The U.S. deployed thousands of troops to Europe in early 2020, but there is no evidence for claims that those troops or any other U.S. troops were tasked with excavating secret military bases, freeing trafficked children or arresting \"deep state cabal members.\"", "These allegations are tied to the baseless QAnon conspiracy theory, which claims that prominent Democrats and Hollywood celebrities are Satan-worshipping, cannibalistic pedophiles, and that there was a \"deep state\" plot against President Donald Trump’s efforts to bring them to justice.", "As early as January 2020, the U.S. Army began moving equipment and deploying thousands of troops to Europe in preparation for a joint military exercise known as Defender-Europe 20.", "The exercise was a \"U.S.-led multinational exercise, including NATO's participation,\" according to NATO’s official website. It was scheduled to be the \"largest deployment of U.S.-based forces to Europe in more than 25 years with 20,000 soldiers deployed directly from the U.S. to Europe.\"", "The exercise was meant to demonstrate the U.S.’s commitment to NATO and \"to build strategic readiness by deploying a combat credible force to Europe\" according to the U.S. European Command.", "By March, however, the Army announced that the exercise would be modified \"in size and scope\" because of growing concerns about the outbreak of the COVID-19 virus.", "All movement of troops and equipment from the U.S. to Europe was stopped, the Army said in its press release. Additionally, the Army said most — but not quite all — of the planned exercises that would have been part of Defender-Europe 20 were canceled.", "\"We anticipate the armored brigade combat team already deployed to Europe will conduct gunnery and other combined training events with Allies as part of a modified Allied Spirit exercise,\" the Army said in its statement. \"Forces already deployed to Europe for other linked exercises will return to the United States.\"", "Asked about the video’s claim, a NATO official said it was false.", "\"There has been a substantial amount of fake news and propaganda directed towards the exercise over the past year,\" the official said. \"The false claims made in the video have zero basis in reality.\"", "A video shared on Facebook claimed, \"In March 2020 the United States deployed 30,000 troops to Europe to ... free child trafficked children and arrest deep state cabal members.\"", "U.S. troops were deployed to Europe in preparation for a joint military exercise with European allies that was later scaled back due to the coronavirus. There is no evidence that any U.S. forces were deployed to Europe to free trafficked children or arrest \"deep state cabal members.\"", "We rate this claim False.", "Facebook post, Jan. 26, 2021", "Email interview with NATO official, Jan. 29, 2021", "Euronews, \"Trump sending 20,000 troops to train with Europeans on Russian border,\" accessed Jan. 29, 2021", "DEFENDER-EUROPE 20, \"About DEFENDER-Europe 20,\" accessed Jan. 29, 2021", "The Hill, \"US military cuts back troops to participate in European exercise over virus fears,\" March 11, 2020", "DEFENDER-EUROPE 20, \"Exercise DEFENDER-Europe 20 Announcement - COVID-19 Implications,\" March 17, 2020", "Deutsche Welle, \"US troops arrive in Germany for 'Defender Europe 20' military maneuvers,\" Feb. 21, 2020", "U.S. Army, \"DEFENDER-Europe 20 modified in size and scope,\" March 16, 2020", "EUCOM, \"DEFENDER-Europe 20 Begins With 1st Combat Power Arrival,\" Feb. 20, 2020", "EUCOM, \"Exercise Defender-Europe 20 Update,\" March 11, 2020", "U.S. Army Europe and Africa, \"Exercise Defender-Europe 20 UPDATE,\" March 16, 2020", "PolitiFact, \"What is QAnon, the baseless conspiracy spilling into US politics?\" Aug. 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]