["About this rating", "The insecticide chlorpyrifos, sold under the brand names Lorsban, Dursban, and others, has been the subject of regulatory battles for decades. It was first introduced as a pesticide in 1965, and it remains the most commonly applied pesticide in the United States. In 1996, the Clinton administration signed into law the Food Quality Protection Act, which mandated regular scientific reviews and safety evaluations of existing pesticides based on children’s health safety benchmarks. One of the actions resulting from this review was a 2000 ban on chlorpyrifos for nearly all residential and indoor uses:", "This action comes after completing the most extensive scientific review of the potential hazards from a pesticide ever conducted. This action — the result of an agreement with the manufacturers — will significantly minimize potential health risks from exposure to Dursban, also called chlorpyrifos, for all Americans, especially children.", "Following this ruling, the EPA additionally ruled that chlorpyrifos would remain classified as safe for use in other agricultural and industrial settings. This latter ruling resulted in a September 2007 petition to the EPA filed by the Pesticide Action Network of North America and the Natural Resources Defense Council, both of which jointly requested that the agency ban the pesticide or issue final rulings on their acceptable levels (legally termed “tolerances”) in food. In September 2015, the Ninth Circuit court of appeals mandated that the EPA respond to this petition by either banning the chemical completely or issuing final rulings on tolerances of the chemical’s residue on food products by October 31, 2015.", "Following this court order, the EPA conducted a lengthy review and delivered a proposal on 6 November 2015, which suggested — as requested by the petition — that all currently published tolerances regarding chlorpyrifos residue on food should be revoked:", "EPA is proposing to revoke all tolerances for residues of the insecticide chlorpyrifos [including] tolerances for residues of chlorpyrifos on specific food commodities; on all food commodities treated in food handling and food service establishments in accordance with prescribed conditions; and on specific commodities when used under regional registrations.", "The agency is proposing to revoke all of these tolerances because EPA cannot, at this time, determine that aggregate exposure to residues of chlorpyrifos, including all anticipated dietary exposures and all other non-occupational exposures for which there is reliable information, are safe.", "In March 2017, before the EPA’s proposal was implemented, Scott Pruitt — the new EPA administrator under President Donald Trump — reversed course and argued the previous administration’s scientific rationale was dubious, denying the petition:", "In October 2015, under the previous Administration, EPA proposed to revoke all food residue tolerances for chlorpyrifos, an active ingredient in insecticides. This proposal was issued in response to a petition from the Natural Resources Defense Council and Pesticide Action Network North America. The October 2015 proposal largely relied on certain epidemiological study outcomes, whose application is novel and uncertain, to reach its conclusions.", "The decision to deny the petition faced renewed scrutiny because the CEO of Dow Chemical, Andrew Liveris, had been appointed by Trump to a White House manufacturing working group, and his company subsequently donated $1 million to Donald Trump’s inauguration fund. Liveris also was scrutinized over reports that he met with Pruitt prior to his announcement reversing the ban.", "On 19 November 2017, using text from a viral Chelsea Handler tweet, the progressive Facebook Page \"Really American\" launched a petition with a call to action:", "We explore each component of this memetic claim:", "Chlorpyrifos Was Invented by the Nazis as a Nerve Agent", "Mostly false. Chlorpyrifos is a specific chemical that belongs to a broader class of chemicals called organophosphates. While the Nazis were at the forefront of developing this broader class as both weapons and insecticides, they can not be credited with inventing chlorpyrifos specifically.", "In the 1930s, a German researcher named Gerhard Schrader at German chemical producer IG Farben (infamous for producing the gas most commonly employed at Nazi death camps) discovered that organophosphates interact with cholinesterase, an enzyme that aids in the production of an important neurotransmitter in animals.", "Originally this effect was explored as a way to produce an insecticide, but one of Schrader's formulations, named “Preparation 9/91”, ended up being extremely toxic to humans. Schrader himself required hospitalization as a result of his own interaction with it. This discovery was reported to Nazi authorities, who mandated that all German researchers report any scientific development that could have military applications to the regime.", "Shrader’s discovery led to the discovery and production of some of the world’s most infamous organophosphate nerve gases, including Tabun and Sarin gases. Other countries, including Britain and the United States, also began research into organophosphates during WWII as weapons. After the war ended, research resumed into organophosphate use as an insecticide.", "Chlorpyrifos, a specific formulation of an organophosphate, is included as one of many chemicals assigned to the Dow Chemical company in a 1963 patent which lists United States-based researcher Raymond Rigterink as the inventor. The only connection that chlorpyrifos has to the Nazi regime is its foundational work on the biological effects of organophosphates that researchers performed prior to, and during, WWII. Many nations built on this work after the war.", "Chlorpyrifos Causes Brain Damage", "Unproven, but likely. That organophosphates can be toxic to humans is nothing new. The idea, in developing such a chemical for use an insecticide, is to engineer an organophosphate that is below the threshold for affecting the human nervous system (via its effect on cholinesterase, something scientifically referred to as AChE inhibition) but is still toxic to insects.", "From a scientific standpoint, the main controversy surrounds the potential residual effects that chlorpyrifos may have on the neurological development of fetuses and young children, which some studies have documented even at levels well below what is currently considered acceptable. In their 2016 decision to ban all tolerances for the chemical on food, the Environmental Protection Agency stated:", "In summary, the EPA’s assessment is that the [Columbia Center for Children’s Environmental Health, CCCEH] study, with supporting results from the other 2 U.S. cohort studies and the seven additional epidemiological studies reviewed in 2015, provides sufficient evidence that there are neurodevelopmental effects occurring at chlorpyrifos exposure levels below that required for AChE inhibition.", "The primary study cited by the EPA was conducted by the Columbia Center for Children’s Environmental Health and published in the journal Proceedings of the National Academy of Sciences in 2012. This study compared fetal exposure to chlorpyrifos (based on sampling of blood in the mother's umbilical cord) to differences in brain development:", "We investigated associations between [chlorpyrifos, CPF] exposure and brain morphology using magnetic resonance imaging in 40 children, 5.9–11.2 y, selected from a nonclinical, representative community-based cohort. Twenty high-exposure children (upper tertile of CPF concentrations in umbilical cord blood) were compared with 20 low-exposure children on cortical surface features [...].", "In a press release this study, CCCEH said:", "Even low to moderate levels of exposure to the insecticide chlorpyrifos during pregnancy may lead to long-term, potentially irreversible changes in the brain structure of the child", "[...]", "Changes were visible across the surface of the brain, with abnormal enlargement of some areas and thinning in others. The disturbances in brain structure are consistent with the IQ deficits previously reported in the children with high exposure levels of [...] CPF, suggesting a link between prenatal exposure to CPF and deficits in IQ and working memory at age 7.", "[...]", "Notably, the brain abnormalities appeared to occur at exposure levels below the current EPA threshold for toxicity, which is based on exposures high enough to inhibit the action of the key neurological enzyme cholinesterase. The present findings suggest that the mechanism underlying structural changes in the brain may involve other pathways.", "There have been several large-scale studies that show a similar association between exposure to chlorpyrifos and other organophosphates to neurological problems, and there have been several studies proposing hypotheses about why such an association exists, but there lacks a rigorous consensus on the later point. The Pruitt EPA, in essence, has used this uncertainty to punt a decision on its neurological effects to a later review date:", "Following a review of comments on both the November 2015 proposal and the November 2016 notice of data availability, EPA has concluded that, despite several years of study, the science addressing neurodevelopmental effects remains unresolved and that further evaluation of the science during the remaining time for completion of registration review is warranted to achieve greater certainty as to whether the potential exists for adverse neurodevelopmental effects to occur from current human exposures to chlorpyrifos.", "EPA has therefore concluded that it will not complete the human health portion of the registration review or any associated tolerance revocation of chlorpyrifos without first attempting to come to a clearer scientific resolution on those issues. As noted, Congress has provided that EPA must complete registration review by October 1, 2022. Because the 9th Circuit's August 12, 2016 order has made clear, however, that further extensions to the March 31, 2017 deadline for responding to the Petition would not be granted, EPA is today also denying all remaining petition claims.", "Pruitt highlighted specific methodological problems and uncertainties scientists raised during their 2016 review, but importantly neglected to mention that at the time of the panel’s meeting, they still concluded that the ban was necessary — even if the mechanistic aspects of chlorpyrifos danger are not yet settled. Jim Jones, the former head of the EPA chemical safety unit, contended in an interview with the New York Times that the science behind the neurological risks of chlorpyrifos is not questioned:", "“They are ignoring the science that is pretty solid,” Mr. Jones said, adding that he believed the ruling would put farm workers and exposed children at unnecessary risk.", "Speaking of the EPA’s reversal, the Union of Concerned Scientists issued a statement suggesting that Pruitt’s decision was not based on science, arguing an ethical responsibility to use science for the good of humanity:", "Science should be used to prevent harm and to protect lives. The decision to put the agenda of a corporation over the lives and wellbeing of Americans is an egregious failure of our government to use strong, independent science to protect public health and safety.", "Chlorpyrifos Was Supposed to Be Banned in 2017, but Trump Is Now Allowing It", "True. In a broad sense, the \"blame\" for this chlorpyrifos ban reversal belongs only indirectly to Trump himself. He did, however, appoint anti-regulation crusader Scott Pruitt as administrator of the EPA, who subsequently decided to exercise his executive authority to reject the chlorpyrifos petition and reverse the previous EPA’s ban, which is a power afforded to Pruitt through the United States Federal Food, Drug, and Cosmetic Act:", "Under section 408(d)(4) of the FFDCA, EPA is authorized to respond to a section 408( d) petition to revoke tolerance either by issuing a final rule revoking the tolerances, issuing a proposed rule, or issuing an order denying the Petition.", "If Pruitt had not exercised this authority, the EPA had a court-mandated deadline to make a ruling on the matter by 31 March 2017. Prior to this deadline, Pruitt issued his own ruling rejecting the work done by previous advisory boards. Had a different administrator been in charge, that call may have been very different.", "As a result of Trump and Pruitt’s actions, chlorpyrifos will continue to be allowed to be sprayed on food items, but it should be noted that this represents no change in current policy; it merely blocks what would likely have been the implementation of a change that would have otherwise taken effect in March 2017.", "Dow Chemicals Gave President Trump $1 Million for His Inauguration", "True. Dow Chemicals donated one million dollars to Trump’s inaugural committee, a donation described by political news site TheHill.com as “among Trump’s largest.” Dow also donated $250,000 to the 2005 George W. Bush inaugural committee (whose administration also sought to limit regulation on chlorpyrifos), but not to either the 2009 or 2013 Obama inaugural funds.", "Responding to an April 2017 report alleging that Dow attempted to kill efforts to study the negative effects of chlorpyrifos, Dow contended that the gift was legal and not part of an influence campaign:", "Rachelle Schikorra, the director of public affairs for Dow Chemical, said any suggestion that the company’s $1 million donation to Trump’s inaugural committee was intended to help influence regulatory decisions is “completely off the mark.”", "“Dow actively participates in policymaking and political processes, including political contributions to candidates, parties and causes, in compliance with all applicable federal and state laws,” Schikorra said. “Dow maintains and is committed to the highest standard of ethical conduct in all such activity.”", "Although it is clear that Dow Chemicals actively lobbied against a chlorpyrifos ban, we cannot rule on claims that their $1 million donation influenced Trump or Pruitt to change their view on the issue.", "While some aspects of the text included in the Chelsea Handler tweet and “Really American” petition, such as chlorpyrifos’s connection to Nazi Germany and the scientific degree to which irreversible brain damage has been alleged, include some uncertainty, the bulk of its claims are true. The EPA’s scientific community was certain enough, despite questions about methods or mechanisms, to agree with the petition that chlorpyrifos posed a risk to neurological health and should be banned. President Donald Trump, who did receive a significant amount of money from Dow Chemicals for his inauguration, unilaterally reversed this decision through his administrator Pruitt’s actions.", "Agency for Toxic Substances and Disease Registry.   \"Chlorpyrifos: Production, Import/export, Use, and Disposal.”\r\n    Accessed 27 November 2017.", "Environmental Protection Agency.   \"Chlorpyrifos.”\r\n    Archived from 19 January 2017.", "Environmental Protection Agency.   \"Dursban Announcement.”\r\n    8 June 2000.", "United States Court of Appeals for the Ninth Circuit.   \"Pesticide Action Network North America; Natural Resources Defense Council, Inc., v. U.S. Environmental Protection Agency.”\r\n    10 August 2015.", "Regulations.gov.   \"Tolerance Revocations: Chlorpyrifos.”\r\n    6 November 2016.", "Environmental Protection Agency.   \"EPA Administrator Pruitt Denies Petition to Ban Widely Used Pesticide.”\r\n    29 March 2017.", "Biesecker, Michael.   \"Pesticide Maker Tries to Kill Risk Study.\"\r\n    Associated Press.   20 April 2017.", "Associated Press.   \"EPA Chief Met with Dow Chemical CEO Before Deciding Not to Ban Toxic Pesticide.”\r\n    30 June 2017.", "Everts, Sarah.   \"The Nazi Origins of Deadly Nerve Gases.\"\r\n    C&EN.   17 October 2016.", "Rauh, Virginia A. et al.   \"Brain Anomalies in Children Exposed Prenatally to a Common Organophosphate Pesticide\"\r\n    Proceedings of the National Academy of Sciences.   30 April 2012.", "Columbia Center for Children’s Environmental Health.   \"Insecticide Linked to Altered Brain Structure.”\r\n    30 April 2012.", "Environmental Protection Agency.   \"Transmittal of Meeting Minutes of the April 19-21 2016 FIFRA SAP Meeting Held to Consider and Review Scientific Issues Associated with Chlorpyrifos: Analysis of Biomonitoring Data?”\r\n    21 April 2016.", "Environmental Protection Agency.   \"Chlorpyrifos; Order Denying PANNA and NRDC's Petition to Revoke Tolerances.”\r\n    March 2017.", "Lipton, Eric.   \"E.P.A. Chief, Rejecting Agency’s Science, Chooses Not to Ban Insecticide.\"\r\n    The New York Times.   29 March 2017.", "Union of Concerned Scientists.   \"How Dow Chemical Influenced the EPA to Ignore the Scientific Evidence on Chlorpyrifos.”\r\n    April 2017.", "Goodell, Jeff.   \"Scott Pruitt's Crimes Against Nature.\"\r\n    Rolling Stone.   27 July 2017.", "Wilson, Megan R.   \"Corporate Donors to Trump Inaugural Revealed.\"\r\n    Rolling Stone.   2 February 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]