["About this rating", "On 23 April 2017 the web site Last Line of Defense claimed President Barack Obama's burial plans were a lavish waste of taxpayer funds:", "When a president dies, the country pays for their burial. In the case of a president like JFK, who was a war hero and assassinated in the middle of a term, something extravagant is in order. His burial at Arlington with the memorial paid for by the people cost almost $4 million in today’s money, adjusted for inflation. The Kennedy family paid for the casket, vault and the eternal flame.", "Barack Obama has just submitted his plans for burial in a plot that will house his entire family, citing the Kennedys, the Tafts and the Roosevelts as precedent, inside a monument he had designed to celebrate the nation’s first black president. The monument, which will occupy space on the National Mall along with monuments to Washington, Lincoln, Jefferson and hundreds of thousands of fallen heroes, will cost the taxpayers roughly $120 million and will be listed as a national historical place with 24 hour protection from the 3rd US Infantry Regiment, just like the Tomb of the Unknown Soldier.", "The claim and iterations of it predictably drew outrage on social media:", "AWWWW HELL NO! Obama’s Burial Plot Is A Massive Waste Of Taxpayer Money (IMAGES) https://t.co/ewEnLtU1Bt", "— gnosis_carmot? (@gnosis_carmot) May 12, 2017", "Although the story subsequently spread to other sites, Last Line of Defense is fake news site whose disclaimer states:", "DISCLAIMER: America’s Last Line of Defense is a satirical publication that uses the imagination of liberals to expose the extreme bigotry and hate and subsequent blind gullibility that festers in right-wing nutjobs. We present fiction as fact and our sources don’t actually exist. Names that represent actual people and places are purely coincidental and all images should be considered altered and do not in any way depict reality.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]