["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The post was written by conservative author Evan Sayet and posted July 13, 2017, on townhall.com.", "Marshall Kamena, to whom the column was attributed in a separate LinkedIn post, stopped being Livermore’s mayor in 2011.", "The author of the LinkedIn post acknowledged within the post that he misattributed Sayet’s column to Kamena.", "We can’t explain how Marshall Kamena, a former mayor of Livermore, Calif., got linked in the first place to an online post defending President Donald Trump. But we know he didn’t write it.", "\"The mayor of Livermore California explains Trump’s popularity and success. This is perhaps the best explanation for Trump's popularity,\" said the headline of a June 16, 2018, LinkedIn post shared on Facebook.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The column on Trump was actually written by conservative author Evan Sayet and posted July 13, 2017, on townhall.com. It’s been widely misattributed to Kamena, whose mayoralty ended in late 2011. The current Livermore mayor is John Marchand.", "Versions of the LinkedIn headline have appeared elsewhere since 2017 (including the website of an Orlando radio station), claiming that Kamena wrote a good read offering a better understanding of Trump and U.S. politics.", "The posts claim that Kamena is a registered Democrat who \"ran on the Democratic ticket,\" yet is \"as conservative as they come.\" We don’t know Kamena’s political leaning or registration; Livermore local elections are nonpartisan.", "PolitiFact tried to get in touch with Kamena but didn’t hear back from him.", "The body of the LinkedIn blog post does not match its headline. The blog post consists of an introductory paragraph followed by the full text of Sayet’s column. In that introduction, the author of the Linked blog post acknowledges in a muddled way that Sayet’s column was \"mistakenly attributed\" to Kamena.", "A LinkedIn headline shared on Facebook claimed that the mayor of Livermore, Calif., wrote a column defending Trump.", "The column was written by conservative author Evan Sayet, and misattributed to a former mayor of Livermore.", "We rate it False.", "Archived LinkedIn post, June 16, 2018", "City of Livermore, Mayor’s Message", "Truth or Fiction, Democratic Livermore Mayor Marshall Kamena on Donald Trump-Incorrect Attribution!, Nov. 22, 2017", "1059sunnyfm.radio.com, Rick Shares Livermore Mayors Marshall Kamena's Opinion, Aug. 13, 2019", "Townhall.com, He Fights, July 13, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]