["By D'Angelo Gore", "Posted on September 16, 2020", "In a TV ad, a Democratic committee falsely claims Sen. Steve Daines of Montana is “pushing a plan” that could “end Social Security benefits by 2023.” He’s not.", "The ad is confusing Daines’ support for eliminating the Social Security payroll tax only for the rest of 2020 with a government analysis of hypothetical legislation permanently terminating that payroll tax in 2021.", "The press secretary for the senator’s office, Miles Novak, told FactCheck.org in an email: “Senator Daines does not support permanently eliminating payroll taxes for Social Security and Medicare. Senator Daines called for a temporary payroll tax cut only for Social Security and only through the remainder of the year, with the Social Security trust funds replenished through a transfer from the General Fund of the Treasury, as was done with the payroll tax cuts signed into law by President Obama.”", "The Democratic Senatorial Campaign Committee released the attack ad against Daines on Sept. 10. It’s part of a more than $30 million TV and digital ad campaign the DSCC will run this fall against Republican senators in four states, including Montana.", "Daines is defending his seat against Democratic Gov. Steve Bullock.", "“Whenever Steve Daines has to choose between corporations and Montanans, he puts his corporate donors first,” the ad’s narrator says. “You see, Daines has taken $2 million from corporate PACs and voted for a trillion dollar corporate tax break that put Social Security and Medicare on the chopping block. Now, Daines is pushing a plan that will be another tax windfall for corporations, but experts say could end Social Security benefits by 2023.”", "It’s true Daines has received about $2.19 million from corporate political action committees since the 2012 election cycle, according to MapLight data cited in the ad. But 31 current U.S. senators, including 12 Democrats, have received more. Sen. Mitch McConnell of Kentucky received the most from corporate PACs in that time period — $6.55 million.", "Daines also voted for the Tax Cuts and Jobs Act of 2017, which cut taxes for corporations, other businesses and individuals. The law is projected to add nearly $2 trillion to the deficit over 10 years, and economists and seniors advocacy groups have warned that lawmakers might make cuts to entitlement programs, such as Social Security and Medicare, to reduce increasing deficits and debt. It remains to be seen whether such cuts would be enacted.", "But Daines isn’t “pushing a plan” that “could end Social Security benefits by 2023.”", "As the ad’s narrator makes that claim, two citations are shown on screen: a March 13 report from the Institute on Taxation and Economic Policy and an Aug. 25 NBC News story.", "ITEP said it analyzed a Trump proposal at the time “to eliminate payroll taxes that fund Social Security and Medicare through the end of the year.” The think tank estimated that temporarily stopping the collection of Federal Insurance Contributions Act taxes — which are 12.4% for Social Security and 2.9% for Medicare, split evenly between employers and employees — “would cost $843 billion and 65 percent of the benefits would go to the richest 20 percent of taxpayers.” It also said eliminating the employer portion of these taxes specifically “would provide a windfall to corporations and other businesses” which would likely not “pass the benefits to workers.”", "In early March, Politico reported that it was Daines who suggested a payroll tax cut to Trump as a way to stimulate the economy during the coronavirus pandemic. And on March 9, the senator’s office announced in a press release that he would be working with the president and members of Congress on a number of proposals, including a “temporary” payroll tax suspension “so employees can keep more money in their pocket.”", "The press release said Daines proposed reimbursing the Social Security trust funds from the general fund, and Novak confirmed to us in an email that Daines only supported a Social Security payroll tax cut for 2020.", "However, the NBC News article cited by the DSCC, which was published five months later, was about a hypothetical plan to end the payroll tax for Social Security in 2021.", "“The federal government’s ability to pay Social Security benefits could stop by mid-2023 if President Donald Trump were to permanently terminate the payroll tax and not offer another revenue source, the chief actuary of the Social Security Administration said Monday,” NBC News reported.", "On Aug. 24, Stephen Goss, the SSA’s chief actuary, published a letter responding to four senators who asked him to analyze “hypothetical legislation” that reduces the Social Security payroll tax rate for employers, employees and the self-employed to 0%, and makes no other changes to current law. Goss wrote:", "Goss, Aug. 24: If this hypothetical legislation were enacted, with no alternative source of revenue to replace the elimination of payroll taxes on earned income paid on January 1, 2021 and thereafter, we estimate that DI [Disability Insurance] Trust Fund asset reserves would become permanently depleted in about the middle of calendar year 2021, with no ability to pay DI benefits thereafter. We estimate that OASI [Old Age and Survivors Insurance] Trust Fund reserves would become permanently depleted by the middle of calendar year 2023, with no ability to pay OASI benefits thereafter.", "But he said he was “not aware that anyone has proposed” such a bill.", "As we wrote recently, Trump made conflicting remarks about the payroll tax in August. On multiple occasions, the president said, if he wins reelection, he would look at “ending” or “terminating the payroll tax.” But White House and Trump campaign officials have said the president actually meant that he wants to forgive a four-month Social Security payroll tax holiday for workers who earn less than $4,000 biweekly, or $104,000 a year.", "On Aug. 8, Trump issued a memorandum that affects the payroll tax for Social Security — not the Medicare tax, which was included in the Institute on Taxation and Economic Policy’s analysis.", "The president’s memo allows the deferral of the employee portion of the Social Security payroll tax from Sept. 1 to Dec. 31. The employer portion of that tax had already been deferred, until either 2021 or 2022, by the Coronavirus Aid, Relief, and Economic Security Act, which was signed into law in late March, with bipartisan support.", "The memo also instructed Treasury Secretary Steven Mnuchin to “explore avenues, including legislation, to eliminate the obligation to pay the taxes deferred pursuant to the implementation of this memorandum.” And Trump has said he wants Congress to use general revenues to pay back the Social Security trust funds.", "The same day Trump issued the memo, Daines announced he would introduce legislation to forgive the payroll tax deferral for employees.", "“Temporarily suspending the payroll tax will ensure that employees can keep more of the money they earned in their pocket,” his office said in a press release. It added: “Daines’ bill will also ensure that Social Security funds are replenished from the general fund to protect Social Security beneficiaries.”", "The bill has not been put forward, but Novak told us the senator is working on it.", "Notably, Goss’ Aug. 24 letter said legislation stipulating transfers from the general fund to make up for reduced payroll tax revenue — which also happened in 2011 and 2012 — would leave Social Security benefits and trust fund reserves “essentially unaffected.”", "Even the NBC News story said: “The president has said legislation to cut payroll taxes would specify that the money comes from the general fund. The SSA letter noted they were asked not to consider that scenario, which would not affect benefits.”", "Still, DSCC spokeswoman Helen Kalla told us the group stands by its ad.", "“The president has said he wants to make permanent cuts to the payroll tax if he wins a second term,” she said in an email. “We do not take the Trump administration’s staff or Republican senators who have voted nearly 100% of the time with the president like Steve Daines on their word alone that Social Security will not be impacted by this plan, especially given their records to date of promising to protect Social Security while actively undermining the program with their actions.”", "But that’s an example of something Trump said, not Daines — who doesn’t support permanently eliminating payroll taxes, his office told us. Legislation similar to what Daines has proposed would not “end Social Security benefits” in three years, according to an analysis on which the DSCC’s claim is partially based.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]