["About this rating", "In late June 2020, social media users shared an apparent celebrity death hoax targeting U.S. President Donald Trump. The post originated on the mobile video app TikTok and features a fake New York Times article claiming that Trump died of a drug overdose on June 27, 2020.", "The following screenshot from that post also circulated on other social media platforms:", "Trump is not dead, and The New York Times did not report that he was.", "For starters, if the president of the United States had died it would be a major news event. Notably, there are no credible news outlets reporting it. Trump is also more personally active on social media than any of his predecessors and, as of this writing, Trump is still posting to his Twitter account.", "Furthermore, Paul Krugman, whose byline is on the fake article, is an economist, and though he pens regular opinion columns for The New York Times, he isn't a breaking news reporter. It is highly unlikely Krugman would be assigned this sort of breaking news story.", "Celebrity death hoaxes are frequent fixtures online. Other targets have included actor Chuck Norris, WWE wrestler Big Show, and singer Demi Lovato.", "Palma, Bethania. \"Did COVID-19 Kill Chuck Norris?\"\r\n  Snopes.com. 18 May 2020.", "Palma, Bethania. \"Celebrity Death Hoax: WWE’s ‘Big Show.’\"\r\n  Snopes.com. 26 December 2016.", "Mikkelson, David. \"Demi Lovato Death Hoax.\"\r\n  Snopes.com. 2 August 2018.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]