["Photographs of the dead body of a girl hanging from a tree have been shared on social media with the claim that Naseer Khan raped and murdered the girl in Rajasthan’s Sapotara. It’s being said that she was 8 years old. Below is a tweet by @Real_AbhiShukla where the claim has been made in Hindi — “8 वर्षीय बच्ची , सपोटरा , राजस्थान में # नसीर खान ने # बलात्कार के बाद # हत्या कर शव पेड़ से लटका दिया गया।”", "The images are circulating across Facebook and Twitter. Alt News has also received fact-check requests on its official mobile application.", "A reverse-image search of the photographs took us to a report by The Lallantop published on June 22, 2019. According to the report, a 19-year-old girl was murdered in Rajasthan’s Karauli district. On June 20, she had left her home for defecation and was later found hanging from a tree in another village. The doctor who conducted her post-mortem ruled out rape.", "As per a report published by Dainik Bhaskar on June 22, the girl died after her throat was strangulated. The PM report did not hint at rape. The report said, “Initial police investigation speculated a lovers’ spat as the motive behind the crime. The police found the footprints of a person on a far below a field where the deceased’s slippers were also found at a distance of 100 feet from the scene of the crime. On the other side, the shoe prints of the pressure applied to kill the girl were found.", "A follow-up report published by Dainik Bhaskar on June 26 said that the police arrested Mahendra Mina and the motive behind the murder was a lovers’ spat. Mina killed the girl to get rid of her and later tied her dead body from a tree.", "Photographs of a year-old incident were shared on social media with the false claim that a Muslim man named Naseer Khan raped and murdered an 8-year-old girl in Rajasthan. The police had arrested Mahendra Mina in connection with the crime. Furthermore, the girl was not a minor but 19 years old.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]