["About this rating", "On 19 April 2016, social media users began sharing links to what appeared to be a Huffington Post article titled \"The Fix Is In: Sanders Supporters in New York See Votes Switched to Hillary,\" which reported that persons casting ballots for Bernie Sanders in the New York state Democratic primary election were seeing their votes recorded for rival candidate Hillary Clinton:", "People voting for Bernie Sanders in today’s New York primary are seeing their ballots changed to show a vote for Hillary Clinton.", "Calls began flooding in early this morning to New York-based ABC affiliate WGRZ with reports of voting machines across the state switching votes entered for Democrat Bernie Sanders to his establishment counterpart Hillary Clinton. The station has spoken with multiple witnesses and is in the process of verifying statements from voters Upstate (districts 20, 21, 22 and 24) as well as two of the five boroughs (Bronx and Manhattan).", "According to one witness identified as Jason Jones from Manhattan, “It was the strangest thing. The machine literally would not allow me to vote Bernie. I have been a Bernie supporter since he launched his campaign and have absolutely no reason to vote for Shillary. I have heard the same from several others coming out of the voting booth. Seems like the establishment will stop at nothing to keep this out of the hands of Bernie.”", "Brian Johnston, a volunteer and self-professed Hillary supporter who is overseeing the voting at the 9th district, had this to say, “These allegations have no basis in reality. If Sanders supporters cannot figure out how to use a voting machine maybe they shouldn’t be voting.”", "The hoax article appears to legitimately originate with the Huffington Post:", "However, closer inspection showed that the article in question did not originate with the leigitmate Huffington Post web site; rather, it was a hoax published by an impostor site that mimicked HuffPo's familiar look:", "Additionally, a tiny gray hyperlink titled \"Disclaimer\" at the very bottom of article led to a page that acknowledged the site's counterfeit nature and identified the site's content as \"fiction\":", "This site is in no way affiliated with The Huffington Post. This is a news and political satire web publication, which may or may not use real names, often in semi-real or mostly fictitious ways. All news articles contained within this site are fiction, and presumably fake news. Any resemblance to the truth is purely coincidental. Advice given is NOT to be construed as professional. If you are in need of professional help, please consult a professional.", "**Today’s question…can liberals be trolled as easily as Republicans? We shall see.", "This report was aggregated by the similarly unreliable web site United Media Publishing, which cited the counterfeit Huffington Post site as a source.", "This hoaxc article popped up as New York's primary was already riddled with confusion. A lawsuit was filed on behalf of voters claiming they were disenfranchised from participating in the election, and, according to reports, approximately 125,000 Democratic\n voters were \"purged\" in Kings County alone.", "Bergin, Brigid.    \"De Blasio Demands Explanation, As Decline in Registered Brooklyn Democrats Doubles.\"\r\n    WNYC.    19 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]