["About this rating", "In July 2019, a video purportedly showcasing the amazing table tennis talents of a young girl went viral on social media. One popular version shared on Twitter racked up more than a million views within two days of its posting:", "Many viewers felt that this little girl seemed more skilled than her apparent age would allow and questioned whether this clip had been doctored. While we, too, were skeptical when we first viewed this video, we haven't found any red flags suggesting this video is fake.", "The earliest postings of this clip we could find were shared on the Chinese social media websites Weibo and Douyin on July 2. These postings didn't provide any background information about the video, however, as they were simply shared with complimentary messages about the young child's skills (loosely translated): \"Now you understand why Chinese table tennis is so powerful!\"", "Around the same time, this video was posted on TikTok by Tony Margetta, but in the ensuing days he set the video to private. We attempted to contact Margetta, who has uploaded two similar videos of other children playing ping-pong, and will update this article if more information becomes available.", "As for the clip, while some viewers may have found this little girl's talents unbelievable, we saw nothing to indicate that this video was doctored. When we examined a similar clip purporting to show a young woman playing a ferocious game of ping-pong with nothing but her forehead, we found instances of unnatural movement (e.g., the ball changing directions before it was hit or in mid-air) as the ball bounced back and forth across the table. We discerned no such editing errors in this footage.", "Furthermore, smaller details that can be overlooked when digitally doctoring a piece of footage, such as shadows or reflections, appear to correspond with the little girl's movements throughout the video.", "The girl's reflection is a bit difficult to see in the original video, so we've enlarged it in the following example. On the left is a portion of the original video, and on the right is a zoomed-in version that provides viewers a better look at the girl's reflection:", "As well, while this child is seemingly a very skilled ping-pong player, her talents as seen here would be far from unique. Ping-pong is one of the most popular recreational sports in China, and many children start playing it at a very young age:", "As a comparatively inexpensive sport that doesn't require much space, ping pong has long been accessible to a much wider population than many other activities, and tables can now be found in almost every primary school, public park or community center. Kids start to train as soon as they are tall enough to see over the table, set at a standard height of 2 feet and six inches. \"To get into my school, you already have to be good at ping pong or they won't accept you,\" says Lu Chenchen, a 10-year-old girl from Shanghai, about her public elementary school. When kids show promise, parents send them to specialized boarding schools that will foster their talent.", "Yang was one such student. He grew up in a small, countryside village where ping pong was always around. At the age of ten -- a little late, Yang admits -- his family sent him to a private ping pong boarding school in Shanghai, where he and other students practiced for 6 to 7 hours a day. \"In the evening, we played another 1 to 2 hours, which was voluntary. But because all the other kids do it, and the sport is so competitive, you have to do it,\" Yang says.", "We found several videos of young children showcasing similar skill sets:", "We marked this video as unproven for two reasons: We have not been able to determine exactly when and where it was taken, or how it first started to spread online. Second, we can't be completely sure that this clip wasn't sped up just a tad to make this child's movements that much more impressive.", "Generally speaking, however, we see little reason to question the legitimacy of this video.", "Hruby, Denise.   \"The Sport China Can't Lose.\"\r\n    Paper.   27 August 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]