["The 13-second video was published on Facebook here on November 30, 2020.", "The post’s caption reads: “Sri Nazir Mohammed, an SDPI worker, dressed as a Sardarji in the farmers’ protest in Haryana is arrested this morning.”", "SDPI is an acronym for the Social Democratic Party of India, a newly formed political party that describes itself as a “political platform of marginalised and minority communities in India”.", "The post circulated as thousands of farmers, mainly from the Sikh-dominated northern states of Punjab and Haryana, protested against agricultural reforms introduced by the Indian government, as AFP reported here.", "The video was also shared alongside identical claims on Facebook here, here, here and here and on Twitter here, here, here and here.", "The claim is false.", "A Google keyword search found the incident was reported here by SikhNet, a global Sikh community news platform, on March 31, 2011, almost one decade before the ongoing farmers’ protest.", "“United Sikhs Files Criminal Complaint Against Punjab Police For Removal of Sikh's Turban,” the article’s headline reads.", "A longer version of the video was also published on YouTube here on March 31, 2011.", "Below are screenshot comparisons of the video posted in the misleading Facebook post (L) and the YouTube video (R):", "The incident occurred after protesting veterinary pharmacists converged on a cricket match in Mohali, a city in Punjab. At least 24 people were injured in the unrest, The Indian Express reported here on March 29, 2011.", "The video also circulated in December 2019 alongside another false claim, which AFP debunked here.", "Mohali police said at the time that two officers who removed the man’s turban, which is considered a religious desecration, were suspended.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]