["About this rating", "Signs warning drivers about distracted walkers were spotted in Sweden at the end of 2015.", "These signs were installed by the Swedish government.", "A photograph purportedly showing a street sign in Sweden warning drivers about oblivious pedestrians watching their phones instead of traffic started spreading around the internet in February 2016. While the photo was frequently shared along with the claim that it showed a real government installed street sign, the above-displayed sign was created by two artists:", "Jacob Sempler and Emil Tiisman installed the signs in November 2015 in order to encourage people to pay attention to their surroundings:", "Smartphones are great. Until you walk straight out into the street and almost get run over cause you can’t stop staring at it. That’s from personal experience. And that was the inspiration behind these lovely signs that we put up across Stockholm.", "While the art installation was widely covered at the time, many people who encountered the sign (either in person or online) were not aware of its origin and believed that it was a real sign installed by the Swedish government. Sempler told The Metro that while these signs are pieces of art, there is clearly a need for such a warning:", "It is great fun that people genuinely think there is a real need for this kind of sign. However, I believe, unfortunately, that those who need to see the sign the would will never ever see it since they're too busy with their phones.", "While Sweden may have a need for a sign displaying a similar warning, local authorities told UPI that Sempler's works will soon be taken down since they are not official road signs.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]