["A March 28 report in The Guardian states, “The US has become the first country to exceed 100,000 confirmed coronavirus cases as Donald Trump signed into law the largest economic stimulus package in US history, a $2.2tn bill designed to rush federal assistance to workers and businesses.”", "As the US becomes the new epicentre for the coronavirus, a 3-minute video with the claim “US President Trump joins Muslims prayers for respite from Coronavirus after failing to tackle it” has gone viral. On the bottom right corner, the viral video has a logo of ABC News. Alt News received several requests to fact-check the viral video on WhatsApp (+91 76000 11160) and on our official Android application.", "This video has been shared along with Hindi text by a Twitter user @rtapgarhiSonu (archive link) and Facebook user Hema Sankhe (archive link) as well. The Hindi text says, “The world’s most powerful country also acknowledged the power of the Quran and read the Quran in the White House and prayed for Crona, share this, respect every religion (Translated from दुनिया के सबसे बड़े ताकतवर मुल्क ने भी माना कुरान की ताकत को और व्हाइट हाउस में कुरान पढ़ा गया और दुआ की गई क्रोना के लिए शेयर कीजिए,हर धर्म का सम्मान करों)”.", "#ब्रेकिंग न्यूज़ दुनिया के सबसे बड़े ताकतवर मुल्क ने भी माना कुरान की ताकत को और अल्लाह की ताकत को व्हाइट हाउस में कुरान पढ़ा गया और दुआ की गई कोरोना वायरस के लिए शेयर कीजिए 👇👇👇 pic.twitter.com/D4k5iGqDXU", "— Sonu Prtapgarhi. (@PrtapgarhiSonu) March 26, 2020", "Alt News performed a reverse image search on Yandex and found link which suggested that the video could be from an interfaith service held in 2017.", "Using that as a clue Alt News performed a keyword search on YouTube and found that the viral video is a clip from the National Prayer Service for the 58th presidential inauguration at the National Cathedral, Washington on January 21, 2017. According to a 2017 article in NPR, “The inaugural prayer service is a tradition that began with President George Washington and was revived in 1933 by President Franklin Roosevelt, continuing ever since.”", "The guest list for the event is available on the National Cathedral‘s website. Islam was represented by Imam Mohamed Magid, executive Imam, ADAMS Center, Sterling, Virginia and Sajid Tarar, advisor, Medina Masjid, Baltimore, Maryland at the event.", "The viral video begins with Magid’s address followed by a portion of Tarar’s address. Alt News could not find the video uploaded by ABC News. However, we found the same video by C-SPAN. The relevant section of the video begins from the 36:58 mark. A video of the same event shot from a different angle was uploaded by Fox News. The relevant section can be watched onward 35:40.", "A January 21, 2017 article by Washingon Post reported, “President Trump spent more than an hour Saturday at an interfaith prayer service designed to appeal for national unity as an expected 500,000 people streamed into the nation’s capital to protest his fledgeling presidency.”", "Thus, a video of an interfaith national prayer service from 2017 was shared as US President Donald Trump offering Islamic prayers in the light of the coronavirus pandemic.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…"]