["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Tim Kaine’s two-word description of Donald Trump is \"trash talker.\"", "Kaine, the Democratic vice presidential nominee, used the term repeatedly during an Aug. 1 campaign rally in his hometown of Richmond. He accused Trump, the GOP presidential nominee, of \"trash talking\" about U.S. allies, foreign leaders, people with disabilities, women and other Republicans.", "\"The thing that amazes me is the depth of his trash talking with Latinos, saying all Mexicans are rapists and going after Latino immigrants,\" Kaine said.", "No doubt, Trump has made controversial statements about the groups Kaine cited. But did Trump go as far as saying \"all Mexicans are rapists?\"", "We asked the Clinton-Kaine campaign for evidence. It cited 16 instances since June 2015 when Trump said that some of the unauthorized immigrants crossing the Mexican border into the U.S. are hardened criminals and rapists.", "Topping the list was a Trump statement that made international headlines when he announced his candidacy for president on June 16, 2015.", "\"When Mexico sends its people, they’re not sending their best,\" Trump said. \"They’re not sending you. They’re not sending you. They’re sending people that have lots of problems, and they’re bringing those problems with us. They’re bringing drugs. They’re bringing crime. They’re rapists. And some, I assume, are good people.\"", "Trump’s statements about Mexican immigration have been discredited in fact checks. PolitiFact National has twice given Pants on Fire ratings to his claim that the Mexican government is sending violent criminals to the U.S.", "Trump hasn’t provided proof for his repeated claims and a number immigration say there’s no evidence to support them. Experts say unauthorized Latino immigrants usually come to the U.S. looking for jobs and to reunite with families that already are here.", "There’s no knowing the number or percentage of U.S violent crimes committed by unauthorized immigrants, because the U.S. doesn’t keep such statistics. There’s is strong evidence, however, that the border-crossers haven’t made the U.S. more dangerous.", "The number of unauthorized immigrants in the U.S. grew from 3.5 million in 1990 to 11.2 million in 2012, according to estimates by the Pew Research Center. That’s a 220 percent increase. During the same years, the violent crime rate in the U.S. declined by 47 percent, according to FBI data.", "Now, let’s get back to Kaine. His campaign, as we’ve noted, cited 16 times  when Trump said \"rapists\" and other violent sorts are coming into the U.S. from Mexico. But Trump, in none of the quotes, made the charge that \"all Mexicans are rapists,\" as Kaine said. There’s nothing that even approached such a contention.", "\"Sen. Kaine was clearly referencing Trump's attacks on Latino immigrants -- as he said in his comments -- from Mexico,\" Amy Dudley, a national spokesprson for Kaine, wrote us in an email.", "Our ruling", "Trump has roiled emotions with his debunked claims that the Mexican government is sending \"rapists\" and other violent criminals into the U.S. as unauthorized immigrants.\"", "Kaine has embellished the controversy by saying Trump has said \"all Mexicans are rapists.\" The Democrat doesn’t come close to proving his claim; all of the Trump quotes Kaine’s campaign sent us pertain to unauthorized immigrants crossing the Mexican border into the U.S.", "No doubt, many Latinos have taken umbrage with what Trump actually has said. But Kaine put an insult into the mouth of Trump that never was uttered.", "So we rate Kaine’s statement False.", "Tim Kaine, Remarks in Richmond, Va., Aug. 3, 2016", "Email from Sarah Peck, spokesperson for Clinton-Kaine campaign, Aug. 2, 2016.", "Time, \"Here’s Donald Trump’s presidential announcement speech,\" June 16, 2015.", "PolitiFact, \"Donald Trump says Mexican government ‘forces many bad people into our country,’\" July 9, 2015.", "PolitiFact, \"‘The Mexican government...they send the bad ones over,’\" Aug. 6, 2015.", "Pew Research Center, \"Unauthorized immigrants: Who they are and what the public thinks,\" Jan. 15, 2015.", "FBI, \"Crime in the United States,\" 1990-2009, accessed Aug. 4, 2016.", "FBI, \"Crime in the United States,\" 1993-2012, accessed Aug. 4, 2016.", "Salon, \"The media needs to stop telling this lie about Donald Trump,\" Dec. 21, 2015.", "Email from Amy Dudley, national spokesperson for Kaine, Aug. 5, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]