["A TV ad accusing Gov. Pritzker of raising lawmakers' pay includes boilerplate imagery of an envelope being passed across a table. (Illinois Rising Action)", "A new group affiliated with a national Republican opposition research organization is targeting Democratic Gov. J.B. Pritzker over the perennially fraught issue of lawmaker pay.", "Illinois Rising Action, a nonprofit launched in March by America Rising Squared, is out with an ad accusing Pritzker of putting the interests of politicians above those of working families during the COVID-19 pandemic.", "\"While voters were distracted, Pritzker gave huge pay raises to his politician buddies,\" a narrator says halfway through the 30-second spot, which includes boilerplate imagery of an envelope being passed across a table. The group has said it spent $1 million on the TV ad buy.", "The ad cites an article published in May by a news station based in Quincy, which claimed state lawmakers \"gave themselves an $1,800 pay raise\" by including a cost-of-living increase in the budget they approved for the new fiscal year, which began July 1.", "Leaders in the Democrat-controlled General Assembly, long vocal about refusing such raises, are adamant there is no raise on the books. So we decided to check it out.", "There’s an interesting history behind the way state lawmakers are compensated, a system long criticized as political cowardice.", "Decades ago, every time lawmakers wanted more taxpayer money in their personal bank accounts, they were required to pass a bill. Voting themselves pay raises in lean years was a liability come election time. So, through a series of acts in the 1980s criticized at the time as backdoor menuevers, they gave themselves an automatic cost-of-living bump each year.", "That means the only time lawmakers need to act on their personal pay is if they want to reject their automatic raises, which they have routinely done for most of the past decade.", "But last year a circuit court judge ruled unconstitutional the pay freezes for lawmakers passed during their terms. The longstanding maneuver was challenged in court by two former lawmakers who want their back pay. The state is appealing that judge’s ruling.", "This year — faced with that legal decision — Democratic leaders took a different approach by freezing legislator pay indirectly through their spending bill. Instead of rejecting the pay increase, they simply appropriated no money for it. It’s a move experts say could face similar legal challenges from dissenting lawmakers who feel entitled to their raises.", "Republican lawmakers are suspicious of this new tactic, which comes only a year after Pritzker signed a budget that gave legislators their first raise since 2008, hiking their base pay to more than $69,000. The governor defended that increase based on \"how hard these legislators are working.\"", "This year, Pritzker and the General Assembly have promised no such raises, a point Pritzker reiterates in a TV spot of his own responding to Illinois Rising Action’s attack.", "So we asked Illinois Rising Action for their evidence that lawmakers are getting a raise this year thanks to Pritzker.", "Kayleen Carlson, the group’s executive director, referred to yet another law, passed in 2014, that made lawmaker pay a \"continuing appropriation,\" which she argues makes the $0 appropriation for raises in the budget Pritzker signed an empty gesture.", "\"Since 2014, Illinois law automatically increases state lawmakers’ pay through a ‘continuing appropriation,’\" Carlson wrote in an email. \"This means that legislators who want to foreclose a pay increase must pass a bill specifically to do so.\"", "Regardless, Democratic Comptroller Susana Mendoza, the official in charge of cutting the state’s checks, promises there will be no raises this fiscal year. She even released a video to underscore that message.", "Experts say the decades of political gamesmanship lawmakers have used to avoid voting for their own pay raises may be finally coming to a head.", "Charles N. Wheeler III, who has followed the General Assembly for decades as both a journalist and professor at the University of Illinois Springfield, said there is one obvious fix — go back to the politically inconvenient practice of forcing lawmakers to vote on pay increases.", "One Republican senator proposed legislation in February to do just that, but the bill died in committee without ever coming up for a vote. Under that legislation, the fix wouldn’t take effect until 2023, when lawmakers will all begin new terms.", "As for the ad’s claim, Wheeler called it \"a convenient misstatement of the facts.\"", "\"If you wanted to be more accurate, you would say the governor and the Democratic majorities failed to take the actions that would have been needed to eliminate these things going forward,\" he said. \"But that’s not as effective as saying, ‘he gave his buddies a pay raise.’\"", "Illinois Rising Action’s ad says \"while voters were distracted, Pritzker gave huge pay raises to his politician buddies.\"", "The group was referencing the annual cost-of-living adjustments legislators are provided with automatically under state law. For most of the past decade, legislators have passed bills rejecting those raises.", "Because of a recent legal decision, lawmakers used a different maneuver to freeze pay this year in the budget Pritzker signed. Lawmakers have gotten no pay raise this year, and the governor made no moves designed to give them one.", "We rate this claim False.", "FALSE — The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Press release, Illinois Rising Action, March 5, 2020", "Press release, Illinois Rising Action, June 23, 2020", "\"State lawmakers, officials win raise,\" Chicago Tribune, Dec. 11, 1984", "\"Revise salary review board to end ‘back-door’ pay raises,\" Bloomington Pantagraph, Sept. 25, 1985", "Preface to Lawmaking, Illinois General Assembly Commission on Government Forecasting and Accountability, October 2019", "Compensation Review Act, Illinois General Assembly", "Emails, Julie Roin, professor at the University of Chicago Law School, June 30, 2020", "\"New state budget lists ‘automatic’ annual pay raise for legislators at $0,\" WCIA, May 27, 2020", "P.A. 101-0637, Illinois General Assembly", "\"Gov. J.B. Pritzker says he will sign budget with legislative pay increases, defends lawmakers’ hard work,\" Chicago Tribune, June 4, 2019", "Ad, J.B. Pritzker, June 29, 2020", "Email, Kayleen Carlson, executive director of Illinois Rising Action, June 30, 2020", "P.A. 098-0682, Illinois General Assembly", "Emails and phone interview, Charles N. Wheeler III, professor emeritus of public affairs reporting at the University of Illinois Springfield, June 29 & 30, 2020", "SB3607, Illinois General Assembly", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]