["Republican Ken Cuccinelli is closing his gubernatorial campaign with warnings to Virginia families about the price they’ll pay if Democrat Terry McAuliffe wins Tuesday’s election.", "\"Terry also wants to raise your taxes $1,700 to pay for his infinite promises,\" Cuccinelli said during the final gubernatorial debate on Oct. 24.", "He’s makes the same claim on a number of ads, including a TV spot released on Oct. 29 that says, \"Terry McAuliffe’s plan: expand Obamacare, increase spending, raise your taxes by $1,700.\"", "The tax charge originates from Cuccinelli’s estimate of the fiscal impact of various promises he says McAuliffe has made. Let’s look at how the Republican arrived at that number.", "Cuccinelli says the McAuliffe’s pledges add up to $14 billion in new spending over the next four years. About $12 billion of that sum stems from statements McAuliffe has made on three issues: public school funding, college debt and public teacher pay.", "On K-12 education, Cuccinelli points to a section on page 11 of McAuliffe’s platform where the Democrat laments cuts to school funding that the state made during the Great Recession and has not fully restored.", "\"It’s time to restore those standards and make sure our schools have the tools they need to get the job done,\" McAuliffe’s platform says.", "Cuccinelli interprets that statement as a McAuliffe pledge to fully restore education money at the start of his administration. The Republican cites research by The Commonwealth Institute, a liberal think tank, which found that in inflation-adjusted numbers, the per-pupil general fund spending for K-12 students was about $5,000 during the 2007-08 school year  fiscal year, but only about $4,000 this school year.", "With enrollment data from the Virginia Department of Education showing about 1.2 million K-12 students in 2012-13, Cuccinelli estimates that restoring per-pupil funding to 2007 levels would cost more than $1.2 billion annually, or $5 billion over a four-year McAuliffe term.", "The second biggest expense, Cuccinelli says, would come from what he interprets to be McAuliffe’s position on college debts assumed by Virginia undergraduates.", "Page 12 of McAuliffe’s platform says, \"Every student deserves the opportunity to get a quality education and start their working lives without the burden of debt.\" Cuccinelli says that means McAuliffe is vowing to clear all Virginia students’ debts.", "Using figures from the Institute for College Access, which estimated that 2011 college graduates receiving a bachelor’s degree in Virginia had an average debt of $14,628, Cuccinelli estimated it would cost $667 million to pay off the loans of the entire class. Once rising enrollments and debt loads are taken into account,  Cuccinelli says the total cost of this policy would be nearly $3.9 billion over the next four years.", "Cuccinelli also says McAuliffe has vowed to raise teacher pay in Virginia to the national average. He points to a May 25 speech in Manassas in which McAuliffe said, \"as governor, I want to make sure that we pay our teachers the national average in order for us to get the best possible teachers.\"", "Cuccinelli took figures from the National Education Association showing there are 103,908 teachers in Virginia. During the 2011-2012 school year, Virginia instructors earned an average of $48,703. That was $6,715 below the national average of $55,418. Cuccinelli estimates it would cost about $700 million a year -- or $2.8 billion over four years -- to end the disparity.", "To compute the tax cost per family, Anna Nix, a Cuccinelli spokeswoman, says the campaign divided its estimated four-year, $14 billion cost of McAuliffe’s full agenda by four, which comes to $3.5 billion annually. Cuccinelli’s camp divided that yearly cost by the state’s population of 8.2 million and arrived at an estimate of $427 per person. So an average  four-person family would pay slightly more than $1,700, Nix reasons.", "Josh Schwerin, a McAuliffe spokesman, dismisses Cuccinelli’s calculations, saying his campaign \"is just making up numbers.\"", "\"Terry has no plans to raise taxes,\" Schwerin said in an e-mail.", "He also denied that McAuliffe has made any of the three major promises Cuccinelli attributes to him. He said that McAuliffe’s comments on restoring public school funding, raising teacher salaries to the national average and easing college students’ debts merely reflect his boss’s \"spending priorities.\"", "\"It would be irresponsible to say how much you’re going to spend before knowing how much revenue there will be,\" Schwerin wrote.", "Cuccinelli’s $1,700-a-year tax estimate assumes McAuliffe will accomplish all of his policy ambitions during his first months in office without reducing any governmental expenses.", "McAuliffe has pledged to \"save millions of taxpayers dollars through operational efficiencies,\" but his plan is not greatly detailed. He’s broadly called for reducing government energy costs, cutting state employee travel expenditures and streamlining agencies.", "Cuccinelli’s estimate assumes there will be no increase in state revenues during a McAuliffe governorship, ignoring that general fund tax receipts have risen by an annual average of 3.7 percent over the last three years.", "It also assumes McAuliffe will fail to convince the General Assembly to expand Virginia’s Medicaid program to reap federal dollars available under Obamacare. There may be good reason for Cuccinelli’s hunch: the Republican-led House is staunchly opposed to the enlargement. McAuliffe says the expansion could produce $500 million a year in new revenues and savings, but some predict analysts predict the annual yield may only be $50 million.", "Cuccinelli’s tax estimate also ignores some standard practices in state budgeting. For example, it assumes that the state would pay the entire cost of raising average teacher salaries to the national average. Virginia traditionally shares the cost of increasing teachers’ pay with localities.", "Our ruling", "Cuccinelli says McAuliffe wants to raise taxes by $1,700 annually for an average four-person family to pay for his \"promises.\"", "The major problem is that Cuccinelli’s claim is based on his own interpretation of McAuliffe’s agenda. He assumes, for example, that McAuliffe’s statement that college graduates \"deserve the opportunity\" to start their careers without the burden of student debts is a promise that the state will pay off their loans, starting his first year in office. He assumes McAuliffe’s statement that \"it’s time\" to restore per-pupil funding in public schools to pre-recession levels is a vow to do that instantly.", "Then, Cuccinelli takes his assumptions and multiplies them by a stew of worst-case scenarios to come up with his unreliable tax estimate.", "We don’t fault Cuccinelli for demanding specifics on McAuliffe’s agenda; the Democrat has addressed issues with a broad brush throughout the campaign. It’s fair to ask how McAuliffe would accomplish his objectives and keep his word not to raise taxes.", "But that doesn’t give Cuccinelli the license to create a platform for his rival. We rate his claim False.", "C-SPAN, \"Virginia gubernatorial debate,\" Oct. 24, 2013.(statement is at 55:50)", "E-mail from Anna Nix, spokeswoman of Cuccinelli for Governor, Oct. 29, 2013.", "YouTube video of opening of Terry McAuliffe Fairfax campaign office, April 27, 2013.", "Cuccinelli for Governor, \"Big Differences,\" Oct. 29, 2013.", "FactCheck.org, \"Misrepresenting McAuliffe’s budget plan,\" Oct. 24, 2013.", "The Washington Post Fact Checker, \"Ken Cuccinelli’s fantastical vision of Terry McAuliffe’s spending plan,\" Oct. 2, 2013.", "McAuliffe for Governor, \"Terry’s platform: Putting jobs first,\" accessed Oct. 29, 2013.", "Ken Cuccinelli’s news conference comments, Oct. 9, 2013.", "Cuccinelli for Governor, \"Cuccinelli to reveal true cost of McAuliffe platform,\" Oct. 9, 2013.", "Cuccinelli for Governor, \"McAuliffe’s budget adjustments,\" Oct. 9, 2013.", "E-mails from Josh Schwerin, spokesman for McAuliffe for Governor, Oct. 28 and Oct. 31,, 2013.", "America Rising Pac, \"Terry McAuliffe can’t explain how he will fund his ‘shoot for the moon’ plans,\" Sept. 13, 2013.", "YouTube video, \"Terry McAuliffe for Governor on Virginia’s education system & teachers,\" May 25, 2013.", "FactCheck.org, \"Misrepresenting McAuliffe’s budget plan,\" Oct. 24, 2013.", "The Washington Post Fact Checker, \"Ken Cuccinelli’s fantastical vision of Terry McAuliffe’s spending plan,\" Oct. 2, 2013.", "The Daily Press, \"McAuliffe promises teacher pay raises if elected,\" April 11, 2013.", "National Education Association, \"Ranking and Estimates: Rankings of the states 2012 and estimates of school statistics 2013,\" December 2012, pages 17-19.", "Virginia Department of Education enrollment data, accessed Oct. 30, 2013.", "House Appropriations Committee, \"Overview of FY 2014 compensation summary for school divisions,\" June 17, 2013.", "Richmond Times-Dispatch, \"Candidates using funny math on Medicaid,\" Aug. 13, 2013.", "Interview with Robley Jones, government relations director of the Virginia Education Association, Oct. 30, 2013.", "Institute for College Access, database on Virginia’s college graduate’s debt, accessed Oct. 30, 2013.", "Terry McAuliffe, \"Keeping Virginia the best managed state in the nation,\" assessed Nov. 1, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]