["About this rating", "A California newspaper debunked an attempt by Donald Trump to criticize pro football players protesting extrajudicial killings by police by illustrating the real context behind a photograph he shared via his Twitter account.", "On 4 January 2018, the San Diego Union-Tribune highlighted the following tweet from the president:", "So beautiful....Show this picture to the NFL players who still kneel!", "The photograph showed a woman lying down with an infant near a headstone. Trump's tweet linked to one by another user, Corey Jones, who posted the image with the caption, \"THIS IS WHY WE STAND\":", "We stand to honor those who fought and died defending the greatest nation the world has ever known. God bless our vets! #MAGA", "Jones failed to mention that former San Francisco 49er quarterback Colin Kaepernick, who originated the protest prior to the 2016 regular season, began \"taking a knee\" after consulting with an Army Special Forces veteran, Nate Boyer.", "Further, the Union-Tribune confirmed that it first published the photograph of Jenn Budenz at the grave of her husband, Marine Corps Maj. Andrew Budenz, in 2014. But it also noted that contrary to Jones' suggestion, the major was not killed in action; he actually died in September 2013 in a motorcycle accident.", "Photographer Hayne Palmour IV, who captured the images of Jenn Budenz and the couple's young son A.J. for the newspaper, said of the president's comment:", "It's not the first time I've seen that set of photos passed around the internet without context. The one thing that hit me was that he's the first president to comment on my photo. My first thought was, well, I just became part of the historical record that is Trump's tweets.", "Gomez, Luis.   \"Donald Trump Retweeted Our Photo Out of Context Today. Here's Why.\"\r\n    San Diego Union-Tribune.    4 January 2018.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]