["By Robert Farley", "Posted on July 21, 2020", "In a series of virtual tele-rallies, President Donald Trump repeatedly distorted Joe Biden’s position on education, claiming the former vice president wants to “end school choice” and “abolish charter schools.”", "Biden, the presumptive Democratic presidential nominee, opposes federal funding going to “for-profit charter schools,” but schools managed by for-profit companies make up only a fraction of charter schools. And while Biden opposes vouchers for private school tuition — the ultimate in school choice for some — he does not oppose students choosing between public schools, magnet schools and high-performing charter schools.", "Trump’s attack on Biden was gleaned from policy recommendations drafted by Biden and his former rival for the Democratic presidential nomination, Sen. Bernie Sanders. The 110-page document, called the Biden-Sanders Unity Task Force Recommendations, was released July 8 and is not the official Democratic Party platform. Nevertheless, Trump has seized on the document to make a number of misleading claims about Biden’s positions, some of which we have written about previously.", "In three recent tele-rallies, Trump repeatedly cited the document and misrepresented it:", "Here’s what the unity task force recommendations say about charter schools:", "Biden-Sanders Unity Task Force Recommendations, July 8: Charter schools were originally intended to be publicly funded schools with increased flexibility in program design and operations. Democrats believe that education is a public good and should not be saddled with a private profit motive, which is why we will ban for–profit private charter businesses from receiving federal funding. And we recognize the need for more stringent guardrails to ensure charter schools are good stewards of federal education funds. We support measures to increase accountability for charter schools, including by requiring all charter schools to meet the same standards of transparency as traditional public schools, including with regard to civil rights protections, racial equity, admissions practices, disciplinary procedures, and school finances. We will call for conditioning federal funding for new, expanded charter schools or for charter school renewals on a district’s review of whether the charter will systematically underserve the neediest students. And Democrats oppose private school vouchers and other policies that divert taxpayer–funded resources away from the public school system.", "While the document states that Biden would “ban for–profit private charter businesses from receiving federal funding,” the big missing caveat from Trump’s claim is that the overwhelming majority of charter schools are not operated by for-profit entities — which are not even allowed in certain states.", "Biden’s position is “a more reasonable and limited restriction,” and Trump’s characterizations of Biden’s position “go too far,” Katherine Merseth, an adjunct lecturer on education at Harvard Graduate School of Education and an expert on charter schools, told us via email.", "“Of course, charters are public schools, an important note to make that does drive some opponents crazy,” Merseth added. “And some charters have crossed the line by applying for business loans as if they were private businesses. But fundamentally, charters are public institutions.”", "“This is a common misconception about charter schools,” Jamison White, the senior manager of data and research for the National Alliance for Public Charter Schools, told us via email. “All charter schools are public schools. There is no such thing as a for-profit charter school.”", "Actually, there are a few for-profit schools, but only in Arizona. More commonly, when people refer to “for-profit charter schools,” however, they mean charter schools that contract with for-profit entities to help with management.", "White said Biden is likely referring to those Education Management Organizations, or EMOs, which are for-profit entities hired to manage charter schools. White said EMOs “support public charter schools by providing them back-office services, teacher trainings, curriculum help, or other management related services. As charter schools are typically free to contract with both non-profit and for-profit organizations for goods and services, some choose to contract with for-profit organizations.”", "However, the current percentage of schools contracting with EMOs is about 10%, White said.", "To be sure, some charter school proponents are concerned with the recommendations of the unity task force, such as its call for “conditioning federal funding for new, expanded charter schools or for charter school renewals on a district’s review of whether the charter will systematically underserve the neediest students.”", "“The stuff about impact on underserved kids is code for letting districts decide if they want charters – which is like letting McDonalds decide if they want Five Guys,” Andrew Rotherham, co-founder and partner at Bellwether Education Partners, a national nonprofit organization working to support educational innovation and improve outcomes for underserved students, told us via email.", "As Vox explained in its story “Everything you need to know about charter schools,” while all charter schools have to be approved by an outside authority, whom that authority is varies by state. “In states with more restrictive laws on charter schools, district school boards must approve charters. In other cases, state boards of education, mayors, or a special charter school board approve charters.”", "Nina Rees, president and CEO of the National Alliance for Public Charter Schools, issued a statement arguing that “federal charter school funding for charter schools should not be contingent upon a review by a school district. This is clearly problematic because districts have a conflict of interest and often see charters as competitors.”", "Rees also said she was disappointed that in the Biden-Sanders task force report charter schools were not “listed among the multiple public school pathways that provide access to the opportunities students deserve. To omit charter schools from this groups suggests either a lack of understanding or a deliberate snub.”", "According to the National Center for Education Statistics, 3.1 million students attended charter schools in 2017, representing about 6% of the students who attended public schools. According to the National Alliance for Public Charter Schools, that number climbed to 3.3 million in 2018.", "Nonetheless, whether Biden would cut off funding for charter schools managed by for-profit companies, or whether he would seek to rein in charter school expansion with further school district oversight, Trump goes too far with his blanket claim that Biden would “abolish all charter schools.”", "According to a statement provided by a Biden campaign official, “VP Biden will do everything he can to help traditional public schools, which is what most students attend. As president, he will ban for-profit charter schools from receiving federal funds. He will also make sure that we stop funding charter schools that don’t provide results. We should not waste the scarce resources that our public schools badly need. In addition, he will ensure that charter schools are held to the same levels of accountability and transparency as traditional public schools.”", "The campaign official added that Biden “does not oppose districts letting parents choose to send their children to … high-performing public charters.”", "As for Trump’s claim that Biden opposes school choice, as the document makes clear, Biden opposes “private school vouchers and other policies that divert taxpayer–funded resources away from the public school system.”", "The unity task force recommendations specifically seek to discontinue federal funding for the Opportunity Scholarship Program, a program offered only in Washington, D.C., that in 2019 provided $17.5 million for private school vouchers that predominantly went to Black students. According to the unity document, the program “offers taxpayers no accountability for the use of the funds and has consistently failed to demonstrate academic effectiveness.”", "Indeed, according to a 2019 study by the U.S. Department of Education, “Three years after students applied to the OSP, those offered scholarships were doing no better academically but also no worse than otherwise similar peers not given the same opportunity.”", "In 2019, Trump and Education Secretary Betsy DeVos proposed “Education Freedom Scholarships,” which would provide $5 billion in annual federal tax credits for businesses and individuals who donate to scholarship organizations that support private school education. That plan has been opposed by many Democrats — some view it as yet another attempt at vouchers for private schools — and it has not advanced in Congress.", "So when Trump says Biden opposes school choice, it’s true that he opposes vouchers for private schools. But not everyone defines school choice that way.", "According to a Biden campaign official, “Joe Biden opposes the Trump/Devos conception of ‘school choice,’ which is private school vouchers that would destroy our public schools. He’s also against for-profit and low-performing charter schools, and believes in holding all charter schools accountable. He does not oppose districts letting parents choose to send their children to public magnet schools, high-performing public charters, or traditional public schools.”", "Magnet schools are part of the local public school system, and function under the same administration (unlike charters). They typically have a curricular focus — like STEM (Science, Technology, Engineering, and Math) — and students from across the school system with an interest in that curricular focus can attend.", "In short, whether Biden opposes school choice depends on one’s definition of school choice. Some consider offering choices between traditional public schools, magnet schools and charter schools to be “choice” — which Biden supports. Others define choice as federal support for private school tuition — which Biden opposes.", "The Department of Education, in a 2019 report on school choice, defines “school choice” as “an array of elementary and secondary education options” that includes traditional public schools “within or across districts,” public charter schools, private schools and homeschooling.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]