["About this rating", "In September 2016, the magazines Boys' Life and Girls' Life put out their usual issues, with wildly disparate cover images and content listings. Pictures of the two covers were shared side by side in an image that went viral as a purported example of the divergent ways in which girls' and boys' interests are represented in the United States:", "A graphic artist designed her own cover based on the message she thought Girls' Life should convey:", "However, the original photograph of the covers — while real — is misleading for a number of reasons, mostly contextual.", "The Girls' Life cover is a sample size of one.  While this particular cover appears to encourage teens and tweens to focus on their looks at the expense of everything else (and to tacitly say that being pretty is the only important thing) at first glance, a closer look at the magazine's web site quickly shows that previous issues bore covers focusing on stories about body acceptance, getting jobs, and dealing with bullies (and how not to be one) tucked amid pieces on fashion and celebrity gossip.", "Digging deeper into the web site also unearths articles about other (and not at all trivial) topics, with titles such as \"Nosy parents? Try this to set boundaries\" (listen, communicate, compromise), \"September is Childhood Cancer Awareness Month\", and \"5 books that will help you succeed this school year\".", "But if that's not the point (and if you consider the cover the most important part of the magazine), a look at some of the other covers shows a more balanced approach to the hormonally fraught life of the average ten- to sixteen-year-old girl, with headlines showing articles about how to study better in school, how to handle friendships, how to create things, how to boost self-esteem, and book reviews and recommendations.", "It also is important to consider that Boys' Life magazine is not a general boys' interest publication but rather the official trade magazine of the Boy Scouts of America, whose official oath is:", "On my honor I will do my best\nTo do my duty to God and my country\nand to obey the Scout Law;\nTo help other people at all times;\nTo keep myself physically strong,\nmentally awake, and morally straight.", "To clarify, Boys' Life is a magazine that functions as a way to further the very specific (and positive) Boy Scouts' message to boys. It is not a usual newsstand magazine, and despite appearances, it is not affiliated with  Girls' Life — which has a similar name, and is a magazine, but is not affiliated with the Girl Scouts or any other similar organization. Girls' Life states its mission as follows:", "GL readers get real, honest advice. Parents can trust GL to guide their girls through the growing-up years—without making them grow up too fast.", "Karen Bokram is the founding editor and publisher of Girls' Life magazine. She told us that the outcry seems to stem from adults placing their own expectations and pressure on young people.  She says that by the time girls are reading her magazine, they're already receiving mixed messages about what they're supposed to be (and with additional pressure from their peers to fit in), which is in part what her magazine is trying to help them navigate:", "I put this stuff in there, and once I point it out, people say — okay fine, you have a lot of high quality content, but you still should have it on the cover!  And I'm like, okay, so we're shaming girls for having interests that aren't aligned with what you think they should be interested in? So getting good grades and making friends — which is on my cover — isn't within your wheelhouse?", "While there is undoubtedly a conversation to be had about the gender binary, sexism, and the difference in expectations faced by young people based on their sex and outward appearance, this photograph of the two covers side by side does not illustrate those issues as clearly as it might seem to at first glance.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]