["Throughout Joe Biden's campaign, son Hunter Biden's position on a Ukrainian gas company's board of directors has been a popular target for conservative critics. Now, the son of the speaker of the House is also being scrutinized.", "“Guess who’s son is on the Ukraine board w/ H. Biden? Paul Pelosi Jr. that’s right! Nancy’s boy,” reads a sign in a photo posted to Facebook Oct. 24", "Meanwhile the same photo is spreading on Parler, a popular social media platform among conservatives.", "USA TODAY reached out to the Facebook user that posted the photo for comment.", "Fact check:False claim that Joe and Hunter Biden pictured golfing with Burisma CEO", "The image is presumably referring to Burisma Holdings, the Ukrainian gas company on whose board Hunter Biden sat from 2014-19. However, Paul Pelosi Jr. never worked with Biden or Burisma.", "Nancy Pelosi’s Deputy Chief of Staff Drew Hammill told USA TODAY that claims stating her son served on any Ukrainian board with Biden or had any professional relationship with Burisma were \"completely false.\"", "USA TODAY could not find any evidence that Paul Pelosi Jr. had a professional relationship with Biden, Burisma or any other Ukrainian company.", "This is not the first time misinformation about Pelosi and Ukraine has raised eyebrows.", "Fact check:Jill Biden didn't comment on Hunter Biden's laptop, as viral post claims", "Snopes, FactCheck.org and PolitiFact investigated a similar claim that Pelosi worked with a Ukrainian gas company after it circulated in October 2019. All rated it false.", "Misconceptions that Pelosi was involved in a Ukrainian business emerged when a video of him speaking at a 2010 XPRIZE Foundation event went viral in 2019. In the video, apparently posted by NRG Lab in 2013, Pelosi speaks about his position on the board of an energy company called Viscoil Holdings LLC. His mother also appears at the event.", "The video and Pelosi’s purported connection to Ukraine drew attention after conservative reporter Patrick Howley shared it on Twitter. In a thread, Howley shared another video by NRGLab, which credited Ukrainian singer Mika Newton for helping “to secure the rights to build a plant for the production of SH-boxes in Ukraine” in its caption. Howley argued this description and Pelosi’s recent trip to Ukraine proved he had business ties to the country.", "However, the speaker's office told FactCheck.org Viscoil had no business in Ukraine.", "“Paul Pelosi Jr. briefly worked for a company named Viscoil Group. The company was based in Southern California and focused solely on U.S. business. The company dissolved in 2010 and was an LLC registered in California,” Hammill wrote to FactCheck.org. “The company later reorganized under a different name, but Paul Pelosi Jr. played no role in the new entity.”", "FactCheck.org reported the new entity was NRGLab. NRGLab posted both videos that mention planned Ukraine business in 2013, years after Pelosi had worked with the affiliated company.", "State records confirm Viscoil was located in Escondido, California, not Ukraine.", "Hammill told FactCheck.org Pelosi did visit Ukraine in 2017, but the trip was “a vacation at personal expense.”", "Neither Snopes, FactCheck.org, PolitiFact nor USA TODAY found any evidence Pelosi was working with a gas company during his trip.", "House Speaker Nancy Pelosi's son Paul Pelosi Jr. does not and has not worked with Hunter Biden on the board of a Ukrainian gas company. USA TODAY could find no evidence Pelosi ever worked Biden or Burisma Holdings. We rate the claim FALSE because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]