["The six-minute video was posted here on Facebook on January 7, 2021. It has been viewed more than 200,000 times.", "The video’s title reads: \"THIS IS SHOCKING: Businessman Zobel de Ayala SHAMES VP LENI and SIDES with Pres DUTERTE\".", "It begins with a voiceover narration that states in part: \"This news just in that business tycoon Fernando Zobel de Ayala has bravely spoken against the attacks by the opposition including Vice President Leni Robredo who accused President Duterte of sleeping on the job on the government’s pandemic response.", "“In a current interview released by the presidential communications itself, Zobel de Ayala bravely exposed the president and the government's transactions to provide free vaccines for our fellow Filipinos.\"", "The supposed interview starts at the one-minute 49-second mark.", "Robredo, who leads the political opposition to President Rodrigo Duterte’s government, has previously criticised his response to the pandemic.", "Under Philippine election law, voters can choose a president and vice president from different political parties--as was the case in 2016 when Duterte and Robredo won.", "The video circulated online after Zobel de Ayala announced his company would procure coronavirus vaccines and donate a portion to the Philippine government.", "An identical video was shared alongside a similar claim here and here on Facebook; here on YouTube; and in this blog post.", "The claim, however, is misleading.", "A keyword search on Google found a longer video posted on YouTube by the state-run People’s Television Network (PTV).", "The PTV video shows a government press briefing on January 4, 2021. Nowhere in the clip does Zobel de Ayala mention Robredo, contrary to the claim in the misleading posts.", "Instead, he is shown with presidential spokesperson Harry Roque discussing efforts by the private sector to help fight the pandemic, including the purchase of vaccines. Zobel de Ayala also answers one question from a journalist about his business outlook during the pandemic.", "Below is a screenshot comparison of the misleading video (L) and the PTV report (R):", "Multiple Philippine media organisations, for example ABS-CBN here and Inquirer here, reported on Zobel de Ayala’s remarks during the briefing, but did not state he “shamed” the vice president, as alleged in the misleading posts.", "In response to the misleading posts, a spokesperson for Ayala Corporation told AFP by Viber message on January 11, 2020: “Mr Fernando Zobel (de Ayala)'s past interview was about our Covid-19 initiatives with the private sector and in support of government priorities, especially sourcing vaccines and distribution/logistics requirements.”", "The misleading claim was also debunked here by Philippine news organisation Rappler.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]