["About this rating", "On March 6, 2019, NPC Daily published an article positing that a Berkeley student had pledged to donate his entire college-savings fund to Bernie Sanders' 2020 presidential campaign \"because education will be free when he’s elected\":", "“I donated my college fund to the Bernie 2020 campaign because education will be free when he’s elected”", "Bernie Sanders’ 2020 presidential campaign is raising money faster than Trump’s wall fund. The numbers speak for themselves. In just two short weeks, Bernie Sanders raised upwards of 30 million dollars from donations alone. Most of these donations came from millennials and progressives who were more than willing to give all they could in order to make into reality a future they could believe in.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "NPC Daily is a satire site, providing political and cultural commentary with wanton sarcasm. NPC Daily pokes fun of modern journalism and liberalism. If you believe one of our articles is real, it’s because the content is not too far adrift from what is published by mainstream news outlets. But, alas, our content is totally fictitious and is created to elicit laughs and bemusement.", "We note that the article text was republished verbatim on at least two other sites, Real Center News and Trump Is Hero, without any satire disclaimers. Both were shared hundreds of times by social media users in January 2020.", "For background, here is why we sometimes write about satire/humor.", "NPC Daily.   “I Donated My College Fund to the Bernie 2020 Campaign Because Education Will Be Free When He’s Elected.\"\r\n   6 March 2019", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]