["De Lima is in jail awaiting trial on charges she ran a drug ring in the country’s largest prison when she was justice secretary. Here is an AFP report from after her arrest in February 2017 and here is a recent article in major newspaper Inquirer about her ongoing detention.", "The photo, posted multiple times on Facebook for example here and here on March 29, 2019, where it has been shared more than 700 times, shows De Lima holding a document.", "The papers in her hands have the words “Republic of the Philippines, Supreme Court Manila” in the upper-right corner and give her name as the petitioner.", "The document also purports to say: “To allow Mr. Ronnie Dayan to visit me even once a week.” Dayan is De Lima’s former lover and driver and she has spoken about their relationship to Philippine media. Here is an ABS-CBN report about the pair.", "Below is a screenshot of one of the misleading posts:", "The post’s caption, translated to English, says in capital letters: “Just like a plant, De Lima also gets dried up and also needs to be watered. Uggghhh!\"", "De Lima is a high-profile critic of Duterte and her arrest has drawn accusations from rights groups that the case is politically motivated, such as Amnesty International here.", "A Google reverse image search traced the image of De Lima to a photo published by AFP on November 7, 2016.", "Below is a screenshot of the photo on the AFP image site here:", "The photo was taken as De Lima asked the Supreme Court to stop Duterte from securing private information about her in order to attack her. Here is a Senate press release on her petition.", "Both the altered and the original photos contain these key details: De Lima wearing a black scarf, a pearl ring on her left hand and a video camera at the background.", "The image below compares a screenshot of the misleading Facebook post (L) and the AFP photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]