["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Sean Duffy, R-Wis., took on Planned Parenthood in a claim about abortions vs. other health care. (Associated Press photo)", "Email exchange, Rep. Sean Duffy spokesman Mark Bednar, Jan. 25, 2017", "Email exchange, Planned Parenthood of Wisconsin spokeswoman Iris Riis, Jan. 27, 2017", "Email from Planned Parenthood Federation of America spokeswoman Kate Meyer, Feb. 8, 2017", "Phone conversation, Planned Parenthood Federation of America spokeswoman Elizabeth Clark, Feb. 15, 2017", "Rep. Sean Duffy news release, \"Congressman Duffy Re-Introduces Women’s Public Health & Safety Act,\" Jan. 24, 2017", "Live Action, \"As defund debate hits, Live Action exposes Planned Parenthood’s prenatal care deception,\" Jan. 24, 2017", "Planned Parenthood Federation of America, 2014-2015 Annual Report, Dec. 22, 2015", "PolitiFact, \"Jon Kyl says abortion services are 'well over 90 percent of what Planned Parenthood does',\" April 8, 2011", "PolitiFact, \"Fox Business reporter: 95% of Planned Parenthood's 'pregnancy services' were abortions,\" Aug. 4, 2015", "NPR, \"Fact Check: How Does Planned Parenthood Spend That Government Money?,\" Aug. 5, 2015", "The Washington Post, \"For Planned Parenthood abortion stats, ‘3 percent’ and ’94 percent’ are both misleading,\" Aug. 12, 2015", "Slate, \"The Most Meaningless Abortion Statistic Ever,\" May 7, 2013", "Congress.gov, \"H.R.656 - Women's Public Health and Safety Act,\" accessed on Feb. 16, 2017", "Des Moines Register, \"Ernst introduces bills aimed at ending federal funding for Planned Parenthood,\" Jan. 30, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]