["The list of purported goals was published on Facebook here on June 19, 2020. The post appears to list goals for the UN’s Agenda 21, which is a development plan established in 1992, and the UN’s 2030 Agenda for Sustainable Development.", "The post reads: “NEW WORLD ORDER UN Agenda 21/2030 Mission Goals", "“One World Government\n\t“One World cashiers Currency\n\t“One World Central Bank\n\t“One World Military\n\t“The end of national sovereignty\n\t“The end of ALL privately owned property\n\t“The end of the family unit\n\t“Depopulation, control of population growth and population density\n\t“Mandatory multiple vaccines\n\t“Universal basic income (austerity)\n\t“Microchipped society for purchasing, travel, tracking and controlling Implementation of a world \n\t“Social Credit System (like China has) \n\t“Millions of appliances hooked into the 5G monitoring system (Internet of Things)\n\t“Government raised children\n\t“Government owned and controlled schools, Colleges, Universities\n\t“The end of private transportation, owning cars, etc. All businesses owned by government/corporations\n\t“The restriction of nonessential air travel\n\t“Human beings concentrated into human settlement zones, cities\n\t“The end of irrigation\n\t“The end of private farms and grazing livestock\n\t“The end of single hornes\n\t“Restricted land use that serves human needs\n\t“The ban of natural non synthetic drugs and naturopathic medicine\n\t“The end of fossil fuels”", "Other posts featuring the same image appear on Facebook here, here, here, here and here.", "The claim is false.", "“All of the items on the list from the website are either completely false or twisted beyond the truth,” a UN spokesperson told AFP via email on June 27, 2020.", "Heidi Beirich, an expert of extremist movements and the author of a 2014 report on Agenda 21 conspiracy theories, also debunked the purported list of UN goals.", "“That post is filled with all the bogus claims the far right has made against [Agenda 21] for a long time now,” Beirich, who is now the co-founder of the Global Project Against Hate and Extremism, told AFP in an email on June 30, 2020.", "Beirich’s 2014 report was published by the Southern Poverty Law Center, a US civil rights organisation which monitors hate and extremist groups.", "Beirich added the claims in the misleading post about the 2030 Agenda are also “just a false attempt to paint sensible plans for sustainable development as some sort of communist plan, which it is not.”", "The UN spokesperson also noted that Agenda 21 and the 2030 Agenda are not legally binding.", "“Implementation and success will rely on countries’ own sustainable development policies, plans and programmes,” the UN also states here in a FAQ page on the 2030 Agenda.", "“Countries have the primary responsibility for follow-up and review, at the national, regional and global levels, with regard to the progress made in implementing the Goals and targets by 2030.”", "Keyword searches in the Agenda 21 and Agenda 2030 agreements for claims made in the misleading post -- including “one world government,” “one world cashless currency”, “one world central bank,” and “one world military” -- did not return any results.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]