["About this rating", "On 8 June 2016, counties in California published updates about outstanding ballots versus counted ballots, and a significant portion remained yet-to-be tallied.", "The announcements were public and lagging results didn't constitute a coverup; most of the delay involved rounding up and certifying mail-in and provisional ballots.", "Whether the final tally would deviate significantly from the initial totals used to \"call\" the state on 7 June 2016.", "On 7 June 2016, California was one of the last states to count its ballots in the final presidential primaries. (The vote was eclipsed somewhat by a pre-primary call made by the Associated Press declaring Hillary Clinton the Democratic Party's presumptive nominee.)", "Results from California didn't begin trickling in until late on the night of 7 June 2016. As a state with both early and mail-in voting, Clinton obtained an early lead that leveled out as votes made in person were added to the tallies. As of the afternoon of 9 June 2016, Hillary Clinton had received 1,940,580 votes in California to Sanders' 1,502,043, for a total of 3,442,623 ballots counted:", "Shortly after California was called for Clinton in the early hours of 8 June 2016 on the East Coast, memes and rumors began circulating claiming that a large share of ballots had yet to be tallied. The rumors dovetailed with social media reports of problems at polling places, and claims that voters were forced to vote on provisional ballots due to broken machines:", "A 9 June 2016 Los Angeles Times brief about voting by mail indicated that more than five million votes were mailed in for the 7 June 2016 primary. A separate short update in the same paper noted that estimates for total ballots counted were live, but no information about the uncounted balance was available:", "And....six minutes left in the California primary vote. Weeks left in the California primary vote count.", "— Cathleen Decker (@cathleendecker) June 8, 2016", "As of early Wednesday morning, about 5 million ballots had already been counted, but there was no official word on how many remained. State election law gives counties 30 days to finish their canvassing of votes cast. Secretary of State Alex Padilla must receive certified results from each of California's 58 counties by July 8.", "A lengthy certification period is part and parcel of California's vote certification process. Counties have a month to submit finalized tallies in early July 2016, and that 30-day period is a well-publicized aspect of the process. An 8 June 2016 article from the Justice Gazette (reproduced by the unreliable web site USA Daily Politics) exacerbated the confusion by making unsupported claims that poll workers reported \"vote flipping\" in parts of the California. Those claims were peppered with language like \"it has been learned\" and estimates without citations:", "The Justice Gazette reporters and others are conducting an investigation into voting irregularities and the theft of Bernie Sanders's apparent California landslide victory by those supporting Hillary Clinton. According to popular actress Frances Fisher, a lawsuit is being prepared to require the counting of all the provisional ballots. If this lawsuit is successful, the actual vote count is expected to become known and Sanders will likely have a landslide victory in California. It has been learned from poll workers that 50% to 90% of voters who were supposed to have been eligible to vote in the Democratic primary were told they would have to vote provisional ballots. There were two irregularities leading to the forced use of provisional ballots instead of regular ballots. The first was that previously registered voters' names had been removed from the rolls. The second was that someone (in most cases, not the voter) had marked them as vote by mail voters but they had received no ballot in the mail. Oddly, virtually all of those not allowed to vote and forced to vote provisional ballots were Bernie Sanders supporters. The next oddity is even more curious. Poll workers in Los Angeles and Orange County report that Bernie won the electronic votes in their precincts by well over a 2 to 1 margin, the opposite of the result of the vote count. The contrast between this and the outcome is indicative of vote-flipping. Also the outcome.. outcome does not match what anyone who has conducted polling in this state knows ... If you add the lower figure of 50% of voters who were not allowed to vote regular ballots for Bernie to the votes he received, you wind up with a substantial Sanders landslide victory in California.", "USA Daily Politics cited a blog post by investigative journalist Greg Palast to support its claim that a majority of provisional ballots were discarded. However, that claim was addressed and largely debunked the next day, when Dean Logan of the Los Angeles County Registrar-Recorder/County Clerk addressed fears of uncounted provisional ballots on Twitter and stated that most would probably be deemed valid and added to totals:", "@writingnewman All provisional ballots will be processed; those validated will be counted. Historically, 85-90% are determined valid. — Dean Logan, RR/CC (@LACountyRRCC) June 8, 2016", "Logan fielded questions about percentages reported in the media, and attempted to clear up confusion about votes tallied versus votes outstanding:", ".@Sidalceau -- #LACounty doesn't make the call. We count and certify the official vote totals according to CA Election Law; not party rules. — Dean Logan, RR/CC (@LACountyRRCC) June 9, 2016", "@jodirasar - I believe what they are/should be reporting is that 100% of precincts are represented in the count; not 100% of votes cast. — Dean Logan, RR/CC (@LACountyRRCC) June 9, 2016", "It is possible (though not certain) that the gap between Sanders and Clinton might narrow further as more votes were certified, but California's lengthy post-election process is neither fraudulent nor secretive. Mainstream news outlets and county officials frequently and regularly interact with concerned citizens, and invite them to observe the certification process.", "On 14 June 2015, the state of California release a per-county estimate of then-uncounted ballots; the total for all counties in the state was just under two million [PDF]. Logan continued actively addressing questions as the certification process continued:", ".@BlkMenForBernie - I listened & I heard. Will go over transcript for further review, action & improvement; respect & acknowledge concern.", "— Dean Logan, RR/CC (@LACountyRRCC) June 14, 2016", "The complete tally of uncounted ballots to date can be found here.", "Myers, John.   \"5 Million Californians Are Expected To Vote By Mail, A New Record For A Statewide Primary.\"\r\n    Los Angeles Times.   9 June 2016.", "Myers, John.   \"Wednesday's Big Question: How Many Uncounted California Ballots?\"\r\n    Los Angeles Times.   9 June 2016.", "Palast, Greg.   \"How California Is Being Stolen From Sanders Right Now.\"\r\n    Greg Palast.   7 June 2016.", "The Justice Gazette.   \"Bernie Sanders Wins California Landslide BUT 2/3 Of His Votes Aren’t Counted.\"\r\n    7 June 2016.", "Los Angeles County Registrar-Recorder/County Clerk.   \"Certifying Results.\"\r\n    (Undated.)", "California Secretary of State.   \"Voting Resources: Provisional Voting.\"\r\n    (Undated.)", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]