["Discredit a quote and it still shows up online. That’s what is happening with a viral post that alleges the great abolitionist Harriet Tubman said she believed she could have freed more slaves if only they \"knew\" they were slaves.", "A post recently shared to Facebook features an image of Tubman alongside the quote, which says: \"I freed a thousand slaves. I could have freed a thousand more if only they knew they were slaves.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "While the quote has been debunked as fake before, it continues to get re-posted on social media.", "There is no evidence that Tubman said this, and while she has been credited with liberating hundreds of slaves (not thousands) on the Underground Railroad in the past, historians now say the number of people she personally guided to freedom is closer to 70 or 80.", "Kate Clifford Larson is a historian and Tubman scholar who authored the biography, \"Bound For the Promised Land: Harriet Tubman, Portrait of an American Hero.\" Larson told PolitiFact Tubman never made that statement.", "\"Tubman never said this. I think the phrase started making the rounds back in the late 1990s and early 2000s. It is ridiculous in the extreme. Of course enslaved people knew they were enslaved. All of them wanted to be free,\" Larson wrote in an email. She said Tubman herself rescued about 70 people on the Underground Railroad and, with the help of about 150 black soldiers helped liberate 750 enslaved people from plantations on the Combahee River in South Carolina during a raid in June 1863.", "A spring 2008 article in the Maxwell Perspective, a magazine of the Maxwell School of Syracuse University, traced some of the confusion to feminist political analyst Robin Morgan. During the 2008 presidential primary matchup between Hillary Clinton and Barack Obama, Morgan wrote a follow-up to her famous 1970 essay \"Goodbye to All That.\"", "Challenging women who didn’t support Clinton, Morgan wrote, \"Let a statement by the magnificent Harriet Tubman stand as reply. When asked how she managed to save hundreds of enslaved African Americans via the Underground Railroad during the Civil War, she replied bitterly, ‘I could have saved thousands—if only I’d been able to convince them they were slaves.’\"", "The Maxwell Perspective also found the quote to be inauthentic, and several scholars who studied Tubman were unable to locate a primary source for the statement.", "This faux quote is Pants on Fire!", "Facebook post, April 1, 2019", "Associated Press, False quote on freed slaves wrongly attributed to Harriet Tubman, Oct. 4, 2018", "AfricaCheck.org, False Harriet Tubman quote an insult to people in slavery – and to Tubman, Jan. 25, 2019", "Amazon.com, DK Biography: Harriet Tubman, p. 119, by Kem Knapp Sawyer, Accessed April 2, 2019", "HarrietTubmanBiography.com, Harriet Tubman Myths and Facts, Accessed April 2, 2019", "History.com, Harriet Tubman’s Daring Raid 150 Years Ago, May 31, 2013", "Maxwell Perspective from Syracuse University, The Truths Behind the Myth of Harriet Tubman, Accessed April 2, 2019", "Wordpress.com, In Support of Hillary Rodham Clinton: Good-bye to All That, Part II, by Robin Morgan, Feb. 3, 2008", "Email interview, Kate Clifford Larson historian and Tubman biographer, April 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]