["A meme making rounds in Canada shows a photo of a masked protester next to a photo empty supermarket shelves. Above the photos, a caption states: “Illegal blockades causing shelf shortages in the Maritimes,” in reference to Canada’s Atlantic provinces of New Brunswick, Nova Scotia, and Prince-Edward-Island.", "The post was published on February 21 by Nova Scotia Proud, a conservative-leaning Facebook page, and subsequently shared by New Brunswick Proud and Proud To Be A Canadian, two affiliated pages.", "However, the post is misleading because the photo of the store was not taken in Canada, but in a supermarket in Atlanta, in the US state of Georgia, in February 2014. Shoppers in the southeastern state were preparing for a snow storm dubbed “Snowmageddon 2014,” leaving shelves in this supermarket empty.", "Canada’s Maritime provinces have suffered propane shortages due to blockades that have disrupted Canada’s rail traffic for more than two weeks. Protesters are acting in support of the Wet’suwet’en hereditary chiefs, members of a Canadian first nation fighting construction of a natural gas pipeline on their traditional territory in northern British Columbia, Canada’s westernmost province.", "But Patrick Sullivan, president of the Halifax Chamber of Commerce, in Nova Scotia’s capital, told AFP, the impact on grocery stores is low because “most grocery chains have just switched to trucks.”", "“Certainly there have been shortages, but not as dramatic as this photo shows. I didn’t see any shelves like that when I was in the grocery store this weekend picking up my groceries,” Sullivan said.", "Mike Hammoud, president of the Atlantic Convenience Store Association, also told AFP that “there are some empty spaces on shelves but they’re not all completely empty like that picture.”", "CTV News’ local affiliate also reported some shortages of non-perishable items.", "Federal government officials told reporters that the blockades were having a negative impact on Canada’s economy, with freight traffic suspended and 1,000 rail workers temporarily laid off. “It could even affect our GDP if it continues,” transportation minister Marc Garneau said Sunday.", "One of the main blockades, in Tyendinaga, a township east of Toronto, was dismantled on Monday by the Ontario Provincial Police.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]