["The Oregon Republican Party endorses an initiative to overturn a new law that allows people in the country illegally to apply for special driving cards in Oregon.", "Suzanne Gallagher, the state party’s chairwoman, issued a press release with a list of reasons to reject the bill that was signed into law by Gov. John Kitzhaber on May 1. Here’s one reason that caught our eye: \"OFIR estimates that the annual cost to Oregon taxpayers for government services to illegal aliens, after any income tax revenue from them, is $1 billion.\"", "Oregonians for Immigration Reform is a vocal and passionate group that opposes illegal immigration. OFIR did not itself calculate the costs, but relies on a December 2012 report by the Federation for American Immigration Reform, a Washington, D.C., organization that also opposes illegal immigration. FAIR offers state analyses as well as a national analysis.", "It is impossible to get firm numbers when it comes to undocumented immigrants. Furthermore, studies differ on whether they are a net drain or net gain or have a negligible effect on government.", "Recent news reports indicate that unauthorized workers put more money into Social Security and Medicare than they will get out, because they’re not eligible for those benefits. Actually, they are not eligible for most government assistance, but their children, born in the United States, are U.S. citizens and can qualify for medical assistance and social services.", "Our sister PolitiFact publications have tackled similar statements in their states and ruled differently: Half True in Georgia and False in Florida and in New Jersey. They could not offer better calculations on the costs of immigration. We won’t either.", "FAIR study", "How did FAIR figure a $1 billion hit to taxpayers in Oregon?", "First, the organization estimates that 170,000 undocumented immigrants -- or \"illegal aliens\" -- and their children live in Oregon. Schooling costs make up roughly half of the $1.077 billion they consume in government services; K-12 classes plus help for students with limited English skills make up nearly three-quarters of the $1.077 billion.", "The rest of the costs to taxpayers comes from criminal justice and social services. On the flip side, FAIR estimates that undocumented immigrants contribute about $77 million a year in the form of gas, property, income and tobacco taxes. The yearly difference, then, is $1 billion.", "The Pew Hispanic Center puts the undocumented population in Oregon at 160,000, with a low of 110,000 to a high of 220,000. FAIR’s overall number of 170,000 is in the ballpark.", "FAIR estimates there are 10,715 undocumented children in Oregon schools, plus 48,215 children born in the country to undocumented parents, for a total of 58,930 children in Oregon schools.", "Public schools don’t track the information, as they must provide education regardless of documentation. What we do know is that in 2011-12 there were roughly 59,000 students identified as \"English Language Learners\" in Oregon, of which 46,500 receive language development services, according to a spokeswoman for the Oregon Department of Education.", "Obviously, not every child who needs help learning English is in the country illegally, or is the child of parents who are here illegally, but this leads us to think that FAIR’s population estimates could be, again, within field-sized ballpark range.", "The statewide average cost to educate a child was $9,364 in state, local and federal money in 2011-12. Schools receive from the state an additional $3,000 -- very roughly -- for each child who needs special language programs.", "Using FAIR’s numbers, you end up with $100.3 million to educate undocumented children and $451 million to educate children born in the country to undocumented parents. That’s close to FAIR’s overall estimate of $575 million for K-12 education.", "FAIR also calculates an extra $159 million to provide special English language classes for students. Most of that, $130 million, goes to help U.S. citizens, according to the analysis. We end up with $140 million if we multiply 46,500 students by $3,000.", "The rest of the study is summarized this way:", "About $111 million for health and emergency care, including $85 million for U.S.-born children; about $140 million for policing and incarceration of criminals; about $13 million for food and child care assistance on behalf of citizen children; and roughly $79 million in miscellaneous.", "Critics", "FAIR’s reports have been greatly criticized by both the Immigration Policy Center and Competitive Enterprise Institute. Both groups say that the analysis inflates the economic harm done by undocumented immigrants, ignores the tax benefits of immigration, and perhaps more significantly, unfairly includes the costs of educating and providing health care for U.S.-born children.", "FAIR says it’s fair to include the costs of educating children born in the United States. \"We don’t try to hide that we are including the costs,\" said Ira Mehlman, a FAIR spokesman. \"If not for the fact the parents were here breaking the law, we would not be incurring the costs.\"", "The Oregon Center for Public Policy did its own analysis in January 2012. The economic think tank is friendly to immigrants and estimates that the 110,000 to 220,000 undocumented immigrants in the state earn between $2.3 billion to $4.5 billion a year, which they spend on goods and services.", "The center also estimates workers pay between $154 million to $309 million in taxes, including Social Security and Medicare taxes they won’t be able to use later, as well as property, state and local taxes. Their employers also pay taxes on behalf of workers.", "Advocates of stricter immigration rules argue that those benefits are over-inflated because legal residents and U.S. citizens could just as easily hold those jobs.", "Ruling", "The Oregon Republican Party states that an outside organization \"estimates that the annual cost to Oregon taxpayers for government services to illegal aliens, after any income tax revenue from them, is $1 billion.\"", "This is a murky area and if we could calculate a definitive balance sheet of what illegal immigration costs taxpayers, well, we’d be in a different line of work. Still, our reporting finds the education cost estimates are plausible.", "What is problematic is that well more than half of the $1 billion can be credited to U.S. citizens. FAIR’s own numbers suggest nearly $700 million for the lawful children of undocumented immigrants in the United States. Those citizens are not \"illegal aliens.\"", "The $1 billion calculation also ignores taxes paid by and on behalf of undocumented workers.", "The statement includes an element of truth. There is some basis for some of the numbers. We can sympathize with critics of illegal immigration who say it’s appropriate to include the costs of educating children, even if they are U.S. citizens. But citizens are not \"aliens\" and the bulk of the estimated $1 billion goes to provide services to people entitled to receive those services.", "We find the statement Mostly False.", "Interview with and email from, Ira Mehlman, Federation for American Immigration Reform, June 12-13, 2013", "Emails from Jim Ludwick, Oregonians for Immigration Reform, June 12, 2013", "Email from David Cross, Oregon Republican Party, June 12, 2013", "Email from Susan Tully, Federation for American Immigration Reform, June 13, 2013", "Emails from Erik Sorensen, CAUSA Oregon, June 11, 13, 2013", "Interview with Francisco Lopez, director, CAUSA Oregon, June 14, 2013", "Interview with and emails from Crystal Greene, spokeswoman, Oregon Department of Education, June 13-14, 2013", "Interview with and email from Chuck Sheketoff, executive director, Oregon Center for Public Policy, June 13-14, 2013", "Oregon Republican Party, \"ORP Endorses Referendum Against Oregon Driver Privilege Card for illegal aliens,\" May 29, 2013", "Federation for American Immigration Reform, \"The Fiscal Burden of Illegal Aliens on Oregonians (2012),\" December 2012", "Federation for American Immigration Reform, \"The Fiscal Burden of Illegal Immigration on U.S. Taxpayers,\" July 2010", "Competitive Enterprise Institute, \"A FAIR Criticism: A Critique of the Federation for American Immigration Reform’s ‘The Fiscal Burden of Illegal Immigration on United States Taxpayers,’\" Oct. 25, 2011", "Immigration Policy Center, \"Statistical Hot Air: FAIR’s USA Report Lacks Credibility,\" March 29, 2011", "Immigration Policy Center, \"Fatally Flawed: FAIR Blames Immigrants and Children for Maryland’s Financial Problems,\" June 12, 2012", "PolitiFact New Jersey, \"Assemblywoman McHose says illegal immigration costs New Jersey taxpayers more than $3 billion annually,\" Aug. 7, 2011", "PolitiFact Georgia, \"Georgia pols use report to push for immigration reform,\" Feb. 18, 2011", "PolitiFact Florida, \"Vern Buchanan says illegal immigration costs Florida taxpayers $4 billion a year,\" Dec. 6, 2010", "Oregon Center for Public Policy, \"Undocumented Workers Are Taxpayers, Too,\" Jan. 25, 2012", "Immigration Policy Center, \"New Americans in Oregon,\" Jan. 11, 2013, updated May 2013", "Pew Research Hispanic Center, \"A Portrait of Unauthorized Immigrants in the United States,\" April 14, 2009", "Pew Hispanic Center, \"Unauthorized Immigrant Population: National and State Trends, 2010,\" Feb. 1, 2011", "National Conference of State Legislatures, \"A Special Report: Immigration and the States: March 2011,\" (accessed June 13, 2013)", "New York Times, \"For Medicare, Immigrants Offer Surplus, Study Finds,\" May 29, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]