["The image, which bears the CSC logo, has been shared more than 200 times since it was published on Facebook here on May 15, 2020.", "The text in the purported announcement reads: “15 MARCH 2020 CIVIL SERVICE EXAMS UPDATES… THUS; President Duterte announced last May 1, 2020 that all EXAMINEES are automatically passed the said exam both Professional Level and Subprofessional Level. / CONGRATULATIONS EXAMINEES MARCH 2020\".", "Text overlaid in the image reads: “REALLY? THEY ARE SO LUCKY”.", "The post’s caption reads: “and were you able to file?”", "The Philippines' civil service exam, also known as the career service exam, is administered annually by the CSC and tests an individual’s preparedness for government work.", "On March 10, the CSC announced that its March 15 exam would be suspended due to the COVID-19 pandemic.", "The same purported notice about examinees receiving an automatic pass was also shared on Facebook here, here and here.", "However, the claim is false.", "“The CSC has not issued any directive to pass registered examinees of the 15 March 2020 CSE Professional and Subprofessional without taking the actual test,” the CSC said on May 13 in a statement condemning the purported notice.", "The CSC urged the public to “IGNORE THE FAKE NEWS circulating online”, and said the commission has “no existing policy on considering examinees of the Career Service Examination as 'passed' by virtue of incidental factors or circumstances such as the COVID-19 pandemic”.", "The statement also contained a photo of the hoax document stamped “FAKE NEWS”.", "Multiple keyword searches on the website of the presidential communications office found no record of President Duterte making any announcement about granting automatic passes for examinees.", "The president’s Labor Day message on May 1 also did not contain any reference to civil service exams.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]