["The photos shared in this Facebook post show people smeared with a red liquid that looks like blood and wrapped in what resembles supermarket meat packaging.", "The post, which has been shared more than 133,000 times since it was published on August 14, 2017, also includes images of tinned tuna and what looks like meat in the shape of a person.", "Below is a screenshot of the post:", "The post’s Filipino-language caption, translated to English, says in capital letters:", "“Will you believe… Reminder to all OFWs abroad don’t buy corned beef or meal tuna there… Their content is human meat… This is spread out all over the world”.", "OFWs refers to Overseas Filipino Workers, millions of whom are deployed outside of the country for their jobs, according to this report by the Philippine Statistics Authority.", "A reverse image search on Google traced the vertical photo back to this article dated May 12, 2010, about a protest held by animal-rights organisation People for Ethical Treatment of Animals (PETA) in the US.", "The article is headlined: “PETA’s latest bloody naked protest”.", "The image below compares screenshots of the image from the misleading Facebook post (L) and the picture as it appears in the report on PETA (R):", "Another reverse image search on Google traced the top-right image in the Facebook post to this report in UK newspaper the Telegraph, dated May 23, 2016, about a demonstration in Spain against meat production and consumption.", "The image is visible eight seconds into a video that is embedded in the report.", "Below is an image comparing the picture in the misleading Facebook post (top) with the video still in the Telegraph report (bottom):", "The bottom-right image in the post is a montage that was deemed potentially “violent or graphic” on Facebook and greyed out.", "Here is a screenshot of the image:", "A reverse image search of the bottom picture in the montage led to this 2012 multimedia report in the Daily Mail about an event to promote the launch of the video game “Resident Evil 6”, which included meat in the shape of human body parts.", "Here is a screenshot from 1:17 in the video included in the report, which shows the fake “meat body”:", "The upper image in the montage also came from the same video-game event. This post on canada.com, dated October 2, 2012, uses the image.", "Below is a screenshot of the report, which credits the image to Capcom, the developer of Resident Evil 6:", "Comments like the one below show some people believed the misleading post was genuine.", "This comment, when translated to English, says: “This is true even my parent-in-law in America she saw herself that those are humans not all corned beef contain beef so please watch news about other countries so that you will know the truth”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]