["“The AMA, in a surprising move, has officially rescinded...a previous statement against the use of Hydroxychloroquine (HCQ) in the treatment of Covid-19 patients, giving physicians the okay to return to utilizing the medication at their discretion,” a December 15, 2020 transcript on Limbaugh’s website reads.", "According to social media monitoring tool CrowdTangle, the link has been shared more than 15,000 times on Facebook, including 9,000 times from Limbaugh’s page.", "Limbaugh claimed that although the organization had cautioned against using the treatment that has been repeatedly touted by President Donald Trump, “now that Trump is gone, they think, now that Trump is fini, oh, guess what? Hydroxychloroquine is perfectly fine to use.”", "“How much of that do you think cost Trump some votes?” he continued.", "“In other words, the AMA knowingly lying about hydroxychloroquine, could you say that it’s another form of election meddling?” Limbaugh said, appearing to link the supposed AMA move to unsubstantiated claims of foul play in the 2020 presidential election.", "A similar claim was circulated in French by a doctor who has been conducting clinical trials on the treatment and continues to claim it is effective against Covid-19, despite questions about his methodology.", "Mentioned in Limbaugh’s post is a blog post that links to an AMA document considering a proposal to revise their hydroxychloroquine stance.", "The article -- “American Medical Association Rescinds Previous Statement Against Prescription of Hydroxychloroquine to COVID-19 Patients” -- misinterprets the document as proof of a successful shift in the organization’s guidelines.", "The AMA ultimately reaffirmed its position on the drug.", "“In March, the AMA urged caution about prescribing hydroxychloroquine off-label to treat #COVID19. Our position remains unchanged,” the organization tweeted on December 16.", "Earlier this year, the AMA, American Pharmacists Association and American Society of Health-System Pharmacists warned health care providers against ordering “excessive” amounts of the drug to treat Covid-19 and depleting the supply for “patients who need these medicines for chronic conditions.”", "The statement remains on the AMA website as of December 17, 2020.", "The US Food and Drug Administration issued an Emergency Use Authorization for hydroxychloroquine as a Covid-19 treatment in the spring, but has since revoked it, saying the drug is “unlikely to be effective” against the disease.", "AFP Fact Check has debunked other false or misleading claims about hydroxychloroquine here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]