["The photo was published on Twitter here on January 26, 2021.", "“The prime minister of Luxembourg and his glamorous wife wearing a beard and a fishtail skirt. Very fashionable, what do you think?” the Chinese-language caption reads.", "The caption was published alongside another tweet of a German-language Twitter post that features the photo. It translates to English as: “The Luxembourg prime minister and his ‘wife’...”", "The photo was also published alongside a similar claim on Twitter here, here and here; on Facebook here; and on Weibo here and here.", "Some social media users appeared to be misled by the posts. One Twitter user commented in Chinese: “A group of goblins, against humanity, roam in Europe.” Another Facebook user wrote a comment that translates as: “Luxembourg will be damned soon”.", "The claim, however, is false.", "Reverse image and keyword searches found the photo in fact shows Austrian singer Conchita Wurst and her business partner — not Luxembourg's Prime Minister Xavier Bettel and his spouse.", "The photo was published by German newspaper Kurier here on February 28, 2019. The article’s headline translates as: “Opera Ball: Conchita in a white dress and with a bald head”.", "The article reports that the photo was taken at Austria's annual Vienna Opera Ball by Kurier photographer Jeff Mangione.", "Below is a screenshot comparison of the photo in the misleading tweet (L) and the photo published in Kurier (R):", "Wurst also posted this photo on Instagram on February 28, 2019, where she can be seen in the same outfit. “Honoured to be at #wieneropernball2019 tonight,” she wrote.", "A post shared by Conchita / TOM / WURST (@conchitawurst)", "The other person in the photo is André Karsai, the executive chairman of Wurst’s company TNRB unstoppable GmbH.", "Karsai posted another photo of him and Wurst at the Vienna ball on Instagram on February 28, 2019.", "A post shared by André Karsai (@andrekarsai)", "A search also found no reports that suggested Prime Minister Bettel and his husband Gauthier Destenay attended the Vienna Opera Ball in 2019.", "An AFP photo of Bettel and Destenay, who do not resemble Wurst or her business manager, can be seen below.", "The false claim about the photo was also debunked by AFP in Portuguese here and Spanish here in 2019, and also in Serbian here in January 2021.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]