["About this rating", "On Aug. 23, 2019, conservative radio personality Mark Simone posted a message on Twitter asserting that that former U.S. Vice President (and 2020 presidential candidate) Joe Biden owned the largest mansion in his state:", "Since Simone's tweet, near verbatim copies of this message — \"Joe Biden lives in the biggest mansion in his state and just bought another mansion in DC, Bernie Sanders has 4 hours, Obama just got his 3rd mansion. All of this money was made from lecturing you on income inequality!\" — have been reposted by a several additional Twitter accounts. This message was also turned into a meme that has been shared hundreds of thousands of times on Facebook:", "While Simone's post mentioned politicians Bernie Sanders and former President Barack Obama, for the purposes of this article we'll be focusing on the real estate rumors concerning Biden.", "It's unclear which state this meme is referring to by \"his state.\" Biden was born in Scranton, Pennsylvania, but he represented Delaware in the U.S. Senate for more than 30 years between 1973 and 2009. As Biden doesn't own any property in Pennsylvania (and therefore couldn't own the largest mansion in that state), we'll assume that this meme references Delaware, where Biden owns two properties.", "The Washington Post reported in June 2019 that Biden owned two homes in Delaware: his primary residence, a 7,000-square-foot lakeside home in Wilmington, and a 4,800-square-foot vacation house in Rehoboth Beach. While these are both sizable and expensive properties (the beach house was purchased for $2.7 million), neither of them would be considered the \"biggest mansion\" in the state of Delaware.", "By one measure, the Winterthur Estate could be considered Delaware's largest mansion. The house was originally built in 1839 but has been enlarged considerably over the years. Henry Francis du Pont renovated the building between 1929 and 1931, resulting in a 175-room mansion sitting on 2,500 acres. This estate was turned into a museum in 1951, however, so some may not consider it to be the \"largest mansion\" in Delaware.", "The Du Pont family built another massive property in Delaware in the early 1900s. While the Nemours Mansion dwarfs the properties owned by Biden at 47,000 sq. ft. (compared to 7,000), this property, too, no longer serves as a single-family residence and therefore may not be an applicable comparison.", "Still, Biden's Delaware homes are not the biggest in the state. We were able to find several articles concerning homes with more square footage than Biden's residence in Wilmington. The image below shows a 17,588-square-foot estate in Wilmington, for instance, according to Homes of the Rich:", "The most expensive home in Delaware, according to Delaware Online, is a $14.9 million, 7,800-square-foot oceanfront home. Redfin.com also lists properties in excess of 7,000-square-feet, including this 9,957-square-foot property in Dewey Beach, and this 12,000-square-foot home in Wilmington.", "While Biden's Delaware homes are certainly large, they are not the biggest mansions in the state.", "The Washington Post's June 2019 article about Biden's finances also mentioned that he had started renting a large home in McLean, Virginia, after leaving the White House:", "The Georgian-style home — from the front a brick version of the White House — once belonged to Alexander Haig, the former secretary of state. Nestled on a wooded lot in McLean, the nearly 12,000-square-foot residence has five bedrooms and 10 bathrooms, marble fireplaces, a gym and a sauna.", "While the McLean property is larger than both of Biden's Delaware properties, it is not the biggest mansion in Virginia. For instance, a $62.95 million, 48,900-square-foot residence dubbed “The Falls” went up for sale in McLean in 2018.", "Zap, Claudine.   \"Oceanfront Opulence: $14.9M Shell House Is Delaware's Most Expensive Home.\"\r\n    Realtor.com.   5 February 2019.", "Gerhardt, Nick.   \"The Biggest Home in Each State That Will Stun You.\"\r\n    Family Handyman.   Retrieved 22 October 2019.", "Viser, Matt.   \"Once the Poorest Senator, 'Middle Class Joe’ Biden Has Reaped Millions in Income Since Leaving the Vice Presidency.\"\r\n    The Washington Post.   25 June 2019.", "Polus, Sarah.   \"A New Listing Sets the Record for the Most Expensive Home to Ever Hit the D.C. Area Market.\"\r\n    The Washington Post.   29 May 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]