["About this rating", "Ilhan Omar's father is living the U.S. legally. The family was cleared to enter the country in 1995 and successfully secured asylum status.", "Omar's father is not in the U.S. illegally.", "We know of no evidence that Omar's father was responsible for, or even credibly accused of, any wrongdoing in Somalia.", "The election of Ilhan Omar to the U.S. House of Representatives in November 2018 was a milestone, as Omar became one of the first two Muslim women elected to serve in the U.S. Congress and the first in that body to don a religious head scarf. She also became the first Somali-American and naturalized citizen from Africa to serve in Congress.", "But with those milestones have come numerous conspiracy theories and racial or religious-themed hoaxes targeting Omar. On July 16, 2019, another such rumor emerged when the Gateway Pundit junk news site reported that Omar's father was a Somali war criminal who was living in the U.S. illegally.", "No evidence was offered by Gateway Pundit for the claim that Omar's father, Nur Omar Mohamed, was a \"war criminal\" who was \"connected to the former dictator in Somalia, Said [sic] Barre.\" Instead of providing proof, Gateway Pundit simply dropped the name of a different and unrelated Somali man, Yusuf Abdi Ali, into the mix, conflating Mohamed and Ali without making any substantive connection between the two men.", "Ali was fined $500,000 by a jury in Alexandria, Virginia, in May 2019 after they found that as a Somali colonel serving the regime of U.S.-backed Somalian dictator Siad Barre, Ali was responsible for the torture of Farhan Mohamoud Tani Warfaaa in 1987.", "The proceedings brought to light the fact Ali had been working as a driver for the rideshare apps Lyft and Uber in Northern Virginia at the time the lawsuit was filed against him. According to news reports, Ali came to the U.S. in 1996 on a spousal visa.", "But other than commonality of being from Somalia, neither Omar nor her father has any known connection to Ali. The claim that Nur Omar Mohamed was \"connected\" to Siad Barre or that he committed war crimes in Somalia seems to be a leap made by Gateway Pundit based quite literally on nothing but race — the assumption that two people of the same ethnicity are automatically linked to each other.", "In a detailed profile about Omar published in 2016, Minneapolis City Pages reported that before civil war broke out in Somalia, Mohamed's job there was training teachers. And about Ilhan Omar's early years in Somalia, City Pages reported that:", "Her mother died when she was little. Men would shape her. Three older brothers, father Nur Omar Mohamed, and her grandfather, Abukar, especially.", "Aunts and uncles worked as civil servants and educators. Omar’s father trained teachers. Theirs was a blessed life as Somalia began the transition from European colony to independence.", "The claim that Omar's father is in the U.S. illegally is false. It's well-documented that Omar, her father, grandfather and siblings were cleared to enter the U.S. legally in 1995 and secured asylee status, eventually settling in Minneapolis. Her father, as the Washington Post reported, \"drove a cab and then found a job with better hours and benefits at the post office.\"", "The bottom line is that there is no known evidence or even a credible accusation that Omar's father committed any wrongdoing in Somalia that would constitute \"war crimes.\" Furthermore, it is well-documented that Omar's family, her father included, came to the U.S. legally by securing refugee status. Simply pointing to yet another, unrelated Somali man who was credibly accused of carrying out state-sponsored violence is hardly sufficient evidence upon which to level an inflammatory claim against Omar's father and family.", "Zurowski, Cory.   \"Ilhan Omar's Improbable Journey from Refugee Camp to Minnesota Legislature.\"\r\n    Minneapolis City Pages.   7 November 2016.", "LeTourneau, Nancy.   \"The Fever Swamp Is Going After Ilhan Omar.\"\r\n    Washington Monthly.   24 July 2019.", "Jaffe, Greg and Souad Mekhennet.   \"Ilhan Omar’s American Story: It’s Complicated.\"\r\n    The Washington Post.   6 July 2019.", "Stolberg, Sheryl Gay.   \"Glorified and Vilified, Representative-Elect Ilhan Omar Tells Critics: ‘Just Deal.'\"\r\n    The New York Times.   30 December 2018.", "Weiner, Rachel and Marisa Lati.   \"Somali Ex-Colonel Ordered to Pay $500,000 for Torturing Teenager in 1987.\"\r\n    The Washington Post.   21 May 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]