["About this rating", "Political pundit Bob Beckel called for the assassination of Julian Assange in December 2010.", "Beckel does not appear to be a Clinton strategist, and his comments were not made recently in response to the July 2016 DNC leaks.", "On 10 August 2016, amid escalating tensions between publisher Wikileaks and American political pundits, the former sent a tweet asserting that \"Hillary Clinton strategist Bob Beckel\" had called for the assassination of Wikileaks founder Julian Assange:", "Hillary Clinton strategist Bob Beckel called for WikiLeaks editor Julian Assange to be  assassinated. #DNCLeak pic.twitter.com/9L2ixl24Er", "— WikiLeaks (@wikileaks) August 10, 2016", "Many social media users inferred that the referenced comments had been made recently, but they originated with something Beckel in the course of a Fox News Channel segment about WikiLeaks aired back in December 2010, during which Beckel suggested that \"special ops forces\" be used to kill Assange:", "A dead man can’t leak stuff. This guy’s a traitor, he’s treasonous, and he has broken every law of the United States. And I’m not for the death penalty, so ... there’s only one way to do it: illegally shoot the son of a bitch.", "That remark, in the context of the Fox News Channel segment, can be viewed here:", "It should be noted that Julian Assange is Australian, not American. As such, the legal definition of treason isn't precisely applicable to him:", "Whoever, owing allegiance to the United States, levies war against them or adheres to their enemies, giving them aid and comfort within the United States or elsewhere, is guilty of treason and shall suffer death, or shall be imprisoned not less than five years and fined under this title but not less than $10,000; and shall be incapable of holding any office under the United States.", "Were were unable to authenticate the assertion that Bob Beckel has been employed as a Clinton strategist at any point. Beckel worked in the U.S. Department of State during the Carter administration, served as the manager of Walter Mondale's 1984 presidential campaign, and founded a \"grass roots\" lobbying firm in 1984; since then he has worked as a left-leaning political analyst and pundit writing columns for USA Today, co-hosting The Five for the Fox News Channel, and most recently offering commentary on the 2016 presidential election for CNN. But we found no evidence indicating that he has ever served as a Hillary Clinton campaign strategist.", "Wemple, Erik.   \"CNN Hires Jolly Islamophobe Bob Beckel, Formerly of Fox News.\"\r\n    The Washington Post.   21 October 2015.", "Title 18, U.S. Code.   \"§ 2381 - Treason.\"\r\n    13 September 1994   (Updated.)", "The New York Times.   \"Treason Against the United States.\"\r\n    25 January 1861.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]