["Gov. Rick Scott has a new enemy on the campaign trail: Billionaire environmentalist Tom Steyer. And Steyer has started bringing his message and massive checkbook to the airwaves.", "In an Aug. 8, 2014, commercial from Steyer’s political action committee NextGen Climate, the group accused the Republican incumbent of letting utility company Duke Energy run wild on the state’s citizens. The ad references the botched upgrade at the now-shuttered Crystal River nuclear plant and canceled Levy County nuclear project.", "\"We Floridians are paying billions to the nation's largest power company and getting nothing in return,\" says a TV reporter. Then the narrator: \"One defective power plant. Another never built. Florida fleeced by Duke Energy. Rick Scott knew, but he’s letting Duke keep collecting billions anyway.\"", "The ad flashes a statement attributed to the Tampa Bay Times: \"Duke’s customers on the hook for up to $3.2 billion.\" It also says Scott received $500,000 in campaign contributions from Duke and its pre-merger counterpart, Progress Energy, strongly implying a connection.", "The commercial was one of two NextGen Climate ads released attacking Scott. The other accused Scott of accepting campaign contributions from a Texas company performing unauthorized oil drilling in Collier County. We looked at that one in a separate item.", "It’s obvious Scott heard of the troubles in Citrus and Levy counties, since it was a major headache for the 1.7 million Florida residents billed by Duke Energy for electricity (the company said it doesn’t comment on political ads). But we wondered, is there something Scott could have done to prevent the utility from pulling in billions for the troubled projects, even though no customer is benefitting from them? PolitiFact Florida decided to check the fine print.", "The nuclear option", "The saga of Duke Energy’s ill-fated nuclear plants on Florida’s west coast is complex, making it hard to comprehensively explain its ups and downs. (The Tampa Bay Times has extensively covered the morass.) We will give you a quick overview, though: In 2006, the state Legislature overwhelmingly passed SB 888, allowing utilities to charge a so-called \"advance fee\" to customers in order to pay for nuclear projects.", "The fee was based on the number of kilowatt hours the customers used, and shifted the expense of new nuclear projects to customers instead of shareholders. Unfortunately, while the bill allowed utilities to collect the fee for facilities yet to be built, there was no language included to ensure those companies had to actually build anything.", "That same year, Progress Energy began selecting a site in Levy County for a new nuclear power plant. Over the years, the potential cost of the project neared $25 billion, and Progress collected roughly $1 billion in advance fees to help pay for it.", "In 2009, Progress Energy was also upgrading its Crystal River nuclear plant by installing new steam generators. Progress elected to perform the upgrade itself and the reactor containment dome contracted during the project, requiring extensive repairs. Progress planned to reopen the plant in 2011, but the company committed one mistake after another in the work. Estimates to repair the building reached as high as $3.4 billion.", "Progress merged with Duke Energy in 2012. State lawmakers changed their tune about the advance fee in 2013 amending the 2006 law with SB 1472, saying a utility has 10 years after it gets its federal license to begin construction or lose access to the fees. The projects also had to be \"reasonable,\" an important addition, considering the Levy project had turned into the most expensive nuclear power plant in U.S. history.", "The same day lawmakers passed the amendment by a wide margin, the Florida Supreme Court rejected an environmental group’s challenge to the fee, saying the 2006 fee was constitutional and the state’s Public Service Commission had a framework with which to apply it.", "Duke then decided in 2013 to shut down the Crystal River plant rather than fix it, even after using $265 million in advance fee money. The total cost of the Crystal River project grew to about $1.7 billion from repair work, having to buy electricity for customers elsewhere and other expenses. The company also canceled the Levy County project after spending $1.5 billion on it.", "Duke continued to clamor for more advance fee cash, saying it may one day continue the Levy County project or build a natural gas plant. They also claimed decommissioning the Crystal River facility would take 60 years and cost another $1.18 billion, much of which the utility collected for its federally required decommissioning fund.", "The five-member Public Service Commission voted 4-1 in October 2013 to settle with Duke Energy over $5 billion in costs for the two doomed projects. Customers would shoulder $3.2 billion in expenses, insurance would pay $835 million and shareholders would pay the rest, with Duke keeping about $250 million ($150 million for Levy, $100 million for Crystal River).", "Customers will have to pay monthly charges of $3.45 per 1,000 kilowatt hours for Levy through the early part of 2016 and $2.17 for Crystal River through at least 2017 -- all for two projects that never produced any electricity in exchange for the money paid.", "Who’s to blame?", "The commission’s members are appointed by the governor, who relies on the Legislature to draft a list of nominees when members’ four-year terms are up. Of the five veteran members on the board under Scott, four were previously chosen by Gov. Charlie Crist, and one was originally picked by Gov. Jeb Bush. Scott reappointed each, and the Legislature confirmed them.", "\"Like judges appointed by the governor to the judiciary, PSC commissioners make independent decisions based on the established evidentiary record for each case,\" spokesperson Cindy Muir said. \"PSC decisions are not reviewed by the Legislature or the governor.\"", "Scott did have some say on who served on the commission, however, although he has not spoken publicly about the two nuclear plants or the PSC’s vote. Scott could have urged lawmakers to deal with the advance fee, but no action was taken until 2013.", "Many lawmakers were still not pleased with the commission’s settlement. Rep. Dwight Dudley, D-St. Petersburg, called the 2013 changes to the fee \"total eyewash\" and several legislators demanded a complete repeal of the advance fee. That hasn’t happened.", "A change in the law is the only way consumers could avoid the advance fee, and that’s not up to the PSC or the governor alone, according to Public Counsel J.R. Kelly.", "\"Whether the governor likes it or not and, to a certain extent, whether the PSC likes it or not, they have to follow the law,\" Kelly said. \"I don’t know what the governor’s office or anyone else could have done.\"", "He pointed out that whether or not the governor and the commissioners share opinions on subjects, the PSC’s board members are appointed to four-year terms in order to avoid political reprisals after making unpopular decisions. Commissioners can only be removed for malfeasance, he said.", "Our ruling", "NextGen Climate said Scott \"is letting Duke (Energy) keep collecting billions\" after the utility company took in billions for two failed nuclear projects.", "The $3.2 billion settlement was the decision of the Public Service Commission, however, and not the governor or the Legislature. Scott and lawmakers have a say in who serves as commissioners, but the board’s decisions in utility matters is final.", "Scott could have asked for a change in the advance fee from 2006 that led to the flap, but he didn’t. He also could have appointed commissioners who may have voted differently. Beyond that, there’s not much the governor could do about the settlement the PSC awarded Duke. But it’s not like Scott has spoken up on the issue. If anything, he has been notably silent.", "We rate the statement Half True.", "NextGen Climate, \"Shock,\" Aug. 8, 2014", "Tampa Bay Times, \"Gov. Rick Scott upends PSC by rescinding appointments,\" Feb. 3, 2011", "Yahoo Finance, \"Duke Energy Acquires Progress Energy,\" July 2, 2012", "Tampa Bay Times, \"Nuclear advance fee case in front of Florida Supreme Court has big implications,\" Oct. 1, 2012", "Duke Energy, \"Crystal River Nuclear Plant to be retired; company evaluating sites for potential new gas-fueled generation,\" Feb. 5, 2013", "Tampa Bay Times, \"Florida legislators hope to fix nuclear advance fee law,\" Feb. 20, 2013", "Tampa Bay Times, \"Senate wants 'comprehensive review' of Levy County nuclear project,\" April 10, 2013", "Tampa Bay Times, \"Florida lawmakers toughen guidelines for using nuclear advance fee,\" May 2, 2013", "Tampa Bay Times, \"Duke Energy to cancel proposed Levy County nuclear plant,\" Aug. 1, 2013", "New York Times, \"Florida Nuclear Project Is Dropped,\" Aug. 1, 2013", "WTSP, \"Florida regulators OK Duke Energy nuclear rate hike,\" Aug. 5, 2013", "Tampa Bay Times, \"Florida PSC approves Duke Energy agreement with customers on hook for $3.2 billion,\" Oct. 17, 2013", "Public Service Commission, \"Florida PSC Approves Amended Nuclear Cost Recovery Rules,\" Dec. 3, 2013", "Tampa Bay Times, \"Shutting down Crystal River nuclear plant will cost $1.2 billion, take 60 years,\" Dec. 10, 2013", "Tampa Bay Times, \"Paying in advance for nothing at all,\" Feb. 28, 2014", "Tampa Bay Times, \"Settlement favors Duke Energy in tax dispute with Citrus County,\" March 20, 2014", "WFSU, \"Duke Energy Petitions To Continue Charging Customers For Abandoned Nuclear Plants,\" Aug. 1, 2014", "South Florida Sun-Sentinel, \"Power play for PSC appointees,\" Sept. 19, 2010, accessed Aug. 8, 2014 via Nexis", "South Florida Sun-Sentinel, \"Gov. Scott reappoints four PSC members,\" Feb. 5, 2011, accessed Aug. 8, 2011 via Nexis", "Tampa Bay Times, \"Progress stalls Levy plan,\" Jan. 26, 2012, accessed Aug. 8, 2014 via Nexis", "U.S. State News, \"Sen. Fasano asks Gov. Scott to not reappoint Commissioner  Lisa Edgar to Florida Public Service Commission,\" Sept. 4, 2012, accessed Aug. 8, 2014 via Nexis", "Tampa Bay Times, \"Nuclear plans, fees get an okay,\" Nov. 27, 2012, accessed Aug. 8, 2014 via Nexis", "Tampa Bay Times, \"Nuclear plant fee law at issue,\" March 19, 2013, accessed Aug. 8, 2014 via Nexis", "Tampa Bay Times, \"Naming names in nuclear debacle,\" Aug. 11, 2013, accessed Aug. 8, 2014 via Nexis", "Tampa Tribune, \"Utility choices loom for Gov. Scott,\" Sept. 2, 2013, accessed Aug. 8, 2014 via Nexis", "Tampa Bay Times, \"Another bill from Duke?,\" April 5, 2014, accessed Aug. 8, 2014 via Nexis", "Tampa Bay Times, \"Political ad attacks Scott for failing to stop Duke's nuclear charges,\" Aug. 8, 2014", "Florida Senate, SB 888, accessed Aug. 11, 2014", "Florida Senate, SB 1472, accessed Aug. 11, 2014", "Florida Senate, SB 964, accessed Aug. 11, 2014", "Florida Senate, HB 4001, accessed Aug. 11, 2014", "Interview with Suzanne Henkels, NextGen Climate spokesperson, Aug. 8, 2014", "Interview with John Tupps, Gov. Rick Scott spokesperson, Aug. 8, 2014", "Interview with Greg Blair, Scott for Florida campaign spokesperson, Aug. 8, 2014", "Interview with Cindy Muir, Florida Public Service Commission spokesperson, Aug. 8, 12, 2014", "Interview with J.R. Kelly, Office of Public Counsel attorney, Aug. 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]