["As of 2018, the last year when lawmakers filled out financial disclosures, 61 were worth $1 million", "Many of the newly-elected members of the Senate are also millionaires", "Democratic candidates are already starting to pop up for a 2022 run for U.S. Senate, all aiming for a seat held now by Republican Ron Johnson, who has not said if he’ll seek a third term.", "And it doesn’t look like the race will be a friendly one.", "Johnson was already a top target of Democrats before he said the Jan. 6 attack on the Capitol wasn’t an armed insurrection ( a claim we rated Pants on Fire) and before he forced a full-reading of the $1.9 trillion COVID relief plan advanced by Democrats and President Joe Biden (we rated his stance on full readings a Full Flop).", "One of the Democratic candidates, Outagamie County Executive Tom Nelson, has been taking shots at Johnson, but also took aim recently toward Milwaukee Bucks executive Aex Lasry, who has also announced his Democratic campaign.", "During a March 7, 2021 interview on WISN TV’s UPFRONT, Nelson said he had asked Lasry to not self-fund his campaign.", "\"I think what’s really important here is you listen to what the people want, I think the last thing people want is for someone to come in and self-fund,\" Nelson said. \"Right now, two-thirds of the U.S. Senate is composed of millionaires. We need someone who is in touch with the people.\"", "For this fact-check, we are focusing on the part of Nelson’s claim that two-thirds those in the Senate are millionaires.", "Is he right?", "When asked for backup for the claim, the Nelson campaign pointed to an August 2020 fact-check of U.S. Sen. Cory Booker, D-N.J., who claimed, in part, the Senate was \"dominated by millionaires.\" PolitiFact National rated that claim True.", "That fact-check relied on an analysis by the Center for Responsive Politics, which examined net-worth data for senators from 2018 -- still the most recent data available.", "The data comes from financial disclosure forms, which lawmakers are required to fill out. Because the forms don’t require exact values, only a range, the center calculated net worth for lawmakers by adding their assets, subtracting their liabilities and calculating the midpoint of the resulting range.", "In all, 61 of the 100 senators had a net worth of at least $1 million -- with some having a net worth many times that amount.", "For example, Republican Kelly Loeffler of Georgia had a net worth of more than $500 million and Republican Rick Scott of Florida’s net worth was nearly $260 million. Also among the top:  Democrat Mark Warner of Virginia (more than $214 million) and Republican Mitt Romney of Utah (about $174 million).", "Both Wisconsin senators met the threshold: Johnson was listed at $39 million, while Democrat Tammy Baldwin was listed at $1.1 million.", "Of course, since the Center’s report last year, 10 seats changed. Of the 10 senators who were replaced, eight were millionaires. We could not locate recent net worth estimates for all of their replacements.", "That said, many of the new members are also millionaires.", "Democrat Mark Kelly of Arizona is worth between $10.8 million and $28 million, according to a January 2021 Newsweek report, while Democrat John Hickenlooper of Colorado is worth between $9 million and $27 million. Several others are also listed as worth more than $1 million.", "According to a December 2020 report from the Atlanta Journal-Constitution, Georgia Democrats John Ossof and Raphael Warnock each have net worths well over $1 million as well. They replaced Republicans Loeffler and David Perdue, worth nearly $26 million.", "Experts have noted in recent years that the cost of running for office -- in Wisconsin and across the nation -- has become increasingly difficult for candidates who cannot bring their own money to the table.", "Robert Yablon, an associate professor at the University of Wisconsin Law School, said campaigns have become more expensive to run. Having money to start off a campaign can lead to better political consultants working on a campaign and likely even having wealthy friends willing to contribute large amounts, he said.", "The 2020 election is a good example of the escalating price, with seven campaigns bringing in $100 million or more in contributions -- more than ever before.", "Yablon also noted that the Senate tends to attract people who have seen success in their life, whether in business or celebrity, which was likely lucrative.", "\"There is a long history of very wealthy people in the Senate,\" he said. \"The phenomenon is not new.\"", "Nelson, a Democrat running for US. Senate, said that two-thirds of those in the Senate were millionaires.", "Based on data from 2018, last year of financial disclosures available, 61 Senators had an average net worth of more than $1 million, according to one estimate. So, that is nearly two-thirds.", "Many of the 10 newly elected senators also have high net worths, but an updated tally is not yet available.", "Nevertheless, political experts say the Senate is likely to attract campaigns from wealthier people, contributing to the high number of millionaires who currently hold seats.", "We rate this claim Mostly True.", "WISN, \"UPFRONT recap: Republicans propose changes to election laws,\" March 7, 2021", "PolitiFact, \"Cory Booker said the U.S. Senate is ‘dominated by millionaires.’ Is that true?\" Aug. 13, 2020", "The Center for Responsive Politics, \"Majority of lawmakers in 116th Congress are millionaires,\" April 23, 2020", "The Center for Responsive Politics, \"Net worth - 2018,\" March 10, 2021", "Newsweek, \"Who are the richest incoming members of Congress?\" Jan. 3, 2021", "Atlanta Journal-Constitution, \"Warnock, Ossoff raise combined $210 million for Jan. 5 Senate contests,\" Dec. 25, 2020", "Phone conversation with University of Wisconsin Law School associate professor Robert Yablon, March 17, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]