["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "PA Sen. Scott Wagner questions PA Secretary of Education Pedro Rivera during the Senate Appropriations Committee budget hearing with the Department of Education. (senatorscottwagner.com)", "In an Oct. 11 fundraising email sent to supporters, Republican gubernatorial candidate Scott Wagner said his opponent, Democratic incumbent Tom Wolf, \"has failed Pennsylvanians,\" adding, \"Our unemployment rate is 20 percent higher than the national average.\"", "PolitiFact Pennsylvania repeatedly asked Wagner’s campaign for evidence supporting the claim and got no response, so we decided to mine the data ourselves. And since Wagner’s campaign didn’t place a timeframe on his claim — other than using the present tense — we decided to see if anyone else had.", "We found a June tweet from Matt Brouillette, current president and CEO of Commonwealth Partners and former president and CEO of the conservative Commonwealth Foundation. In it, Brouillette wrote in response to a tweet from U.S. Rep. Keith Rothfus about national economic figures: \"Yet under @GovernorTomWolf's tenure, PA's unemployment rate remains upwards of 20% higher than the national average.\"", "In an email response to PolitiFact Pennsylvania, Brouillette pointed to April when Pennsylvania’s unemployment rate was 4.7 percent and the national rate was 3.9. Brouillette said this puts Pennsylvania’s rate at 20.5 percent above the national rate.", "Here’s the math: (4.7 - 3.9) / 3.9 = .205 x 100 = 20.5 percent", "Obviously one could also say that Pennsylvania’s rate was, in absolute terms, 0.8 percentage points higher than the national rate in April, but that number is far less impactful, especially if, like Wagner, your intent is to besmirch the sitting governor who also happens to be your political opponent.", "\"Using a percentage change is not that uncommon, especially if it works to make the point more dramatic,\" said G. Terry Madonna, professor of public affairs and director of the Center for Politics and Public Affairs at Franklin and Marshall College.", "Erin E. Delaney, an economist with the U.S. Bureau of Labor Statistics, explained, \"It’s usually not necessary to calculate a percent change with percentages because they are already comparable as is (unlike if you were looking to compare unemployment levels).\"", "Delaney added, \"... calculating a percent change could be misleading if all of the facts are not presented. Because the numbers are smaller in the first instance, the percent difference is exaggerated — especially confusing since both of the rates would be more favorable than the higher rates with the smaller percentage difference.\"", "So, Pennsylvania’s unemployment rate was 20 percent — not 20 percentage points — higher than the national rate in April.", "But is that still the case, given the present tense used in Wagner’s email?", "No. Not even close.", "Based on U.S. Bureau of Labor statistics data, in August 2018 — the most recent month for which state data are available — Pennsylvania’s seasonally adjusted unemployment rate was 4.1 percent. The national seasonally adjusted unemployment rate was 3.9 percent. That’s a 0.2 percentage point or 5 percent difference, not a 20 percent difference as Wagner claims.", "Seasonally adjusted numbers take into account fluctuations and trends in employment numbers that re-occur each year. This includes winter slowdowns in agriculture, construction and other seasonal industries, the pickups seen every June as students take summer jobs, and the hiring and layoff patterns that coincide with winter and summer holidays.", "Seasonally adjusted stats are generally considered a more reliable indicator of unemployment trends. Brouillette used them in support of his claim about April’s disparity between state and national unemployment rates.", "But even by his own account, that disparity has dwindled considerably since, with Pennsylvania’s unemployment rate sitting at 0.2 percentage points or 5 percent higher than the national rate in August.", "And when looking at not-seasonally adjusted numbers, Wagner’s claim doesn’t fare any better. The not-seasonally adjusted number in Pennsylvania was 4.4 percent in August and 3.9 percent nationwide. That’s a 12 percent difference.", "In fact, with the exception of April, at no point since Gov. Tom Wolf was inaugurated in January of 2015 has the state unemployment rate been 20 percent higher than the national rate.", "The closest it’s come is 18.4 percent or 0.7 percentage points in May when Pennsylvania’s unemployment rate was 4.5 to the nation’s 3.8.", "Our ruling", "Pennsylvania did have an unemployment rate that was 20 percent — not 20 percentage points — higher than the national rate in April.", "But Wagner is wrong to claim it stilldoes. The most recent data shows Pennsylvania’s rate in August was 5 percent above the national rate.", "For these reasons, we rate this claim False.", "Email interview, Erin E. Delaney, economist with the U.S. Bureau of Labor Statistics, Oct. 15, 2018", "Email interview, Michael Gerber, press secretary with the Pennsylvania Department of Community and Economic Development, Oct. 15, 2018", "Bureau of Labor Statistics, Quarterly Census of Employment and Wages", "Bureau of Economic Analysis, Gross Domestic Product by State, 1st quarter 2018", "Economic Policy Institute, State jobs picture, Sept. 21, 2018", "Email interview, Matt Brouillette, president and CEO of Commonwealth Partners, Oct. 17, 2018", "Email interview, Sandi DiMola, associate professor of political science, Carlow University, Oct. 17, 2018", "Email interview, Kristen Coopie Allen, assistant professor of political science at Duquesne University, Oct. 17, 2018", "Email interview, G. Terry Madonna, professor of public affairs and director of the Center for Politics and Public Affairs at Franklin and Marshall College, Oct. 17, 2018", "Email interview, Kristin Kanthak, associate professor of political science at the University of Pittsburgh, Oct. 17, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]