["On Oct. 26, the New York Post endorsed President Donald Trump's bid for reelection.", "The cover of the tabloid that announced the choice was emblazoned with a photo of Trump and the words, \"Make America great again, again.\"", "On Dec. 28, another cover of the New York Post dedicated to Trump appeared online, posted to Instagram by accounts like PoliAlert and Breaking 911. This cover, though, had a very different message: \"Mr. President... STOP THE INSANITY. You have lost the election — here's how to save your legacy.\"", "PoliAlert and Breaking 911 have not responded to requests from USA TODAY for comment.", "Fact check:No, Joe Biden's brother-in-law does not own Dominion Voting Systems", "Both the cover and staff editorial that are critical of Trump are real, published by the New York Post on Dec. 27.", "The tabloid, owned by Rupert Murdoch, published the front page online along with a copy of the editorial, which ran under the headline, \"The Post says: Give it up, Mr. President — for your sake and the nation’s.\"", "The scathing editorial instructed Trump to \"end this dark charade\" and accused him of \"cheering for an undemocratic coup\" by encouraging Republicans to reject the results of the presidential contest.", "\"You had every right to investigate the election. But let’s be clear: Those efforts have found nothing,\" the editorial read.", "It also took aim at his allies, including lawyer Sidney Powell, whom it called \"a crazy person,\" and Michael Flynn, a retired lieutenant general – who it said committed acts \"tantamount to treason\" by suggesting Trump should institute martial law rather than accept the electoral results and leave office peacefully.", "Instead of disputing his loss, the editorial encouraged Trump to focus on the upcoming runoff elections in Georgia on Jan. 5 that will decide control of the Senate.", "\"Securing the Senate means securing your legacy. You should use your considerable charm and influence to support the Georgia candidates, mobilizing your voters for them,\" the editorial read. \"Focus on their success, not your own grievances, as we head into the final week.\"", "Fact check:Rev. Warnock sermon on 'whiteness' condemns racism, does not call for anti-white bigotry", "The editorial concluded with the following warning for Trump, a quote that PoliAlert also included in its post on Instagram:", "\"If you insist on spending your final days in office threatening to burn it all down, that will be how you are remembered. Not as a revolutionary, but as the anarchist holding the match.\"", "The New York Post has long bolstered Trump — both while he became a celebrity in New York City and early in the primaries in 2016, per the New York Times.", "Still, its tone has shifted since it became clear that President-elect Joe Biden had clinched a victory. For example, on Nov. 7, the New York Post issued a staff editorial that instructed Trump to \"stop the ‘stolen election’ rhetoric.\"", "\"Where Trump won several key states by razor-thin margins to take the White House in 2016, Biden seems to have done the same this year. It undermines faith in democracy, and faith in the nation, to push baseless conspiracies. Get Rudy Giuliani off TV. Ask for the recounts you are entitled to, wish Biden well, and look to the future,\" it read. \"If Trump persists in wild talk to the contrary, he’ll lead his people into irrelevance and marginalize his own voice.\"", "Fact check:Meme is missing context, potentially misleads on support for Biden, Trump and Obama", "Based on our research, the claim that the New York Post published a cover and staff editorial urging President Trump to accept defeat is TRUE. The items were published in print and online on Dec. 27.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]