["About this rating", "In February 2020, news outlets such as The Intercept, CBS News, and The BBC published articles reporting that Native American burial sites in southern Arizona were at risk of being, or had already been, damaged during construction of a section of the U.S.-Mexico border wall in Organ Pipe Cactus National Monument.", "The Intercept, for instance, reported on Feb. 6:", "Contractors working for the Trump administration are blowing apart a mountain on protected lands in southern Arizona to make way for the president’s border wall. The blasting is happening on the Organ Pipe Cactus National Monument, a tract of Sonoran Desert wilderness long celebrated as one of the nation’s great ecological treasures, that holds profound spiritual significance to multiple Native American groups.", "These reports originated with credible news outlets, yet some readers found the news hard to believe. We received several queries asking if the reports were true. While we recommend reading the articles published by The Intercept, CBS News, and The BBC, we'll respond to readers' most pressing questions below.", "Is There a Native American Burial Site on Monument Hill?", "In early February 2020, U.S. Customs and Border Protection (CBP) started construction on a segment of border wall inside Arizona's Organ Pipe Cactus National Monument. CBP officials confirmed that \"controlled blasting\" had started in an area within the Roosevelt Reservation at Monument Mountain, which is also known as Monument Hill.", "The Intercept reported:", "\"In a statement to The Intercept, U.S. Customs and Border Protection confirmed that the blasting began this week and will continue through the end of the month. “The construction contractor has begun controlled blasting, in preparation for new border wall system construction, within the Roosevelt Reservation at Monument Mountain in the U.S. Border Patrol’s Tucson Sector,” the statement said, referring to an area also known as Monument Hill. “The controlled blasting is targeted and will continue intermittently for the rest of the month.\"", "Organ Pipe Cactus National Monument is located in southern Arizona and sits just above the border of the United States and Mexico. To the east of this national park is the Tohono O'odham Indian Reservation. According to tribe leaders, as well as archaeologists, Monument Hill is home to a Native American burial site.", "In January 2020, Arizona Rep. Raul Grijalva surveyed the area with Ned Norris Jr., the chairman of the Tohono O'odham Nation, Peter Steer, the tribe's historic preservation officer, and a group of archaeologists. Here's how Monument Hill was described in a set of briefing notes compiled by Grijalva's staff after the visit:", "Archaeologists noted that Tribal elders were interviewed and identified this hill as sacred to the O’odham. This hill is first documented and mentioned in Father Kino’s letters when there was no Sonoita. During Apache raids, if a body was found after battle the tribe would place the bodies on this hill. Meaning there are bodies of other tribes in Arizona among this Hill with bone fragments. DHS mentioned that they would back off on developing the Hill, but the work is still being done (as you can see the road is widened in the photos/video) even after the tribe mentioned the cultural and historic significance of this area in a letter. Archeologist Edward Abbey also mentioned Monument Hill and its significance to the tribe in his archeology papers published in 1960s.", "Steer provided similar information to AZ Central. According to Steer, Monument Hill was once used for religious ceremonies and was also the resting place of fallen soldiers. Steer said that bone fragments had also been found on the hill and that the tribe has been able to date back mentions of the hill to the 1600s.", "AZ Central reported:", "\"This hill, from the information we've been able to gather, was used by Hia-C’ed O’odham for religious ceremonies,\" Peter Steere said. \"This is also a place, when the Apache were raiding out here, if the Apache warrior was killed, his body was placed on this hill.\"", "He added that the tribe is able to track mentions of the hill dating back hundreds of years. They have found possible references in letters written by Father Eusebio Kino, the famed Jesuit missionary that proselytized the area in the late 1600s.", "The tribe has documented information about the hill from O'odham elders, as well as archaeologists who have worked in the area.", "\"We have found a couple of places with bone fragments up here,\" Steere said.", "When Rep. Grijalva visited the area in January 2020, construction had not yet started. The Arizona congressman sent a letter to acting Secretary of Homeland Security Chad Wolf expressing concern over the border wall's potential impact on the national monument and asked the government to address certain issues, such as the location and schedule for construction and the protection of groundwater resources. Grijalva said that he never received a response to his letter and in February 2020 construction crews began \"controlled blasting\" in the area.", "Grijalva told The Intercept: \"It’s been really frustrating. [...] You would think that in a situation like this, that involves human remains, burial sites, bone fragments that are traced and dated a thousand years or more back, that there would be some sensitivity, for lack of a better word, on the part of DHS and the administration. There is none.”", "On Feb. 9, 2020, Grijalva posted an update on social media stating that two of the four burial sites that he visited had already been disturbed by the construction of the border wall:", "Aren't Native American Burial Sites Protected?", "The U.S. does have laws such as the Environmental Protection Act, the Endangered Species Act, and the Native American Graves Protection Act. However, these laws can be circumvented if the government deems that they are at odd with national security.", "CBS News reports that the 2005 REAL ID Act gives the government \"broad power to waive\" laws that stand in the way of national security:", "The Trump administration has been able to legally construct the border wall over public land due in large part to a little known law passed in the wake of the 9/11.", "The REAL ID Act of 2005 gives the federal government broad power to waive other laws that stand in the way of national security. Under REAL ID, the Trump administration has waived dozens of laws — including the Native American Graves Protection and Repatriation Act, the Endangered Species Act, and the Environmental Protection Act — in its bid to construct the border wall.", "\"Of the 21 times the (REAL ID) waiver has been enacted since 2005, 16 of those instances have occurred in the last two and a half years,\" reads the letter Grijalva sent to Homeland Security.", "What Has CBP Done to Minimize the Impact of the Border Wall in the Organ Pipe Cactus National Monument?", "CBP does have an \"environmental monitor\" present during construction; an agency official also said that crews identify the \"best construction management practices to minimize impacts on the environment to the greatest extent possible.\"", "We reached out to CBP for more information about their efforts to minimize the environmental impact of the border wall and will update this article when more information becomes available.", "Grijalva was skeptical that these environmental monitors would do anything to prevent further damage to these sacred sites.", "Grijalva told The Intercept that he had zero faith that the Department of Homeland Security's \"environmental monitor will do anything to avoid, mitigate, or even point out some of the sacrilegious things that are occurring and will continue to occur, given the way they’re proceeding.\"", "Are Other Native American Burial or Archaeological Sites at Risk?", "Grijalva was not the first to raise concerns about the border wall's impact on the area. A 123-page internal report from the park service obtained by The Washington Post via a Freedom of Information Act request warned that the border wall's construction could damage 22 archaeological sites at Organ Pipe Cactus National Monument:", "Bulldozers and excavators rushing to install President Trump’s border barrier could damage or destroy up to 22 archaeological sites within Arizona’s Organ Pipe Cactus National Monument in coming months, according to an internal National Park Service report obtained by The Washington Post.", "The administration’s plan to convert an existing five-foot-high vehicle barrier into a 30-foot steel edifice could pose irreparable harm to unexcavated remnants of ancient Sonoran Desert peoples. Experts identified these risks as U.S. Customs and Border Protection seeks to fast-track the construction to meet Trump’s campaign pledge of completing 500 miles of barrier by next year’s election.", "Rafael, Carranza.   \"Sacred Native American Site in Arizona Blasted for Border Wall Construction.\"\r\n    Arizona Central.   7 February 2020.", "BBC.   \"Native Burial Sites Blown Up for US Border Wall.\"\r\n    10 February 2020.", "Thompson, Nigel.   \"Destroying History For a Wall: New Border Construction Threatens Native American Burial Sites in Arizona.\"\r\n    Al Dia.   10 February 2020.", "Devereaux, Ryan.   \"Trump is Blowing Up a National Monument in Arizona to Make Way for the Border Wall.\"\r\n    The Intercept.   6 February 2020.", "McNamara, Audrey.   \"Arizona National Monument, Home to Sacred Native American Burial Sites, is Being Blown Up For the Border Wall.\"\r\n    CBS News.   10 February 2020.", "Lutes-Adlhoch, MacKinley.   \"Leaders Say Border Wall Blasting Typical of Feds’ Neglect of Tribes.\"\r\n    CN News.   10 February 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]