["About this rating", "The CDC had a \"Zombie Preparedness\" section on its website, where audiences could engage with real emergency preparedness education in the context of an entertaining and tongue-in-cheek theme.", "The CDC is not encouraging anyone to prepare for a real zombie apocalypse. The campaign has also been retired as of early 2022.", "As if the Centers for Disease Control and Prevention (CDC) didn’t have enough on its hands with the COVID-19 pandemic, it also offers guidance in the event of a zombie apocalypse. Many online users started sharing the guide in March 2021, but the CDC has actually had it on its website for a few years.", "The guide begins with the disclaimer that this is a \"tongue-in-cheek campaign,\" but that the CDC found it useful as a platform to help audiences, especially students, learn about real disaster response and preparedness through creative means:", "Wonder why zombies, zombie apocalypse, and zombie preparedness continue to live or walk dead on a CDC web site? As it turns out what first began as a tongue-in-cheek campaign to engage new audiences with preparedness messages has proven to be a very effective platform. We continue to reach and engage a wide variety of audiences on all hazards preparedness via “zombie preparedness”.", "The page has lesson plans and activities for classrooms, a Zombie preparedness graphic novel, and more. In one blog post, CDC outlines what you need to do “before zombies … or hurricanes or pandemics for example, actually happen.” One of these things include gathering essential supplies:", "As of early 2022, the CDC had \"retired\" the campaign. As such we rate this claim as \"Outdated.\"", "20 July 2022: Updated rating to \"Outdated.\"", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]