["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Maricopa County Elections Department said it has a surveillance recording of a man rummaging through a dumpster outside of its office and attempting to gain entry into its warehouse.", "The department says all voted ballots from the 2020 election are sealed in a locked indoor vault, awaiting shipment for an audit by the state Senate, that none are kept in the warehouse and none have been shredded.", "Did someone’s dumpster dive outside the Maricopa County Elections Department in Phoenix, Ariz., turn up evidence of shredded ballots cast in the 2020 presidential election?", "That’s what an article and photos published by The Gateway Pundit, a conservative website, contend.", "The March 6 article, widely shared on Facebook, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "\"Piles of shredded ballots were located today in a dumpster in Maricopa County, Arizona,\" reads the first paragraph of the story. \"This find occurs only days before the Senate’s audit of the county’s 2020 election results is due to start.\"", "We found the evidence didn’t hold up to scrutiny.", "The article includes a photo of an unidentified man standing inside a dumpster wearing jeans and a blue polo shirt. In another, the man poses next to a table top and kitchen counter covered with shredded paper that appears to have been spilled from a yellow plastic bag. A third photo shows a close-up of strips of paper that appear to say Maricopa County Elections Department in Spanish.", "Those photos, as well as dozens more, were posted on Facebook by someone named Staci Burk. Her post, which appeared the same day as the Gateway Pundit article, indicates she was with the man in the photo, reads: \"Ballots shredded and in dumpsters behind the Maricopa County Ballot tabulation center. Physical evidence collected. Went to three different dumps after that tracking down the other bags. Wrapped up physical evidence collection with a Purple Heart Vet willing to dumpster dive for his Country. This is 510 S. 3rd Ave, Phoenix, AZ.\"", "Burk filed a lawsuit alleging widespread fraud in Arizona in the November 2020 election. It was dismissed. A judge found the suit \"sorely wanting of relevant or reliable evidence\" and that Burk didn’t have legal standing to sue because she wasn’t a registered voter.", "Maricopa County Elections Department spokeswoman Megan Gilbertson told PolitiFact that surveillance video captured images of the man who is pictured in The Gateway Pundit article in a dumpster outside of the department and attempting to get inside its warehouse on March 5 and 6. She said she doesn't know the man’s identity, but that the department would be contacting law enforcement officials.", "Gilbertson said sample ballots and other miscellaneous election materials are kept in the warehouse and could have been in the warehouse dumpster, but not cast ballots. All ballots that have been cast are kept in an indoor vault, she said, and surveillance footage shows no outsider gained entry to it.", "A judge ruled Feb. 26 that Maricopa County must turn over the 2.1 million cast ballots from the November election to the Arizona Senate so that the Senate can conduct an audit. Senate leaders have said they are unsatisfied with the county's multiple pre- and post-election audits, according to news reports.", "The Maricopa County Board of Elections, composed of four Republicans and one Democrat, voted unanimously on Nov. 20 to certify that Joe Biden defeated Donald Trump in the county.", "Biden won 1,040,774 votes, or 49.8%, in the county; Trump won 995,665, or 47.7%.", "Biden won Arizona by 1,672,143 to Trump’s 1,661,686.", "The author of the Gateway Pundit article did not reply to our email.", "An article widely shared on Facebook claimed: \"Ballots in Arizona’s Maricopa County\" from the 2020 presidential election \"found shredded and in dumpster days before Senate audit to begin.\"", "The county elections department said it has a surveillance recording of a man rummaging through a dumpster outside of its office and attempting to gain entry into its warehouse.", "The department says all voted ballots from the 2020 election are sealed in a locked indoor vault, awaiting shipment for an audit by the state Senate, that none are kept in the warehouse and none have been shredded.", "We rate the statement False.", "Help shape our fact-checking! Take PolitiFact’s reader survey now >>", "Facebook post, March 6, 2021", "Facebook, Staci Burk post, March 6, 2021", "Interview, Maricopa County Elections Department communications director Megan Gilbertson, March 8, 2021", "Arizona Republic, \"Arizona judge scraps election fraud lawsuit in which plaintiff was not a registered voter,\" Dec. 15, 2020", "Arizona Republic, \"Judge rules Maricopa County must provide 2020 ballots to Arizona Senate for audit under subpoenas,\" Feb. 26, 2021", "Maricopa County Recorder, official county results of Nov. 3, 2020 election, accessed March 8, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]