["About this rating", "Images circulating on social media of police cars in Ontario with Arabic lettering are real and unaltered.", "The addition of languages other than French or English to some Canadian cruisers began in 2009 and is unrelated to an influx of refugees or other events of 2016.", "In late May 2016 images of Canadian police cruisers with Arabic lettering on their sides began circulating on Facebook, alongside claims that the photographs were evidence of \"Sharia police\" slowily encroaching in Canada. While Americans were among those objecting to the images, Canadians also took umbrage to what was widely perceived as a new and unwelcome addition to police cars in the province of Ontario:", "Many outraged Facebook users described the photographs as evidence of the \"beginning\" or \"start\" of something larger and disruptive to Canadian culture:", "Some viewers suspected the images were altered, noting that the twin cruisers pictured above didn't bear the same markings and that the background vehicle lacked Arabic lettering. But the photograph was legitimate, as news coverage about the social media brouhaha revealed.", "On 2 June 2016, the CBC reported that viral Facebook posts on the subject had led to a flood of angry calls to police in London, Ontario:", "Slapping the Arabic word for police onto London patrol cars has sparked an online uproar involving thousands of social media posts.", "In the latest string of racially charged incidents in the southern Ontario city, photos of the Arabic decal were posted on Facebook May 30 by a man from Quebec.", "His comments include the statement: \"So it starts. The little toes in the door already.\"", "He also asks the question: \"Why is this acceptable?\"", "The post has already been shared nearly 12,000 times with several people adding similar xenophobic opinions. Those posts have led to dozens of calls to London police with people asking to have them removed.", "As it turns out, the images were authentic but the inferences viewers took from them were largely off-base. Many outraged callers surmised that the Arabic lettering was the result of waves of immigration entering Canada in 2015-16 from countries where that language is spoken, the police cars' modifications long antedated that flood of refugees.", "Const. Sandasha Bough told the CBC that the addition of other languages to police cruisers began several years ago and wasn't restricted to Arabic:", "Bough explains to callers ... Arabic is just one language chosen in a larger campaign, started back in 2009, but it is the only one to draw criticism.", "Using figures from Statistics Canada, officials selected the most frequently used languages for the stickers, including Vietnamese, Chinese, Persian and Polish.", "This rumor came on the heels of a similar refugee-related rumor in Canada, holding that the Fort McMurray  wildfire was the work of Islamic State (or ISIS) terrorists.", "CBC News.   \"Arabic Decals on London Police Cruisers Spark Online Uproar.\"\r\n    2 June 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]