["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A person is taken on a stretcher into the United Memorial Medical Center after going through testing for COVID-19 on March 19, 2020, in Houston. (AP)", "The coronavirus is real and infecting thousands of people around the world.", "As of March 19, COVID-19 had infected more than 191,000 people around the world and resulted in 7,807 deaths.", "Since January, PolitiFact has fact-checked more than 100 claims about COVID-19. Some of the falsehoods, such as conspiracy theories about the virus’ spread, are quite elaborate.", "A more recent Facebook post is not one of those claims.", "In a March 19 post, a Facebook user said the coronavirus doesn’t actually exist.", "\"There is no virus,\" the user wrote in all capital letters. \"The government is trying to enforce martial law and place a chip inside of us as a ‘vaccine.’\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It had more than 8,000 shares as of March 19.", "(Screenshot from Facebook)", "The post is bogus — it’s similar to a conspiracy theory that falsely claims the media and politicians have fabricated the threat of COVID-19. There is ample evidence that the coronavirus is real and infecting hundreds of thousands of people around the world.", "Scientists have traced the first confirmed case of COVID-19 to Hubei Province, China, in November. Several news outlets covered the subsequent outbreak in the city of Wuhan, the epicenter of the coronavirus pandemic.", "From there, the coronavirus spread to more than 100 countries around the world. As of March 19, more than 191,000 people had been infected and 7,807 had been killed by the virus, according to the World Health Organization.", "Footage from a variety of news outlets has documented the spread of COVID-19. Scientists have isolated the genetic data and approximate origin of the virus, as well as how different groups of people are affected. They’ve also released microscopic images of coronavirus virions.", "RELATED: 7 ways to avoid misinformation during the coronavirus pandemic", "According to the Centers for Disease Control and Prevention, COVID-19 is a betacoronavirus like Severe Acute Respiratory Syndrome (SARS) and Middle East Respiratory Syndrome (MERS). All three have their origins in bats and cause symptoms like cough, shortness of breath and fever. COVID-19 is a \"novel,\" or new, coronavirus, meaning it had not been previously identified.", "The WHO has declared the COVID-19 outbreak to be a pandemic and global health emergency. On the advice of health officials, several countries — including France, Italy and Spain — have ordered nationwide lockdowns to prevent the spread of the virus. Coronavirus prevention measures have caused the plunge of global financial markets, as well as layoffs across the country.", "To claim that the virus at the center of the pandemic does not exist, as the Facebook post does, is inaccurate and ridiculous. We rate it Pants on Fire!", "The Atlantic, \"Coronavirus: Photos From Wuhan Under Quarantine,\" Jan. 27, 2020", "Business Insider, \"Pictures show the first coronavirus patients arriving at the new Wuhan hospital China panic-built in 10 days,\" Feb. 5, 2020", "CBS News, \"Coronavirus patients describe symptoms,\" March 17, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 Basics, accessed March 19, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Situation Summary, March 18, 2020", "Centers for Disease Control and Prevention, Coronavirus Disease 2019 (COVID-19): Symptoms, accessed March 19, 2020", "Centers for Disease Control and Prevention, Image Library, accessed March 19, 2020", "Centers for Disease Control and Prevention, \"Severe Outcomes Among Patients with Coronavirus Disease 2019 (COVID-19) — United States, February 12–March 16, 2020,\" March 18, 2020", "Chinese Center for Disease Control and Prevention, \"Vital Surveillances: The Epidemiological Characteristics of an Outbreak of 2019 Novel Coronavirus Diseases (COVID-19) — China, 2020\"", "Deutsche Welle, \"China investigates SARS-like virus as dozens struck by pneumonia,\" Dec. 31, 2019", "Facebook post, March 19, 2020", "Nature, \"The proximal origin of SARS-CoV-2,\" March 17, 2020", "NPR, \"Coronavirus: COVID-19 Is Now Officially A Pandemic, WHO Says,\" March 11, 2020", "Osong Public Health and Research Perspectives, \"Identification of Coronavirus Isolated from a Patient in Korea with COVID-19,\" February 2020", "PolitiFact, \"How the coronavirus shook the stock market, explained,\" March 10, 2020", "PolitiFact, \"Rush Limbaugh is spreading a conspiracy theory about the coronavirus and Trump’s re-election,\" Feb. 27, 2020", "Reuters, \"Chinese officials investigate cause of pneumonia outbreak in Wuhan,\" Dec. 31, 2019", "South China Morning Post, \"Coronavirus: China’s first confirmed Covid-19 case traced back to November 17,\" March 13, 2020", "South China Morning Post, \"Hong Kong takes emergency measures as mystery ‘pneumonia’ infects dozens in China’s Wuhan city,\" Dec. 31, 2019", "The Straits Times, \"China probes pneumonia outbreak for Sars links: State media,\" Dec. 31, 2019", "The Wall Street Journal, \"Call It a Layoff, a Furlough or a Cut Shift: Americans are Losing Work,\" March 18, 2020", "The Wall Street Journal, \"Italy Hardens Nationwide Quarantine,\" March 11, 2020", "The Washington Post, \"Empty streets and disrupted lives: A world in the wake of coronavirus,\" March 13, 2020", "The Washington Post, \"Spain, France take drastic measures to fight coronavirus; Georgia delays presidential primary,\" March 14, 2020", "World Health Organization, Coronavirus disease 2019 (COVID-19) Situation Report – 58, March 18, 2020", "World Health Organization, Report of the WHO-China Joint Mission on Coronavirus Disease 2019 (COVID-19), February 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]