["A video of a man praising Prime Minister Narendra Modi is currently viral on social media with claims suggesting that the man is Rajasthan Deputy CM Sachin Pilot’s father-in-law. The caption attached to the video is – “सचिन पायलट के ससुर जी क्या बोल रहे हैं सभी युवा साथियों देख लो ब्रेकिंग न्यूज़ (All young friends, watch what Sachin Pilot’s father-in-law is saying. Breaking news.)”", "सचिन पायलट के ससुर जी क्या बोल रहे हैं सभी युवा साथियों देख लो ब्रेकिंग न्यूज़", "Posted by We Support Modi on Monday, 17 December 2018", "Several individual users have widely circulated the video. From the account of one Subhash Jatre, it has over 1 lakh views and nearly 5,000 shares. Multiple right-wing pages have also shared the video (1, 2) with the identical narrative.", "Alt News found that the video has been circulated on Twitter as well. A user followed by PM Modi and Railway Minister Piyush Goyal’s Office has also circulated the video.", "सचिन पायलट के ससुर जी क्या बोल रहे हैं सभी युवा साथियों देख लो ब्रेकिंग न्यूज़ ll@BJP4Gujarat @BJP4India @AmitShah @amitmalviya @AmitThakerBJP @iPankajShukla @ParasKGhelani @Jitulaljamnagar @jitu_vaghani @Satishsanadhya @raviranabjp @hakubhajadeja @rcfalduofficial @mpvadodara pic.twitter.com/0fykX1Q5s1", "— Manish P Pandey (@ManishKBJP) December 13, 2018", "The oldest instance of the video we could find on social media was December 4.", "#सचिन पायलट के ससुर जी क्या बोल रहे हैं सभी युवा साथियों देख लो ब्रेकिंग न्यूज़ @abpnewshindi @ZeeNews @RahulGandhi @APanagariya @ArvindKejriwal @yadavakhilesh @SachinPilot @narendramodi @myogiadityanath pic.twitter.com/VbWgSsHqhJ", "— gaurav kumar dubey (@gauravkumardub1) December 4, 2018", "Sachin Pilot is married to Sara Abdullah, the daughter of J&K National Conference chief and ex-Chief Minister of J&K Farooq Abdullah, which makes Pilot his son-in-law. Sara was married to him in 2004.", "The man in the viral video bears no resemblance to Abdullah, as seen in the collage below.", "The video of a person whose identity we are yet to ascertain (and will update the article when we do) was viral as Sachin Pilot’s father-in-law praising PM Modi. Since the conclusion of the recent assembly elections, misinformation targetting the Congress has surged. Earlier, a false claim of Sachin Pilot blackening the poster of PM Modi was viral on social media. In many other instances of misinformation, claims of Pakistani flags and pro-Pakistan slogans raised in Congress rallies were widely in circulation.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]