["About this rating", "In January 2020, readers inquired about the accuracy of an article that claimed U.S. Rep. Ilhan Omar, D-Minn., had given Iran \"military advice,\" committing treason against the United States.", "On Jan. 7, the right-wing website PJ Media published an article with the headline \"Treason? Ilhan Omar Gives Iran Military Advice, Suggests It Could Target Trump Hotels.\" The article reported that:", "The inspiringly patriotic Rep. Ilhan Omar (D-Tehran, no, check that, I’m hearing she’s from Minnesota) tweeted Monday offering some unsolicited military advice to the Islamic Republic of Iran: “Trump needs to immediately divest from his businesses and comply with the emoluments clause. Iran could threaten Trump hotels *worldwide* and he could provoke war over the loss of revenue from skittish guests. His business interests should not be driving military decisions.” She also tweeted a video in which the late comedian George Carlin asserts that the U.S. is “not very good at anything” besides war. And so once again we have to ask the by-now-familiar question: Is Ilhan Omar a traitor who hates America?", "Omar’s warning that Trump’s “business interests should not be driving military decisions” makes no sense, because clearly the fact that Trump owns hotels that Iran could target didn’t stop him from going after Qasem Soleimani. But as far as Omar and her ideological allies are concerned, it doesn’t matter how much they have to twist their logic into pretzels to get Trump, as long as they make the president look bad.", "That imperative has now driven Omar even to give a military suggestion to a hostile foreign power. The mullahs and their henchmen haven’t said anything about targeting Trump hotels, so here is a United States congresswoman to give them a marvelous new idea about how they could murder Americans and others, and further menace the United States.", "The definition of treason is giving aid and comfort to the enemy. The leaders of the Islamic Republic of Iran order their people to chant “Death to America” in mosques every Friday, and repeatedly vow that they will ultimately destroy the United States of America and the state of Israel. They were doing this before Soleimani was killed, and they’re doing it now. How is giving them a suggestion about how they could target the United States, whether or not they have or would have thought of it themselves, not giving aid and comfort to the enemy, and hence treason?", "Omar has long been a target of misinformation and false allegations, often transparently motivated by Islamophobia and xenophobia. Those attacks escalated and intensified after she became, along with Rashida Tlaib, the first Muslim woman elected to the U.S. House of Representatives, in 2018. PJ Media's article was written by Robert Spencer, founder of the anti-Muslim JihadWatch website, who routinely conflates Islamic fundamentalist violence with any and all professions of Muslim faith, and falsely presents even moderate Muslims (such as Omar) as being part of a shadowy global conspiracy to conquer Western democracies and impose shariah law throughout the world.", "In her Jan. 6 tweet, Omar was not giving \"military advice\" to Iran, nor was she engaging in anything that remotely resembled \"treason.\" That her remarks were singled out by critics did not provide evidence of any anti-Americanism on her part, but rather constituted an elegant illustration of the distortion and double standards to which she is routinely subjected.", "On Jan. 6, in the aftermath of the U.S. assassination of high-profile Iranian Major General Qassem Soleimani, and in light of Iranian government vows to avenge his death, Omar tweeted: \"Trump needs to immediately divest from his businesses and comply with the emoluments clause. Iran could threaten Trump hotels *worldwide* and he could provoke war over the loss of revenue from skittish guests. His business interests should not be driving military decisions.\"", "Omar was not making a suggestion to Iran, she was articulating an analysis — that Iran, in seeking revenge for Soleimani's assassination, could potentially target Trump-branded hotels around the world. The same rather obvious point had already been made on several occasions by several other observers in the days between Soleimani's assassination and the congresswoman's tweet.", "For example, the right-leaning Washington Times cited several security experts as cautioning that Trump hotels and properties could be subject to Iranian revenge attacks. Among them was former FBI Assistant Director Lewis Schiliro, who headed the agency's New York field office and supervised the investigation into the 1993 World Trade Center bombing. On the subject of potential attacks against Trump properties, he said: “The greater danger is the lone jihadist, someone who feels empowered based on recent events to take action, that becomes the more difficult threat to guard against.”", "On Jan. 3, Iran expert Suzanne Maloney, from the Brookings Institution, said: \"They [Iran] will look for the most opportune chance to strike back in a way that hurts President Trump personally. They take these things in a very personal fashion, and so I would assume that security all around any kind of a Trump property to be — if it has not already been — significantly enhanced.\"", "On Jan. 4, Hesameddin Ashena, an adviser to Iranian President Hassan Rouhani, prompted speculation that he was hinting at a possible avenue for retaliation, when he tweeted a link to a Forbes article that listed the locations of multiple Trump-owned properties throughout the world.", "Those concerns had already been articulated when Omar broadly reiterated them on Jan. 6. She made the additional argument that, in light of the potential threat to Trump properties, the president should divest himself of any interest in them, so as to completely avoid any possibility that his financial self-interest might influence his decision-making as regards the Iranian conflict.", "Nothing in the congresswoman's tweet indicated any measure whatsoever of encouragement of an Iranian attack on Trump properties or gratification at the prospect of such an attack, nor that she was providing advice or making a suggestion with Iran as the intended recipient. The same was true of the insights offered by Maloney, Schiliro, and several others. Therefore, the claim that Omar gave Iran \"military advice,\" and that she had engaged in treason, was false.", "The fact that PJ Media leveled those accusations against Omar, but not against Schiliro or Maloney, for example, and that other websites scrutinized her pronouncements, but not theirs, provided a stark illustration of the distortions and double standards to which the Minnesota congresswoman is routinely subjected.", "Publicly (and falsely) accusing a Muslim, foreign-born U.S. congresswoman of treasonously providing military advice to Iran also had the  predictable effect of prompting some observers to encourage violence against her. Among the user responses to PJ Media's Jan. 7 Facebook post promoting Spencer's article, Snopes found 131 comments, some of them particularly graphic and disturbing, that encouraged, threatened, or expressed a wish for violence, execution, death, disease, or murder against Omar or her family members. Some of those comments had been allowed to remain on the page for five days. A small selection of them can be found here.", "Spencer, Robert.  \"Treason? Ilhan Omar Gives Iran Military Advice, Suggests It Could Target Trump Hotels.\"\r\n  PJ Media.  7 January 2020.", "The Anti-Defamation League.  \"Stop Islamization of America (SIOA).\"  \r\n  2013.", "Karimi, Nasser and Jon Gambrell.  \"Iran General Replacing Soleimani Vows Revenge for US Killing.\"\r\n  The Associated Press.  6 January 2020.", "Boyer, Dave and Tom Howell Jr.  \"'Low-Hanging Fruit': Trump Properties Around World at Risk of Iranian Revenge Attack.\"\r\n  The Washington Times.  6 January 2020.", "Stickings, Tim.  \"Mar-a-Lago in the Firing Line: Iranian Presidential Advisers Posts List of Donald Trump's Properties...\"\r\n  The Daily Mail.  6 January 2020.", "Forbes.  \"The Definitive Net Worth of Donald Trump.\"\r\n  September 2019.", "Calabrese, Dan.  \"Ilham Omar: 'Nice Hotels You've Got Around the World, Trump...Be a Shame If Iran Attacked Them.\"\r\n  HermanCain.com.  7 January 2020.", "Geller, Pamela.  \"Jihad-Rep Ilhan Omar Signals Iran: 'Nice Hotels You've Got Around the World, Trump...Be a Shame If Iran Attacked Them.\"\r\n  Geller Report.  7 January 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]