["The video was published here on Facebook on April 1, 2020. It has been viewed more than 63,000 times and shared more than 2,800 times.", "The two-minute seven-second video, which loops to repeat the clip, shows a boy talking to a woman in the background while repeatedly pointing to the sky and was later hugged by an older crying boy.", "The post’s Malay-language caption translates to English as: “In Italy,  a child is looking for his mother who died due to Convid19. His older brother says their mother is up in the sky then the child shouts calling for his mother in the sky. Feel so sad.”", "As of May 21, 2020, more than 228,000 people were confirmed cases of COVID-19 and over 32,000 have died from the disease, according to this situation report update from the Italian Ministry of Health.", "The footage, alongside a similar claim in Malay, has been viewed more than 110,000 times and shared more than 3,300 times after it appeared here, here and here on Facebook; and here and here on YouTube.", "It has been shared in various languages including Arabic here, here and here; and Bengali here.", "The claim is false. The boy can be heard speaking Spanish in the video; the footage has circulated online before Italy recorded its first COVID-19 death in February 2020.", "On February 21, 2020, Adriano Trevisan, a 78-year-old retired bricklayer in northern Italy, became the first European who died from the novel coronavirus disease, or COVID-19, according to this report from AFP.", "Le vendredi 21 février, Adriano Trevisan s'éteint dans un hôpital proche de Padoue (nord), premier mort du coronavirus en Europe. Près de 5.000 décès plus tard, l'Italie d'il y a un mois appartient au passé ➡️https://t.co/erVO2bWRwQ par @ngaudich et @alexandriasage #AFP pic.twitter.com/YlXa2yFrfE", "Throughout the video, the boy in the video can be heard conversing in Spanish, not Italian.  Translated from Spanish to English, he can be heard saying: “Look, there is my mum.” The lady who is apparently recording, asks: “Which one is your mum, dear?” to which the boy replies: “The one that shines.” Then, he says he's going to talk to her and starts screaming: “Mum!”", "A reverse image search on Google based on screenshots extracted from the video in the misleading post traced it back to the earliest version of the 54-second clip published on February 16, 2020, here and here on YouTube.", "It was later published on the Instagram post of a Spanish-language radio show in the United States called “El Show del Piolin” on February 18, 2020.", "The caption on the Instagram post, translates in part to English as: “Boy says he sees his mother in heaven.”", "A further keyword search on Google found this article published on February 18, 2020, from Elsalvador.com, a news website from El Salvador.", "The title, translated from Spanish to English, reads: “VIDEO: The emotional video of a kid  talking to a star because he thinks it is his dead mum.”", "The first two paragraphs read: “A three-year-old kid appears in a touching video that has recently gone viral on social media. In it, you can see the kid shouting at a star thinking that it is his dead mother, looking at him from the sky.", "“The home-made video, for which we don't know the date nor the location, touched many users on social media.”", "Another article here from Peru-based Mag El Comercio mentioned that the video could have been filmed in El Salvador.", "AFP has not been able to independently verify that it was filmed in El Salvador.", "The same video has been fact checked here in Arabic by AFP.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]