["By Robert Farley", "Posted on May 13, 2020", "President Donald Trump falsely claims that Democrats propose “doubling, tripling, quadrupling your taxes” and that presumptive Democratic presidential nominee Joe Biden’s plan specifically would result in “doubling and tripling your taxes.”", "Biden proposes to raise an additional $4 trillion in taxes over the next decade, but the increases would fall mainly on very high-income earners and corporations, and would not nearly double, let alone triple or quadruple, people’s taxes at any income level (on average), according to analyses of Biden’s plan by the Penn Wharton Budget Model, the Tax Policy Center and the Tax Foundation.", "Although there conceivably could be rare cases in which a taxpayer inheriting capital assets could see federal taxes double or triple under Biden’s plan, the vast majority of Americans would see increases of less than 6%. And even the top 1% of earners — who would bear the brunt of Biden’s increases — would see an increase of about 40%, on average, according to the Tax Policy Center. That’s less than half a doubling of their taxes, and again, that’s only for the top 1% of earners.", "“PWBM’s analysis projects that the Biden tax plan would not double anyone’s taxes, even the highest earners,” Kent Smetters, a professor of business economics and public policy at the University of Pennsylvania’s Wharton School, told us via email.", "Trump’s comments came as the president predicted the economy would rebound dramatically next year — but only if he is reelected. On “Fox & Friends” on May 8, Trump claimed if Biden becomes president, he would “[gum] up the works.”", "Trump, May 8: Fourth quarter — I think — is going to be very good. And I think next year we’re going to have one of the best years we’ve ever had. If you don’t have somebody getting in and gumming up the works and doubling and tripling your taxes like Sleepy Joe wants to do. He has no idea what he is doing.", "Three days later at a White House press conference, Trump again forecast “a phenomenal year next year” unless a Democratic administration “messes it up by coming along and raising taxes, doubling, tripling, quadrupling your taxes.”", "It’s true that Biden, the former vice president, proposes to increase tax revenue by as much as $4 trillion over 10 years. The three main provisions of his plan include:", "(There are numerous other smaller, proposed tax changes, highlighted in Table A1 of the Tax Policy Center report.)", "Although the individual and payroll tax increases would fall almost entirely on high-income earners, the plan to increase the corporate tax rate would impact all workers, according to the Penn Wharton Budget Model, Tax Policy Center and Tax Foundation analyses. All of the models assume that some portion of the corporate tax increase will fall on labor.", "The Penn Wharton model, for example, assumes 25% will fall on labor, while the Tax Policy Center assumes 20%. As a result, all of the models project that Biden’s plan would — on average — result in tax increases in every income group.", "But it’s a huge stretch to say that Biden’s plan would double, triple or quadruple people’s taxes.", "According to the Penn Wharton Budget Model analysis of Biden’s plan, the middle 20% of income earners would see a $180 tax increase in 2021, reducing their after-tax income by 0.4%. The top 0.1% of earners would, on average, pay an additional $1.3 million in 2021, reducing their after-tax income by 17.7%.", "“PWBM projects that the top 0.1% of income earners would bear 53.9% of the tax increase, reducing their after-tax income by 17.7%. Around 87 percent of the tax increase would be borne by households in the top 5% of the income distribution,” Smetters told us.", "The Tax Policy Center’s analysis reached similar conclusions. It found that Biden’s tax plan would lower after-tax incomes by 3.1%, or about $2,600, on average for all taxpayers (See Table 2).", "“On average, every income group would pay more in taxes,” Howard Gleckman, a senior fellow in the Urban-Brookings Tax Policy Center at the Urban Institute, told us via email. “But except for high-income households, their tax increases would be very small.”", "On average, people in the first four income quintiles, people making less than $169,500, would see an average federal tax increase between 2.6% and 5.9%, according to the Tax Policy Center. That’s a fraction of “doubling” their taxes, as Trump claimed, for 80% of Americans.", "Even those at the top would not see their taxes double, on average, according to the Tax Policy Center’s analysis. The top 20% of earners would, on average, see their taxes increase by 18.2%. The biggest hit would be for the top 0.1% of earners, those making more than $3.67 million, who would see their federal taxes increase by 53.4%. That’s only halfway toward doubling.", "According to Gleckman, Biden’s plan “would raise average effective federal tax rates (including income, payroll, estate and excise taxes) by 2.5 percentage points, from about 18.9 percent to 21.4 percent. This is not remotely close to ‘doubling or tripling your taxes.'”", "And, Gleckman said, “the average is misleading. Three-quarters of these tax increases would be paid by the top 1 percent (those making $837,000 or more).” Low and moderate income households, he said, “would see very little change in their federal tax bills. Middle income people would pay about $260 more than under current law. Biden would raise their average federal tax rate by 0.4 percent, to 14.5 percent.”", "“While the Top 1 percent would pay significantly more than under current law, even their average tax bill would not double,” Gleckman said. “We project Biden would raise their average federal tax rate by 16.3 percent, from 30.4 percent to 46.7 percent.”", "Karl Smith, vice president of federal tax and economic policy at the business-backed Tax Foundation, told us that there are rare circumstances in which someone could see the tax burden triple under Biden’s plan.", "“So given that there are nine different major tax increases that Biden has proposed it’s possible that for uniquely situated taxpayers various proposals could interact to produce a tripling of their burden,” Smith told us via email. “However, the only straightforward way something like this could happen would be as a result of the step-up in basis on capital gains.”", "As part of a health plan Biden unveiled in July, he said he would restore the top marginal income tax rate to 39.6% and increase the top marginal tax rate on long-term capital gains to 39.6% for taxpayers earning more than $1 million annually. Biden also has called for ending a tax break called “stepped-up basis” that allows some heirs to inherit investments without paying taxes on the capital gains earned.", "“So for a couple that inherits $20 million or less in capital assets (say stock) they can currently sell immediately tax free,” Smith said. “They are under the inheritance tax threshold and the calculation for how much they have gained on the asset starts at the time they inherit it. So, if they sell it immediately there is no gain to be taxed and no inheritance tax to be paid. Biden would move the basis to whatever the asset was originally bought for. So, if that was $5 million then they now owe capital gains tax on $15 million. In addition he would increase the rate to 39.6% on $14 million of that from a current 20% rate.”", "“That would be around $5.8 million in new taxes they would pay that year which is probably much higher than what they would have paid,” Smith said. “Though we can’t know what they would have paid without knowing all their other sources of income.”", "“So, in that case it’s possible [for someone’s taxes to be tripled],” Smith said.", "That, however, is an anomaly.", "“In general though there is no other class of taxpayer that would see such an increase,” Smith said. “On average the top 1% of tax payers would see their tax burden rise by a little over a third.”", "Gleckman at the Tax Policy Center generally agreed.", "While it’s “certainly conceivable that some taxpayers could see their taxes double, average tax increases would be far lower than [Trump] claims,” Gleckman said. “Even for the very rich.”", "As for the effect on the economy, the Penn Wharton Budget Model  predicts that Biden’s tax plan would reduce the gross domestic product by 0.6% in 2030. The Tax Foundation forecasts it would reduce GDP by 1.51% over the 2021 to 2030 period. The Tax Foundation analysis also concluded Biden’s plan, over 10 years, would lead to 585,000 fewer full-time equivalent jobs. For context, the U.S. lost 20.5 million jobs in April amid the coronavirus pandemic, according to the Bureau of Labor Statistics.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]