["By Eugene Kiely, Lori Robertson, Robert Farley and D'Angelo Gore", "Posted on December 3, 2020", "In what he billed as perhaps “the most important speech I’ve ever made,” President Donald Trump continued his attempt to deceive the American public into believing the election was “rigged.”", "Trump has presented no evidence for such an explosive charge. Nor have his lawyers, who have admitted as much in some of their many dismissed lawsuits. Instead, the evidence shows Trump is inventing and pushing conspiracy theories and other false and misleading claims in an unrelenting attack on U.S. elections.", "We’ve fact-checked his false claims about voter fraud for months, and even years, dating back to the 2016 campaign, long before he lost his reelection bid to President-elect Joe Biden. But on Dec. 2, 49 days before he is set to leave office, Trump once again repeated a slew of assertions in a nearly 46-minute video he posted to social media.", "The speech came one day after his own attorney general, William Barr, rebutted his claims, saying the Department of Justice and FBI “have not seen fraud on a scale that could have affected a different outcome in the election.”", "Here are 19 false or misleading claims the president made during the speech. It is by no means an exhaustive list.", "Not ‘overwhelming’ evidence: The president boasted that his legal team has collected “overwhelming” evidence of fraud. “Everyone is saying, ‘Wow, the evidence is overwhelming,’ when they get to see it,” he said. Judges, however, have found the evidence less than overwhelming.", "For example, U.S. District Judge Matthew Brann criticized the Trump campaign for failing to provide evidence to justify blocking Pennsylvania from certifying its election results. In dismissing the case, Brann said: “One might expect that when seeking such a startling outcome, a plaintiff would come formidably armed with compelling legal arguments and factual proof of rampant corruption.” Brann continued, “Instead, this Court has been presented with strained legal arguments without merit and speculative accusations, unpled in the operative complaint and unsupported by evidence.”", "The Trump campaign appealed Brann’s decision to the 3rd Circuit Court of Appeals, but the three-judge panel unanimously upheld the lower court ruling. Judge Stephanos Bibas, a Trump appointee, wrote: “Charges of unfairness are serious. But calling an election unfair does not make it so. Charges require specific allegations and then proof. We have neither here.”", "In Michigan, the Trump campaign sued to stop the counting of mail-in ballots in Wayne County, which includes Detroit, and block the certification of the county’s election results. The lawsuit included an affidavit from a poll watcher who claimed she heard from another poll worker that other poll workers were told to change the dates on late ballots. The state judge who ruled against the campaign called the affidavit “inadmissible hearsay within hearsay.”", "There are ‘safeguards’: Trump wrongly claimed there were “no safeguards” used by states to check the identity of voters. “While it has long been understood that the Democrat political machine engages in voter fraud from Detroit to Philadelphia, to Milwaukee, Atlanta, so many other places,” Trump said, “what changed this year was the Democrat Party’s relentless push to print and mail out tens of millions of ballots sent to unknown recipients with virtually no safeguards of any kind.”", "Only nine states and the District of Columbia sent mail-in ballots to all registered voters, and the states home to the cities mentioned by Trump — Michigan, Pennsylvania, Wisconsin and Georgia — were not among them. As for safeguards, most states use bar codes on mail-in ballots matched to a specific person in the voter files; ballot envelopes require personal information, such as date of birth or driver’s license numbers; and signatures are required and matched against ones on file.", "Dominion Voting Systems: Trump again made the bogus claim that Dominion Voting Systems technology, certified by 28 states, switched votes. “Its name is Dominion, with the turn of a dial or the change of a chip, you could press a button for Trump and the vote goes to Biden,” Trump said. Multiple experts, including Attorney General Barr, have debunked this conspiracy theory.", "Barr said the Department of Homeland Security and Justice Department looked into such claims and “we haven’t seen anything to substantiate that.” A group of federal, state and local officials overseeing the nation’s voting system also refuted such claims.", "Trump added that “the only secure system is paper,” but 95% of ballots did have a paper record, said Christopher Krebs, the head of DHS’ Cybersecurity and Infrastructure Security Agency whom Trump fired after the election. That’s up from 82% of ballots in 2016 and “one of the keys to success for a secure 2020 election,” Krebs said.", "Vote counting: In describing Dominion as a “disaster,” Trump asked “where are the votes counted?” He answered his own question by repeating a fantastical false claim: “Which we think are counted in foreign countries, not in the United States.”", "“I don’t understand this claim,” Krebs said, when asked about it in a “60 Minutes” interview that aired Nov. 29. “All votes in the United States of America are counted in the United States of America. Period.” Dominion said in a statement, “Votes are not processed outside the United States. Votes are counted and reported by county and state election officials — not by Dominion, or any other election technology company.”", "Human error in Michigan: Trump inaccurately used a case of human error — by a Republican county clerk, no less — to falsely suggest widespread voter fraud. “In one Michigan County, as an example, that used Dominion systems, they found that nearly 6,000 votes had been wrongly switched from Trump to Biden, and this is just the tip of the iceberg,” Trump said. “This is what we caught. How many didn’t we catch?”", "The facts: A day after the election, Antrim County in Michigan reported that Biden was ahead of Trump by about 3,000 votes, with 98% of votes counted. Election officials, surprised that Biden could win a Republican-leaning county, found it was a case of human error and Trump was actually leading by about 2,500 votes. The county clerk “accidentally did not update the software used to collect voting machine data,” the Michigan Department of State, which oversees the state’s elections, said in a statement.", "Antrim County Clerk Sheryl Guy, a Republican, said the error in unofficial results would have been caught during the county canvass process when certifying votes. “I must emphasize that the human error did not in any way, shape or form affect the official election results of Antrim County,” she said at a state legislative hearing.", "Poll observers present: Trump has repeatedly, falsely claimed that votes were counted without Republican poll observers present. His own lawyer admitted in court that observers were there. “In Pennsylvania, large amounts of mail-in and absentee ballots were processed illegally. And in secret, in Philadelphia, in Allegheny counties, without our observers present,” Trump claimed.", "Trump campaign lawyer Jerome Marcus admitted under questioning by a Republican-appointed U.S. district judge that there were GOP observers present — saying there were “a nonzero number of people in the room.”", "Half of Detroit registered voters voted: Trump falsely claimed that in Detroit, “there were more votes than there were voters. Think of that. You had more votes than you had voters.” Nearly 50% of the city’s 504,714 registered voters cast a ballot, according to the city’s unofficial election results.", "Trump appears to be talking about a minor issue with out-of-balance precincts. In Detroit, the number of ballots cast versus the number of voters checked into polling precincts differed by a mere 357, Mayor Mike Duggan said on Nov. 18. Such discrepancies, which aren’t unique to this election, can occur through a scanner error or if a voter decides not to vote or spoils a ballot, meaning they ask to void the ballot and re-do their vote.", "Trump lost the state by more than 150,000 votes.", "‘Not credible’ allegations: Repeating unsupported allegations from a failed lawsuit, Trump said: “Other witnesses in Detroit also saw our election officials counting batches of the same ballots many times, as well as illegally duplicating ballots.” He also said election workers entered “fake birth dates into the system, in order to illegally count” ballots.", "Trump is referring to a lawsuit brought by Republican poll challengers that alleged widespread fraud in the counting of ballots at the TCF Center in Detroit. The suit included seven affidavits that accused Detroit election workers of “counting the same ballot more than once,” using “false information to process ballots, such as using incorrect or false birthdays,” and “improperly duplicating ballots,” among other things.", "In ruling against the Republicans, who were seeking to stop certification of the election results in the county, Wayne County Circuit Judge Timothy Kenny said the allegations made in the affidavits were “not credible” and represented a misunderstanding of the ballot tabulation process. Detroit election officials, he wrote, “offered a more accurate and persuasive explanation of activity” within the TCF Center.", "Georgia signature checks: Trump wrongly claimed Georgia didn’t properly check signatures from mail-in ballots and misleadingly claimed the signature checks were left out of the recount. “In the recent recount in Georgia, which means nothing because they don’t want to check signatures, and if you’re not going to check signatures in Georgia, it doesn’t work,” Trump said. “But we have a secretary of state, and a governor who made it very difficult to check signatures.” As we have written, Georgia election officials check signatures twice: once when a voter requests a mail-in ballot, and then again when the ballot is returned.", "Georgia Secretary of State Brad Raffensperger, a Republican, said Georgia strengthened its signature match for this election, and trained election officials on Georgia Bureau of Investigation signature-matching techniques. Trump is correct that signature checks were not part of the hand recount. Once a signature is verified on the ballot’s outer envelope, the ballot itself is separated for counting. This protects voter privacy.", "Rejected ballots in Georgia: Trump again falsely claimed that the percentage of ballots rejected in Georgia was suspiciously low. “In swing state after swing state, the number of ballots rejected has been dramatically lower than what would have been expected based on prior experience,” Trump said. “In Georgia, just 0.2%, that’s substantially less than 1%, of mail-in ballots have been rejected. In other words, almost none have been rejected. They took everything. Nothing was rejected, practically, compared to 6.4% in 2016.” As he has in the past, Trump is conflating the ballots rejected just for signature issues in this election with ballots rejected in past elections for all reasons — usually for arriving too late. The percentage of mail-in ballots rejected in Georgia due to signature issues this year was about the same as in the 2016 and 2018 general elections.", "‘Cured’ ballots: Trump wrongly claimed that in Pennsylvania, Democrats were allowed to cure their ballots — meaning voters were notified about an error in their mail-in ballot so they could fix it — but Republicans were not. “Tens of thousands of voters across Pennsylvania were treated differently based on whether they were Republicans, or Democrats,” Trump said. “Voters who submitted flawed ballots in some Democrat precincts were notified and asked to fix their ballots, while Republican precincts, and in particular Republican voters, were not so notified, which plainly violates the Equal Protection Clause of the United States Constitution.”", "As we have written, all counties got the same guidance the night before the election instructing them to notify political parties and update the ballot-tracking online system about ballot errors, thus allowing voters to cast a provisional ballot on Election Day. Some counties notified voters, and some didn’t. But that inconsistency didn’t fall strictly along partisan county lines.", "On Nov. 27, the U.S. Court of Appeals for the 3rd Circuit rejected a Trump campaign lawsuit on this issue. According to an opinion written by Judge Bibas, who, again, was appointed by Trump, the campaign’s “claims have no merit.” The complaint, “never alleges that anyone treated the Trump campaign or Trump votes worse than it treated the Biden campaign or Biden votes.”", "“A violation of the Equal Protection Clause requires more than variation from county to county,” Bibas wrote. “It requires unequal treatment of similarly situated parties. … To be sure, counties vary in implementing that guidance, but that is normal. Reasonable county-to-county variation is not discrimination.”", "Vote ‘dumps’: Trump again claimed that in Michigan, early in the morning after Election Day, “a vote dump of 149,772 votes came in unexpectedly. We were winning by a lot. That batch was received in horror. Nobody knows anything about it.”", "As we’ve written before, what appeared to be an unusually large uptick of about 140,000 votes for Biden was the result of a typo in unofficial results reported by Michigan’s Shiawassee County. The mistake was quickly corrected, the county’s elections clerk told us in a phone interview.", "Wisconsin results: Trump again questioned how he lost Wisconsin even though he was ahead in the vote count on the night of the election.", "“In Wisconsin, as an example, where we were way up on election night, they ultimately had us miraculously losing by 20,000 votes,” Trump said. “We’re leading by a lot and then at 3:42 in the morning, there was this, it was a massive dump of votes, mostly Biden, almost all Biden. And to this day, everyone’s trying to figure out, ‘Where did it come from?’”", "As we’ve written before, Trump was seemingly ahead in Wisconsin at the end of the day on Nov. 3, but that was before many of the mail-in ballots were counted. State law prevented election officials from counting absentee ballots before polls opened on Election Day.", "And no one is trying to determine where those absentee votes came from because the Milwaukee Journal Sentinel has already explained what happened. “Biden overtook Trump in the early morning hours when Milwaukee reported its roughly 170,000 absentee votes, which were overwhelmingly Democratic. Then early morning returns from Green Bay and Kenosha on Wednesday added to his slender lead. Trump had nurtured a lead of more than 100,000 votes before those returns came in,” the newspaper reported.", "Missed votes in Georgia: Trump falsely suggested that many votes from Trump supporters in Georgia remain uncounted. “Thousands of uncounted ballots were discovered in Floyd, Fayette, and Walton counties weeks after the election, and these ballots were mostly from Trump voters. They weren’t counted. They were from Trump voters,” he said.", "It’s true that almost 6,000 previously uncounted or unreported votes in those counties (and Douglas County) were discovered by officials during Georgia’s hand recount of ballots after the election. But those votes for Trump and Biden have since been included in the overall tallies and didn’t change the outcome.", "Gabriel Sterling, the voting systems implementation manager for the Georgia secretary of state’s office, said that after including those additional votes for both candidates, Biden’s lead over Trump narrowed from 14,156 votes to 12,781 votes.", "Pennsylvania ballots: Trump suggested some issues with mail-in ballots — addressed by elections officials before Election Day — were evidence of fraud. They’re not.", "“Many voters all across Pennsylvania received two ballots in the mail,” he said. In October, some voters in Allegheny and Fayette Counties received incorrectly printed ballots. In both cases, election officials issued corrected ballots and made clear: “Only one ballot will be counted for each voter,” as the statement from Allegheny County said.", "The state also contacted in October about 4,300 voters who received two ballots, due to a printing error. Department of State spokesperson Ellen Lyon told reporters any duplicate ballots were “coded for the same voter, so if a voter tried to submit more than one, the system would literally prevent the second ballot from being counted.”", "Trump further exaggerated: “In Fayette County, Pennsylvania, multiple voters received ballots that were already filled out.” In late October, the county’s district attorney’s office announced it was investigating two ballots that voters received that were already filled out. The Trump campaign cited that incident in a Nov. 9 lawsuit, which was dismissed by a federal judge and upheld by the unanimous 3rd Circuit.", "Arizona: Trump repeated a claim from another dismissed lawsuit that wasn’t about fraud. “In Arizona, in-person voters whose ballots produced error messages from tabulation machines were told to press a button that resulted in their votes not being counted,” he said.", "As we’ve written, Trump campaign lawyer Kory Langhofer stated in court that he was “not alleging fraud,” but instead was raising concerns about a “limited number of cases” involving “good faith errors.” There were 191 presidential ballots with “overvotes” — meaning more than one candidate for the same office was selected — in Maricopa County.", "No witnesses for the Trump campaign could confirm that their votes had not been recorded, and the judge dismissed the campaign’s claims as moot and with prejudice, meaning the decision cannot be retried.", "Trump lost Arizona by more than 10,000 votes.", "The president added that Arizona’s “attorney general announced that mail-in ballots had been stolen from mailboxes and hidden under a rock.” The AG did announce that 18 ballots, which weren’t opened or filled out, had been found in a field on Oct. 30. Police hand-delivered them to the voters.", "Voter rolls: As he has for years, Trump falsely equated errors on voter rolls with evidence of voter fraud. “This colossal expansion of mail-in voting opened the flood gates to massive fraud,” Trump said. “It’s a widely known fact that the voting rolls are packed with people who are not lawfully eligible to vote, including those who are deceased, have moved out of their state, and even our non-citizens of our country.” It is true that voter rolls contain errors, such as people moving to another state but not being removed from the old state’s voter rolls, or people dying but their names not being removed in a timely fashion. But that’s not fraud, unless or until someone tries to illegally vote in the wrong state, or for a deceased person.", "As we have written, voting experts say that while the instances of voter fraud via mail-in ballot are more common than in-person voting fraud, the number of known cases is relatively small.", "Wisconsin rolls: Trump claimed — with no evidence — that he “knew” a legal dispute over whether to remove more than 100,000 voters from Wisconsin voter rolls involved “illegal voters.” All those voters did was fail to respond within 30 days to a mailing saying it appeared they had moved and giving them the opportunity to continue their registration if they had not. There’s no evidence they voted illegally. The case dates back to 2019 and concerns whether the state elections commission, which found errors in such residency-change lists before, had the authority to deactivate those voters. The state Supreme Court heard arguments in late September and has yet to rule on the case.", "Not ‘statistically impossible’: Trump wrongly claimed that it was “statistically impossible” that he lost the presidential race even as Republicans had success in congressional races. “The tremendous success we had in the House of Representatives, and the tremendous success we’ve had so far in the Senate, unexpected success all over the country, and right here in Washington, it is statistically impossible that the person, me, that led the charge lost,” Trump said. It is statistically possible.", "As John McCormack wrote in National Review, “the notion that down-ballot Republicans greatly outperformed President Trump is inaccurate.” As he noted, only one Republican won a Senate race in a state lost by Trump, Susan Collins in Maine. Republicans picked up seats — but not the majority — in the House. But while Republicans fared better than polls suggested they would, it is not unusual in recent elections for House GOP candidates to fare better against their Democratic opponents “than the Republican presidential candidate performed against his Democratic opponent,” McCormack wrote.", "Election experts also attribute some of the disparity to “ballot roll-off,” which is when voters skip certain races. Barry Burden, director of the Elections Research Center at the University of Wisconsin-Madison, told us it’s not unusual for voters to “choose a candidate at the top of the ballot and then ‘roll off’ as they move down the ballot. There is nothing suspicious about lower participation in lower level races.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]