["About this rating", "In December 2020, online advertisements displayed old pictures of a drained Niagara Falls, with the words: \"Engineers Drained Niagara Falls And Saw A Truly Chilling Sight.\" Other variations included \"stomach-churning discovery\" and \"sickening discovery.\"", "Niagara Falls was indeed drained in 1969 by the Army Corps of Engineers. The American falls side was diverted to the Canadian side for several months as part of a massive \"dewatering\" project to assess erosion.", "The advertisements also mentioned that a \"chilling,\" \"nauseating,\" \"stomach-churning,\" and \"sickening\" discovery was unveiled. While those adjectives may have been subjective, it is true that two dead bodies were recovered from the bottom of the falls.", "On June 13, 1969, just one month before Apollo 11's moon landing, The Vancouver Sun published a story from The Associated Press. For context, June 13 was a Friday:", "The bodies of an unidentified man and woman have been found here in a grisly beginning to a major engineering feat that has all but halted flow of the Niagara River over the American Falls.", "Police said today the decomposed body of the woman was discovered Wednesday while they searched for the man, who was seen leaping over the precipice. His body was found Thursday.", "The water was shunted to the channel flowing over the Horseshoe Falls so engineers can study the face of the American Falls in an attempt to halt erosion.\"", "We were unable to find any information on the identity of the corpses. A list on Wikipedia included just a few of the many people who have died at Niagara Falls over the last two centuries.", "According to Wired.com, when Niagara Falls was dewatered, the Army Corps of Engineers also found millions of coins:", "When crews shut down the falls in 1969, they found two bodies and millions of coins, most of which were removed. (As were the human remains, of course.)", "But in the last 50 years, tourism at Niagara has grown wildly. The possibilities are endless — more coins, yes, but also lost cell phones, cameras, baby strollers, errant drones, and whatever else could be thrown or dropped by careless, thoughtless, or mischievous visitors.", "There is, of course, the possibility of human remains being discovered again — though there are no individuals known to have jumped or fallen in who haven’t been recovered.", "The website NiagaraFrontier.org published more information on the dewatering project, and published photographs shot by Clifford and Madeline Valentine, courtesy of Russell Glasson.", "On Feb. 8, 2020, The Buffalo News reported that two nearly 120-year-old pedestrian bridges in Niagara Falls were in need of being repaired or replaced. The bridges were situated above the rapids. Discussions were underway as to whether water would need to be diverted as it had been in 1969.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]