["3-month-old Muntasir Mahdi takes a nap on the back of Melissa Marthol at a Doula workshop on North 48th Street in Milwaukee in Nov. 2014. The training aims to create doulas to assist expectant women. (A. Peterson/Milwaukee Journal Sentinel).", "Gov. Tony Evers’ budget includes proposals on a smorgasbord of issues, from legalizing medical marijuana, to boosting the minimum wage and helping homeowners replace lead pipes.", "The governor, a Democrat, also included $28 million in new funding for the \"Healthy Women, Healthy Babies\" initiative.", "Republican lawmakers have balked at that proposal, mainly because it includes a provision to restore Planned Parenthood funding blocked under former Gov. Scott Walker.", "Democratic lawmakers held a news conference on March 12, 2019 to support the initiative, with state Rep. Shelia Stubbs, D-Madison, highlighting racial disparities in the state’s infant mortality rate.", "\"Wisconsin (has) the highest infant mortality rate for black babies nationwide,\" Stubbs declared.", "Is she right?", "The evidence", "When asked for backup, Stubbs cited a 2018 U.S. Centers for Disease Control and Prevention report.", "The report, which uses data from 2013-2015, states: \"For infants of non-Hispanic black women, the mortality rate ranged from 8.27 in Massachusetts to 14.28 in Wisconsin.\"", "\"The data should be shocking to everyone,\" Stubbs said in an email. \"But for Black families, especially Black women, this is reality. It is past time these stories are heard so we can address this traumatic and heartbreaking truth.\"", "The CDC defines infant mortality as the death of an infant before his or her first birthday. The infant mortality rate is the number of infant deaths for every 1,000 live births.", "As Stubbs noted, Wisconsin does appear at the top of the CDC list when it comes to infant mortality for non-Hispanic black women, with the following deaths per 1,000 live births:", "Wisconsin -- 14.28", "Ohio -- 13.46", "Alabama -- 13.40", "Indiana -- 13.26", "North Carolina -- 12.24", "For non-Hispanic white women, the picture shifts:", "Arkansas -- 7.04", "West Virginia -- 7.02", "Mississippi -- 6.91", "Oklahoma -- 6.86", "Kentucky and Alabama -- 6.44", "Wisconsin came in at 4.71 deaths per 1,000 live births for non-Hispanic white women, slightly lower than the U.S. rate of 4.95.", "What about the overall picture? That is, babies of all races?", "According to the Wisconsin Department of Health Services’ annual Birth and Infant Mortality Report 2016, released in July 2018:", "-- 415 infants under the age of one year died in 2016.", "-- The overall infant mortality rate was 6.2 infant deaths per 1,000 births, up from 5.7 in 2015.", "In Wisconsin, the infant mortality rate -- especially among black mothers -- is driven by what happens in the City of Milwaukee.", "In Milwaukee, experts cite stress during pregnancy as a major factor in premature births, which itself is a cause of infant mortality. The ZIP codes with the highest infant mortality rates in Milwaukee are also in the most impoverished areas and have the highest concentration of minorities living there, according to the Milwaukee Health Department’s 2017 Fetal Infant Mortality Review report.", "\"In the four year period of 2012 through 2015, the city of Milwaukee recorded 390 infant deaths and 262 stillbirths,\" the report said. \"This represents about 98 infant deaths per year and about 66 stillbirths per year during this time period. Data from 2015 alone indicate that while the city of Milwaukee had 15% of all births in the state of Wisconsin, it also had a quarter (24.7%) of all infant deaths in the state, and 21.8% of all the stillbirths in the state.\"", "According to City of Milwaukee data, the city’s overall mortality rate in 2017 was 12.6 deaths per 1,000 live births. The racial breakdown:", "Black -- 18.4", "Asian -- 11.4", "Hispanic -- 8.9", "White -- 3.6", "So, what’s being done?", "Last week, Milwaukee regained a five-year, $5 million federal grant to combat the problem — a grant Milwaukee lost five years ago.", "In 2017, Milwaukee's Westlawn neighborhood was added to a list of communities being aided by Best Babies Zone, a national effort to reduce racial disparities in infant death rates.", "Meanwhile, the Lifecourse Initiative for Healthy Families is a regional program to support African American women and their families to have healthy births. It is aimed at reducing the disparity in birth outcomes between African Americans and whites.", "On April 2, 2019, Mayor Tom Barrett signed legislation creating a joint pilot program with the Milwaukee County Department of Health and Human Services to provide doulas to 100 expectant mothers in the 53206 ZIP code.", "2017 data shows that 53206 tops the city’s infant mortality list, with the highest rates generally concentrated on the city’s economically distressed north and northwest sides:", "53206 -- 29.1", "53225 -- 26.5", "53210 -- 20.6", "53212 -- 17.6", "53216 -- 15.2", "Doulas are certified professionals trained to support expectant mothers’ nutritional, physical and mental health. Nearly all of them emphasize prenatal nutrition, breastfeeding, safe sleeping habits and stress reduction techniques.", "\"A healthy city starts with healthy moms and babies,\" Barrett said during a bill signing event at Canaan Missionary Baptist Church. The program, advocated by Ald. Khalif Rainey and Milwaukee County Supervisor Marina Dimitrijevic, will be funded with up to $100,000 from Milwaukee County.", "Evers’ plan also includes grant funding for doula training and Medicaid coverage for doula services.", "Our rating", "Stubbs said \"Wisconsin (has) the highest infant mortality rate for black babies nationwide.\"", "Data from the CDC and other sources backs her up.", "We rate the claim True.", "Milwaukee Journal Sentinel \"How much of Democratic Gov Tony Evers’ budget will survive the GOP Legislature? (Spoiler: Not much.)\" Feb. 27, 2019.", "Milwaukee Journal Sentinel \"Milwaukee has regained a key federal grant to fight infant mortality, but friction has emerged from how it came about,\" April 15, 2019.", "Wisconsin State Journal \"Tony Evers to seek $28 million for women’s health, infant mortality, Planned Parenthood,\" Feb. 22, 2019.", "Wisconsin.gov \"Gov. Evers announces ‘Healthy Women, Healthy Babies’ Initiatives in State budget,\" Feb. 21, 2019.", "The Cap Times \"Robin Vos expects Evers' budget to contain 'poison pills' preventing Republican support,\" Feb. 21, 2019.", "The Cap Times  \" Health advocates, lawmakers say Tony Evers' health care plan is needed to disrupt disparities,\" March 12, 2019.", "Centers for Disease Control and Prevention  \"State Variations in Infant Mortality by Race and Hispanic Origin of Mother, 2013–2015\" Jan. 2018.", "Email, State Rep. Shelia Stubbs, April 8, 2019.", "Kaiser Family Foundation , \"Infant Mortality Rate by Race/Ethnicity\" 2016.", "The Capt Times, \"Reps. Stubbs, Taylor, Sargent and Subeck: ‘Healthy Women, Healthy Babies’ budget initiative needed to reduce racial disparities,\" March 28, 2019.", "Milwaukee Journal Sentinel  ‘A healthy city starts with healthy moms and babies’: Mayor Tom Barrett signs measure creating doula pilot program for 53206,\"April 2, 2019.", "Statista, \"Infant mortality rate in the United States as of 2018, by state (deaths per 1,000 live births.)", "Wisconsin Department of Health Services, \"Annual Wisconsin Birth and Infant Mortality Report 2016,\" July 2018", "Lifecourse Initiative for Healthy Families", "City of Milwaukee Health Department \"Fetal Infant Mortality Review (FIMR) report 2017", "Milwaukee Journal Sentinel \"Milwaukee doulas ask for the community’s help to lower black maternal and infant mortality,\"March 18, 2019.", "Milwaukee Journal Sentinel \"Milwaukee may implement a pilot program for doulas to address infant mortality in 53206,\" March 10, 2019.", "Best Babies Zone,", "Milwaukee Journal Sentinel \"Milwaukee will gain partner in its fight to reduce racial disparities in infant mortality rate,\" Nov. 15, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]