["The video appears on this July 18, 2019 post on Facebook, where it has been watched 93,000 times.", "The caption below the 43-second clip translates as: “Where is our country’s government? Papua has been like this for a long time, why remain silent? What is the meaning, then, of ‘NKRI harga mati’?”", "“NKRI” is the abbreviation of Indonesia’s official name, the Unitary State of the Republic of Indonesia. “NKRI harga mati” means “NKRI is the non-negotiable bottom line” -- a phrase widely used to express support for the unity of Indonesia.", "Below is a screenshot of the post:", "\"Papua\" refers to Indonesia’s most easterly region, comprising Papua province and West Papua province, where Indonesian soldiers frequently clash with separatist rebels.", "AFP reports on recent clashes in Papua region can be read here and here.", "A Google reverse image search using digital verification tool InVid found this video, which includes the footage in the misleading post and was posted on the official YouTube channel of Tribun Timur -- part of the Jakarta-based Tribunnews media network -- on July 18, 2019.", "The clip posted to Facebook can be seen between 0:56 and 1:37 in the Tribun Timur video embedded below, which is just over three minutes long:", "Translated to English, the YouTube post is headlined: “VIRAL: the moment when on-duty Indonesian military officers were attacked by Serikat Mandiri Batanghari group”.", "The first paragraph says: “A video circulating widely on social media shows the moment when a group named Serikat Mandiri Batanghari (SMB) attacked some Indonesian military officers for trying to extinguish fires burning on a plot of land in Jambi, Sumatra on Saturday (13/7/2019).”", "Jambi is a province on the western Indonesian island of Sumatra.", "Below is a comparison between a screenshot taken from the Tribun Timur footage (L) and another from the same moment in the video in the misleading Facebook post (R):", "Here is a map of Indonesia, with Jambi marked in red to the left, and Papua to the right:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]