["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In November 2020, amid a global spike in COVID-19 coronavirus cases, social media users shared a meme that claimed to include a picture of Michigan Gov. Gretchen Whitmer failing to wear a face mask to protect against the virus.", "Mask-wearing as a mitigation against the spread of the pandemic has become a polarized issue, with supporters of U.S. President Donald Trump viewing them as unnecessary. So an image of Whitmer, a Democrat, not wearing a mask amid a global spike in cases in November 2020 seemed ripe for outrage.", "The picture, however, was taken in late February 2020, before COVID-19 was widespread in the U.S., before Michigan had its first confirmed case, and before masks were recommended by public health officials for the public at large. The picture was snapped by Frank Cusumano, a local elected official in Macomb Township, who told The Associated Press that he took the selfie on Feb. 24, 2020, at the Palazzo Grande, a conference and event space in the Detroit suburb of Shelby Carter Township (she can be seen mask-less in the lower left corner of the image above).", "Photographs published by the local Macomb Daily newspaper show Whitmer was attending an event for the business community in Macomb, in which she can be seen in the same room and wearing the same gold jacket as depicted in the meme.", "The meme exploited the fact that Whitmer wore the same jacket to the business event in February and again at a Nov. 15, 2020, news conference in which she announced new restrictions amid surging COVID-19 cases. At the November news conference, Whitmer wore a mask, as can be seen in the upper right corner of the image above.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]