["About this rating", "David Avocado Wolfe, an anti-pharma/anti-GMO conspiracy theorist and “celebrity pitchman” for as-seen-on-TV blenders and who, among other things, considers gravity a toxin, published an article in February 2016 titled “Beware: Top 5 Potentially Cancer-Causing Children’s Snacks Made from Petroleum-Based Products” which was subsequently made into a viral video:", "The first issue with the post is use of the term “petroleum-based”, which is simultaneously broad and misleading. The compounds Wolfe implicates are, technically speaking, petrochemical derivatives whose building blocks include one or more of the six basic organic chemicals extracted from oil or natural gas. These chemicals are necessary for most procedures involving synthetic chemistry with organic compounds. so by Wolfe's definition nearly every organic chemical you run into on a daily basis is “petroleum-based”.", "Each of Wolfe's assertions should be analyzed on its own merits, but it is worth noting that dosage is also important when it comes to the safety of any chemical. Most of the laboratory studies showing deleterious effects potentially attributed to these additives are based on absurdly high amounts of substances that could not legally found in, or practically ingested through the consumption of, food products.", "Claim: Pop Tarts contain TBHQ, which Wolfe claims causes “cellular dysfunction” and has been linked to tumors, loss of vision, liver enlargement, convulsions, and paralysis.", "UNPROVEN", "What’s true: TBHQ, or tert-Butylhydroquinone, is an antioxidant preservative found in Pop Tarts and many other foods. According to the NIH Toxicology Data Network, it has indeed been linked to tumors, vision loss, liver enlargement, convulsions, and paralysis in laboratory animals.", "What’s left out: While there have, in fact, been animal studies that report harmful effects after large doses of TBHQ, as well as a single report of vision disturbance in humans after chronic exposure to the chemical, the totality of the research on the topic provides a more complex view of the problem. Numerous studies, which the NIH Toxicology Data Network also lists, have provided data that contradict those scarier-sounding studies. The long-term health effects in humans exposed to high doses of TBQH is not a settled issue, but the long-term effects of humans exposed to it in doses legally allowed by USA and European regulatory agencies is settled — it is considered, in their eyes, safe for human consumption.", "The European Food Safety Authority (EFSA) was asked to re-evaluate this conclusion in 2004. After reviewing all the available literature on the topic, they concluded that TBHQ is “not carcinogenic and that further genotoxicity studies are unnecessary.”", "Claim: “Fruit flavored snacks” (based on the picture, we assume Wolfe means Gummi Bears and their ilk) contain Red 3 (Erythrosine), which is banned for use in cosmetics and has been linked to thyroid tumors.", "MOSTLY FALSE", "What’s True: The EU has banned Red 3 for use only as a hair dye, but this was the result of a lack of properly filed paperwork. According to the EFSA report on Red 3 as a cosmetic product, its ban as a hair dye came about “because a safety dossier supporting its use was not provided under the European Hair Dye strategy and the substance was subsequently banned for this use.”", "What’s False: Any connection to cancer and tumors stems from a study on rats which scientists later determined to be a poor analogy for comparison to consumption by humans. Both the EU and the United States consider the chemical to be non-carcinogenic and free of risk at legally allowable levels.", "Claim: M&M’s contain Blue 1 (Brilliant Blue FCF), which can trigger the development of malignant tumors.", "FALSE", "Numerous studies have failed to find a link between Blue 1 and tumor production or cancer. Both the FDA and EFSA have ruled it safe for human consumption at legally permitted amounts.", "Claim: M&Ms contain Blue 2 (Indigo Carmine), which can increase hyperactivity and has been linked to brain tumors.", "FALSE", "There is a single study showing a statistically significant incidence of tumors in male rats exposed to indigo carmine. In that same study, however, the authors concluded that the statistical elevation was not biologically significant, further noting that:", "The overall brain-tumor incidence in this study was within the range typical for 2-yr-old CD rats. Under the conditions of this study, [Blue No. 2] did not produce evidence of any toxicity, including carcinogenicity.", "There has been a large volume of work dedicated to examining the link between synthetic food coloring agents and ADHD. This work was primarily popularized by Dr. Benjamin Feingold, who developed a diet, based on his own research and popular in the 1970s and 80s, that recommended removing artificial food dyes. The research itself has been called into question by numerous scientists, however, and only one rigorous and widely-accepted study has been performed on the purported link between food dye and brain tumors, and that study did not investigate Blue 2.", "Claim: M&Ms contain Red 40 (Allura Red AC), which can damage DNA.", "UNPROVEN", "What’s True: A few studies have shown a possible connection between Red 40 and damage to colon DNA in laboratory animals.", "What’s Left Out: Studies showing adverse effects are widely outnumbered by studies showing no toxic, carcinogenic, or genetic effects from Red 40.", "Claim: M&Ms contain Yellow 5 (Tartrazine) and Yellow 6 (Sunset Yellow FCF), which have both been linked to cancer.", "FALSE", "No laboratory studies on animals have shown any link between Yellow 5 and cancer, though it does belong to a class of chemicals that includes some carcinogens. No human studies have been performed on the compound and most world regulatory agencies consider Yellow 5 to be safe for human consumption. Countries that do ban its use do so because of its potential to cause anaphylactic shock in people with an allergy to it, not because it is a carcinogen.", "No human studies  have been performed on Yellow 6, either. In 2014, in response to concerns based on Benjamin Feingold’s ADHD research, the EFSA conducted a fresh review of studies regarding the safety of Yellow 6. Far from banning the substance, the panel raised the allowable limit in food four-fold, stating that the chemical posed no risk to humans. The FDA shares this view.", "Claim: The artificial coloring in Cheetos is made from Yellow 6 (see above) as is the “cheese” flavoring, which includes methyl benzoate and ethyl methylphenidate.", "MOSTLY FALSE", "What’s True: Wolfe does not explicitly state what harm methyl benzoate may cause, but the NIH does consider it “mildly toxic” when ingested in high concentrations, and it is present in cheese flavoring. This is not surprising, as it is a naturally occurring compound in many cheeses.", "What’s False: From a strictly nomenclatural standpoint, there is no such thing as “ethyl methylphenidate,” and the top references to it on Google search link to cloned versions of Wolfe’s assertion:", "Giving Wolfe the benefit of the doubt, we'd guess it is possible he meant either Methylphenidate (the ADHD drug Ritalin) or Ethylphenidate (an analog of Ritalin). No peer-reviewed studies have documented either compound's occurrence in artificial cheese flavoring.", "Claim: Graham Crackers are “laced” with TBHQ, which causes ADHD, restlessness, anxiety, and also stomach cancer. (Though already identified as problematic in the Pop Tart section, this iteration of TBHQ’s threat introduces new claims that need to be investigated).", "MIXTURE", "What’s True: Rodents that were administered high levels of TBHQ, in some studies, showed signs of “gastrointestinal hyperplasia”— in which cells are created at a higher than normal rate that is similar to—but not actually—cancer. A study using human white blood cells in vitro suggested that this effect could plausibly happen in humans and could potentially be linked to TBHQ. While hyperplasia is a different process than neoplasia — which is the cellular process behind cancer — it is valid to say that hyperplasia can increase the risk of cancerous cells developing.", "What’s False: No peer-reviewed studies link TBHQ—specifically—to ADHD, restlessness, or anxiety. Diets inspired by Benjamin Feingold’s research frequently suggest the removal of TBHQ as a cure for ADHD, but no research specifically focused on TBHQ has documented any connection, and those diets generally treat all food coloring agents as a broad group despite clear chemical differences.", "The claims made in Wolfe’s post stem from a highly selective, lazy, and filtered reading of decades of complex and involved research, a majority of which was never performed on humans. In those few studies that showed negative effects, dosing was much higher than would be encountered in any food including children’s snacks.", "If a chemical considered damaging at higher doses but safe at lower doses concerns you, consider kale — a vegetable that, in Wolfe’s words, would allow kids to safely “taste the rainbow”. It contains a naturally-occurring compound chemical called thiocyanate, which (like almost any organic compound) can be synthesized using petroleum derived base chemicals. In extremely high doses, this naturally-produced leaf compound could — unequivocally and abruptly — kill you. Is it time to start going after Big Kale?", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]