["Claims that 1 million pounds of rat meat from China are being sold as boneless chicken wings in the United States are not true. The US Food and Drug Administration (FDA) never issued a report warning about rat meat, and the photos used to illustrate the claim are presented out of context.", "An article from The Voyager Channel is entirely based on a fictional FDA report allegedly warning that one million pounds of chicken wings made out of rat meat have been sold across the United States in the past eight months. The article was published on July 8 and has been shared over 110,000 times since.", "“This story is not true,” FDA spokesperson Peter Cassell told AFP in an email.", "“We have never put out such a warning, and USDA [United States Department of Agriculture] is the agency that has primary regulatory authority over most meat products, including imported meats.”", "Contacted by email by AFP, a USDA Food Safety and Inspection Service (FSIS) spokesperson said that FSIS \"has not detained, seized, or issued a warning report about rat meat being imported to the United States from China.\"", "The email added that \"US consumers can be assured that the poultry they eat is safe, wholesome and accurately labeled.\"", "This is not the first time the FDA has been forced to debunk claims about rat meat. Various claims of large-scale rat meat scandals have been debunked several times.", "One article which mentioned 300,000 pounds of rat meat was timed to coincide with the NFL Super Bowl. According to the National Chicken Council, Americans typically consume more than 1 billion wing portions during the weekend of the big game.", "These articles spread enough uncertainty to influence Google and Foodsafety.gov search results.", "In 2016, fact-checking website Snopes traced the earliest version of the story to a February 6, 2016 article in World News Daily Report, now unavailable online.", "The lead photo in the article on The Voyager Channel was not taken in the United States in 2018. A reverse image search shows that it was taken in 2007 in Thailand by Danish travel blogger Nicolai Bangsgaard.", "The AFP photo used in the article was taken in 2013 as part of a series of photos from a rat restaurant on the outskirts of Hanoi, Vietnam.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]