["About this rating", "On 7 April 2017, a post detailing a supposed reality show about President Donald Trump's administration was done well enough that it left many readers wondering if it was real.", "According to the original post, Trump released a statement promoting the show, which would be titled The Real First Family of D.C. The show would allegedly meld \"the gripping family drama of HBO’s Game of Thrones with the sizzling political intrigue of the Netflix series, House of Cards.\"", "The post is clearly billed as satire, but it does play into not only Trump's television background, but into items like First Lady Melania Trump's decision to stay in New York City, rather than join her husband in moving to Washington D.C.:", "One NBC television executive, who spoke off the record, added that Melania’s decision to live in New York City was actually a plot device suggested by Mark Burnett to create the appearance of tension between the President and First Lady. Burnett felt strongly that planting the seeds of a potential messy divorce, played out on a national stage, was a proven way to hook viewers in the first season.", "Mr. Trump also proposed adding a “hot young mistress or a horny White House intern” to the plot line to give it more authenticity. Network sources would not say if a decision has been made on the president’s proposal, but did confirm that Mr. Trump has added a casting couch to the Oval Office.", "Apparently not even the \"casting couch\" line was too over-the-top for readers; for example, one commented: \"Holy crap I too at first thought this was a true story? Breath Peggy Breath!\" The post's author, Allan Ishac, responded:", "This is how absurd our new president is, Peggy.", "If you had seen this same ridiculous post about Obama, or Bush, or Clinton or any other president ever, you would not have spent a minute of your time reading it. But this disaster of a man is, yes, capable of demanding a reality tv show instead of focusing 100% on being a respected leader of the country and the free world.\nSorry to lure you in but, oh goodness, Peggy, we all have to stay on our toes and resist, resist, RESIST!", "Thanks for reading.", "We contacted Ishac seeking his reaction to the response the post has generated thus far. He told us:", "I will continue to write political satire as my form of resistance to the Trump administration, even if it offends, makes people uncomfortable, or causes many to scratch their heads and write to Snopes to validate one of my posts. Because then these people are thinking. And the satire is working.", "Ishac also said that his posts are always marked as humor or satire, \"unless the satire is completely absurd.\"", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]