["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A tape recorder from President Richard Nixon's Oval Office. (Gerald R. Ford Presidential Museum)", "The governor has not identified the responsible staffer despite repeated attempts from reporters to learn more about the incident.", "But he also has not said publicly what action, if any, he will take to discipline the person.", "Gov. Tony Evers came under fire after it was revealed a staff member in his office secretly recorded a May 14, 2020 phone meeting between the governor and Republican legislative leaders.", "The move incensed Assembly Speaker Robin Vos and Senate Majority Leader Scott Fitzgerald, who immediately called for the staffer’s firing.", "Other lawmakers, including Republicans and at least one Democrat, echoed that demand.", "State Rep. Romaine Quinn, R-Barron, waded into the debate during the GOP’s June 18, 2020 weekly radio address, accusing Evers of \"a complete disregard for civility, cooperation and a lack of leadership.\"", "Quinn went on to say: \"The governor has refused to identify or discipline the staff member who secretly taped the conversation.\"", "Is that accurate? Partially.", "Let’s take a look.", "The call in question came one day after the state Supreme Court threw out Evers’ safer-at-home order, forcing officials to regroup and discuss a new response to the coronavirus pandemic.", "Evers, Vos and Fitzgerald talked respectfully to one another, but disagreed on next steps and what was happening in the state, based on a tape of the call released to the Milwaukee Journal Sentinel under an open records request.", "When asked for evidence to back up Quinn’s claim, an aide pointed PolitiFact Wisconsin to a June, 11 2020 Department of Health Services briefing, at which Evers was asked about the recording incident, and a Wisconsin Radio Network-WSAU article about the briefing headlined, \"Evers won't fire staffer who secretly recorded phone call.\"", "During the briefing, on the state’s response to COVID-19, Evers fielded multiple questions about the controversy and claimed he didn’t know the meeting was being recorded.", "The governor’s chief legal counsel, Ryan Nilsestuen, said staff consented to the recording in compliance with the state’s one-party consent rule, but wouldn’t identify who OK’d it.", "\"A staffer wanted help taking notes, and that’s why that staffer did that,\" Evers said. \"I will not discuss personnel issues in public, but needless to say, the practice has ended with this one time.\"", "So Quinn is right that Evers won’t identify the staff member. But what about the discipline?", "Wisconsin Radio Network reported in its article that Evers said the staffer \"will not be fired.\"", "One problem: Evers never said that in the call, according to a review of the call by PolitiFact Wisconsin.", "He has only continued to reiterate that he won’t talk about disciplinary matters, so it’s unclear how -- or whether -- the staffer has been disciplined. But in a June 23, 2020 DHS briefing, Evers hinted action had been taken, saying:", "\"This is obviously a personnel issue, and discipline measures are being handled internally,\" he said.", "Evers’ office did not respond to questions from PolitiFact Wisconsin.", "In the weekly GOP radio address, Quinn said Evers \"has refused to identify or discipline the staff member who secretly taped the conversation.\"", "The governor has so far been very clear that he won’t identify the person. But he repeatedly refused to discuss any discipline in public. So, on that point, Quinn mischaracterized what Evers said and what is known about the situation.", "That leaves us with a statement that’s partially accurate but leaves out important details or takes things out of context.", "That’s our definition for Half True.", "See Figure 1 on PolitiFact.com", "Milwaukee Journal Sentinel, Republican leaders secretly recorded by Gov. Tony Evers' staff, infuriating GOP lawmakers, June 10, 2020.", "Milwaukee Journal Sentinel, Republicans — and one Democrat — call for Gov. Evers to fire staffer who secretly recorded phone call, June 11, 2020.", "Wisconsin Legislature, GOP Weekly Radio Address: The Governor Needs to Take Responsibility for Secret Recording, June 18, 2020.", "WisconsinEye, Wisconsin DHS Media Briefing on COVID-19 for June 11, June 11, 2020.", "WSAU, Evers won't fire staffer who secretly recorded phone call, June 12, 2020.", "WisconsinEye, Wisconsin DHS Media Briefing on COVID-19 for June 23, June 23, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]