["About this rating", "In December 2020, roughly nine months after Louisville police fatally shot Breonna Taylor in her apartment during a botched drug raid, a ceramic artist erected a statue memorializing the 26-year-old Black woman in downtown Oakland, California. But shortly after the bust's installation near City Hall, reports surfaced online alleging a person or group had smashed the sculpture into several pieces.", "The reports were true.", "About two weeks after sculptor Leo Carson of the Bay Area placed the sculpture in the downtown plaza to support the Black Lives Matter movement, the ceramic memorial was found significantly damaged on Dec. 26, and the Oakland Police Department was investigating the vandalism, according to news reports and Carson's posts online.", "In an Instagram post and GoFundMe page to fundraise for a new statue, Carson called the damage \"an act of racist aggression.\"", "The artist's GoFundMe page titled, \"Rebuild the Breonna Taylor Sculpture in DT Oakland,\" read:", "After spending months creating this artwork it was incredible to see the community and neighbors taking photos and enjoying it. Now I am devastated and enraged to see it in pieces. This was an act of racist aggression and we need to show them we will not stand for it.", "The police department had not identified any suspects nor a possible motive for the destruction as of this writing.", "Sharing a news story and Carson's online fundraiser, Oakland Mayor Libby Schaaf denounced the vandalism in a Dec. 28 tweet, writing: \"It's a vicious attack against the light + justice sought in Breonna Taylor's name. We will keep moving forward; Oakland will not tolerate acts of hatred.\"", "At the time of this report, Carson's online fundraiser had surpassed its goal of $5,000 for a new bronze statue \"to prevent further damage\" and claimed to donate the excess funds to Taylor's family.", "For a full explanation of the circumstances surrounding Taylor's death, which was at the center of protests against racism and police brutality in summer 2020, see our investigation here.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]