["A video of ABP News anchor Rubika Liyaquat supposedly dancing inside a TV studio is circulating on social media. A distasteful song is playing in the background.", "मुजरेवाली है यह मीडिया मुजरा करती है😂😂😂😂 मुजरे वाली भी अपने profession के ऐसा नहीं करती ये कोन सी मिट्टी की बनी है।", "#टीवी_देखना_बंद_करो", "Posted by Shahrukh Pardhan on Saturday, 4 April 2020", "While tweeting the video one Zoya said, “कौन है ये?#टीवी_देखना_बंद_करो (Who is this? Stop watching TV -translated)”. It is noteworthy that ‘#टीवी_देखना_बंद_करो (Stop watching TV)’ was trending on Twitter, a few days back. Zoya’s tweet had garnered close to 2,400 retweets. The tweet has now been deleted. The trend was a criticism of television media’s coverage of coronavirus pandemic.", "The same video was posted on Facebook and Twitter with messages abusing the anchor.", "With a time search on Twitter, Alt News found the video posted by the official handle of Rubika Liyaquat in 2018. The original clip has been edited to add a distasteful song in the background. Liyaquat had posted the video on November 7, 2018, terming it “Diwali celebrations”.", "Yeh #Diwali @abpnewstv waali 😁❤️ #HappyDiwali pic.twitter.com/VGvqyK2CYi", "— Rubika Liyaquat (@RubikaLiyaquat) November 7, 2018", "In the original clip, the anchor dances while singing happy Diwali. Hence, a slanderous attempt was made on social media to malign the anchor by superimposing a distasteful song over her video from Diwali celebrations.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]