["The 48-second video was posted here on YouTube on March 21, 2020.", "The Indonesian-language title of the post translates to English as: “Breaking news, a prosecutor taking a bribery of 1.5billion. HRS case”.", "The voiceover in the first 15 seconds of the video says: “Exposed. A prosecutor admitted that he had accepted a bribe in connection with Habib Rizieq Shihab’s court case. The image of Indonesian law is getting worse.”", "HRS refers to Habib Rizieq Shihab, an Indonesian Muslim cleric who was arrested for holding mass gatherings with tens of thousands of followers in violation of pandemic health protocols, AFP reported on December 13, 2020.", "Habib is an honorific given to a person who is believed to be the descendant of the Prophet Muhammad.", "Rizieq’s first trial was held on March 16, 2021, at the East Jakarta Court, as Kompas.com reported here.", "The clip has also been viewed more than 49,000 times since being shared alongside similar claims on Facebook here, on YouTube here and here and on TikTok here.", "The claim, however, is false.", "A keyword search on Google found this video, posted on the YouTube channel of local broadcaster Kompas TV, which shows scenes that match those seen in the clip in the misleading post.", "The video was posted on November 25, 2016 and is titled: “Prosecutor Involved in Bribery Linked With Court Case”.", "The video’s caption reads: “The illegal-levies eradication team of the Attorney General's Office conducted a sting operation against a prosecutor who is assigned to the High Prosecutor’s Office, East Java. Apart from the prosecutor, a person who paid the bribe was also arrested with evidence of 1.5 billion rupiah. Yulianto, head of the sub-directorate for investigations at the assistant attorney general’s office for special crimes department, explained that following investigations, the prosecutor was arrested at his boarding house, both of them are suspected of bribery linked with village land sales at Kali Mok village, Kalianget Sumenep regency, East Java. The person who paid the bribe had hoped that he would be freed from prosecution.”", "Kalianget is a district located in Sumenep regency, on Madura island, East Java province.", "Kompas TV identifies the official interviewed by journalists in the video as Yulianto, from the Attorney General’s Office.", "In both the genuine video and the misleading video, Yulianto told journalists that they had arrested two people: AF, the prosecutor who took the bribe, and AM, the person who paid the bribe.", "The KompasTV video does not mention anything about Rizieq Shihab.", "Below is screenshot comparison between the footage in the misleading post (L) and the Kompas TV video (R):", "The 2016 arrest of the East Java prosecutor was also reported by other local media outlets, such as Tribunnews, Media Indonesia and tvOne.", "Other local broadcaster Net TV reported the first trial of the prosecutor named Ahmad Fauzi on its YouTube channel on December 21, 2016, titled: “NET. EAST JAVA - PROSECUTOR AHMAD FAUZI’S TRIAL”.", "Fauzi was sentenced to four years in jail and given 50 million rupiah ($3,500) in fines in February 2017, as reported by Suara Hukum and Kompas daily.", "The General Attorney’s Office also published a clarification on Twitter about the misleading video here on March 21, 2021.", "Translated from Indonesian language to English, the first paragraph of the tweet reads: “Hoax News a clip of the confession of a prosecutor who received a bribe in habib rizieq sihab’s court case”.", "Berita Hoaks sebuah cuplikan video pengakuan seorang jaksa yang menerima suap kasus sidang habib rizieq sihab\n\n\t\tStop menyebarkan berita hoaks.\n\t\tJangan biarkan pikiran kita & orang lain teracuni dengan berita-berita yang tidak jelas sumbernya dan tidak terbukti faktanya#KejaksaanRI pic.twitter.com/Uiih7pSJRy", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]