["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man wearing a mask prepares to enter a restaurant providing take out food on Wednesday, April 22, 2020, in Alameda, Calif. (AP)", "Some people have protested stay-at-home orders in recent weeks with public demonstrations.", "During the flu pandemic in 1918, protesters formed an Anti-Mask League in San Francisco.", "San Francisco was among several cities that experienced a second wave of cases.", "The protests against stay-at-home orders in some state capitals have drawn comparisons to the 2010 tea party movement, but the idea of protesting such rules amid a pandemic is not just a 21st-century phenomenon.", "There are parallels to a protest a century ago.", "\"During the 1918 Spanish flu pandemic, several influential San Francisco residents including a few physicians formed the Anti-Mask League which objected to wearing masks to prevent the spread of influenza,\" stated an April 22 Facebook post. \"They held meetings of thousands of maskless people. San Francisco was ultimately one of the cities that suffered the most with a high death rate.\"", "(The \"Spanish flu\" is a misnomer — it’s more accurate to refer to it as the flu pandemic of 1918.)", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The post includes a black-and-white photo of policemen wearing masks over their mouths and noses. We did a reverse Google search and found the image matches a photo of policemen in a different city — Seattle — wearing masks in 1918.", "But there are accurate statements in the text, which draws from a source at the University of Michigan. We found that there was such a thing as the Anti-Mask League in San Francisco in January 1919. The city did have one of the highest death rates from the flu, but the authors said they can’t prove whether the Anti-Mask League played a role.", "RELATED: What the 1918 flu pandemic shows us about social distancing", "Hat tip to NPR reporter Tim Mak for digging up the history of the Anti-Mask League and sharing it in a Twitter thread. Mak pulled from an essay by J. Alexander Navarro at the University of Michigan Center for the History of Medicine, a book by Alfred W. Crosby, America’s Forgotten Pandemic and the San Francisco Chronicle archives.", "As the number of flu cases rose in October 1918 in San Francisco, the city passed an ordinance requiring everyone to wear a mask in public except at mealtime.", "Mask wearing was promoted as a symbol of patriotism. Gov. William Stephens told Californians it was a \"patriotic duty for every American citizen\" to wear a mask.", "City officials and local newspapers reported widespread compliance with the mask order initially, Navarro found. But some resisted the rules, and police arrested 110 people on Oct. 27 for not wearing their masks or for failing to keep them properly adjusted. The majority were fined $5, though some went to jail.", "In November, with cases declining, the city started to lift restrictions, although it still required masks. People flocked to public venues including theaters and sports arenas. At a boxing match, the city’s mayor and city health officer were photographed not wearing masks, for which they were fined.", "Later that month, the mayor annulled the ordinance. But new cases quickly emerged, and the mask ordinance was reinstated in January.", "Opponents formed the Anti-Mask League, multiple news articles in January 1919 show. Crosby wrote in his book that the league consisted of \"public-spirited citizens, physicians and fanatics.\"", "At a meeting of the Anti-Mask League \"resolutions were passed denouncing the mask ordinance as contrary to the desires of the majority of the people,\" the San Francisco Examiner reported. Nearly 2,000 people attended.", "The league got their wish, and the mask rule was rescinded Feb. 1.", "Navarro and colleagues studied how 43 cities fared during the 1918 pandemic and published their results in the Journal of the American Medical Association. They found that many cities experienced second waves after ending social distancing.", "San Francisco had one of the higher excess-death rates: 673 per 100,000 people.", "\"It is impossible to say for certainty that the advent of the Anti-Mask League played a role in that outcome,\" Navarro told PolitiFact \"Undoubtedly, having over 2,000 people gather would have helped continue to spread influenza.\"", "The main factors in San Francisco’s outcome, however, were failure to implement interventions such as social distancing quickly and failure to keep them in place long enough.", "Navarro said he didn’t find something similar to the Anti-Mask League in other cities. Only a few other cities implemented mandatory face mask orders, while others recommended that the public use masks.", "A Facebook post said during the 1918 flu pandemic, San Francisco residents formed an \"Anti-Mask League.\" San Francisco \"was ultimately one of the cities that suffered the most with a high death rate.\"", "Residents angry about the reinstatement of a mask order did form the Anti-Mask League in January 1919. It appeared to be short-lived, as the mask rule was quickly rescinded. Researchers found that San Francisco did have one of the higher death rates in the country, but it is impossible to say whether that was directly related to the mask protests.", "A photo of masked police officers that accompanies the post is real, but it shows officers in Seattle.", "We rate this statement Mostly True.", "Facebook post, April 22, 2020", "NPR reporter Tim Mak, Twitter thread, April 19, 2020", "University of Michigan Center for the History of Medicine Influenza Encyclopedia, The American influenza epidemic of 1918-1919, Accessed April 22, 2020", "Alfred W Crosby, America's Forgotten Pandemic: The Influenza of 1918", "San Francisco Chronicle, A city of masks: When the flu tore through San Francisco, Sept. 11, 2015", "J. Alexander Navarro and Howard Markel of the Center for the History of Medicine at the University of Michigan op ed in Washington Post, To save lives, social distancing must continue longer than we expect, April 8, 2020", "Vox, Social distancing won’t just save lives. It might be better for the economy in the long run. March 31, 2020", "New York Times, Cities That Went All In on Social Distancing in 1918 Emerged Stronger for It, April 3, 2020", "JAMA, Nonpharmaceutical Interventions Implemented by US Cities During the 1918-1919 Influenza Pandemic, Aug. 8, 2007", "Proceedings of the National Academy of sciences, Public health interventions and epidemic intensity during the 1918 influenza pandemic", "Associated Press, Fauci: ‘We’re not there yet’ on key steps to reopen economy, April 15, 2020", "Pandemics Depress the Economy, Public Health Interventions Do Not: Evidence from the 1918 Flu, April 13, 2020", "San Francisco Examiner, New cases of influenza at low record, Jan. 26, 1919", "San Francisco Chronicle, Anti-Mask League mass meeting ends in battle royal, Feb. 1, 1919", "Reuters, Scattered protests push back on U.S. coronavirus stay-at-home orders, April 16, 2020", "PolitiFact, What the 1918 flu pandemic shows us about social distancing, April 17, 2020", "PolitiFact, Large majorities of Americans support keeping stay-at-home policies for now, April 22, 2020", "Email interview, J. Alexander Navarro, Assistant Director, Center for the History of Medicine, The University of Michigan, April 16 and April 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]