["The claim was shared here on Facebook on January 6, 2021. The post has more than 7,000 interactions on Facebook.", "The post’s Korean-language caption translates to English as: “The sky of the Korean peninsula at this moment. This is almost like a scene from the Chronicles of Narnia.”", "A cold wave with heavy snow and strong wind hit South Korea on January 6, 2021, causing public transport delays, traffic congestion and a spike in road accidents, according to this report by Yonhap News Agency on January 7, 2021.", "The identical claim has been shared on Facebook here, here and here and on Twitter here and here.", "However, the claim is false.", "A Google reverse image search found that the satellite image was in fact taken on January 5, 2010, as seen here on NASA’s Worldview website, also known as EOSDIS (Earth Observing System Data and Information System) Worldview.", "NASA Worldview ingests, processes, archives and distributes data from a large number of Earth-observing satellites, among other functions.", "Below is a screenshot comparison of the image in the misleading posts (L) and the satellite image of the Korean peninsula taken on January 5, 2010 from the NASA Worldview website (R).", "Below are the satellite images of the Korean peninsula taken on January 6 and 7 2021, respectively, according to NASA Worldview. These satellite images are different from the one in the misleading posts.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]