["The claim was published on Facebook here on March 16, 2019. The post has been shared more than 12,000 times.", "“TIME Magazine ranked PM Prayuth Chan-o-cha as the best leader in the world,” the Thai-language post read.", "“According to the World Leader 2019 ranking that was announced today, Prayuth Chan-O-cha is the best leader in the world, narrowly followed by the Canadian Prime Minister Justin Trudeau.”", "It credits Prayuth's “strong and creative policy in developing the country” for his nomination.", "The post features photos of Prayuth with superimposed text that translates as: “Uncle Tu, don’t give up”.", "Prayut, who is commonly referred to by supporters as Uncle Tu, is a former army-chief who seized power from a democratically-elected government in 2014.", "Other Facebook users appeared to believe the TIME award was genuine, posting comments such as “Love Uncle Tu”; “It is clear.. Stay all the way, Uncle Tu.”; and “I sincerely congratulate you, Uncle Tu.”", "The claim about the purported TIME magazine ranking previously circulated on Facebook in 2017, 2019 and 2021. It was also shared by Thai site Daily here in March 2019.", "However, the claim is false.", "A keyword search found that the claim appears to have originated in this Facebook post by The Matter, a local Thai local media outlet, on March 31, 2017. The caption clearly notes that the post is an April Fool Day joke.", "“TIME ranked Premier Prayuth Chan-O-cha as the best leader in the world,” the caption reads.", "The last paragraph adds: “#TheMATTER #JustKidding #JustFooledYou #AprilsFoolDay”", "A TIME spokesperson also denied the claim.", "“This claim is false. TIME does not publish a ranking of world leaders,” a spokesperson for the magazine told AFP in an email on March 25, 2021", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]