["About this rating", "In December 2018, a video purportedly showing a baya weaver bird dying next to its deceased mate went viral on social media, driven by the associated claim that this species of bird is \"the only creature in the entire world which dies when its companion dies\":", "It's unclear who captured the original video and where it was first posted online. The version shown above was cropped to remove a bit of Chinese text that roughly translated to \"Life cannot be the same as death!\" which leads us to believe that this video was first circulated on a Chinese social media site such as Weibo. The earliest version we could find was published by Pancho Reao on Facebook in October 2018, where it was accompanied by the caption \"Lo más triste que verás hoy!\" or \"The saddest thing you'll see today!\"", "Several reasons prompt us to be skeptical of this clip and the accompanying death claim. First off, male baya weaver birds don't engage in one-on-one relationships as suggested by this video.  Males of this species are polygamous and mate with multiple females, so if this claim were true, then the death of a single male baya weaver would potentially result in the deaths of several females as well.  (In fact, some studies have reported that males and females of this species are polygamous, so the death of any single baya weaver bird would potentially result in the deaths of multiple other birds as well.)", "Second, this video appears to show two birds of the same sex. Male and female baya weavers have distinctly different coloration, but the birds seen in this video look similar in that regard:", "Furthermore, this clip doesn't offer any real evidence of its claim.  The video shows one baya weaver bird that is seemingly unwilling to leave the presence of a dead baya weaver bird, then it cuts to a shot of two dead baya weaver birds being buried.  The video doesn't document how the second bird died, however, and the viewer can't even be sure the latter two birds are the same pair seen in the earlier portion of the clip.", "As we noted above,  while some animals truly form monogamous pairs and mate for life, the baya weaver is polygamous and may mate with a number of different partners. A 1957 report published in the Journal of the Bombay Natural History Society (BNHS) documented philandering baya weavers of both sexes:", "It was observed that cocks will surreptitiously attempt to copulate with the hens visiting an absent neighbour's nest, in the same way as they will filch his nesting material. As in the latter case, they flee precipitately upon the owner's return. In one instance, the owner arrived while the act of 'adultery' was in progress. He broke off the pairing and spiritedly chased the intruder, who fitted across and settled on his own nest hard by while the owner himself took overtures to the hen. On the other hand a 'married' female, newly in possession of nest and mate, will sometimes snatch a hasty opportunity to hop across to a neighboring eligible nest (i.e., in the appropriate helmet state) in the momentary absence of its rightful mistress,' deliberately exposing herself to the amorous impetuosity of the 'married' owner, and even inviting and permitting copulation.", "Thus, while 'progressive polygamy' is now definitely established as the normal procedure in the baya, our observations in the 1956 season provide strong evidence also of fortuitous promiscuity in the sexual relations of both sexes.", "The polygamous nature of the baya weaver was also noted in a 2016 article from the Indian Express:", "“This clever little bird knows 14 to 18 different types of knots,” says [Siddhesh] Surve, [project assistant at BNHS and organiser of the pan-India survey]. “He uses them to hold his nest together so that it can resist monsoon storms and hold the weight of his mate and their eggs.” The bird also makes small mud pellets to weigh the nest down.", "This might seem like a lot of work, but the female Baya Weaver demands much to be impressed. She jumps from nest to nest for quality inspection before deciding on her mate. But once the male has been selected, he loses interest and and flies off in search of more females almost immediately. His abandoned mate incubates the eggs, which hatch in around two weeks.", "We examined multiple sources documenting the mating habits of the baya weaver, but none of these sources reported that members of this bird species were the only animals in the world that died when their mates died.   We've reached out to the Audubon Society and The National Aviary and will update this article should they provide more information.", "Singh, Radhika.   \"Wild Side: This Bird’s Mating Is One Knotty Affair.\"\r\n    Indian Express.   18 June 2016.", "Ali, Salim.   \"Further Notes on the Baya Weaver Bird.\"\r\n    Journal of the Bombay Natural History Society.   August 1957.", "Berger, Michele.   \"Till Death Do Them Part: 8 Birds That Mate for Life.\"\r\n    Audubon.   10 February 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]