["The three-minute, 47-second clip appeared here on Facebook on March 9, 2020. It has been viewed more than 1,100 times.", "The post's Indonesian-language caption translates to English as: “Thehydro-power plant dam project in Asuppo, Laos, which was built by a South Korean company, collapsed.", "“5,000 million cubic of water hit the city. Dozens of people died and hundreds were missing.\n\tScary…”", "Below is a screenshot of the misleading post:", "Hundreds went missing and an unknown number of people were feared dead after a partly built hydropower dam in southeast Laos collapsed after heavy rain in July 2018. The $1.2 billion dam is part of a project by Vientiane-based Xe Pian Xe Namnoy Power Company, a joint venture between a Laotian, a Thai and two South Korean companies, as reported by AFP here.", "The same video has been viewed more than 2,200 times after it appeared alongside a similar claim on Facebook here, here, here and here.", "It was posted with a similar claim on YouTube here, where it was viewed more than 830 times before it was removed.", "The claim is false; the clip shows a tsunami in Miyagi prefecture in Japan in 2011.", "A Google reverse image followed by subsequent keyword search found an identical video published here on YouTube on December 18, 2011.", "The Japanese-language caption translates to English as: “Ishinomaki city Tsunami TSUNAMI JAPAN 3.11/2011”.", "The video’s English caption reads: “‘Ishinomaki-shi Tidal wave’ eastern Japan great earthquake  A picture in Ishinomaki-shi, Miyagi. I suggest you be rubbed by such tidal wave, it can't be done. I take a picture from a roof of Ishinomaki gas. 2-3-48, Myojincho, Ishinomaki-shi, Miyagi”.", "A powerful quake struck the seabed off Miyagi prefecture on March 11, 2011, followed by a tsunami that swept Japan’s northeastern shoreline, killing almost 16,000 people with more than 2,500 still missing, AFP reported here.", "Below is a side-by-side comparison of the video in the misleading post (L) and the YouTube video (R):", "The video was recorded in Ishinomaki here, a city in Miyagi prefecture, Japan.", "Three blue tube towers and two blue ball structures from Ishinomaki Gas visible in the still from the video (L) can be seen in the Google Street View imagery of the location captured in May 2013 (R):", "The same video was submitted to Japanese commercial television network Fuji News Network which is published in this report.", "AFP has debunked the same video with other claims: that it shows Typhoon Hagibis in 2019 here and that it shows a tsunami in Indonesia in 2018 here.", "In this video report, AFP also investigated the devastation in the city of Ishinomaki after the disaster.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]