["About this rating", "This tale, like several other adolescent horror legends, seemingly originated (or at least was first collected) in the early 1960s:", "Example: [Smith, 1983]", "A young couple living in a large isolated house had gone out to a dinner party one evening and left the baby-sitter in charge of their two children. The children had been put to bed and the baby-sitter was watching the television when the phone rang. She answered but all she heard was a man laughing hysterically and then a voice saying, \"I'm upstairs with the children, you'd better come up.\" Thinking it was \"one of those phone calls\" or a practical joke she slammed down the receiver and turned the television sound up. A short time later the phone rang again and, as she picked it up, the unmistakable hysterical laughter came down the line and the voice once again said \"I'm upstairs with the children, you'd better come up.\"", "Getting rather frightened she called the operator and was advised they would notify the police and, should he phone again, could she keep him talking in order to give them time to trace the call and have him arrested. Minutes after she replaced the receiver the phone rang again and, when the voice said, \"I'm upstairs with the children, you'd better come up,\" she tried to keep him talking. However, he must have guessed what she was trying to do and he put the phone down.", "Only seconds later the phone rang again, this time it was the operator who said, \"Get out of the house straight away, the man is on the extension.\" The baby-sitter put down the phone and just then heard someone coming down the stairs. She fled from the house and ran straight into the arms of the police. They burst into the house and found a man brandishing a large butcher's knife. He had entered the house through an upstairs window, murdered both the children and was just about to do the same to the poor baby-sitter.", "Variations:", "Its obvious features deal with the insecurity felt by adolescents as they are required to accept increasing responsibilities while making the transition to adulthood. The teenage girl is not simply left alone to fend for herself, but she is also made responsible for the safety of other children (in what might be considered a \"dress rehearsal\" for motherhood). She fails at her task in the most catastrophic manner (with the implication that she is at least partly to blame for being too absorbed in watching television), and, in a delicious irony, she herself is threatened through the instrument that is a teenage girl's favorite means of social communication.", "Sightings:   The plot of the 1979 movie When A Stranger Calls is based on this legend. The 1974 film Black Christmas features a murdering maniac hiding in a sorority's attic who telephones after every killing. In the 1998 film Urban Legend, the folklore professor regales his class with this legend.", "Brunvand, Jan Harold.   The Choking Doberman.\r\n    New York: W. W. Norton, 1984.   ISBN 0-393-30321-7   (pp. 214-215).", "Brunvand, Jan Harold.   The Vanishing Hitchhiker.\r\n    New York: W. W. Norton, 1981.   ISBN 0-393-95169-3   (pp. 53-57).", "de Vos, Gail.   Tales, Rumors and Gossip.\r\n    Englewood: Libraries Unlimited, 1996.   ISBN 1-56308-190-3   (pp. 296-297).", "Fowke, Edith.   Folklore of Canada.\r\n    Toronto: McClelland and Stewart, 1976.   ISBN 0-77103-202-1   (p. 264).", "Smith, Paul.   The Book of Nasty Legends.\r\n    Glasgow: Fontana/Collins, 1984.   ISBN 0-00-636856-5   (p. 97).", "Fiery, Ann.   The Complete and Totally True Book of Urban Legends.\r\n    Philadelphia: Running Press Books, 2001.   ISBN 0-7624-107404   (pp. 107-113).", "Healey, Phil and Rick Glanvill.   Now! That's What I Call Urban Myths.\r\n    London: Virgin Books, 1996.   ISBN 0-86369-969-3   (pp. 14-15).", "Holt, David and Bill Mooney.   Spiders in the Hairdo.\r\n    Little Rock: August House, 1999.   ISBN 0-87483-525-9   (pp. 49-51).", "Schwartz, Alvin.   Scary Stories to Tell in the Dark.\r\n    New York: HarperCollins, 1981.   ISBN 0-397-31927-4   (pp. 69-71).", "The Big Book of Urban Legends.\r\n    New York: Paradox Press, 1994.   ISBN 1-56389-165-4   (pp. 60-61).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]