["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "After President Donald Trump announced that terrorist leader Abu Bakr al-Baghdadi was dead, Trump repeated an inaccurate boast that he called for taking out Osama bin Laden before the Sept. 11 attacks.", "Trump said that he made the warning in his January 2000 book \"The America We Deserve.\"", "Speaking to reporters Oct. 27, Trump said that he doesn’t get credit for warning that bin Laden should have been taken out.", "\"You know, if you read my book — there was a book just before the World Trade Center came down. And I don’t get any credit for this, but that’s okay. I never do. But here we are. I wrote a book — a, really, very successful book. And in that book, about a year before the World Trade Center was blown up, I said, ‘There is somebody named Osama bin Laden. You better kill him or take him out.’ Something to that effect. ‘He’s big trouble.’\"", "Trump continued, saying that he said to people, \"Take out Osama bin Laden,\" although \"nobody ever heard of Osama bin Laden until, really, the World Trade Center.", "\"But about a year — you’ll have to check — a year, year and a half before the World Trade Center came down, the book came out. I was talking about Osama bin Laden. I said, ‘You have to kill him. You have to take him out.’ Nobody listened to me.\"", "Trump made a similar statement in a speech as a presidential candidate in Virginia in 2015. We rated that statement Mostly False. At other speeches in 2015, Trump went further and said he \"predicted\" bin Laden and terrorism.", "Trump did write about bin Laden critically in his book, but he did not suggest that he be taken out.", "Bin Laden is mentioned once in the book, specifically in a passage criticizing President Bill Clinton’s approach to national security:", "\"Instead of one looming crisis hanging over us, we face a bewildering series of smaller crises, flash points, stand offs, and hot spots. We’re not playing the chess game to end all chess games anymore. We’re playing tournament chess - one master against many rivals. One day we’re assured that Iraq is under control, the UN inspectors have done their work, everything’s fine, not to worry. The next day the bombing begins. One day we’re told that a shadowy figure named Osama bin Laden is public enemy number one, and U.S. jet fighters lay waste to his camp in Afghanistan. He escapes back under some rock, and a few news cycles later, it’s on to a new enemy and a new crisis.\" (Emphasis in bold is ours.)", "Trump’s reference to bin Laden relates to the Aug. 20, 1998, U.S. bombing of his camps in Afghanistan and Sudan. Clinton said they were in retaliation for terrorist bombings earlier that month on U.S. embassies in Kenya and Tanzania which killed 224 people, including 12 Americans, and wounding thousands. Clinton said the goal of the U.S. strikes was to \"disrupt bin Laden’s terror network.\"", "Trump devoted a chapter to terrorism and warned broadly that America could be attacked, but he did not call for taking out bin Laden. He wrote that the U.S. \"must prepare for the real possibility that somewhere, sometime, a weapon of mass destruction will be carried into a major American city and detonated.\"", "Trump acknowledged that this was not his original thought, noting that ABC-TV’s \"Nightline\" had aired a series of shows about the threat.", "In his comments to the media Oct. 27, Trump also said that \"al-Baghdadi everybody hears because he’s built this monster for a long time. But nobody ever heard of Osama bin Laden until, really, the World Trade Center.\"", "The United States government was aware of bin Laden a few years before the Sept. 11 attacks. The CIA established a unit in 1996, Alec Station, to hunt bin Laden when he was calling for global jihad. The station was disbanded a decade later.", "Trump said that in his 2000 book \"I was talking about Osama bin Laden. I said, ‘You have to kill him. You have to take him out.’\"", "Trump inaccurately recounted what he wrote in his own book. The only kernel of truth here is that Trump did write about bin Laden in the context of criticizing President Clinton.", "Trump’s book warned about terrorism, as did others by 2000, but he did not write that bin Laden should be taken out.", "This statement rates Mostly False.", "White House, Remarks by President Trump on the Death of ISIS Leader Abu Bakr al-Baghdadi, Oct. 27, 2019", "YouTube, Donald Trump FULL announcement ISIS leader Abu Bakr al-Baghdadi killed in military operation, Oct. 27, 2019", "CNN, Fact check: Trump falsely claims his 2000 book demanded the killing of Osama bin Laden, Oct. 27, 2019", "AP, AP FACT CHECK: Trump Spins Tales on Bin Laden, Iraq War, Oct. 27, 2019", "New York Times, C.I.A. Closes Unit Focused on Capture of bin Laden, July 4, 2006", "Donald Trump, Speech in Manassas, Va., Dec. 2, 2015.", "Trump, \"The America We Deserve,\" Published Jan. 15, 2000.", "The Washington Post Fact Checker, \"Trump’s claim that he ‘predicted Osama bin Laden,’\" Dec. 7, 2015.", "FactCheck.org., \"Trump’s bin Laden ‘prediction,’\" Dec. 2, 2015.", "The New York Times, \"U.S. cruise missiles strike Afghan and Sudan targets tied to terror network,\" Aug. 21, 1998.", "The American Presidency Project, Bill Clinton radio address, Aug. 22, 1998", "History.com, U.S. embassies in East Africa bombed, Aug. 7, 1998", "TIME, Worst Embassy Attacks", "PolitiFact, Donald Trump says CIA warned George W. Bush of Sept. 11 attacks, Oct. 21, 2015", "PolitiFact, Trump's hyped claim that he called for rubbing out bin Laden in 2000, Dec. 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]