["About this rating", "Few entities in the United States are as capable of commanding an individual's instant, undivided attention as the Internal Revenue Service. Possible contact initiated by the IRS has long been dangled as bait by scammers leveraging taxpayer fears about audits and other tax-related hassles.", "E-mail scammers posing as IRS agents have been phishing for information in inboxes since at least May 2007.  The manner in which such scams are conducted range from direct collection of sensitive information (such as Social Security Numbers) to transmission of an attachment containing malware. Although a variety of IRS-based e-mail scams remained a steady nuisance, the agency explicitly stated on their web site that such communications were illegitimate:", "The IRS doesn't initiate contact with taxpayers by email, text messages or social media channels to request personal or financial information. This includes requests for PIN numbers, passwords or similar access information for credit cards, banks or other financial accounts.", "On the same page, the IRS advised:", "Report all unsolicited email claiming to be from the IRS or an IRS-related function to phishing@irs.gov. Recent scams have used the Electronic Federal Tax Payment System (EFTPS) to attract potential victims.  Also, if you've experienced any monetary losses due to an IRS-related incident, please report it to the Treasury Inspector General Administration (TIGTA) and file a complaint with the Federal Trade Commission (FTC) through their Complaint Assistant to make the information available to investigators.", "A 21 October 2013 IRS press release titled \"IRS Warns of Pervasive Telephone Scam\" addressed phone-based versions of the scams, but added an important-to-remember caveat:", "“This scam has hit taxpayers in nearly every state in the country.  We want to educate taxpayers so they can help protect themselves.  Rest assured, we do not and will not ask for credit card numbers over the phone, nor request a pre-paid debit card or wire transfer,” says IRS Acting Commissioner Danny Werfel. “If someone unexpectedly calls claiming to be from the IRS and threatens police arrest, deportation or license revocation if you don’t pay immediately, that is a sign that it really isn’t the IRS calling.” Werfel noted that the first IRS contact with taxpayers on a tax issue is likely to occur via mail[.]", "On 26 February 2015, the New York Times published an article titled \"Call From the I.R.S.? Hang Up. It’s a Fraud.\" The piece examined the popularity of IRS phone scams, and the lengths to which criminals went in their attempts to dupe taxpayers by invoking the specter of the tax agency:", "“The callers are aggressive, they are relentless and they are ruthless,” said J. Russell George, Treasury inspector general for tax administration, in a statement. His office, which oversees the I.R.S., said it had received reports of about 290,000 calls since October 2013, and nearly 3,000 victims had been cheated out of more than $14 million.\nGarrett Gregory, a former senior lawyer with the I.R.S. who now has a tax practice in Dallas, said the calls were pervasive and that his office heard once or twice a week from clients who were concerned about getting such calls. Most people know to “laugh and hang up,” he said, but the calls still can be unnerving. His own father received such a call a month ago, he said.", "The crooks aren’t particularly discriminating in their choice of targets: The Connecticut state tax commissioner received a call this month, according to a report in The Hartford Courant. And a lawyer for the Federal Trade Commission wrote this month on the agency’s blog that she had received such a call on her home answering machine ... The callers strive to appear authentic; they may use robocalling technology that shows “I.R.S.” on your caller identification screen. They may know part or all of your Social Security number and they may provide a fake I.R.S. “badge” number. In some cases, follow-up calls may come, supposedly from local police or prosecutors.", "A page on IRS.gov featured a lengthy (but still probably incomplete) list of all known IRS-related scams pervasive in e-mail, on social media, and through other electronic methods of transmission. As the IRS has repeatedly noted, contact for any purpose initiated by the agency \"is likely to occur via mail[.]\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]