["“Please read this, especially if your first inclination is not to read it. I appreciated this so much,” say posts shared here and here. Other users shared the 16 points using the hashtag #truth.", "Numerous posts attribute the thoughts to Howard. They continue to circulate online with his picture attached.", "Many users expressed approval for what was said to have been written by the 65-year-old Hollywood director, who shot to prominence as a child actor on “The Andy Griffith Show” before attaining global stardom as Richie Cunningham in the American family sitcom, “Happy Days.”", "He has since been the driving force behind films including “Apollo 13” and “A Beautiful Mind.” The latter garnered four Academy Awards, including Best Director for Howard.", "The points attributed to him mention immigration, religion and health care, specifically The Affordable Care Act -- known as Obamacare -- passed during president Barack Obama’s first term. All three subjects are touchstone issues in the 2020 US presidential election.", "The posts say that although Howard believes health care is a right, and not a privilege, “somehow that's interpreted as ‘I believe Obamacare is the end-all, be-all.’” It goes on to make other pointed remarks that are embraced by Facebook users.", "“I don’t believe your money should be taken from you and given to people who don’t want to work,” Howard is claimed to say. There is also implicit criticism of US President Donald Trump.", "“I believe our current administration is fascist. Not because I dislike them or because I can’t get over an election, but because I've spent too many years reading and learning about the Third Reich to miss the similarities,” it says.", "But Howard was not the author.", "“Ron Howard did not make the remarks to which you refer, on Facebook,” Imagine Entertainment, the film and television production company founded by Howard and his co-creator Brian Grazer in 1986, told AFP.", "Howard, however, has aired political views on Twitter and responded to questions posed by users on subjects such as the experience that elected officials should bring to office, illustrating his willingness to engage with the public.", "Following the initial circulation of the posts, several users went on to say the remarks are the work of an author named Lori Gallagher Witt, with some correcting their Facebook posts to reflect this.", "In an email to AFP, Gallagher Witt said that she did write a post on January 7, 2018, which she described at the time as an open letter to friends and family, explaining that she was a liberal. It included all 16 points later attributed to Howard.", "Blog posts such as this one also said Gallagher Witt was the original author.", "Currently living in the US state of Maine, she said it was “irritating” that her work had been passed off as someone else’s, but she was more alarmed about “erroneous factual information” being spread online in a heavily divided US political climate.", "“In this case, the information didn’t change, just the source,” she said. “The issue that bothered me the most was that the post was suddenly taken more seriously once it had a celebrity’s name attached.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]