["Reps. Keith Rothfus, Mike Kelly and Bill Shuster", "Three Republican congressmen from Pennsylvania circulated an op-ed criticizing the Affordable Care Act and touting an alternative health care plan that \"will expand the options for individuals and families to access affordable insurance coverage.\"", "In the three-byline op-ed titled, \"Relief from Obamacare: a better system ahead,\" Rep. Keith Rothfus, R-12th, Rep. Mike Kelly, R-3rd, and Rep. Bill Shuster, R-9th, claimed that \"Obamacare covers 24 million fewer people than it was expected to, and the projected price tag has more than doubled at $2 trillion.\"", "But that didn’t sound anything like figures that have come from both sides of the aisle: that some 20 million people are now insured and wouldn’t have been if it weren’t for the Affordable Care Act. So we decided to check the claim.", "Kate Rosario, a spokeswoman for Rothfus, said the numbers \"all come from the Congressional Budget Office\" and cited three articles — two from The Weekly Standard and one from the Washington Examiner — about CBO figures. The CBO is the nonpartisan arm of Congress charged with determining how much legislative proposals will cost the federal government. Sometimes its projections change as circumstances change (as we’ll see), but PolitiFact considers it a standard for fact-checking claims.", "Let’s look first at the number of people covered under the Affordable Care Act. In March 2010, the CBO released its cost projections before the law’s final passage. At the time, it estimated the following would occur by 2016:", "By 2016, those projections had changed. At that point, the Supreme Court had ruled Medicaid expansion under the Affordable Care Act could be left up to the states, changing some projections about who would enroll and how they would do it. The projections by 2016 — the last available full report, according to a CBO spokeswoman — were:", "That means that in 2010, the CBO estimated 21 million people would be covered under exchanges by 2016. Six years later, it’s 12 million, but an additional 11 million people qualified for Medicaid coverage under the Affordable Care Act. That means those covered under Obamacare was actually about two million people higher than the projections.", "So where’d that 24 million number come from? Rosario referenced a Weekly Standard article from March 2016 titled, \"CBO Misses Its Obamacare Projection by 24 Million People.\" In the article, the reporter wrote that in 2013, CBO estimated the ACA would result in \"201 million people having private health insurance.\" By 2016, that estimate decreased to 177 million. The article later states that \"[n]one of this is to say that fewer people have ‘coverage’ under Obamacare — it’s just not private coverage.\"", "Rothfus and his colleagues didn’t qualify that in their op-ed, though. They wrote only that Obamacare covered 24 million fewer people than it expected to. In reality, it covers slightly more people than it was expected to.", "The piece of their claim that asserted \"the projected price tag has more than doubled at $2 trillion\" is a bit more complicated.", "In 2010, the CBO projected that between 2010 and 2019, the gross cost of the ACA to the federal government would be $938 billion, a number used by former President Obama. In its March 2016 report, the CBO estimated that between 2016 and 2026 — a similar length of time but a different time period — the gross cost of coverage provisions would be $1.9 trillion.", "Rosario blamed the discrepancy on Democrats, saying the original figure provided by the CBO in 2010 was a \"gimmick to make the cost of the bill look less up front than it would end up being.\"", "But cherry-picking those figures from either side of the aisle leaves out some key points. First, the CBO’s estimates for 2010 through 2019 included the first four years after the Act’s passage when spending was negligible, as the healthcare exchange didn’t launch until fall 2013 and Medicaid expansion was still being worked out in individual states.", "It makes more sense to compare the same years over a smaller time frame. In 2010, the CBO estimated that costs related to the Affordable Care Act would total $623 billion between 2016 and 2019. By March 2016, the projection had actually decreased to $157 billion, or by about 25 percent. The decrease in costs can be partially attributed to the Supreme Court’s decision that Medicaid expansion was optional for states.", "When taken year-by-year once the Act was in full effect, the CBO’s 2010 projections were actually above what they are now. The CBO wrote in a recent report that \"for 2019, for example, CBO and [the Joint Committee on Taxation] projected in March 2010 that the ACA’s insurance coverage provisions would have a net federal cost of $172 billion; the current projections show a cost of $123 billion — a reduction of $49 billion, or 28 percent.\"", "That checks out. In the CBO’s March 2010 report, it projected the gross cost of coverage provisions in 2019 would be $214 billion. Last year’s report projects the gross cost of coverage provisions in 2019 will be $164 billion, a decrease of $50 billion.", "The CBO has also warned against using the gross cost of coverage provisions (that’s the $1.9 trillion figure) to assert the \"price tag\" of the Affordable Care Act. That’s because the Act includes a number of tax provisions, penalty assessments and decreases in Medicare payments to hospitals that both bring in revenue and decrease overall costs. The CBO contends that because of that, the ACA is still expected to, on the net, reduce budget deficits.", "Representatives from both Kelly’s and Shuster’s offices did not respond to requests for comment.", "Our Ruling", "Three Republican congressmen wrote in an op-ed that \"Obamacare covers 24 million fewer people than it was expected to, and the projected price tag has more than doubled at $2 trillion.\"", "Obamacare actually covers slightly more people than it was expected to. Fewer people are expected to be covered by private health insurance, but the congressmen conflated that with the Affordable Care Act in totality.", "In addition, the projected gross cost of the ACA over a 10-year span has more than doubled to reach nearly $2 trillion, but original projections included several years in which spending was negligible. To assert that the \"price tag\" of Obamacare is $2 trillion is itself a misleading statement that ignores other provisions of the act that offset those costs.", "We rate the claim Mostly False.", "https://www.sharethefacts.co/share/66f65bf9-dd5a-4fed-b232-255de662be92", "Email, Kate Rosario. Spokeswoman, Rep. Keith Rothfus. Feb. 22, 2017.", "Email, Deborah Kilroe. Spokeswoman, Congressional Budget Office. Feb. 22, 2017.", "Letter. To Nancy Pelosi from the Congressional Budget Office and the Joint Committee on Taxation. March 20, 2010.", "News article. \"CBO Misses Its Obamacare Projection By 24 Million People.\" The Weekly Standard. March 2016.", "Op-ed. \"Relief from Obamacare: a better system ahead.\" Keith Rothfus, Mike Kelly and Bill Shuster. Feb. 19, 2017.", "PolitiFact. \"TV ad says health law’s cost is $2 trillion, ‘double what we were promised.’\" Angie Holan. July 12, 2012.", "Report. \"Federal Subsidies for Health Insurance Coverage for People Under Age 65: 2016 to 2026.\" Congressional Budget Office. March 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]