["The second phase of the Covid-19 vaccination in India began on March 1, 2021. The same day, NDTV tweeted that it would be administered to the Supreme Court judges. It also claimed that the judges would be given the option to choose between two vaccines. While the tweet has since been deleted, we managed to capture a screenshot.", "A user with the display name Major General Surinder Sharma tweeted the same while sharing NDTV’s report. (Archive link)", "SC Judge Can Choose Vaccine whereas ordinary citizen is not allowed to do so. Totally unfair & partisan conduct. Is it fear of the judiciary or is it favour rendered & banked for future. https://t.co/UUGPzPpYDz", "— Maj Gen Surinder Sharma (@Surinder_Sh) March 1, 2021", "Several others have also been posting this claim.", "Supreme Court Judges To Be Vaccinated From Tomorrow, Can Choose Vaccine – NDTV https://t.co/aMkYbc5FVo", "— FlaShBloG Live Entertainment © (@FlaShBloGLive) March 2, 2021", "It is noteworthy that India has authorized two COVID-19 vaccines for emergency use, including Covishield and Bharat Biotech’s Covaxin. The Serum Institute of India is producing the Oxford-AstraZeneca vaccine in India, known as Covishield. Prime Minister Narendra Modi has received the first dose of the locally produced Covaxin.", "Alt News performed a keyword search and found the related NDTV report, which has now been edited. The claim about Supreme Court judges getting the option to choose between the two vaccines has been removed in the updated piece. A cached version is still available on Google. (Archive link)", "On March 1, Livemint reported that the Health Ministry clarified that judges were not given an option to choose between the two available vaccines. The ministry stated that the vaccination drive would be conducted via the CoWIN platform only. This is a digital portal where the user can register themselves for the vaccination. It allows them to choose a time slot and centre to get the vaccine administered. The report quoted news agency ANI as saying that the vaccine would be given to judges on the Bench, their families, as well as retired judges.", "Reports in The Hindu and Financial Express also stated that Supreme Court judges would not be given the option to choose between Covaxin and Covishield.", "NDTV misreported that the judges of the Supreme Court would be allowed to choose which vaccine they wanted to receive. The Ministry of Health debunked this claim and NDTV subsequently updated its report however it does not carry a clarification.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]