["A video has gone viral with the claim that members of Shiv Sena shaved another man’s head and assaulted him. The video is circulating against the backdrop of Shiv Sena members caught thrashing an ex-Navy man on camera.", "This video is viral with the Hindi text, “In your Maharashtra, has Uddhav Thackeray’s government become a government of goons? Law has become a joke. (आपको की महाराष्ट्र में उद्धव ठाकरे की सरकार गुंडों की सरकार बन गयी है ? क़ानून का मज़ाक़ बना कर रख दिया.)", "Twitter user @abbas_nighat posted the video along with the viral text on September 14. It has been retweeted over 17,000 times and has 8 lakh plus views. (archived link)", "क्या अब लगता हे आपको की महाराष्ट्र में उद्धव ठाकरे की सरकार गुंडों की सरकार बन गयी है ? क़ानून का मज़ाक़ बना कर रख दिया 😡😡 Kindly RT pic.twitter.com/S17wQ9K8Qo", "— Nighat Abbass (@abbas_nighat) September 14, 2020", "Similarly Facebook page Acche Din posted the viral video on September 14. It has been viewed over 20 lakh times. (archived link)", "The video has been shared across social media by Facebook and Twitter users.", "Alt News performed a keyword search on YouTube and found that the incident indeed took place, however, it’s from last year. The video was aired by several media outlets including NDTV, HW News English, Mumbai Live, and Republic TV. As per the reports, the incident happened in December 2019, and the man who was attacked is Hiramani Tiwari.", "As per The Hindu, an FIR was filed against Shiv Sena leader Samadhan Jugdar and three others for unlawful assembly, rioting, assault, intentional insult to provoke breach of peace, and criminal intimidation under the Indian Penal Code at Wadala TT police station.", "Wadala tonsuring incident: FIR registered against #ShivSena leader | reports @NotMengele https://t.co/Kv3xMBs7n6", "— The Hindu-Mumbai (@THMumbai) December 26, 2019", "While speaking to Republic, Tiwari said that he had called Uddhav Thackeray takle (bald) while criticizing him for linking police action on Jamia campus to Jallianwala Bagh Massacre. After he posted this, Tiwari’s acquaintances from Shiv Sena pointed out he should delete the post. Despite doing so, Tiwari was attacked by 25 Shiv Sena members a day later. Tiwari added that police arrived shortly after the incident and arrested the culprits however Tiwari was advised to strike a compromise.", "Maharashtra CM’s son Aaditya Thackeray wrote on December 24, 2019, “Law and order is a subject of police and shouldn’t be taken into anyone’s hands.”", "Our statement on trolls and reactions. pic.twitter.com/AvTUnAZo5H", "— Aaditya Thackeray (@AUThackeray) December 24, 2019", "The video shows Shiv Sena members assaulting a man for his post on social media. This incident happened on December 22, 2019. It was shared without any context thus misleading viewers to believe that the incident took place recently.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]