["Last week, after Time magazine announced its annual \"Person of the Year,\" images of the magazine's cover flooded social media.", "Some of the covers posted to Facebook featured three individuals: President-elect Joe Biden, Vice President-elect Kamala Harris and Chinese President Xi Jinping, along with the text \"Xi Jinping, Joe Biden, and Kamala Harris – Changing America's Story.\"", "One of the images – posted by The Committee to Defend the President, a page that favors President Donald Trump – had over 1,000 shares before the post was deleted. We Are TRUMP Nation also posted a photo of the cover with the caption, \"Time's Persons of the Year, we're screwed.\"", "The pages have not responded to requests from USA TODAY for comment.", "Time magazine awarded the title of 2020 \"Person of the Year\" to just two of the three individuals on those covers – Biden and Harris, not Xi.", "Time Editor-in-Chief Edward Felsenthal explained that the duo received the accolade \"for changing the American story, for showing that the forces of empathy are greater than the furies of division, (and) for sharing a vision of healing in a grieving world.\"", "Time displays all of its published covers in \"The Vault.\" The most recent cover – slated for Dec. 21 – features Biden and Harris.", "The posts that show Biden, Harris and Xi on the cover appear to be a photoshopped version of the actual magazine cover. On the real cover, photos of Biden and Harris in profile overlap each other. On the altered cover, Xi is awkwardly slotted between the two.", "A number of other imperfections on the cover also suggest that it is fake. Unlike Biden and Harris, the profile of Xi lacks a neck or torso, and there is a faint red outline on part of his face and hair.", "Fake covers targeting the magazine have previously appeared online – including another cover that showed \"The Medical Workers\" as the 2020 \"Person of the Year.\"", "In 2017, the longtime trend even prompted Time to publish a guide on the subject of spotting fake covers. It includes tips on how to examine the logo, the border, the image and the typography for clues about a cover's veracity.", "Indeed, a close inspection of the typography on the fake cover featuring Xi reveals that his name is a slightly different font than Biden and Harris.", "Based on our research, the claim that Biden, Harris and Xi appear on Time magazine's cover as Person of the Year is an ALTERED image. Only Biden and Harris received the accolade and a spot on the magazine's actual cover. Posts that show Biden, Harris and Xi on the cover are photoshopped.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]