["About this rating", "New York City announced a \"Green New Deal\" in April 2019 that would reduce the amount of processed meat purchased by government-run facilities such as hospitals, schools, and correctional facilities.", "New York City did not ban hot dogs outright. Restaurants, hot-dog stands, grocery stores, and other privately owned businesses will still be able to sell hot dogs.", "On 22 April 2019, New York City Mayor Bill de Blasio announced the city's \"Green New Deal,\" an \"audacious plan to attack global warming on all fronts.\" While this package of investments and new legislation covered several approaches to reduce emissions by nearly 30 percent by the year 2030, a number of outlets focused their headlines on one specific fast-food item: hot dogs.", "An article published on iHeartRadio's platform, for instance, was misleadingly entitled \"NYC To Ban Hot Dogs and Processed Meats To Improve Climate.\" As this article and others like it circulated on social media, many viewers apparently stopped reading after the headline and came away with the belief that hot dogs had been banned city-wide:", "One Twitter user wrote: \"NYC Mayor - you just made enemies of a lot of NYC vendors who sell great hot dogs, the citizens & visitors who love them! Repeat: You will make NYC a ghost town by 2030 if you continue this ridiculous green deal! New Yorkers, speak up!\"", "Hot dogs are not being banned in New York City. Headlines such as \"NYC To Ban Hot Dogs and Processed Meats To Improve Climate\" are misleading for two reasons.", "First, hot dogs are not being banned throughout the city. The city government plans to reduce the purchase of processed meats consumed at city-run facilities, such as hospitals, public schools, and correctional facilities, but this policy will have no effect on vendors, restaurants, grocery stores, or any other privately owned businesses that sell hot dogs, or on their customers who eat them.", "Second, the city's plan to reduce the consumption of hot dogs is only partly based on an effort to \"improve climate.\" NYC's \"Green New Deal\" policies are part of the city's \"OneNYC 2050: Building a Strong and Fair City\" strategy. While these policies address climate-change issues, they also deal with community well-being and the general health of the city's population. The section of OneNYC 2050 dealing with processed meats can actually be found in the \"Healthy Living\" portion of this strategy. More specifically, the section dealing with processed meats explains that reducing the consumption of hot dogs will lower the risk of heart disease and cancer.", "Here's the relevant section of OneNYC 2050 (emphasis ours):", "ADOPT MORE SUSTAINABLE CONSUMPTION PRACTICES IN CITY GOVERNMENT OPERATIONS", "The City will shift away from goods that have an outsized impact on the environment and identify opportunities to reduce waste and cut GHG emissions throughout City government. Through updates to our Environmentally Preferable Purchasing (EPP) and executive action, we are ending the purchasing of unnecessary single-use plastic foodware, reducing the purchasing of beef, and phasing out the purchasing of processed meat.", "Single-use plastic foodware — including straws, cutlery, cups, plates, bowls, and trays — are designed to be used once and then thrown away. These petroleum-based products are a threat to our neighborhoods, waterways, and climate. The City is ending the purchasing of unnecessary single-use plastic foodware, switching to compostable, reusable, or recyclable alternatives while maintaining a sufficient supply of single-use plastic foodware for those who need it. And we will work with City Council to expand these requirements to private businesses.", "Building on the success of implementing Meatless Mondays at all New York City public schools, the City will reduce the purchasing of beef by 50 percent. Beef has a relatively high environmental footprint compared to poultry, pork, and plant-based foods. Beef cattle, managing manure, and manufacturing fertilizer produces nitrous oxide and methane, two climate-warming pollutants 298 and 25 times more powerful than carbon dioxide, respectively.", "Processed meat consumption is linked with increased risk of cancer and is often high in saturated fat and sodium which is linked with heart disease. This policy would offer health benefits to the most vulnerable New Yorkers.", "So New York City plans to reduce the consumption of processed meats at city-run facilities such as hospitals, public schools, and correctional facilities. But this plan will not \"ban\" hot dogs in the city. Restaurants, hot dog stands, grocery stores, and other privately owned businesses will still be able to sell hot dogs in the city.", "Moore, Deanna.   \"NYC To Ban Hot Dogs and Processed Meats To Improve Climate.\"\r\n    v1017.iheart.com.   23 April 2019.", "NYC.Gov.   \"Action on Global Warming: NYC's Green New Deal.\"\r\n    22 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]