["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Election worker Kristen Mun from Portland empties ballots from a ballot box at the Multnomah County Elections Division, Tuesday, Nov. 3, 3030 in Portland, Ore. (AP)", "H.R. 1 requires states to use “objective and reliable evidence” to remove ineligible voters.", "Stefanik was referring to a section in H.R. 1 that bans people from corruptly interfering with another person from registering to vote. But nothing in this section prohibits election officials from removing ineligible people on the voter rolls.", "A separate section says voters can’t be removed just because they didn’t vote in a past election. Another requires that registrants be notified if they are removed from the voter rolls.", "A common attack on H.R. 1, the Democrats’ voting rights bill, is that the legislation would open the door to voter fraud and allow ineligible people to cast ballots.", "In a tweet, Rep. Elise Stefanik, R-N.Y., made a series of attacks on the legislation, including that it would \"prevent removal of ineligible voters from registration rolls.\"", "H.R.1 WOULD: ✖️Use taxpayer $ to fund campaigns✖️Ban voter ID✖️Prevent removal of ineligible voters from registration rolls✖️Allow felons and minors to vote✖️Allow 15 days of early voting✖️Accept absentee ballots 10 days after Election Day✖️Legalize ballot harvesting", "During the 2020 presidential election, some social media posts or allies of then-President Donald Trump spread misleading or false information about ineligible voters — dead people and pets among them — being on voter rolls. Election officials are required by law to maintain accurate voter registration lists.", "H.R. 1 includes steps elections officials must take before removing voters, but it’s wrong to say that the legislation would prevent removal of ineligible voters. The House approved the legislation March 3 and it now heads to the Senate.", "Known as the For the People Act, H.R. 1 combines proposals for voter registration, absentee voting, in-person voting, campaign finance and ethics related to federal elections.", "A spokesperson for Stefanik pointed to a section of the bill, Section 1071, that deals with prohibiting or interfering with voter registration. It states that it is unlawful for any person \"to corruptly hinder, interfere with, or prevent another person from registering to vote.\" Violations could lead to a fine as well as up to five years in prison.", "Stefanik spokesperson Karoline Leavitt told PolitiFact that the legislation \"would criminalize the refusal to accept a voter registration application, even if the application does not meet the requirements,\" and that would lead to local officials not removing ineligible voters out of fear of prison time. But that distorts what the bill says.", "Experts who have analyzed H.R. 1 emphasized that the section highlighted by Stefanik targets corrupt efforts to prevent someone from registering to vote. The provision doesn’t ban election officials from their responsibility to remove ineligible voters.", "That section \"does not have anything to do with list maintenance and voter removal from the registration lists,\" said Matthew Weil, an expert on elections at the Bipartisan Policy Center.", "Federal laws currently require states to remove dead people from voter rolls, prohibit states from removing registrants within 90 days of an election, and require states to set basic requirements for maintaining voter rolls.", "Many states get help from a national consortium, the Electronic Registration Information Center, that shares information with states about voters who moved, or died or have duplicate registrations. But some ineligible voters have remained on the rolls, and in other cases election officials have wrongly purged otherwise valid voters. Mass removals of voters can result in removing largely African American or Hispanic voters.", "Sarah Brannon, an expert on H.R. 1 at the American Civil Liberties Union, said Section 2502 of the bill specifically allows election officials to remove ineligible voters.", "\"The reform in H.R. 1 would be to require evidence that the individual is in fact not eligible before the removal,\" Brannon said. \"But this in no way would prevent the removal of ineligible voters from voter rolls.\"", "H.R. 1 attempts to improve the process of removing ineligible voters by requiring states to use what it calls \"objective and reliable evidence\" to remove voters.", "The legislation states that voters can’t be removed just because they didn’t vote in a past election. Within 48 hours of removal, the state must send a notice to the former registrant, unless the person died, telling them why they were removed and how they can contest the removal.", "H.R. 1 encourages states to use ERIC, an interstate data crosscheck system, which allows states to share data about voters who moved out of state, as well as other data, said Danielle Lang, a voting rights expert at the Campaign Legal Center.", "The legislation says that when states are removing voters, they should have the relevant information to confirm the person’s ineligibility including the person’s name, date of birth and last four digits of their Social Security number.", "\"Absent those standards, prior cross checks have been riddled with errors,\" Lang said.", "Whether the legislation would result in a change in the number of voters removed from the rolls is anybody’s guess.", "Bradley Smith, a law professor at Capital University Law School, said H.R. 1 changes the evidence required to determine that a registration is likely no longer eligible, and therefore will make it harder to remove names. But, Smith said, \"nothing in H.R. 1 prevents removal of ineligible voters per se.\" The organization Smith heads up, The Institute for Free Speech, has  criticized H.R. 1.", "David Becker, executive director of the Center for Election Innovation & Research, said election officials could still remove people for common, legitimate reasons.", "\"I see nothing in H.R. 1 that would significantly restrict the ability of a state to accurately remove a voter from the voter lists if they had moved out-of-state or died,\" Becker said.", "Stefanik said H.R. 1 will \"prevent removal of ineligible voters from registration rolls.\"", "No section of the bill prevents an election official from removing an ineligible person on the voting rolls.", "One section of H.R. 1 details rules that states must follow for removing ineligible voters, including that it must notify the registrants.", "We rate this statement False.", "RELATED: Trump misleads about HR 1 and voter registration for welfare recipients", "RELATED: Yes, the ACLU has criticized HR 1. Here’s why", "RELATED: Group makes bogus attack on HR 1 over congressional salaries", "RELATED: Fact-checking misleading attacks on HR 1, Democrats’ voting rights bill", "Rep. Elise Stefanik, Tweet, March 3, 2021", "Congress.gov, H.R.1 - For the People Act of 2021, Introduced Jan. 4, 2021", "Bipartisan Policy Center, Can H.R. 1 Improve Voter Registration? March 2, 2021", "Campaign Legal Center, The Bipartisan Origins & Impact of the For the People Act (H.R. 1/S. 1) Jan. 25, 2021", "Campaign Legal Center, For a More Accessible, Transparent and Responsive Government, CLC’s Trevor Potter Encourages Congress to Pass the \"For the People Act,\" Jan. 4, 2021", "Campaign Legal Center, How H.R. 1 Will Help Us Achieve a Government for the People, Jan. 4, 2021", "Brennan Center for Justice at NYU, Annotated Guide to the For the People Act of 2021, Jan. 20, 2021", "R Street, A Primer on H.R. 1, the \"For the People Act of 2021\" March 1, 2021", "Telephone interview, Sarah Brannon, managing attorney for the Voting Rights Project at the American Civil Liberties Union, March 3, 2021", "Telephone interview, Wendy Weiser, director of the Democracy Program at the Brennan Center for Justice at NYU School of Law, March 3, 2021", "Email interview, Matthew Weil, director of the elections project at the Bipartisan Policy Center, March 3, 2021", "Email interview, Karoline Leavitt, U.S. Rep, Elise Stefanik spokesperson, March 3, 2021", "Email interview, David J. Becker, Center for Election Innovation & Research executive director and founder, March 3, 2021", "Email interview, Danielle Lang, Co-Director, Voting Rights & Redistricting, March 3, 2021", "Email interview, Bradley A. Smith, Capital University Law School professor, March 3, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]