["About this rating", "At least one of the components listed by blog posts for dryer sheets (fragrance) was accurate.", "A number of the listed \"chemicals\" aren't toxic; most of the components do not appear to be commonly used in fabric softener sheet products; dryer sheets are subject to the same rigorous safety regulation as common household cleaners; the listed chemicals are classified as \"generally recognized as safe\".", "On 11 April 2016, blog posts appeared on health and wellness sites claiming that fabric softener dryer sheets are dangerous, toxic, interfered with the body's hormone regulation, and cause cancer. The posts listed several volatile organic compounds (or VOCs) as chemical culprits that cause \"hormone imbalance, neurotoxicity, respiratory problems, and even cancer\":", "In a recent study performed by UW professor Dr. Anne Steinemann, a research team conducted a small study to understand the effects of fragrances in laundry products (both detergent and dryer sheets). The results discovered more than 25 VOCs emitted from dryer vents, with highest concentrations of acetaldehyde, acetone, and ethanol (two of which are considered carcinogenic). To put it in context, one of the carcinogenic VOC’s, acetaldehyde, had emissions that would represent 3% of total acetaldehyde emissions from automobiles in the study area. This is a major omission of toxic chemicals.", "Before even reviewing any published material it was clear the blog author had conflated dryer sheets, laundry detergents, and dryer emissions. The study that it referenced had been published several years before — a press release on Steinemann's web site was dated to 2010, where she pointed out that \"green\" laundry products scored no better than their competitors in lab testing:", "“We analyzed best-selling products, and about half of them made some claim about being green, organic, or natural,” said lead author Anne Steinemann, a UW professor of civil and environmental engineering and of public affairs. “Surprisingly, the green products’ emissions of hazardous chemicals were not significantly different from the other products.”", "We found a paper published in the journal Environmental Health Perspectives in January 2011, which gave a literal laundry list of \"25 air fresheners, laundry detergents, fabric softeners, dryer sheets, disinfectants, dish detergents, all-purpose cleaners, soaps, hand sanitizers, lotions, deodorants, and shampoos\" that emit volatile organic compounds, and again, noted that \"green\" products give off just as many potentially harmful chemicals as their standard counterparts:", "Anne Steinemann, a professor of civil and environmental engineering and public affairs at the University of Washington, Seattle, and colleagues used gas chromatography–mass spectrometry to analyze VOCs given off by the products. They tested 25 air fresheners, laundry detergents, fabric softeners, dryer sheets, disinfectants, dish detergents, all-purpose cleaners, soaps, hand sanitizers, lotions, deodorants, and shampoos. Many of the products tested are top sellers in their category.", "A single fragrance in a product can contain a mixture of hundreds of chemicals, some of which (e.g., limonene, a citrus scent) react with ozone in ambient air to form dangerous secondary pollutants, including formaldehyde.2 The researchers detected 133 different VOCs. Most commonly detected were limonene, α- and β-pinene (pine scents), and ethanol and acetone (often used as carriers for fragrance chemicals).", "Steinemann and colleagues found the average number of VOCs emitted was 17.1 Each product emitted 1–8 toxic or hazardous chemicals, and close to half (44%) generated at least 1 of 24 carcinogenic hazardous air pollutants, such as acetaldehyde, 1,4-dioxane, formaldehyde, or methylene chloride. These hazardous air pollutants have no safe exposure level, according to the U.S. Environmental Protection Agency. Of the 133 VOCs detected, only ethanol was listed on any label (for 2 products), and only ethanol and 2-butoxyethanol were listed on any Material Safety Data Sheet (for 5 products and 1 product, respectively).", "The paper affirmed that products included in the study were subject to federal safety regulation, and Steinemann said that self-reporting symptoms was a significant aspect of her research:", "The Consumer Product Safety Commission, which regulates cleaning supplies, air fresheners, and laundry products, currently does not require manufacturers to disclose any ingredients on the label, including fragrances in these products. The same is true for fragrances in personal care items, which are overseen by the Food and Drug Administration. The Household Product Labeling Act, currently under review in the U.S. Senate, would require manufacturers to label consumer products with all ingredients, including fragrance mixtures. “Disclosing all ingredients could be a first step to understanding potential toxicity and health effects,” says Steinemann ... the authors did not seek to assess whether use of any of the products studied would be associated with any risk, [but] Steinemann says she receives hundreds of letters, phone calls, and e-mails from people who report a variety of respiratory, dermatological, and neurological problems they attribute to scented products: “Children have seizures after exposure to dryer sheets, and adults pass out around air fresheners,” she says.", "“It’s important to take people’s complaints seriously,” says Steinemann, because “these human experiences are helping to inform science.” One of her next projects will focus on biomarkers of exposure and effect to better understand how fragranced products may cause a range of adverse health effects. “The ultimate goal is to improve public health,” Steinemann says. For now, she recommends cleaning with basic supplies like vinegar and baking soda.", "While Steinemann did conduct research in 2010, that research was not restricted to dryer sheets and appeared to rely heavily on self-reported reactions to volatile organic compounds, which are not necessarily a reliable barometer of possible risk. There was no indication those compounds were found specifically in dryer sheets, rather than detergent, shampoo, aerosol air fresheners, lotions, or any of the other dozens of items included in Steinemann's research.", "None of the purported toxins were present in a popular brand of fabric softener [PDF]:", "Procter & Gamble provided the same information for other brands, including Gain and Downy:", "The blogs listed the following ingredients as toxic components of dryer sheets: Alpha-Terpineol, Benzyl acetate, Benzyl alcohol, Chloroform, Ethanol, Ethyl Acetate, Linalool, and Pentane. We were unable to find any of those ingredients on material safety data forms for dryer sheets, but all the cited ingredients (except chloroform) were classified by the Food and Drug Administration as generally recognized as safe (GRAS).", "We were unable to corroborate the claim that chloroform was commonly (or even infrequently) present in any fabric softener dryer sheets.", "Hickey, Hannah.    \"Scented Consumer Products Shown to Emit Many Unlisted Chemicals.\"\r\n    University of Washington Press Release.    26 October 2010.", "Potera, Carol.    \"INDOOR AIR QUALITY: Scented Products Emit a Bouquet of VOCs.\"\r\n    Environmental Health Perspectives.    January 2011.", "U.S. Food and Drug Administration.    \"CFR - Code of Federal Regulations Title 21.\"\r\n    21 April 2015.", "P&G.    \"Product Safety & Compliance.\"", "Sun Products Corporation.    \"Material Safety Data Sheets & Ingredient Disclosure.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]