["After Meghan Markle and Prince Harry's prime-time interview with Oprah Winfrey aired on March 7, some took to social media to claim that the Duke and Duchess of Sussex made millions from the CBS special.", "As many as 17.8 million viewers tuned in to the interview, in which Meghan said there were \"concerns\" about the color of her first child's skin, and that she had suicidal thoughts while pregnant but did not receive any support from the royal family.", "Many quickly speculated that Meghan and Harry were paid for their shocking revelations.", "A post shared by Click It Conservative News on March 10 reads, \"When a Hollywood actress gets paid $7,000,000 to complain to a billionaire talk show host about how becoming a princess made her a victim, it becomes clear that America is in dire need\" of a \"better class\" of attention seekers.", "Accompanying the text is an image of Markle, Prince Harry and Winfrey from the interview. The post has over 1,700 shares and 3,000 reactions.", "Another user wrote in a March 8 text post, \"Meghan and Harry made 7 million dollars from talking to Oprah. How much did we make for talking about it all damn day?!\"", "USA TODAY reached out to Click It Conservative News and the Facebook user for comment.", "Fact check: No, Oprah did not wear an ankle monitor during interview with Harry and Meghan", "At the beginning of the two-hour event, Winfrey addressed the speculation and confirmed that the couple did not receive payment for their participation.", "\"Before we get in to it, I just want to make it clear to everybody that even though we’re neighbors ... that there has not been an agreement, you don’t know what I’m going to ask, and there is no subject that’s off-limits and you are not getting paid for this interview,\" Winfrey said.", "Meghan responded with, \"That is correct.\"", "A representative for the Sussexes also confirmed toBusiness Insider India that the couple was not paid to take part in the interview. USA TODAY reached out to Harpo Productions, Winfrey's production company, for further comment.", "During the interview, Harry revealed that the royal family cut off the couple financially in early 2020 when they stepped away from their roles as \"senior\" royals. Because of this, they signed deals with different platforms such as Netflix and Spotify to pay for their own security, according to CBS News.", "Harry also said that the couple has been living off his inheritance from his mom, the late Princess Diana, and \"without that, we would not be able to do this,\" he said.", "Fact check:Prince Harry's children could run for president under certain conditions", "According to the Wall Street Journal, ViacomCBS, CBS' parent company, paid a license fee between $7 million and $9 million to Harpo Productions for exclusive rights to air the interview.", "The multimillion-dollar license fee gave ViacomCBS the right to air the interview in U.S. and international markets.", "In the U.K., ITV secured rights to air the interview rights and reportedly paid 1 million pounds for it, The Guardian reported.", "Fact check: Rep. Alexandria Ocasio-Cortez's net worth is not close to $1 million", "The claim that Duchess Meghan Markle and Prince Harry were paid $7 million for their interview with Oprah Winfrey is FALSE, based on our research. A representative has confirmed that no payment was made to the couple for their participation. CBS paid $7 to $9 million for exclusive rights to the interview, which went to Harpo Productions, Winfrey's production company.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]