["The video was published on Facebook here on July 8, 2020. It has been viewed more than 43,000 times.", "The six-minute 12-second clip shows Philippine celebrities, artists and public officials speaking to the camera, followed by interviews about the country’s recently enacted anti-terrorism law.", "The post’s Tagalog-language caption translates to English as: \"Famous stars and other prominent personalities expressed support for the Anti-Terror Law. / #JunkTerror #SupportAntiTerrorLaw\".", "The claim circulated online just days after Philippine President Rodrigo Duterte signed a law on July 3, 2020 that gives Philippine security forces sweeping powers target terrorists, but which critics warn could be used to crackdown on opponents of the government, AFP reported here.", "The same video was also shared here and here on Facebook alongside a similar claim.", "The claim is false; the video has been doctored.", "Keyword searches on Google found the video in the misleading posts corresponds to this footage posted to Facebook on July 6, 2020.", "Contrary to the claim in the misleading posts, the original video calls for the abolishment of the Philippines’ controversial anti-terror law. The Facebook post's caption states in part: “The Great Dictator Speech #JunkTerrorLaw #UnitedForDemocracy”.", "The video shows the same group of people reciting a Tagalog-language translation of Charlie Chaplin’s famous speech in the movie “The Great Dictator”, which advocates for citizenry over dictatorship.", "Below is a screenshot comparison of the video in the misleading posts (L) and the original video (R):", "AFP analysed how the audio in the original video has been altered. The manipulated sections include:", "1. At the five-second mark of the original video, actor John Lloyd Cruz says: \"I’m sorry, but I don’t want to be a dictator.\"", "But in its corresponding portion in the misleading video, at the six-second mark, the dubbed audio states: \"I’m sorry, but I don’t want to be a terrorist.\"", "2. At the original video’s one-minute 38-second mark, human rights lawyer Chel Diokno says: “More than knowledge, we need goodness of heart and kindness.”", "That was dubbed with “More than knowledge, goodness of heart is needed, support anti-terror law”, as heard at the one-minute 39-second mark of the misleading video.", "3. In the original video, at the one-minute 29-second mark, Jose Luis Martin C. Gascon, chairperson of the Philippine Commission on Human Rights, can be heard saying: “We think too much, that we have almost lost our feelings.”", "But in the doctored video, at the one-minute 30-second mark, the audio was dubbed to state: “They have too much rage, let us crush the terrorist.”", "Gascon told AFP in a text message on July 16, 2020: “Concerned citizens from different sectors participated in the rendering of a filipino version… of Charlie Chaplin's piece in the Great Dictator… That now there are unknown & nefarious elements who would twist the truth in this manner without the decency & courtesy of informing those same participants reflects a desperate attempt at obfuscating the public discourse on this.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]