["Some legislators see the legal manufacture and use of bump stocks — found on 12 of the 23 guns in the Las Vegas gunman’s Mandalay Bay hotel room — as a loophole in firearms regulation.", "State Sen. Michael Williams, a Republican candidate running in Georgia’s gubernatorial primary, recently came out against any legislation banning the devices, which can be attached to a semiautomatic weapon to simulate the rate of fire of a fully automatic weapon.", "To stress his point, he announced he would give away a free bump stock to a random person who enters the giveaway event.", "\"The tragedy in Las Vegas broke my heart, but any talk of banning or regulating bump stocks is merely cheap political lip service from career politicians,\" Williams said in a news release. \"In reality, the bump stock is the new, shiny object politicians are using to deceive voters into believing they are taking action against gun violence.\"", "Williams continued: \"Many firearms experts determined the Las Vegas shooter’s use of a bump stock actually prevented more casualties and injures (sic) due to its inconsistency, inaccuracy, and lack of control.\"", "That didn’t sound right to us, because the basic point of a bump stock is to help someone shoot really fast. The device allows the recoil from firing a semiautomatic weapon to slide the firearm back and forth. The movement \"bumps\" the trigger against the shooter’s finger without having to manually squeeze the trigger for each shot.", "We should note that police have not yet said precisely which weapons were used in the shooting.", "But we wanted to look into the claim that the gunman would have hurt fewer people had he not had the ability to fire rapidly. Is this a popular expert opinion?", "So who are these experts? We reached out to Williams and his campaign but received no response.", "The campaign has previously pointed to a post from Legally Armed America — written by Paul Glasco, who reviews guns and gun products — that argued that a ban on bump fire stocks would be useless to prevent these kind of attacks.", "As part of our own research, we talked to five experts who said Williams is factually correct on one point about the nature of this attachment: Because because bump stocks use a weapon’s recoil to allow the user to fire rapidly and repeatedly, the use of a bump stock makes the weapon more difficult to control when firing. This decreases the weapon’s accuracy, which depends on a weapon’s steadiness.", "Two experts supportive of gun rights — United States Concealed Carry Association president Tim Schmidt and lawyer John Pierce — were not convinced bump stocks would have made the crime more deadly.", "They agreed that a more accurate weapon could have hurt more people, but they needed more information about the crime to come to a conclusion.", "But three of the five experts said the rapid gunfire is likely what made the recent shooting so devastating.", "Adam Winkler, a law professor at the University of California, Los Angeles, who specializes in firearms, said the use of a semiautomatic weapon without a bump stock would have made a difference if the Las Vegas gunman was trying to hurt a specific person.", "\"When you don’t care who you hit, being a little more inaccurate doesn’t matter,\" Winkler said.", "To be fair, Arthur Alphin, a retired Army lieutenant colonel and West Point graduate, made the case to the Los Angeles Times that accuracy did matter, but so did the rapid fire. The weapon could have been held steady with a bipod, which was found in the gunman’s room.", "If the gunman had been trained by military or law enforcement, an unaltered semiautomatic weapon could have been more harmful than one outfitted with a bump stock, said Rick Vasquez, a former assistant chief and acting chief of the Bureau of Alcohol, Tobacco, Firearms and Explosives’ firearms technology branch.", "But given the gunman’s lack of formal training and the fact that the crowd at the Route 91 Harvest music festival was somewhat blocked in, \"any device that is going to spray a lot of ammunition is going to be more deadly,\" Vasquez said.", "\"He was shooting into a densely packed crowd of thousands of people,\" said Gary Kleck, a criminologist from Florida State University who studies the effects of guns on injuries and death in crimes. \"The main effect of using bump stocks in this particular situation was to increase the number of rounds the shooter could fire in a short period of time before police crashed into his hotel room, which increased the numbers of victims hit somewhat randomly.\"", "The Las Vegas Metropolitan Police Department declined to comment, citing the ongoing nature of the investigation.", "Williams said many firearms experts have determined that the use of a bump stock in the Las Vegas shooting prevented more injuries and deaths than would have otherwise occurred had he not used a bump stock.", "Outside of a blog from a pro-gun rights group, we did not find \"many firearms experts\" making that argument.", "We did learn that bump stock devices tend to affect a weapon’s accuracy. But we found several firearms experts who attributed the high number of people injured and killed to the shooter’s ability to fire rapidly, which a bump stock would have amplified.", "We rate this statement False.", "The Associated Press, \"Once an obscure device, ‘bump stocks’ are in the spotlight,\" Oct. 4, 2017", "The New York Times, \"Bump Stock Innovator Inspired by People Who ‘Love Full Auto’,\" Oct. 5, 2017", "The Washington Post, \"The Las Vegas shooter modified a dozen rifles to shoot like automatic weapons,\" Oct. 3, 2017", "The Los Angeles Times, \"The trigonometry of terror: Why the Las Vegas shooting was so deadly,\" Oct. 4, 2017", "CNN, \"Georgia GOP gubernatorial hopeful to hold bump fire stock giveaway,\" Oct. 17, 2017", "Legally Armed America, \"Why banning bump fire stocks is not the answer,\" Oct. 5, 2017", "Michael Williams campaign, press release, Oct. 17, 2017", "Phone interview, Rick Vasquez, former assistant chief and acting chief of the ATF’s firearms technology branch, Nov. 6, 2017", "Phone interview, Tim Schmidt, United States Concealed Carry Association President, Nov. 7, 2017", "Phone interview, Adam Winkler, law professor at the University of California, Los Angeles, Nov. 7, 2017", "Email, Gary Kleck, criminologist at Florida State University, Nov. 6, 2017", "Email, John Pierce, lawyer and gun rights advocate, Nov. 8, 2017", "Email, Las Vegas Metropolitan Police Department Office of Public Information, Nov. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]