["About this rating", "In the summer of 2018, President Donald Trump's \"zero tolerance\" immigration policy was met with widespread criticism, prompting the Trump administration to scale back elements of the plan (which saw thousands of children separated from their parents at the southwestern border) after less than three months.", "However, the opposition to that policy prompted allegations of hypocrisy leveled by supporters of President Trump against his predecessor, Barack Obama. Some of those comparisons were inaccurate and misleading, as we have examined here previously.", "Commentators and social media users brought up an old statement made by Barack Obama back when he was a U.S. Senator representing Illinois, in which he expressed opposition to \"undetected, undocumented, unchecked\" immigration. The highlighting of that statement was intended to create an equivalence between the views expressed by Barack Obama in 2005 and the \"zero tolerance\" policy enacted by his successor in the White House in 2018, and (either explicitly or implicitly) level the charge of partisan opportunism and hypocrisy against liberal opponents of Trump's policies.", "On 23 June, Fox News contributor Gary Kaltbaum appeared on Cavuto Live and read out the statement in question:", "I have to just read a quote to you:", "\"We simply cannot allow people to pour into the U.S., undetected, undocumented, unchecked and circumventing the line of people who are waiting patiently, diligently, lawfully to become immigrants in this country\" — 2005, Senator Barack Obama. He sounds like Donald Trump, and throughout the years, a lot of Democrats have talked like that but when it comes down to doing something about it? Never, ever happens.", ".@GaryKaltbaum: \"A quote...'We simply cannot allow people to pour into the U.S. undetected, undocumented, unchecked, and circumventing the line of people who are waiting patiently, diligently, and lawfully to become immigrants in this country.' - 2005, Sen. @BarackObama.\" pic.twitter.com/K0wvAR6ljX", "— Fox News (@FoxNews) June 23, 2018", "On 18 June 2018, the quote was posted on the popular pro-Trump Reddit forum /The_Donald, and on 23 July, Val DiGiorgio (chairman of the Chester County, Pennsylvania Republican party) posted a meme showing a photograph of Obama along with the same quote that Kaltbaum read out on Fox News:", "Obama did indeed speak these words in 2005, and also said something very similar in 2006, although his expressed opposition to unchecked illegal immigration in 2005 was not the same as support for the \"zero tolerance\" immigration policy implemented by the Trump administration in 2018.", "On 15 December 2005, Barack Obama joined Republican Senator Mel Martinez of Florida in a press conference about bipartisan efforts to bring about immigration reform, during which the former stated:", "We all agree on the need to better secure the border and to punish employers who choose to hire illegal immigrants. We are a generous and welcoming people, here in the United States, but those who enter the country illegally, and those who employ them, disrespect the rule of law and they are showing disregard for those who are following the law.", "We simply cannot allow people to pour into the United States, undetected, undocumented, unchecked and circumventing the line of people who are waiting patiently, diligently and lawfully to become immigrants in this country.", "Obama then laid out the three basic principles of his preferred approach to immigration reform: enhanced border security and enforcement, a guest worker program and electronic verification capabilities for employers, and an \"interim legal status\" for the millions of undocumented immigrants living in the United States whereby those who entered the country illegally would pay a \"hefty fine\" and \"go to the back of the line\" before applying for U.S. citizenship.", "The future president repeatedly criticized any approach to immigration reform that focused only on enforcement measures. Immediately after uttering the words that would be recirculated in 2018, Senator Obama continued on to say:", "That's why we need to start by giving agencies charged with border security new technology, new facilities, and more people to stop, process and deport illegal immigrants. Having said that, securing the borders alone does not solve immigration management. We're going to have to better manage legal immigration in order to end illegal immigration.", "...Some of the proposed ideas in the House that's [sic] being debated today and tomorrow call only for increased enforcement at the borders and at the workplace. If the policy we end up with tells these immigrants that they will never be good enough to become Americans, then the policy will not work. Part of ending illegal immigration will have to be reforming legal immigration to better reflect our demands for immigrant workers.", "On 3 April 2006, Senator Obama spoke from the floor of the Senate on the subject of immigration reform. In the time-honored tradition of politicians everywhere, the senator re-used many of the phrases and arguments he had deployed a few months earlier:", "The American people are a welcoming and generous people. But those who enter our country illegally, and those who employ them, disrespect the rule of law. And because we live in an age where terrorists are challenging our borders, we simply cannot allow people to pour into the United States undetected, undocumented, and unchecked. Americans are right to demand better border security and better enforcement of the immigration laws.", "However, Obama again emphasized that enhancing enforcement alone would not, in his opinion, be an effective way to reform the U.S. immigration system. He also again underscored his support for a three-pronged approach: better border security and enforcement, a guest worker program with enhanced protections for the rights of immigrant workers and a system for employers to check the legal status of would-be employees, and a conditional path to citizenship for immigrants who had entered the country illegally.", "(A full transcript of Obama's 2006 remarks is available here, on page 24.)", "'He Sounds Like Donald Trump'", "In 2005, Obama did say: \"We simply cannot allow people to pour into the United States, undetected, undocumented, unchecked and circumventing the line of people who are waiting patiently, diligently and lawfully to become immigrants in this country.\" And he said something very similar a few months later, in 2006.", "However, in doing so he was merely articulating an orthodox, relatively uncontroversial position among most American politicians: that the U.S. ought not to have open, unmonitored borders, and immigrants who applied for a visa to live and work in the U.S. should be treated preferentially to those who simply crossed the border without legal status.", "At no time during the 2005 or 2006 speeches in question did Obama advocate the equivalent of a \"zero tolerance\" policy of processing even first-time \"improper\" border crossings via criminal trials, a prosecutorial shift which has necessitated the mass separation of children from parents at the southwestern border (a system we have written about in greater detail elsewhere).", "During his tenure as president, Barack Obama did oversee the criminal prosecution of some illegal border crossers (as opposed to the traditional approach of administrative removal), under a program known as Operation Streamline begun in 2005 during the administration of President George W. Bush. However, this approach was still largely limited to repeat offenders or those with criminal records, and first-time \"improper\" entrants into the United States typically continued to be processed administratively before being deported.", "Crucially, the \"zero tolerance\" policy announced by Attorney General Jeff Sessions in April 2018 prescribed the criminal prosecution of all individuals crossing the border unlawfully, even for the first time -- a distinctive characteristic of the Trump policy, and the one that brought about the separation of thousands of families at the border, during the spring and summer of 2018.", "President Obama also oversaw an increase in the rate of deportations during his tenure as president, something that brought about the separation of some immigrant families already residing in the United States. But those families were not typically separated at the border, and this increase in deportations was partly attributable to a change in definitions used in compiling immigration statistics.", "Obama, Barack.   \"U.S. Senate Floor Remarks -- Immigration Reform.\"\r\n    Congressional Record, Vol. 152, No. 40.   3 April 2006.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]