["About this rating", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In June 2020, an image supposedly showing a white demonstrator at a Black Lives Matter protest holding a sign reading \"I'm Sorry I'm Late. I Had A Lot To Learn\" went viral on social media:", "Many people sharing this image added comments commending this man for taking the time to learn about a subject, changing his views, apologizing, and then speaking out for his beliefs — for example, one commentator wrote: \"This is a good man. There is so much strength in admitting you were wrong and actively changing.\"", "Others were suspicious of the image and claimed that the wording on the sign had been doctored.", "But this is a genuine photograph of a protester in Bethel, Ohio, who goes by Ryan D. \"Wheelz\" (a nickname given to him by his friends) on Facebook. He confirmed to us that he was the person in the photograph and that the signs in the image were genuine. He also shared a second image of himself with the \"I'm Sorry I'm Late. I Had A Lot To Learn\" sign to confirm the authenticity of the viral photo:", "The Black Lives Matter protest in Bethel, a small town in southern Ohio, made national news in June 2020. According to the Washington Post, the 80 or so people who turned out to protest racial injustice were met by about 700 counterprotesters:", "“A demonstration to show my neighbors there are people who care, to show my very monochromatic town that Black Lives Matter,” said Gee, a teacher who identified herself as a lifelong resident of the Cincinnati-area village of Bethel, Ohio — population roughly 2,800. It was a testament to the wide reach of the movement against racism and police brutality convulsing the country since George Floyd’s death in police custody triggered weeks of demonstrations that have swept from cities to suburbs and tiny Midwestern towns that haven’t seen protests in decades.", "But the 80 or so expected demonstrators ended up dwarfed Sunday afternoon by some 700 counterprotesters — members of motorcycle gangs, “back the blue” groups and proponents of the Second Amendment, village officials said. Some carried rifles, a local news station reported, while others brought baseball bats and clubs. Police say they are investigating about 10 “incidents” from the clashes that followed, including one in which a demonstrator was punched in the head.", "The above-displayed image first went viral on June 14 after it was shared to Facebook along with the caption: \"Sometimes it takes longer than others .., but when you get it you get it ..... ?? #bethelohio I see you ????????.\" Since then, Wheelz has made several posts on social media to give some context to the image and to explain why he chose to show up in support of Black Lives Matter.", "In one post, Wheelz, who presumably earned this nickname due to his use of a wheelchair, wrote:", "The black civil rights movements were the biggest supporters of the disability rights movements that happened from the late 70s through the early 90s, there's no way I could just sit idly by and watch these folks continuously get destroyed through systemic racism. Unfortunately in our country, particularly small towns many believe if it doesn't impact them directly, they shouldn't do anything about it.", "In another post, Wheelz said that he was only at the protest for a short time because \"counterprotesters\" started tearing down people's signs, shouting white power slogans, and using racial slurs. Still, when we spoke to him, he said that he hoped the image gave some evidence to Black Lives Matter activists that they had some support in rural communities.", "Wheelz, who told us that he once considered himself to be in the \"All Lives Matter\" camp, said:", "I hope that the photo lets people of color know that despite popular stereotypes, they have the love and support of many people in rural communities. I also hope it lets people know that it's OK to change your opinion when you're presented with new evidence that clearly shows you were wrong. I used to be in the \"all lives matter\" camp, which they all do but when individuals say black lives matter, it doesn't mean only black lives matter. When you examine the evidence it's very clear that this civil rights movement welcomes and advocates for people of many different backgrounds.", "Responses to this image had been overwhelmingly positive, but Wheelz said that he has experienced some harassment both on and offline. This doesn't appear to be deterrent, however, as Wheelz said, \"I have thick skin and this cause is worth the abuse I've had to deal with. This is much bigger than any one individual.\"", "The above-displayed image is genuine and shows a demonstrator at a Black Lives Matter protest in Bethel, Ohio, holding a sign reading, \"I'm Sorry I'm Late I Had a Lot to Learn.\" It should be noted, however, that this image has in some cases been shared with misinformation, including a post on the Other 98% Facebook page that insinuated that this protester had racist parents. Wheelz made it clear in a Facebook message that this was not the case:", "I want to make VERY CLEAR I wasn't raised by racist parents. I'm a big believer in continually educating yourself, and that is what has brought me to this point. Let's all be sure to keep the message clear and positive. Thanks for all the words of encouragement everyone.", "Knowles, Hannah.   \"A Tiny Ohio Town’s Black Lives Matter Event Was Overrun by Armed Counterprotesters.\"\r\n    The Washington Post.  16 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]