["About this rating", "On 11 March 2019, the Twitter account Medical Shots posted a pair of photographs that supposedly showed a woman's legs dressed in snake-printed pajamas and the injuries she allegedly received after her husband mistook her foot for a genuine snake and hit it with an iron stick:", "This woman was sleeping in snake printed pajamas and her one foot was outside the blanket. Well, her husband thought it was snake and he broke her foot with with an iron stick!", "The Medical Shots Twitter account was hardly the first to spread these images as a case of violent reptilian mistaken identity. The images are attached to the same back story shared on a variety of websites and social media pages since at least December 2018.", "The images, however, are unrelated, and the accompanying back story was fabricated.", "The photograph of the snake-print stockings appears to be a promotional image for a pair of novelty leggings available via eCommerce sites such as Amazon and AliExpress. The photograph of the bandaged foot comes from a January 2016 article published on a Vietnamese Wordpress website informing medical students on how to treat and sew a wound. While this medical site did not explain how the person sustained the injury (the site did include additional photographs of the foot prior to treatment), the patient in this case was a 36-year-old male, not a woman as described in the viral Facebook post.", "The photograph of the injured foot originally appeared on a medical website along with a number of other images (none of which featured snake socks) in an article about medical treatment. It wasn't until nearly two years later that it was accompanied by an unrelated image of snake stockings and a fabricated story about a startled husband.", "Thuctapngoai2014.   \"Kiến Tập Khâu Vết Thương, Bó Bột – Ngô Nguyễn Nguyên Chương, Tuần 2, Niên Học 2015-2016, Tổ 6, Y2013B.\"\r\n    17 January 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]