["About this rating", "In July 2016, Massachusetts' attorney general announced that her office would be \"stepping up enforcement\" of the state's long-existing ban on \"copycat assault weapons.\"", "In July 2016, Massachusetts implemented a new law banning the sale of all semi-automatic rifles.", "A month after the June 2016 mass shooting at an Orlando nightclub that left 49 victims dead, Attorney General Maura Healey of Massachusetts announced her department would be stepping up enforcement of a state ban on \"copycat assault weapons.\"  Predictably, this move by the Attorney General lead to the publication of articles with headlines such as \"This State Just Banned the Sale of ALL Semi-Auto Rifles, Effective Immediately,\" leaving readers with the mistaken impression that Massachusetts had just implemented a new law prohibiting the sale of all semi-automatic rifles.  In fact, that prohibition has been the law in Massachusetts since 1994.", "The roots of this issue were planted with the Federal Assault Weapons Ban passed by the U.S. Congress in 1994, which included a prohibition on the manufacture, transfer, and possession of new \"assault weapons\" and \"large capacity\" ammunition magazines (excluding those already in lawful possession at the time of the law's enactment).  Semi-automatic firearms such as the AR-70, AR-15, TEC-9, and all AK models were deemed to be \"assault weapons\" under the law, and the future manufacture of such firearms (as well as any copies or duplicates of them) for civilian use was outlawed.", "The Federal Assault Weapons Ban had a ten-year sunset provision, and that law accordingly expired in 2004. However, Massachusetts enacted a similar ban at the state level that included no sunset provision, so that law remains in effect today.", "The current issue in Massachusetts is that the existing law has long banned the sale of firearms such as the Colt AR-15 and the Kalishnikov AK-47, as well as \"copies\" and \"duplicates\" of such weapons. But Attorney General Healey maintains that firearm manufacturers have for years been evading Massachusetts law by making minor modifications to their \"assault weapons\" and claiming that the modified versions are \"state-compliant\" and not covered by the law:", "The Massachusetts assault weapons ban mirrors the federal ban that expired in 2004. It prohibits the sale of specific and name-brand weapons and explicitly bans copies or duplicates of those weapons. Gun manufacturers, however, make and market what they call “state compliant” versions with minor tweaks to various parts of the weapon. Copycat guns are sold, for example, without a flash suppressor or with a fixed instead of folding stock. These changes do not make the weapon any less lethal and the weapons remain illegal.", "On 19 July 2016, Healey issued an enforcement notice clarifying what constitutes a \"copy or duplicate weapon\" under the existing: law", "A weapon is a Copy or Duplicate and is therefore a prohibited Assault weapon if it meets one or both of the following tests and is 1) a semiautomatic rifle or handgun that was manufactured or subsequently configured with an ability to accept a detachable magazine, or 2) a semiautomatic shotgun.", "Similarity Test: A weapon is a Copy or Duplicate if its internal functional components are substantially similar in construction and configuration to those of an Enumerated Weapon. Under this test, a weapon is a Copy or Duplicate, for example, if the operating system and firing mechanism of the weapon are based on or otherwise substantially similar to one of the Enumerated Weapons.", "Interchangeability Test: A weapon is a Copy or Duplicate if it has a receiver that is the same as or interchangeable with the receiver of an Enumerated Weapon. A receiver will be treated as the same as or interchangeable with the receiver on an Enumerated Weapon if it includes or accepts two or more operating components that are the same as or interchangeable with those of an Enumerated Weapon. Such operating components may include, but are not limited to: 1) the trigger assembly; 2) the bolt carrier or bolt carrier group; 3) the charging handle; 4) the extractor or extractor assembly; or 5) the magazine port.", "If a weapon meets one of the above tests, it is a Copy or Duplicate (and therefore a prohibited Assault weapon), even if it is marketed as “state compliant” or “Massachusetts compliant.”", "In her announcement of the enforcement notice, Healey stated that the updated guidelines would not be applied to any weapons bought or sold prior to 20 July 2016:", "Here in Massachusetts, 10,000 assault weapons were sold just in the last year — each one nearly identical to the rifle used to gun down 49 innocent people in Orlando. In the week after the Pulse nightclub massacre, sales of weapons strikingly similar to the Sig Sauer MCX used at Pulse jumped as high as 450 percent over the previous week — just in Massachusetts.", "How in Massachusetts, then, home to some of the strongest gun laws in the country, do we allow people to buy these guns?", "The gun industry has found a way to exploit our laws, a loophole of potentially horrific proportions. And it’s time we act.", "That will end now. We are sending a directive to all gun manufacturers and dealers that makes clear that the sale of these copycat assault weapons is illegal in Massachusetts. With this directive, we will ensure we get the full protection intended when lawmakers enacted our assault weapons ban, not the watered-down version of those protections offered by gun manufacturers.", "We recognize that most residents who purchased these guns in the past believed they were doing so legally, so this directive will not apply to possession of guns purchased before [now].", "Critics have contended that the issuance of the updated guidelines will have little effect and was primarily motivated by Healey's interest in appearing \"tough on gun crimes\" ahead of a possible 2018 gubernatorial run.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]