["By Eugene Kiely", "Posted on July 11, 2018", "President Donald Trump exaggerated the size of the defense budget in a couple of ways in recent speeches and remarks:", "Trump made his remarks about the “record” defense spending during a July 3 visit to the Greenbrier Resort in White Sulphur Springs, West Virginia.", "Trump, July 3: We have secured, this year — with the help of [West Virginia Sen.] Shelley [Moore Capito] and your great congressman — a record $700 billion for our military. And next year, $716 billion — most amount ever.", "Trump is right about the dollar amounts, but he is talking about budget authority, which gives the department the legal authority to incur obligations. That’s different from how much is actually spent, which is known as budget outlays.", "The Bipartisan Budget Act of 2018, a two-year budget agreement that Trump signed into law Feb. 9, set the budget authority for national defense at $700 billion in fiscal year 2018 and $716 billion in fiscal 2019.", "Let’s look first at Trump’s repeated claim about $700 billion being “a record.” The president made a similar remark at a White House event on June 27, when he called the $700 billion for fiscal year 2018 “the largest ever for our military.” It is not.", "The budget authority for national defense was larger in nominal dollars, which are not adjusted for inflation, in 2010 ($721 billion) and in 2011 ($717 billion). That’s according to the White House’s own Office of Management and Budget. (See “Total, National Defense,” Table 5.1.)", "When adjusted for inflation, four other years since 1976 exceeded the fiscal 2018 budget authority, according to the Center for Strategic and Budgetary Assessments, a think tank headed by Thomas G. Mahnken, a Republican congressional appointee to the Commission on the National Defense Strategy for the United States.", "Jacob Cohn, a CSBA research fellow, calculated the real, or inflation-adjusted, value of budget authority amounts in fiscal 2019 dollars for us, based on the OMB’s deflators (table 10.1). Cohn’s calculations show that the $700.9 billion in budget authority for fiscal 2018 would be the equivalent of $712.6 billion in fiscal 2019 dollars — which was less than the inflation-adjusted amounts from 2007 through 2012. The peak during that time occurred in 2010, when Congress authorized $834.3 billion in 2019 dollars.", "As for Trump’s claim that $716 billion in budget authority for fiscal 2019 will be the “most amount ever,” Cohn looked at outlays — actual spending — instead of budget authority, because the data go back to 1940, covering World War II spending. He found that the “most amount ever” spent was in 1945, when the U.S. spent the equivalent of $950.1 billion (in 2019 dollars). More was also spent in 1943 and 1944, and in 2008 through 2012, which included the height of the Iraq and Afghanistan wars.", "Below is a chart that Cohn created for us that shows inflation-adjusted outlays for national defense since 1940.", "At a rally in Montana, Trump criticized the European Union, saying they “kill us” on trade. He then went on to attack NATO countries for failing to spend enough on their national defense. In doing so, Trump claimed that the U.S. defense budget is 4 percent of the nation’s gross domestic product. It isn’t.", "Trump, July 5: On top of that, they kill us with NATO. They kill us. So we pay 4 percent of a huge GDP, which got a lot bigger since I became your president.", "He reiterated that point on July 11 in Brussels for the NATO summit.", "Trump, July 11: On top of that, Germany is just paying a little bit over 1 percent, whereas the United States, in actual numbers, is paying 4.2 percent of a much larger GDP.", "NATO, the U.S. Department of Defense and the White House Office of Management and Budget all show the United States with a defense budget below 4 percent of GDP.", "The Department of Defense’s budget request for fiscal year 2019 shows that defense outlays were 3.0 percent of GDP in fiscal 2017 and were estimated to be 3.1 percent in fiscal years 2018 and 2019. The White House Office of Management and Budget offers a slightly higher estimate for this year at 3.2 percent of GDP. (See Table 8-4 of OMB’s historical tables.)", "The last time defense outlays reached 4 percent or more was 2012, according to both OMB and the Department of Defense. It was 4.1 percent of GDP in 2012, according to the Defense Department, while the OMB placed the figure at 4.2 percent that year.", "The department’s budget document includes a chart, displayed below, that shows the peak occurred in 1944 at 35.5 percent of GDP.", "NATO has a higher figure for the United States for 2018, but it is still not 4 percent.", "In a report dated July 10, NATO estimates that the U.S. defense expenditure as a share of GDP this year will be 3.5 percent. (NATO estimates Germany’s defense expenditure at 1.24 percent of GDP.) The report says each member country reports defense spending, or planned spending, to NATO, “according to an agreed definition of defence expenditure.”", "NATO explains that its share-of-GDP figures “may diverge considerably from those which are quoted by media, published by national authorities or given in national budgets.” That is the case with the U.S. figure, but neither NATO nor the U.S. show defense spending at 4 percent of GDP.", "In fact, defense spending would have had to total about $776 billion in 2017 (and even more in 2018) in order for the U.S. to have spent 4 percent of its GDP on defense.", "U.S. GDP in 2017 was $19.4 trillion, according to the U.S. Bureau of Economic Analysis. Four percent would be $776 billion — far more than the $700 billion in budget authority for fiscal year 2018 that Trump falsely claimed was “a record,” and the $716 billion that he said is the “most amount ever” spent.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]