["In his new film,\n\nCapitalism: A Love Story\n\n, Michael Moore contends the economic policies of President Ronald Reagan were the turning point toward widening the gap between the rich and everyone else. Once Reagan was elected, Moore said, the government was run like a business, and the president's tough stance on unions and his theory of \"trickle-down\" economics ended up hurting working Americans.", "In this item, we will look at Moore's claim in the movie that as productivity rose during the Reagan years, \"wages for working people remained frozen.\"", "We'll get right to the numbers from the Bureau of Labor Statistics.", "People generally look at \"output per hour\" for workers in the nonfarm business sector to track these kinds of trends. Essentially, it's the amount of value of product produced per hour of work by an employee.", "Generally, productivity has steadily increased for as long as those kind of statistics have been kept as people and businesses learn to work more efficiently. But by the late 1970s, productivity had begun to slow.", "During Reagan's time in office (1981 to 1989), however, the numbers grew from 81.7 to 92.8. So it's certainly fair to say productivity increased during the Reagan administration.", "Now on to wages. There are several ways to look at this. First is the hourly wages paid in current dollars (what workers were actually paid). By that count, average hourly wages increased from $7.44 to $9.80. But these were high inflation years, and so when you look at the hourly wages adjusted for inflation (\"real hourly compensation\"), wages remained fairly flat. In fact, based on 1982 dollars, real wages dipped slightly from $7.89 in 1981 to $7.75 in 1989.", "End of story?", "Not quite. We think a few qualifiers are in order. For one, wages aren't the only way workers are compensated. There's also health benefits and other compensation. When you look at the \"real compensation per hour\" paid by companies to nonsupervisory employees, the cost went from 90.2 in 1981 to 95.1 in 1989. So compensation to employees, even when adjusted for inflation, grew during the Reagan era.", "We also think it's worth noting that stagnation of average hourly earnings, adjusted for inflation, predated Reagan. Historical tables show that hourly wages climbed steadily through the 1960s and into 1970s, and then peaked in 1973. From that point on, \"real\" hourly wages declined for a few years and then pretty much froze until the late 1990s.", "But it wasn't until Reagan's presidency that productivity began to quickly outpace wages.", "Why? Economists have a host of theories.", "For one, new technology certainly allowed workers to build widgets much better and faster, said Chris Edwards, director of tax policy studies at the Cato Institute.", "But the reasons for the widening gap between productivity and wages are more complex and varied.", "Globalization of the economy, eroding of unions, regressive taxes, the declining value of minimum wage, a rise in the number of immigrants and deregulation of industry all contributed, said Heidi Shierholz of the Economic Policy Institute.", "Dean Baker of the Center for Economic and Policy Research believes the weakening of unions played a huge role.", "\"I think the bargaining power of workers took a big hit during the Reagan years,\" Baker said.", "The most notable example was when the Reagan administration broke the air traffic controllers union.", "\"That changed labor-management relations,\" Baker said.", "Moore cited an article by Baker called\n\n\"The Productivity to Paycheck Gap: What the Data Show\"\n\non a part of his\n\nfilm Web site\n\nthat provides backup for a number of claims in the film. And Baker said a fact-checker employed by Moore called him before the release of the movie to make sure he got it right.", "\"I think his (Moore's) comment was pretty much on the mark,\" Baker said.", "One other caveat to Moore's comment. He's talking here about wages for nonsupervisory production workers, which comprise about 80 percent of the work force. But not all. And that's why it's also true, according to the U.S. Census Bureau, that the mean average of real income rose by 15.2 percent from 1980 to 1989, from $33,409 to $38,493, in 1990 dollars. So it all depends on how you define \"working people.\"", "Still, adjusted for inflation, and when looking at nonsupervisory production workers, it's true that during the Reagan years, productivity rose while wages remained frozen (or even dipped slightly). We dock Moore some points, though, because the decline/stagnation of wages pre- and postdated the Reagan era; and total compensation (including payments for benefits) rose. Moore left out some important qualifiers. Still, while you may not agree with Moore's conclusions, he can back up his claim with legitimate numbers. And so we rate it Mostly True.", "Michael Moore Web site,\n\n\"Facts in Mike's Films: Capitalism: A Love Story\"", "Washington Post,\n\n\"U.S. Competitiveness Stages a Comeback - Manufacturing: Many industries have revived by increasing productivity, modernizing factories and slashing payrolls,\"\n\nby Evelyn Richards, May 28, 1991", "Bureau of Labor Statistics,\n\nLabor Force Statistics from the Current Population Survey", "Bureau of Labor Statistics,\n\nLabor Productivity and Costs", "Bureau of Labor Statistics,\n\nEmployees on nonfarm payrolls by major industry sector, 1959 to date", "Bureau of Labor Statistics,\n\nNational Compensation Survey", "GPO Access,\n\nEconomic Report of the President: 2009 Report Spreadsheet Tables", "Center for Economic and Policy Research,\n\n\"The Productivity to Paycheck Gap: What the Data Show,\"\n\nby Dean Baker, April 2007", "National Review, The Real Reagan Record:\n\n\"Upstarts and Downstarts,\"\n\nby Alan Reynolds, Aug. 31, 1992", "Economic Policy Institute,\n\nNational data from \"The State of Working America 2008/2009\"", "\"President Reagan: The Role of a Lifetime,\" by Lou Cannon", "Interview with Kelly D. Barton, archivist at the Ronald Reagan Library, Oct. 6, 2009", "Interview with Chris Edwards, director of tax policy studies at the Cato Institute, Oct. 6, 2009", "Interview with Heidi Shierholz of the Economic Policy Institute, Oct. 6, 2009", "Interview with Dean Baker of the Center for Economic and Policy Research, Oct. 7, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]