["About this rating", "In March 2019, social media users starting sharing a years-old article published by the website News Punch, an outlet with a long history of spewing misinformation. In this case the shared story claimed that California lawmakers had upheld the right of pedophiles to marry children as young as 10 years old:", "California Upholds ‘Right’ For Pedophiles To Marry 10 Year Old Kids", "Lawmakers in California have upheld the rights for pedophiles to legally marry children as young as 10 years old, in a sick and twisted ruling.", "Girls as young as ten are among over 200,000 children who were allowed to legally wed adults in the last 15 years -- according to shocking new data uncovered by a Bay Area legislator.", "This article was tangentially related to a debate over a bill (Senate Bill 273) that sought to establish a minimum age requirement for marriage in the state of California. At the time the News Punch article was originally published in June 2017, California's marriage law only required minors (i.e., youths under age 18) to obtain a court order and permission from one parent in order to marry, without specifying any minimum age for marriage.", "News Punch  didn't offer much in the way of original reporting on this topic. Their article stated a few falsehoods in its opening text, including the assertions that over 200,000 children had been allowed to legally wed adults in the last 15 years, and that California lawmakers had issued a \"ruling\" to uphold the rights of pedophiles. The article attempted to back up those claims by quoting liberally from two other articles: a July 2017 piece from the San Francisco Chronicle, and a blog post from the DC Clothesline, which was little more than a rehash of the the Chronicle's reporting.", "Neither of the referenced articles stated that 200,000 children has been allowed to legally wed adults over the last 15 years, or that California lawmakers had issued a ruling upholding the rights of pedophiles to marry 10-year-olds. Furthermore, while the Chronicle article mentioned several individuals who had married while under the age of 18, the youngest person cited in that report had wed at the age of 15, not 10. The Chronicle's original report concerned political pushback on the minimum marriage age proposal, not a ruling overturning any extant minimum age restriction, and it specifically noted that California simply had no data on how many marriages involved persons under age 18:", "As the emotional fight unfolds in Sacramento, there’s no agreement even about a basic piece of information — how many minors get married each year in California. People who want to limit such marriages say the total is in the thousands, while those who oppose the bill say that’s vastly inflated.", "The state doesn’t keep such numbers, and even efforts to change that are running into resistance.", "Activists arguing for a minimum marriage age in the state claimed that 3,000 marriages involving minors took place every year in the state (which would work out to about 45,000 such marriages over the last 15 years, not the 200,000 claimed by News Punch). And even that lower figure is highly disputable:", "Nationally, about 5 of every 1,000 children ages 15 to 17 were married as of 2014, according to U.S. census data analyzed by the Pew Research Center — figures that don’t specify where the marriages occurred. Activists for age restrictions estimate that California sees about 3,000 marriages per year that include a minor.", "The ACLU and other opponents say that estimate is inflated, noting that just 44 petitions for juvenile marriage were filed in Los Angeles County -- which has a population just above 10 million -- over the past five years.", "“Any legislation to eliminate this core right,” said the National Center for Youth Law in a statement opposing [Sen. Jerry] Hill’s initial legislation, “must be based on concrete data and information that demonstrates this drastic step is the most effective and appropriate strategy to address the harms being alleged, and that there are not other less extreme options available.”", "News Punch has a history of distorting the truth to generate outrage clickbait, particularly  in articles related to child molestation and pedophilia. One way they do this is by taking quotes from genuine news articles, distorting their context, and then presenting them amid fear-mongering false claims.", "It should be noted that after this News Punch article was published in June 2017, California did pass Senate Bill 273. Although the new law did not establish a minimum marriage age, it did impose  new requirements on persons under 18 seeking to marry, and it requires local registrars to compile statistics on marriages involving minors:", "SB 273 expands current requirements for reviews by Family Court Services and by judges when individuals younger than 18 seek a court order granting them permission to marry or enter into a domestic partnership in California.", "SB 273 also requires local registrars and the state to compile statistics on marriages and domestic partnerships involving minors. Under the new law, which takes effect January 1, the state would be required to document the data in a statistical report that includes a county-by-county look at the numbers. The state is to produce the first such document by March 1, 2020, and update it by March 1 each year afterward.", "Under current law in most California counties, a minor only needs to get a court order and permission from one parent to marry. Senator Hill noted that the existing law does not provide a judge with much discretion or direction. Existing statute does not require judges to consider the circumstances of a request for a court order granting permission to marry. Some, but not all, counties require pre-marital counseling or interviews with the individuals seeking to marry.", "SB 273 requires the following reforms as improvements to current law:", "Senate.ca.gov.   \"Governor Brown Signs Bill by Senator Jerry Hill to Help Prevent Minors from Being Forced into Marriage or a Domestic Partnership.\"\r\n    21 September 2018.", "Ioannou, Filipa.   \"New Restrictions Passed gor Teen Marriage, But Some Say They Don't Go Far Enough.\"\r\n    SF Gate.   22 September 2018.", "Tucker, Jill   \"Effort to Bar Child Marriage in California Runs Into Opposition.\"\r\n    San Francisco Chronicle.   6 July 2017.", "DC Clothesline.   \"Effort to Bar Child Marriage in California Runs Into Opposition.\"\r\n    9 July 2017.", "Adl-Tabatabai, Sean.   \"California Upholds ‘Right’ for Pedophiles to Marry 10 Year Old Kids.\"\r\n    News Punch.   10 July 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]