["By Saranac Hale Spencer", "Posted on November 2, 2018", "Q: Are the people shown dragging a Mexican police officer in a viral photo members of the “migrant caravan”?", "A: No. The photo is from 2014 and shows riots following the disappearance of 43 students in southern Mexico.", "Thousands Central American migrants heading toward the U.S. border have become a major focus of the rhetoric ahead of the midterm elections and have prompted misinformation campaigns.", "One photo that has been circulating widely online shows several men with bandanas over their mouths dragging a Mexican police officer. It has been shared with text that says: “Mexican official being dragged by the caravan. Anyone up for open borders??”", "But that’s not true. The photo doesn’t show migrants who are currently traveling north from Central America. It shows protestors during a clash with police in 2014. That demonstration had followed the disappearance, and suspected massacre, of 43 students in the Mexican city of Iguala. The clash with police in the photo happened in Acapulco.", "This isn’t the first time that an old photo has been paired with misinformation about the so-called “caravan.” Earlier we wrote about three old photos — one showed a bloodied officer from 2012; one showed an officer with a bloody nose from 2011; one showed an officer kneeling during another demonstration about the missing student teachers in 2014. Those three unrelated photos were circulating with this bogus claim: “Mexican police are being brutalized by members of this caravan as they attempt to FORCE their way into Mexico – And WE are supposed to believe these are just poor, helpless refugees seeking asylum???”", "Although the photos have been shared thousands of times on Facebook, they have nothing to do with the group of migrants who are currently in the news.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“2,300 migrant children in Central American ‘caravan’ need protection, UNICEF says.” Press release. United Nations. 26 Oct 2018.", "Trump, Donald. Montana campaign rally. C-SPAN. 18 Oct 2018.", "Pardo, Pedro. Mexico student protest photo. Getty Images. 10 Nov 2014.", "Tuckman, Jo. “Mexican police injured in Acapulco during protests over student massacre.” The Guardian. 10 Nov 2014.", "Fichera, Angelo. “Graphic Photos Falsely Linked to ‘Caravan.’” FactCheck.org. 23 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]