["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. Bernie Sanders, speaking in Austin, bemoaned widening income differences between the country’s very rich and the rest of us.", "And in his remarks at a South Austin union hall, the Vermont independent mulling a run for the 2016 Democratic presidential nomination also warned about American failures to save money. \"Here’s something not talked about, something that can make us all very, very nervous,\" Sanders said. \"Half of all Americans have less than $10,000 in their savings account.", "\"And you know what that means and you know why people are so stressed out? If you have less than $10,000,\" he said, \"that means an automobile accident, a divorce, a serious illness, a crisis of one kind or another can drive you into bankruptcy and financial disaster.\"", "Is he right that half of us have less than $10K in savings?", "Sanders’ backup", "To our inquiry, a Sanders spokesman, Jeff Franks, said by email that Sanders relied on an April 2014 USA Today news story quoting a survey indicating 52 percent of U.S. workers had said they had less than $10,000 in total savings and investments, such as a 401(k) or IRA, that could be used for retirement. It did not include their homes or defined benefit plans, such as traditional pensions that could be used for retirement", "Specifically, the story said, 36 percent of workers said they had less than $1,000 in such savings and investments with another 16 percent of workers reporting $1,000 to $9,999 in such savings and investments. Those results came from a telephone survey of 1,000 workers and 501 retirees by the nonprofit Employee Benefit Research Institute and Greenwald and Associates.", "Next, we spotted a chart on the institute’s website drawn from the same 2014 Retirement Confidence Survey. The 52 percent of workers reporting less than $10,000 in savings and investments in 2014 is up from 39 percent in 2009, the chart shows.", "Of course, \"workers\" isn’t all of us. We called the Washington, D.C.-based institute, which says it was founded in 1978 to deliver unbiased information on employee benefit plans \"so that decisions affecting the system may be made based on verifiable facts.\" By phone, researcher Craig Copeland told us that overall, 51 percent of survey respondents, meaning retirees and others, had less than $10,000 in financial savings.", "Also by phone, Ruth Helman of Greenwald and Associates, which helped do the survey, paused at the senator’s wording. \"Strictly speaking, ‘their savings account’ isn’t correct. It’s total savings wherever it may be, under the mattress or wherever,\" Helman said.", "Federal Reserve Bank", "We wondered if there were other ways of looking at savings.", "Several experts urged us to contact the Federal Reserve Bank, which conducts a survey focused on consumer finances every three years. Its latest survey, drawing on data collected in 2013, resulted in a chart pointed out by Copeland indicating that the median value of financial savings outside of a pension or home reported by the nearly 95 percent of families who had bank accounts or stocks, bonds and other financial assets that year was $21,200, down from $23,000 in the board’s 2010 survey.", "SOURCE: Report, \"Changes in U.S. Family Finances from 2010 to 2013: Evidence from the Survey of Consumer Finances,\" Federal Reserve Bulletin, Board of Governors of the Federal Reserve System, September 2014", "Copeland said that given that more than 5 percent of families reported no such financial assets, it’s reasonable to speculate that families overall had median financial savings of less than $20,000.", "We also asked reserve board officials to analyze the senator’s \"savings accounts\" statement.", "By phone, William Emmons and Bryan Noeth, both employed by the Federal Reserve Bank of St. Louis, raised questions. For instance, why not count a family’s home or pension as part of its savings?  Reminder: The institute, with its focus on savings for retirement, set aside these asset categories. Emmons said: \"People do count on their housing equity, not only in retirement, but before that.\"", "Beyond that, the pair said, it’s not always meaningful to focus on money held in \"savings accounts,\" which are a single wealth indicator. \"A savings account isn’t where everybody holds their money,\" Noeth said.", "The two said a potentially superior way to gauge how Americans are faring, savings-wise, would be to consider net worth meaning family assets compared to debts. An agency manager, Adriene Dempsey, emailed us a spreadsheet showing that according to the board’s 2013 survey, 26 percent of U.S. families had less than $10,000 in net worth--a tick worse than the 25 percent of families according to its 2010 study. In 2013, half of American families had about $81,500 in net wealth or more, according to the spreadsheet.", "Total assets for a family include financial assets, such as bank accounts, mutual funds and securities plus tangible assets, including real estate, vehicles and durable goods, according to a February 2015 essay by the St. Louis Fed. We’ve elaborated on this here.", "So by the net-worth metric, more families are better off than if one focused on financial savings alone. We ran this \"net worth\" angle past the institute’s Coleman, who reminded by email that its survey (relied on by Sanders) took into account financial assets, not just savings accounts.", "Our ruling", "Sanders said: \"Half of all Americans have less than $10,000 in their savings account.\"", "Some clarification went missing here: A 2014 survey indicated about half of American adults had less than $10,000 in savings and investments, such as a 401(k) or IRA, that could be used for retirement; those results encompassed more than savings accounts.", "We rate this claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Audio recording, Sen. Bernie Sanders speaking at IBEW union hall, Austin, March 31, 2015 (recording by Jonathan Tilove, chief political writer, Austin American-Statesman)", "Email, Jeff Franks, press secretary, U.S. Sen. Bernie Franks, April 1, 2015", "News story, \"Retirement: A third have less than $1,000 put away,\" USA Today, April 1, 2014", "Document, \"2014 RCS Fact Sheet #6, Preparing for Retirement in America,\" Employee Benefits Research Institute, undated (accessed April 1, 2015)", "Telephone interviews, Nick Bunker, policy analyst; Craig Copeland, senior research associate, Employee Benefit Research Institute, Washington, D.C., April 1, 2015", "Report, \"Changes in U.S. Family Finances from 2010 to 2013: Evidence from the Survey of Consumer Finances,\" Federal Reserve Bulletin, Board of Governors of the Federal Reserve System, September 2014", "Telephone interview, Ruth Helman, research director, Greenwald and Associates, Washington, D.C., April 1, 2015", "Emails, Adriene Dempsey, manager, Media Relations, Federal Reserve Bank of St. Louis, April 1-2, 2015", "Telephone interview, William Emmons, senior economic adviser, Bryan Noeth, lead policy analyst, the Center for Household Financial Stability, Federal Reserve Bank of St. Louis, St. Louis, April 1, 2015", "Spreadsheet, \"Distribution of Net Worth By Year (2013 Dollars),\" Survey of Consumer Finances, Federal Reserve Bank of St. Louis, 2013 (received by email from Adriene Dempsey, April 1, 2015)", "Essay, \"The Demographics of Wealth,\" notably \"Sidebar 2: Family Wealth and Income,\" Federal Reserve Bank of St. Louis, February 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]