["The image, which was published on Facebook here on July 27, 2015, shows three pigs that have curly and fluffy sheep-like fur.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “Mangalica pig is Austrian new technology combining a pig and a sheep. The goal is to deceive Muslims to eat pork mistakenly taken as mutton. After the animals are slaughtered, their heads are thrown away. Please share for Muslims cause.”", "The same image was also shared here and here on Facebook, and here on Twitter with a similar claim.", "The photo was also published with similar Malaysian-language claims on Facebook here and here, and on Twitter here.", "The claim is false; the image shows Mangalica pigs, a Hungarian breed that was first developed in the 19th century by cross-breeding different types of pigs.", "A reverse image search on Google found that the photo in the misleading Facebook posts has been featured in multiple reports about the Mangalica, also known as the Mangalitsa.", "The same image was published here by US-based consumer site The Food Channel in an article titled: “Trend Watch: Chefs Are High on the Mangalitsa Hog.”", "Below is a screenshot of the Food Channel’s report:", "The Pig Site, a UK-based farming publication, noted in this report that Mangalica pigs were first developed in the 1830s by cross-breeding Hungarian and Serbian breeds.", "Below is a screenshot of the article:", "AFP also reported here that the “animal is actually half wild boar, which accounts for the coat of coarse hair that insulates it from both heat and cold.”", "Below is a screenshot of an AFP photo, which can also be seen here, of a Mangalica pig:", "The photo's caption states: “A Mangalica, a Hungarian breed of domestic pig, is pictured at a pig farm, supplier of the Sibilia delicatessen in Lyon, on September 27, 2018 in La Chapelle du Bard, eastern France shows.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]