["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man holds a flag as he attends a rally to protest stay-at-home orders outside the Missouri Capitol Tuesday, April 21, 2020 (AP)", "The post misattributed a quote from a 1935 Illinois Supreme Court decision about Chicago judicial salaries", "The original quote refers to the Illinois Constitution and the laws that created the Municipal Court of Chicago, not the U.S. constitution", "The Supreme Court has ruled in the past that the rights of a citizen can be restricted by the state for the “common good” during a health crisis", "From Maryland to California, governors dealing with the COVID-19 crisis have faced challenges to the legality of their stay-at-home orders, some of which are showing up in court.", "A Facebook post claims that under an 1866 Supreme Court ruling, these orders are already deemed unconstitutional and that many governors must forfeit their authority because they have infringed on the rights of U.S. citizens.", "The post includes a picture with this text:", "\"This should settle the matter. This was the ruling of The United States Supreme Court shortly after the ‘civil war’ in Ex parte Milligan, 71 U.S. 2 (1866) which yet stands to this day: ‘Neither the legislature nor any executive or judicial officer may disregard the provisions of the constitution in case of emergency …’", "… therefore, ANYONE who declares the suspension of constitutionally guaranteed rights (to freely travel, peacefully assemble, earn a living, freely worship, etc.) and or attempts to enforce such suspension within 50 independent, sovereign, continental United States of America is making war against our constitution(s) and, therefore, we the people. They violate their constitutional oath and, thus, immediately forfeit their office and authority and their proclamations may be disregarded with impunity and that means ANYONE; even the governor and President.\"", "The cited case, Ex parte Milligan, 71 U.S. 2 (1866), was about disputed judicial authority during the Civil War. In 1864, Lambdin P. Milligan was arrested and tried by a military tribunal in his home state of Indiana and sentenced to death by hanging. The U.S. Supreme Court ruled that the military courts established by the president during wartime had no judicial power in secure areas with established civil courts, and Milligan was released.", "The case citation and time frame in the post are legitimate. But the quote about government authority does not come from this case.", "That quote, or a close match, comes from a case argued in the Illinois Supreme Court in 1935. In People ex rel. Lyle vs. City of Chicago, the justices of Chicago’s municipal court filed a complaint against the City Council over unpaid salaries amid the Depression. The Illinois Supreme Court ruled in their favor and ordered the city to pay them the partial salaries that had been withheld.", "In his opinion, the Illinois chief justice said that \"neither the legislature nor any executive or judicial officer may disregard the provisions of the constitution even in case of a great emergency.\" He was referring to the Illinois Constitution and the Municipal Court of Chicago’s founding laws.", "The second part of this claim that says orders \"can be disregarded with impunity\" doesn’t come from either of these cases and wasn’t found in any court cases or acts.", "We also found ample evidence that states do have the authority to issue stay-at-home orders. According to the American Bar Association, the U.S. Constitution’s 10th Amendment and past U.S. Supreme Court decisions dictate that \"state governments have the primary authority to control the spread of dangerous diseases within their jurisdictions.\"", "That doesn’t mean that there haven’t been cases brought against governors and local governments in California, Illinois, Texas, and Pennsylvania that are attempting to prove stay-at-home orders are unconstitutional. There have been mixed results from local courts, which all base their decisions on state laws and constitutions.", "Right now, the Supreme Court refuses to take a side. On May 8, the high court declined to review a case from a group of Pennsylvania businesses’ that wanted to block Gov. Tom Wolf’s stay-at-home order.", "In the past, the Supreme Court has supported state’s rights to deal with public health emergencies. The best example of the Supreme Court supporting a state’s power to impose mandatory restrictions during a pandemic is Jacobson vs. Massachusetts, 197 U.S. 11 (1905).", "The case was brought against the Cambridge board of health and its response to a surge in smallpox cases in the city. The city’s board of health issued an order that all adults had to be vaccinated against the disease, or they would face a $5 fine (about $100 today). Henning Jacobson refused to be vaccinated, after having bad reactions to earlier vaccines. When the state of Massachusetts fined him, he appealed to the U.S. Supreme Court.", "The court ruled in the state’s favor, stating that they had full power to restrict the freedoms of any citizen if it \"is necessarily subject for the common good\" and that they had \"distinctly recognized the authority of a State to enact quarantine laws and ‘health laws of every description.’\"", "Our ruling", "A Facebook post claims that under an 1866 Supreme Court ruling, stay-at-home orders are illegal and can be disregarded with impunity.", "The claim cites an actual Supreme Court case, but it quotes a judicial opinion from an unrelated state case in Illinois dealing with judges’ salaries. We rate this claim Pants on Fire.", "Facebook post, May 9, 2020", "Encyclopedia Britannica, Ex Parte Milligan: Law Case, April 6, 2018", "Justia, Ex parte Milligan, 71 U.S. 2 (1866), accessed on May 12, 2020", "DuPage County, History of the Illinois Courts, accessed on May 12, 2020", "American Bar Association, Two centuries of law guide legal approach to modern pandemic, April, 2020", "Bloomberg Law, California Stay-Home Order Upheld Over Constitutional Challenge, May 11, 2020", "Washington Post, Illinois GOP lawmaker wins court ruling exempting him from governor’s stay-at-home order, April 28, 2020", "The Hill, Activists and pastors sue Texas governor over stay-at-home order, April 16, 2020", "CBS Pittsburgh, Coronavirus In Pennsylvania: 4 Southwestern Counties In The ‘Red’ File Lawsuit Against Gov. Wolf, Saying Business Shutdown Violates Constitutional Rights, May 7, 2020", "CBS News, Supreme Court declines to lift Pennsylvania's stay-at-home order, May 8, 2020", "American Journal of Public Health, Jacobson v Massachusetts: It’s Not Your Great-Great-Grandfather’s Public Health Law, April 2005", "Justia, Jacobson v. Massachusetts, 197 U.S. 11 (1905), accessed on May 12, 2020", "Email interview with Law Professor Dan Kobil, May 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]