["The misleading claims have been posted on fan pages for Duterte and one of his top political allies that have a combined following of more than 2.1 million accounts on Facebook. Archived versions of those posts are here and here.", "They seek to use the false claims of the two Miss Universe victories during Duterte's time to promote the president's image, describing him as \"beloved\" and blessed\".", "Below is a screenshot of the post on the Duterte fan page that has more than 1.1 million followers:", "It also has been shared more than 14,000 times by another Facebook account. Below is a screenshot of that post:", "The posts were published shortly after Philippine contestant Catriona Gray won the 2018 Miss Universe on December 16.", "The woman in blue on the upper left of the image is Pia Wurtzbach, who won the Miss Universe title for the Philippines in 2015. She also appears with Duterte in the lower picture.", "On the upper right is Gray.", "The yellow text above the images, when translated to English, says: “Two Ms. Universe in his term. You are truly blessed. Our beloved president”.", "But Duterte was sworn in as president on June 30, 2016, six months after Wurtzbach won. Here is his inauguration speech on the government's RTVMalacanang Youtube channel.", "The Miss Universe title went to South Africa’s Demi-Leigh Nel-Peters in 2017 and to France’s Iris Mittenaere in 2016.", "Wurtzbach visited Duterte on July 18, 2016, which was captured in a government video, and the pair can be seen in the same clothes as in the image used in the false Facebook post. Below is that video.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]