["“Shocking, 35 millions votes were counted but we only have 27.4 millions registered voters,” a Facebook post published a few weeks after the Canadian federal election reads. Below the text is a screenshot of the French version of Elections Canada’s website, which provides numbers on the resources deployed for Canada’s 43rd federal election. Circled in red are two numbers, 35 million and 27.4 million, next to the words “bulletins de vote imprimés” and “électeurs.”", "In the comments section, outraged Facebook users complain that “the system is rigged,” and that the issue “has to be investigated.”", "The Facebook post was itself a screenshot of a now deleted tweet from Sarah Chung, a former Olympian turned candidate for the right-wing People’s Party of Canada in the Ontario riding of Markham-Unionville. Though Chung’s name is not included in the screenshot, her Twitter handle, @SChungforCanada, is clearly visible in the screenshots.", "Chung deleted her tweet after a Twitter user pointed out that “bulletins de vote imprimés,” means “printed ballots,” not counted ballots, as the screenshot of the English version of the website below shows.", "Despite the original misunderstanding, Chung tweeted again on the matter of additional ballots, this time using the English version of the Elections Canada website, and suggesting that non-citizens could have voted, or that some people could have voted several times.", "According to Elections Canada’s preliminary numbers, 18,530,285 votes were cast in the 2019 general elections, 179,536 of which were rejected.", "Ghislain Desjardins, a spokesperson for Elections Canada, told AFP in an email, “It is essential for Elections Canada to print significantly more ballots than there are electors that will actually vote, in order to make sure that no polling location runs out.”", "Desjardins explained that ballots are sent to polling stations in books of 50, and therefore a polling station requiring 202 ballots would automatically receive 250, which, at the scale of the entire country, contributes to the higher ballot count.", "More ballots are also needed due to advance voting. Any unused ballots from advance polls cannot be reused on election day, according to Desjardins.", "Ballots that are not used on election day “are securely destroyed by Elections Canada,” Desjardins added.", "The source of the hoax seems to be Twitter user Patrick Potvin, who was the first to tweet the screenshot of Election Canada’s website, calling it a “#riggedelection with 7.8 millions illegal voters.”", "The electoral system in Canada is not foolproof. In May 2019, 103,000 non-citizens had to be removed from the voters registry after being added by mistake. Citizenship is required in order to vote in Canada and voting as a non-citizen is an offence punishable by a fine of up to $5,000 and/or six months in prison.", "After the 2015 federal election, four people were charged with requesting second ballots after already voting. Here is a list of all of the charges and outcomes of cases brought under the Canada Elections Act and the Referendum Act since 2011.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]