["By Angelo Fichera", "Posted on August 15, 2018", "Q: Did the Obama administration separate “72,410 Children From Their Families in 2013”?", "A: That’s the number of immigrants removed that year who had U.S.-born children. But viral stories wrongly conflate removals with President Trump’s zero tolerance policy.", "Viral stories that defend the Trump administration’s policy of separating children from adults caught illegally crossing the country’s southwest border are claiming that the Obama administration did worse — by separating “72,410 Children From Their Families in 2013.”", "But the websites parroting that line overstate the number of children separated “from their families” under President Obama and conflate two separate immigration actions. We explain both issues here.", "As we’ve reported before, the wide-scale practice of separating families apprehended at the border was not one employed by previous administrations.", "Experts told us that, under previous presidents, such family separations occurred in “really limited circumstances,” such as suspicion of trafficking or other fraud.", "None had a blanket rule like the Trump administration’s “zero tolerance policy,” which referred all illegal border crossings for criminal prosecution. When that happened, adults were sent to jails that cannot legally house children.", "Relying on civil immigration proceedings to remove those who crossed illegally, “previous administrations used family detention facilities, allowing the whole family to stay together while awaiting their deportation case in immigration court” — or released and tracked families as they awaited their court dates, according to the Bipartisan Policy Center.", "Before suspending its practice of separating families amid widespread criticism, the Trump administration separated more than 2,000 children from adults — and has been working to meet a federal court’s order to reunify those eligible.", "The website davidharrisjr.com claimed in an Aug. 10 story that “BARACK OBAMA SEPARATED 72,410 CHILDREN FROM THEIR FAMILIES IN 2013 ALONE.”", "“The truth of the matter is that it was not Donald Trump’s policies that begin separating children from their parents,” the story says, later adding: “With all the liberal tears, wailings and gnashings of teeth over 2,000 illegal children being separated by the Trump administration you would think the 72,410 Obama separated in one year would spark a nation wide protest, wouldn’t you?”", "That story was posted on other websites and accrued thousands of shares and engagements on Facebook, according to CrowdTangle data, including on pro-Trump pages.", "In reality, the number cited — 72,410 — refers to the number of unauthorized immigrants who were removed in 2013 that claimed “at least one U.S.-born child.” A 2014 HuffPost story reported as much, citing U.S. Department of Homeland Security reports given to Congress for the first and second halves of 2013.", "The action of deporting unauthorized immigrants, including those with U.S.-born children, has existed across administrations, and continues to occur today. In other words, Trump’s new zero tolerance policy is in addition to existing deportation actions.", "Most of the removals in 2013 were the result of “immigration enforcement priorities” — meaning the immigrants were convicted of a crime, caught illegally entering the U.S., or were considered a fugitive because they failed to report to ICE or were already issued a final order of removal.", "When parents of U.S.-born children are removed, the children may leave with them — or stay with another parent, family member, or in foster care.", "We don’t know how many children were separated from their families in 2013, and the HuffPost story did not say, so the headline on davidharrisjr.com is wrong. It says Obama “separated 72,410 children from their families in 2013 alone.” But an unknown number wound up staying with their families, either with their other parent or another family member.", "The website misleads when it conflates the issues by declaring that “it was not Donald Trump’s policies that begin separating children from their parents. Those policies were in place long before Donald Trump took office.”", "In the years following 2013, the number of immigrants removed who claimed at least one U.S. child did decline. While we couldn’t locate data for 2014, DHS reported that there were 31,411 such removals in 2015. In 2016, the number totaled 28,860.", "Sarah Pierce, a policy analyst at the Migration Policy Institute, said in an interview that the drop was likely the result of enforcement changes by the Obama administration. DHS guidance issued in late 2014, building off the president’s executive actions on immigration, more thoroughly outlined immigration enforcement priorities and the use of prosecutorial discretion.", "Under the changes, the highest priority group for deportation included serious criminal offenders, especially those deemed national security threats, and immigrants apprehended at the border. DHS officials were also given ample discretion on such cases — even if they did fall under one of several levels of priority. And having a child who was a U.S. citizen, Pierce said, could have helped their case.", "We don’t have enough data to know how exactly the number of immigrants removed who have a U.S.-born child will change over the course of the Trump administration. The first half of 2017 saw 12,464 such removals — a drop from 14,699 in the first half of 2016.", "But within days of taking office, Trump overrode the 2014 guidance with an executive order that significantly broadened the groups of immigrants in the country illegally that should be prioritized for removal, Pierce noted.", "The effects of that may result in Immigration and Customs Enforcement increasing the removals of parents of U.S. citizens, she said. “It takes a lot of time to ramp up interior enforcement — we’ve seen ICE trying to work with local jurisdictions … [and] criminal justice systems, trying to get referrals.”", "We asked DHS for the number of immigrants removed who claimed U.S.-born children in the second half of 2017, and to date in 2018 — as well as for other years’ data — but did not get a response. We will update this story if we do.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "O’Shea, Tim and Theresa Cardinal Brown. “Why Are Families Being Separated at the Border? An Explainer.” Bipartisan Policy Center. 13 Jun 2018.", "Pierce, Sarah. Policy analyst, Migration Policy Institute. Phone interview with FactCheck.org. 14 Aug 2018.", "Robertson, Lori. “Did the Obama Administration Separate Families?” FactCheck.org. 20 Jun 2018.", "Rosenblum, Marc R. “Understanding the Potential Impact of Executive Action on Immigration Enforcement.” Migration Policy Institute. Jul 2015.", "Trump, Donald J. Executive Order 13768: Enhancing Public Safety in the Interior of the United States. White House. 25 Jan 2017.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: First Semi-Annual, Calendar Year 2013.” 28 Apr 2014.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: Second Half, Calendar Year 2013.” 28 Apr 2014.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: First Half, Calendar Year 2015.” 1 Aug 2016.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: Second Half, Calendar Year 2015.” 1 Aug 2016.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: First Half, Calendar Year 2016.” 14 Sep 2016.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: Second Half, Calendar Year 2016.” 1 Jun 2017.", "U.S. Department of Homeland Security. “Deportation of Aliens Claiming U.S.-Born Children: First Half, Calendar Year 2017.” 12 Oct 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]