["For the past few years, history enthusiasts and admirers as well as critics of Tipu Sultan, the last Sultan of the kingdom of Mysore, have circulated a picture on social media claiming that it is a photograph of Tipu Sultan.", "The image has been shared on both Facebook and Twitter. Alt News has also received verification requests on its WhatsApp helpline number (76000 11160).", "This slideshow requires JavaScript.", "BJP spokesperson Ashwini Upadhyay and Ramesh Mendola, BJP MLA from Indore, had also promoted the claim in 2018.", "The image was again posted on Twitter in October 2019 by a user Madhav, who is followed on the platform by PM Modi.", "#TipuSultan", "This is how the congress ecosystem projected the scum called #TipuSultan pic.twitter.com/UxD1DTTlBK", "— Madhav 🇮🇳 (@mahesh10816) October 30, 2019", "The same picture was revived in November 2020.", "But the real #TipuSultan doesnt look like a tiger though. He looks like.. pic.twitter.com/JiDdqvevs7", "— Ajnin (@Ajnin8) November 20, 2020", "Multiple news organisations and fact-checking outlets had checked this viral claim, some of whom concluded that the person in the picture is not Tipu Sultan but Tippu Tip (or Tippu Tib), a slave trader from Tanzania of the 19th century. The first-ever photograph was clicked in 1826 or 1827 and thus, this picture is not a photograph of Tipu Sultan who died in the year 1799 CE.", "The same image is also featured on the website of Getty Images, a stock photography website. According to Getty Images, he is Tippu Tib, also known as Hamed bin Mohammed, who was the most successful Swahili-Arab slave trader in Zanzibar. The photograph has been clicked by Bojan Brecelj.", "With multiple information outlets stating that this person in the picture is a trader from Zanzibar, Tanzania named Tippu Tip, the matter should end there, except for the fact that there are numerous pictures of Tippu Tib which do not match with above picture claimed to be of him. In fact, another picture posted on the website of Getty Images featuring Tippu shows a person markedly different from the person in the above image.", "Juxtaposing the two pictures, it can be seen that there are visible differences in the facial features of the two persons. The person on the left has a long, narrow and slender nose, compared to the person on the right whose nose is widely shaped.", "On Twitter, Alt News came across a tweet that had posted an article fact-checking the claim about the picture. This tweet mentioned that the person seen in the picture is not Tippu Tip but Mohammed Bin Khalfan, commonly known as Rumaliza, another prominent slave trader of Zanzibar of the 19th century.", "இவையிரண்டுக்கும் ஒத்துமை இருக்கா முதல் படத்தில் இருப்பவர் Mohammed bin Hassan Rumaliza அடிமைகள் வியாபாரி pic.twitter.com/M0F0dSdxPD", "— கவி தா (@kavitha129) November 9, 2018", "We searched for ‘Rumaliza’ online and came across a slew of pictures featuring him.", "We noticed that this person closely resembles the picture of the person believed to be Tippu Tip. We placed the picture of Rumaliza next to this image, and the resemblance is striking.", "2. The robe worn by the persons in both pictures has the same design.", "3. The dagger which can be seen tucked inside the robe in both pictures is identical.", "In conclusion, the picture, circulated aggressively by social media users claiming it represents Tipu Sultan, is not the picture of Tippu Tip either, as inferred by media outlets. The picture instead closely resembles Rumaliza, another slave trader of Zanzibar, Tanzania.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "What’s in a name? Apparently, a lot, if social media trends and raging political discourses…", "As Karnataka is set to go to the polls in two months’ time, all parties…", "The Qutub Minar is a UNESCO world heritage site in South Delhi. The name literally…", "On February 21, external affairs minister S Jaishankar gave an interview to ANI journalist Smita…", "An image of an apparently ancient sculpture is viral with the claim that it was…"]