["By Saranac Hale Spencer", "Posted on October 24, 2017", "Q: Is Congress considering a bill that would allow police to track “all Americans” with microchips?", "A: No. A popular story on Facebook distorts the implications of proposed legislation to help locate missing Alzheimer’s patients and autistic children.", "At least five different sites have recently published a story with the headline: “Now All Americans Will Be Microchipped On the Will Of Police: Resolution (H.R.4919) Passed by Senate.”", "The story, which deals with a bill that is currently stalled in Congress, was flagged by Facebook users as potentially false.", "The headline is absolutely false, and the story itself is a mixture of facts, opinion and speculation based largely on a petition from Change.org and a story that was first circulated in December 2016, shortly after the House of Representatives passed a bill intended to enable police departments to better locate missing Alzheimer’s patients and autistic children.", "The Senate had passed a different version of the bill in July 2016.", "While the story is based on an actual proposal, it distorts the implications of the legislation.", "The bill would resurrect and expand the Missing Alzheimer’s Disease Patient Alert Program, which had provided funding to help return missing Alzheimer’s patients to their caregivers, according to a report from the Senate Committee on the Judiciary.", "The new program would be called the Missing Americans Alert Program, and it would be expanded to cover “children with developmental disabilities, such as autism,” the committee report said.", "The bill would allocate $2 million per year until 2021 for grants to fund the development and operation of “locative tracking technology programs” that would help in finding both Alzheimer’s patients and autistic children who have wandered away.", "It is the “locative tracking technology” language in the House and Senate bills that the story circulating on Facebook has spun into the idea of widespread microchipping.", "But, the Senate judiciary committee report specifies that participation in the tracking program would be “entirely voluntary” and devices assigned to children will not involve “implantation of a device or other trackable items.”", "The House version of the bill says that the devices would be “non-invasive and non-permanent” and would not apply to procedures that “implant a device.”", "Several different kinds of tracking systems are currently available, according to AWAARE (the Autism Wandering Awareness Alerts Response and Education Collaboration), and many of them involve devices attached to wristbands.", "Since the bill hasn’t become law, some of the specifics — like what type of tracking systems exactly would be included and who would have access to the data — haven’t been decided. Those things would be determined by the attorney general within 120 days of the passage of the law, according to both the House and Senate bills.", "Both versions also specify that any data collected from the tracking devices are only to be used to prevent injury or death, and the House version says that there is to be no federal database. The Senate judiciary committee report recommends that the attorney general bar the creation of a federal database.", "The last action on the bill in either chamber before the 114th Congress expired was on Dec. 9, 2016. That means the bill must be reintroduced to be considered by the current Congress.", "Rep. Christopher Smith, who sponsored the bill in the House, is planning to reintroduce it in the current session, according to his office.", "While this bill’s purpose — funding research and implementation of programs to locate patients — wouldn’t apply to most people, fears about microchip implants are nothing new. Back in 2010, we wrote about a false claim that the Affordable Care Act would require all patients to be implanted with microchips.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“Now All Americans Will Be Microchipped On the Will Of Police: Resolution (H.R.4919) Passed by Senate.” Viralnewsnetwork.net. 16 Oct 2017.", "Beers, Shaindel. “The House Just Passed A Bill That Violates All Your Rights.” Change.org. 22 Dec 2016.", "Webb, Whitney. “House Passes Bill Allowing Government to Microchip Citizens with ‘Mental Disabilities.’” Trueactivist.com. 13 Dec 2016.", "U.S. House of Representatives. H.R. 4919. Passed 8 Dec 2016.", "U.S. Senate. S. 2614. Passed 14 Jul 2016.", "U.S. Senate. Committee on the Judiciary. Report on S. 2614. 9 Dec 2016.", "U.S. Senate. All actions S. 2614. Accessed 23 Oct 2017.", "Henig, Jess. “More Malarkey About Health Care.” FactCheck.org. 19 Apr 2010.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]