["South African advocacy groups have claimed Johannesburg is the most radioactive city on Earth, because of the mining of uranium-rich gold fields. But uranium contamination and radioactivity aren’t the same thing.", "The gold mines of Johannesburg have concentrated uranium deposits, with mined reefs containing 10 to 100 times more uranium than gold, according to a 2006 report.", "This means that Johannesburg is “probably the most uranium- contaminated city in the world”, according to one expert. But this doesn’t directly correlate with it having the highest levels of radiation.", "While radiation hot-spots have been identified close to the city, there has been no consistent measuring of radioactivity, and available data shows the Iranian city of Ramsar has higher levels.", "The history of gold mining and the South African city of Johannesburg are intimately linked – the city was founded after the discovery of the precious metal on the Witwatersrand in 1884. Locals call it “the City of Gold”, but can it also claim the title of “most radioactive city on earth”?", "“Joburg is the most radioactive city on the planet, thanks to its gold-mining past, says Earthlife Africa,” read an article on news website Independent Online in late 2020. It linked this startling claim to the dumping of uranium as a waste product of gold mining.", "The claim has also been attributed to the Bench Marks Foundation, an independent organisation monitoring corporate performance, by news channel eNCA. (Note: Neither Earthlife Africa or the Bench Marks Foundation answered questions about the source of the statistic.)", "The country’s mining industry has long been criticised for its environmental and social impact. Johannesburg’s mine dumps have also been flagged by environmental researchers for high levels of the mineral uranium.", "But is Johannesburg the most radioactive city on the planet? We checked.", "According to the US Environmental Protection Agency (EPA), radiation is energy that travels from its source in energy waves or energised particles. There are two types of radiation: non-ionising radiation and ionising radiation.", "Non-ionising radiation can heat substances and is found in radiofrequency waves and microwaves. It is not dangerous to humans in doses too low to cause intense heating.", "Ionising radiation, on the other hand poses a health risk by damaging tissue and DNA in genes. At very high doses, it can cause radiation sickness.", "When unstable forms of elements break down, they emit ionising radiation in a process known as radioactive decay. Unlike most elements, uranium has no stable form and is always radioactive.", "According to the US Centers for Disease Control and Prevention, exposure to uranium can cause bone, liver and lung cancer. Uranium is also chemically toxic, and can cause “severe health effects” if inhaled or ingested, including kidney damage.", "Gold has been mined in the Johannesburg area since 1886. The gold reefs also contain high concentrations of uranium.", "During the 1950s, uranium mining was driven by the demand from the US nuclear weapons programme. From 1952 to 1988 more than 11,000 tonnes of uranium were produced. A decreased demand for uranium since the 1980s led to the closure of most uranium mines.", "According to a 2006 report by the South African Water Research Commission, a state-owned body dedicated to researching water quality and accessibility in the country, the mined reefs contain 10 to 100 times more uranium than gold. The waste created by the gold mines is dumped into mine dumps, also known as tailings.", "Tailings have a significant impact on the environment. Metals from the tailings, including uranium, have been found to pollute local water sources and soil. The dust is spread through wind to neighbouring densely populated areas surrounding Johannesburg, such as Soweto.", "But does this make Johannesburg the most radioactive city on the planet?", "Dr Anthony Turton is a water specialist and professor at the University of the Free State Centre for Environmental Management. He told Africa Check that there is a difference between uranium as a chemically toxic element and uranium as a radioactive element.", "“The mineral format it is found as in nature is more chemically toxic than it is radiologically hazardous,” he explained.", "“So it is technically correct to state that Johannesburg is probably the most uranium-contaminated city in the world, but this is not necessarily consistent with being the most radioactive city in the world, although radioactive hotspots have been mapped and are known.”", "Dr Kelvin Kemm, chief executive of nuclear project management company Nuclear Africa, told Africa Check the city has higher than average levels of radiation and the uranium in mine tailings contributes to this. But he said a major contributor to this is cosmic radiation that comes from the sun and increases with altitude. Johannesburg sits at an elevation of 1,753 metres above sea level.", "“There’s a huge amount of radiation that comes in from outer space because of the altitude,” he said. “The scientific answer is Johannesburg is radioactive, more than most places, but not anywhere near as radioactive as Ramsar in Iran and a number of other places around the world.”", "The sievert (Sv) is the unit used to measure the dose of radiation that biologically affects the human body. It can be broken down further into the millisievert (mSv), which is one thousandth of a sievert.", "According to the United Nations Scientific Committee on the Effects of Atomic Radiation, the average person on the planet is exposed to 2.4 millisieverts of radiation each year. Africa Check was unable to find radiation readings for the City of Johannesburg, which covers an area of 2,300 square kilometres.", "South Africa’s National Nuclear Regulator (NNR) was also unable to confirm radiation levels for Johannesburg. The regulator was established in 2000 and is responsible for granting nuclear authorisations and regulating control over safety standards for nuclear energy and radioactive waste.", "“The NNR cannot refute or agree on this claim as we do not have basis or evidence that indicates that the city is known as ‘the most radioactive city in the word’,” spokesperson Gino Moonsamy told Africa Check.", "There have been concerns about radiation levels at an informal settlement near the Tudor mine shaft in Krugersdorp. (Note: The settlement falls just outside the City of Johannesburg metropolitan municipality. It is located in the Mogale City local municipality.)", "Online reports suggested the NNR found that the radiation in the area measured as high as 3.9 millisieverts per year in 2010. But this reading has been disputed by environmental organisations. British environmentalist Prof Christopher Busby reportedly found that the radiation measured as high as 8 millisieverts. (Note: We have asked both the regulator and Busby for their findings. We will update this report if they provide them.)", "In comparison, the city of Ramsar in Iran has unusually high natural background radiation. Some areas of the city have radiation levels as high as 131 millisieverts per year. Other areas with high levels of radiation include China’s Yangjiang county (6.4 millisieverts per year) and the state of Kerala in India (6 millisieverts per year).", "A radiation level higher than 500 millisieverts is likely to kill cells and increase the risk of cancer. After the 1986 Chernobyl disaster, when an explosion took place in a nuclear reactor in the then Ukrainian Soviet Socialist Republic, those involved in the clean-up team were exposed to levels as high as 8,000 to 16,000 millisieverts. Today, the radiation levels in the exclusion zone measure at 8.8 millisieverts.", "Claims that Johannesburg is the most radioactive city in the world have been repeated by South African environmental organisations. They have attributed the unusually high radiation levels to the city’s mining past.", "The environmental impact of mining is significant. Industrial waste has been found to pollute the air, water, soil and buildings in and around the city.", "However, Africa Check was unable to find a radiation reading for the city of Johannesburg. Available recordings for an area just outside the city are disputed. Despite this, far higher radiation levels have been recorded in the city of Ramsar in Iran.", "The available data does not support or disprove the claim. We rate it unproven.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]