["About this rating", "In June 2019, the Facebook page \"CreepyPasta\" renewed interest in an old piece of audio that supposedly documented a creepy 911 call made by a man named Scott Chance before he mysteriously disappeared:", "While this piece of audio is frequently shared on horror-focused corners of the internet as if it were a genuine 911 call, this is actually a short fictional film created by Rui Melo called \"The Break-In.\" According to the film's IMDB page, Melo produced, directed, and edited the film. The only two listed cast members are Jonathan Gross and Tom Leroux, but it's unclear which roles they played.", "Melo uploaded \"The Break-In\" to his YouTube page in September 2016. The original version of Melo's film, as well as the accompanying description, can be seen below:", "A short movie about a creepy 911 call made by a man called Scott Chance, attempting to report a break-in in progress.", "After a while, things take a turn for the worse and Scott becomes inadvertently involved in the situation.", "Melo's film has racked up more than 4 million views since it was first posted online. In November 2018, Melo posted a teaser for a follow-up that would supposedly feature footage from that fateful, fictional night:", "It's unclear if \"Part 2\" will ever be completed. Melo responded to one YouTube user asking about the release date, saying: \"I'm trying to get this made but it hasn't been easy. I'll keep on trying though because I really wanna tell the rest of this story. What I have planned going forward is really interesting, in my honest opinion ...\"", "In sum, this viral 911 call does not document the final moments before the disappearance of man named Scott Chance. This is a short film about a fictional incident.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]