["About this rating", "In December 2018, social media users shared a story on the self-publishing site auxx.me bearing the headline, \"Drone Footage Reveals Over 100 Whales Trapped in Secret Underwater 'Jails,'\" with many questioning whether the report was real. Aside from the fact that the cages are hardly \"secret,\" the story is sadly true.", "The information was originally reported by the independent Russian newspaper Novaya Gazeta on 30 October 2018. The paper revealed that more than 100 whales were caged in small enclosures off Russia's Pacific coast near the city of Nakhodka, possibly in violation of an international ban on commercial whale hunting. The account has since been picked up by reputable English-language news outlets including CBS News and the UK's Telegraph.", "According to news reports, 90 belugas and 11 orcas are being held in small enclosures that reporters have dubbed \"whale jails\" or \"whale prison.\" Some of the animals have been held there since July 2018 and many suspect they will be sold for entertainment in a burgeoning marine park industry in China, as The Telegraph reported: \"An Orca whale can reportedly fetch more than $6 million in the booming ocean theme park industry in neighbouring China. There are more than 60 marine parks in China, and at least a dozen more are under construction.\"", "Although Russian prosecutors are investigating the capture and export of the animals by four companies, identified by Novaya Gazeta as LLC Oceanarium DV, LLC Afalina, LLC Bely Kit and LLC Sochi Dolphinarium, the fate of the animals is currently unclear. Thomas Henningsen, a marine biologist who is head of the Russia program for the international environmental activist organization Greenpeace, confirmed to us via email that as of 19 December 2018 the whales were still in the cages and that the conditions there were \"disastrous and cruel.\"", "Experts cited by The Telegraph also opined that many of the whales were likely infants, based on the sheer number of them packed into pens -- \"even though the capture of whale calves is categorically forbidden.\"", "News reports included an apparent cell phone video that captured the moment one of the whales was lifted by crane and placed into a tank for transport:", "Drone footage posted to social media by the Russian government-controlled news outlet RT also stoked public anger, showing whales crowded into small pens:", "‘Whale prison’ discovered by drone in Far East Russia pic.twitter.com/gkZBVmYwVp", "— RT (@RT_com) November 8, 2018", "According to the animal-oriented web site The Dodo, the process for capturing the whales is harrowing and potentially deadly due to the stress and exhaustion the animals endure:", "“The capture operators are apparently using ‘purse seining,’” Naomi Rose, a marine mammal scientist at the Animal Welfare Institute (AWI), told The Dodo. “They encircle a group of spooked whales with small chase boats. One of these boats drops a net into the water when the whales are huddled together and draws it around the group. The bottom of the net has a line attached and is pulled closed. This is ‘pursing’ — turning the net into a big bag, basically, with the whales inside.”", "Once the animals are caught, the operators will pick and choose which animals they want to keep. They’re particularly interested in juveniles between 3 and 4 years old, Rose explained.", "“They then pull the top of the net tighter and tighter until they have corralled off the whale they want … wrestle it onboard with the net or a stretcher, and release the rest,” Rose said. “Sometimes animals get entangled in the net and drown. Or they may exhaust themselves trying to ram through the net and suffer from capture myopathy, a condition that is essentially being exhausted to death — their hearts can simply stop beating.”", "“The trauma and distress these animals experience during captures is not opinion or emotion — it is fact,” Rose added. “They suffer intense stress-related reactions and their mortality risk spikes sharply soon after capture and then again after transport — they don’t get accustomed to the process. The decimated pods may experience similar stress and trauma — their offspring are being taken from them.”", "The whales' situation has caused something of an international outcry. Thousands of people have signed a petition demanding the release of the whales.", "Orcas are renowned for their intelligence, capacity to feel grief, and complex social and family relationships, and their well-being has been a point of evolving controversy. With many local populations endangered or threatened in the wild, the 2013 documentary Blackfish stoked a national backlash in the United States against marine parks such as Sea World for the treatment of captive animals.", "The matter has reached the highest office in Russia. On 19 December 2018, Russian President Vladimir Putin's spokesman Dmitry Peskov told the state-operated news agency RIA Novosti that Putin was leaning on the local governor in an effort to resolve the issue.", "In late April 2019, the Russian government enlisted the help of French ocean explorer Jacques-Michel Cousteau of the Ocean Futures Society to help figure out how to safely release the animals in the summer. Criminal charges have been levied against the four companies that have held the whales captive.", "Reuters reported that as of June 2019, eight of the ten whales, two orcas and six belogas, had been released. However wildlife activists criticized the Russian government for lack of transparency and rushing the process, thus placing the animals at risk.", "In November 2019, Reuters reported that the release of the remaining whales had been completed, according to a statement from the Russian Research Institute for Fisheries and Oceanology.", "Novaya Gazeta.  \"Pack for China.\"\r\n    30 October 2018.", "Luhn, Alec.  \"'Torture' of Russian 'Whale Jail' as 100 Orcas and Belugas Captured in Pacific Bay.\"\r\n    The Telegraph.   5 November 2018.", "Gove, Ed.   \"More Than 100 Animals Trapped in \"Whale Jail\" Off Russia's Coast.\"\r\n    CBS News.   7 November 2018.", "Worrall, Simone.   \"How Killer Whales Went from Hated, To Adored, To Endangered.\"\r\n    National Geographic.   10 August 2018.", "Robbins, Jim.   \"Orcas of the Pacific Northwest Are Starving and Disappearing.\"\r\n    The New York Times.   9 July 2018.", "Minaya, Ezequiel.   \"SeaWorld Still Facing 'Blackfish' Backlash.\"\r\n    MarketWatch.   8 August 2017.", "Alberts, Elizabeth Claire.   \"Russia Has Captured 100 Wild Whales to Sell to Marine Parks.\"\r\n    The Dodo.   2 November 2018.", "Isachenkov, Vladimir. \"Russia Plans to Free Almost 100 Captured Whales.\"\r\n  Associated Press. 5 April 2019.", "Soldatkin, Vladimir. \"Russia Releases Last of Captured Whales into the Wild.\"\r\n    Reuters. 10 November 2019.", "Updated to note most recent announcement about release of the whales.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]