["The photo was published in this Facebook post on June 21, 2019, where it has been shared more than 8,000 times.", "Below is a screenshot of the misleading Facebook post:", "The Hindi language caption translates to English as: “Brothers, I have quit Islam and embraced Hindu religion. There cannot be useless religion like Islam which take people's life in the name of jihad and play with prestige of our mothers and sisters in the name of Halala. I take refuge in feet of Shri Ram hereafter. Victory to Shri Rama.”", "“Halala” refers to the process which a Muslim couple can choose to undergo if they want to reunite after getting divorced.", "Rama refers to Hindu deity Rama.", "A Hindi language caption alongside the photo and text translates to English as: “Victory to Shri Rama. Zakir has understood that Islam is not a religion. When will others understand? Wake up.”", "The photo has also been shared on Facebook here, here and here, with an identical claim.", "The claim is misleading; the man in the photo told AFP he remained a Muslim, saying he attended the event to promote religious harmony.", "With the support of a local journalist from Gorakhpur, AFP identified the man in the misleading posts, who gave his name as Imran Khan.", "Khan denied the claim while talking to a journalist form AFP’s Delhi bureau by phone on July 8, 2019.", "“I participated in the event to promote communal harmony among Muslims and Hindus, but I am firm on my religion of Islam and will remain firm in future as well,” he said.", "A reverse image search on Google found the same photo of Khan that was used in the misleading posts published here on Indian news site Nyoooz Hindi on August, 2017.", "The Hindi language headline of the report translates to English as: “Gorakhpur: Hindu sisters set precedent of unity by tying Rakhi to Muslim brothers.”", "Below is a screenshot of the photo of Khan in the report:", "The first paragraph of the report translates from Hindi to English as: “Presenting a precedence of secular culture, Muslim brothers and Hindu sisters set an example of Hindu-Muslim unity by tying Rakhi to the formers’ wrist. They (Muslim brothers) pleadged to protect honour and presitige of Hindu sisters as well. The sisters also prayed for their longevity by putting Tilak -- sacred colour -- to their forehead.”", "The Nyoooz Hindi report published additional photos of the event.", "With the help of a local journalist from Gorakhpur, AFP managed to identify another person, circled below in green, as Anwar Hussain, who describes himself on Facebook as the general secretary of the Gorakhpur unit of India's opposition Indian National Congress party.", "Speaking to a journalist from AFP’s Delhi bureau by phone on July 8, 2019, he said: “I have been organising this interfaith event to promote religious harmony and brotherhood for the last ten years. I just want to convey the message that no one can divide us in the name of religion.”", "Hussain also identified two other people -- marked in green in the same image published by Nyoooz Hindi -- as Imran Khan (L) and Annu Prasad (R).", "A journalist in AFP’s Delhi bureau contacted Annu Prasad by phone on July 8, 2019. She said she was a researcher at the University of Gorakhpur and a student leader.", "“The event was organised in the Pant Park near the Gorakhpur University on the occasion of Rakshabandhan in 2017,” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]