["A day after a Florida man landed a gyrocopter on the lawn of the U.S. Capitol to demand campaign finance reform, U.S. Rep. Alan Grayson talked up his own efforts to focus on small donations and his potential U.S. Senate bid.", "Grayson, an Orlando Democrat, told a reporter for Democracy Now on April 16 that he will \"probably\" run in a primary against U.S. Rep. Patrick Murphy, D-Jupiter, for Marco Rubio’s Senate seat in 2016. As Democratic Party activists and leaders consider their best path to winning that seat, Grayson wants to remind them of his populist fundraising:", "\"I’m the only member of the House of Representatives who raised most of his campaign funds in the last election from small contributions of less than $200,\" he said.", "We decided to check if Grayson holds a record in the House for contributions of less than $200.", "(A spokesman for Grayson told PolitiFact Florida that he is likely a few weeks away from making his decision but reiterated that he has said he will \"probably run.\")", "Counting small donations", "The Federal Election Commission considers donations of less than $200 as small donations, which don’t have to be individually reported. Instead, candidates report a total amount of money from small donors.", "In the House for the 2013-14 election cycle, those who received the largest share of their campaign revenue from small contributions were Democrats -- and Grayson was indeed No. 1, according to a November 2014 analysis by the Center for Responsive Politics.", "Grayson’s small donations totaled about $1.8 million and equaled 57 percent of his $3.1 million donations.", "The House member who raised the next highest amount in small donations was Florida’s Debbie Wasserman Schultz, D-Weston, and head of the Democratic National Committee. She raised $1.2 million in small donations, which equaled 47 percent of her contributions. (Wasserman Schultz recently ruled out running for Senate in 2016.)", "The third place House finisher was U.S. Rep. Keith Ellison of Minnesota who raised about $850,000 in small donations, or 41 percent of his pot.", "On the Senate side for the 2013-14 cycle, Democratic Sen. Al Franken of Minnesota topped the list with $11.7 million in small donations, equaling about 40 percent of his donations.", "(During his Democracy Now interview, Grayson mentioned U.S. Sen. Bernie Sanders of Vermont as a leader in the Senate in raising small donations. Sanders, an independent who caucuses with Democrats and was re-elected in 2012, raised almost $5 million in small donations, or about 61 percent.)", "Who racks up small donations and why?", "So why are some member of Congress small donor leaders?", "In the case of Franken, a former Saturday Night Live star, the Center for Responsive Politics noted that \"name recognition in combination with hailing from a state with a strong grassroots tradition doesn’t hurt.\"", "Grayson’s persona as a Democratic firebrand likely contributes to his fundraising abilities. \"The most successful small-money fundraisers mix media exposure with partisan taunting and ideological appeals,\" Adam Bonica, a Stanford political science professor, wrote in 2011.", "Grayson is famous for his provocative taunts against Republicans, such as describing the GOP health care plan as \"if you do get sick, die quickly,\" or comparing Dick Cheney to a vampire.", "Michael J. Malbin, director of the Campaign Finance Institute and a political science professor at the University at Albany, said polarization alone won’t get candidates a lot of money in small donations. In many cases, candidates are tapping into political organizations with an existing network of small donors. Grayson, for example, has received money bundled through ActBlue, an online Democratic fundraising group that focuses on competitive races.", "Candidates \"got their boost from national organizations that created support for the candidates by recommending them to donors who trusted the bundling organization(s) and who probably would not otherwise have known who the candidates were,\" Malbin wrote.", "Our ruling", "Grayson said, \"I’m the only member of the House of Representatives who raised most of his campaign funds in the last election from small contributions of less than $200.\"", "Grayson’s small donations equaled 57 percent of his donations during the most recent cycle, putting him ahead of second-place finisher Wasserman Schultz at 47 percent, according to the Center for Responsive Politics.", "We rate this claim True.", "Democracy Now, \"Grayson on money and politics: if we do nothing we can kiss this country goodbye,\" April 16, 2015", "Center for Responsive Politics, Alan Grayson campaigns, 2006-2014", "Center for Responsive Politics, U.S. Rep. Alan Grayson fundraising, 2013-14", "Center for Responsive Politics, \"Mass appeal: who is on top with coveted small donors,\" Nov. 4, 2014", "Center for Responsive Politics, Rep. Patrick Murphy fundraising, 2013-14", "Federal Election Commission, Top 50 House Campaigns by receipts in 2010 and 2012", "Michael Malbin of The Campaign Finance Institute and University at Albany, \"Small donors: incentives, economies of scale, and effects,\" October 2013", "Palm Beach Post, \"Alan Grayson says ‘probably yes’ to Democratic Senate primary vs. Patrick Murphy,\" April 16, 2015", "Boston Review, Article by Adam Bonica, July 22, 2011", "Florida Election Commission, Campaign guide, June 2014", "The Hill, \"Grayson eyes Florida Senate seat,\" Feb. 3, 2015", "Tampa Bay Times The Buzz, \"Fla Insider poll sizing up Fla’s ‘16 Senate race,\" Jan. 30, 2015", "PolitiFact Florida, U.S. Rep. Alan Grayson’s Truth-O-Meter record and U.S. Rep. Patrick Murphy’s Truth-O-Meter record, Accessed April 24, 2015", "Interview, David Damron, U.S. Rep. Alan Grayson spokesman, April 24, 2015", "Interview, Douglas Weber, Center for Responsive Politics senior researcher, Feb. 4, 2015", "Interview, Viveca Novak, Center for Responsive Politics spokeswoman, April 24, 2015", "Interview, Russ Choma, Center for Responsive Politics money in politics reporter, April 23, 2015", "Interview, Brendan Glavin, Campaign Finance Institute data and systems manager, April 23, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]