["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This is bogus. There is no effort afoot in Congress or by the Biden administration to lower the age of consent to age 5.", "The CNN article screenshot featured in one of the posts was digitally manipulated.", "Inflammatory social media posts are spreading online that falsely claim President Joe Biden’s administration officially lowered the age of consent.", "Some say that the alleged bill passed Congress and lowers the age of consent to 5 years old. Other variations claim it was lowered to 8.", "One Instagram post displays text that reads: \"NEWS: Joe Biden has officially lowered the age of consent to 5 years old.\"", "The caption adds: \"#BreakingNews new age of consent Bill has just passed congress. It will be taking effect as soon as February 14, via @wikipedia !!\"", "A similar post shared on Facebook features an image that purportedly shows a CNN article reporting that the Biden administration lowered the consenting age to 8 starting Feb. 16.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "These claims are false. We could not find any evidence of recent changes made by the Biden administration to the age at which an individual can legally consent to sexual activity. There are no legitimate news reports — by CNN, or any other outlet  —  of Congress passing such a bill.", "Each state has its own general age of consent that ranges from 16 to 18 years old and is usually defined in the states’ statutory rape offenses, according to the Department of Health and Human Services.", "In some states, a \"close in age exemption\" exists to decriminalize consensual sex between two individuals who are both under the age of consent.", "CNN confirmed that the article featured in the photo is fake. The screenshot appears to be from a real article by the news organization, but the headline, text and photo were replaced.", "Posts circulating on social media claim that Joe Biden officially lowered the age of consent to 5 years old.", "No bill has passed Congress or has the approval of the Biden administration that addresses lowering the age of consent to 5 or 8 years old in the U.S. Each state has its own general age of consent that ranges from 16 to 18 years old.", "CNN never reported this. The article screenshot was digitally manipulated.", "Pants on Fire!", "Instagram post, Feb. 2, 2021", "Facebook post, Feb. 2, 2021", "CNN.com search, Feb. 3, 2021", "Congress.gov, Search, Feb. 4, 2021", "Check Your Fact, FACT CHECK: DID CNN REPORT THAT THE BIDEN ADMINISTRATION LOWERED THE AGE OF CONSENT TO 8?, Feb. 2, 2021", "Reuters, Fact check: CNN article about President Biden lowering age of consent is digitally altered, Feb. 3, 2021", "Ageofconsent.net, Close in Age Exemptions, Accessed Feb. 3, 2021", "U.S. Department of Health and Human Services, STATUTORY RAPE: A GUIDE TO STATE LAWS AND REPORTING REQUIREMENTS. SEXUAL INTERCOURSE WITH MINORS, Dec. 15, 2004", "Email interview, CNN spokesperson, Feb. 4, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]