["A video of a baby with hard, cracked skin has been widely shared by social media users. “Rakshas born in asam Baby born after 11 months of pregnancy Killed mother during birth The nurse who took care of it died within 3 hours of touching”, reads the claim sent to Alt News’s official app. It is being claimed that a devil child born in Assam took the life of the mother who gave him birth. The nurse who took care of the child also died in three hours of touching the child, the message further adds.", "[Warning: Visuals in the article may seem disturbing. Viewer discretion is advised.]", "A few more people on WhatsApp inquired about the video.", "A reverse image search on Google of one of the keyframes extracted from the video using InVid, a digital verification tool, led Alt News to a YouTube video uploaded on July 21, 2019.", "The child is suffering from a rare disease, which can affect any ethnic group, called Harlequin Ichthyosis. According to a 2019 BBC report, the condition, which is a result of a faulty gene is said to affect one in a million. “It affects the rate at which the skin regenerates, meaning that old dry skin cells either take longer to shed, or new cells are reproduced too quickly, causing a build-up of thick skin. Large scaly plates then form, separated by deep cracks, which is where it gets the name.” The symptoms usually appear at birth or within the first year of birth.", "While social media posts are referring to the child as a ‘demon’, the baby is actually suffering from a medical condition called Harlequin Ichthyosis.", "A farmer couple in Vidarbha of Maharastra gave birth to a Harlequin baby in June 2016. Hindustan Times dubbed this as India’s first reported case of a baby born with Harlequin Ichthyosis. The child reportedly died after struggling for life for two days.", "One more case of a baby with Harlequin Ichthyosis was reported in January 2017 in Bihar’s Patna district. Last year in September, a baby born with Harlequin Ichthyosis died at Kasturba Gandhi Hospital in the national capital after developing respiratory problems. “It is for the first time we have witnessed a baby born with this skin deformity. Harlequin Ichthyosis involves an ‘ABCA 12’ gene defect.”, said Dr Maruti Sinha, a Senior Consultant Obstetrician and Gynaecologist to Mail Today, a sister publication of India Today.", "According to an article by Hindustan Times, there is no cure for the disease but it can be managed with treatment. The disease is considered fatal, however, with intense neonatal care and advance technology, a higher survival rate has been achieved. In September 2015, British tabloid Daily Mail named 23-year-old Stephanie Turner as the oldest person in the US to live with Harlequin Ichthyosis, which causes her skin to grow seven times faster than normal and appear thick and tight.", "In conclusion, a video of a baby born with a fatal, rare genetic disorder Harlequin Ichthyosis is being shared on social media with unscientific claims that the child was an ominous demon who took the life of the mother and a nurse who touched him. While we are unable to trace the origins of the video, it is evident that the claims circulating on social media are false.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]