["According to Dr. Bill Osmunson, the amount of fluoride in an 8-ounce glass of fluoridated tap water is equivalent to the “pea-sized” amount needed to call the Poison Control Center, as recommended on the back of any fluoridated toothpaste.", "In the UK, you would need to brush your teeth four to six times a day with a ‘pea-sized amount’ of toothpaste, and swallow that toothpaste, to consume the same amount of fluoride as found in a litre of tap water with the maximum levels of fluoride allowed.", "Fluoride is the same ingredient used in rat poison and Prozac.", "Sodium fluoride has been used as a rat poison in the past but the fluoride in that is at much higher concentrations than is found in tap water or toothpaste. Prozac’s main ingredient is fluoxetine hydrochloride – which contains fluoride but also consists of other elements in a very different structure.", "Hitler fluoridated the water in the concentration camps to sedate the prisoners.", "There is no evidence of this.", "Fluoride is so toxic it is considered hazardous waste.", "Fluoride is toxic at high concentrations, but these are much higher than the levels found in toothpaste and tap water.", "Fluoride calcifies the pineal gland.", "The pineal gland can take on calcium deposits over time and fluoride can attach to calcium.  Studies on the effects of fluoride on the pineal gland have proved inconclusive.", "In 1955, Crest became the first fluoride toothpaste.", "Crest began testing its first fluoride toothpaste in 1955. It wasn’t the first fluoride toothpaste but fluoride became a standard additive around this time.", "A post on Facebook makes a number of claims about the chemical fluoride.", "The NHS describes fluoride as “a naturally occurring mineral found in water in varying amounts, depending on where in the UK you live.” It also says it’s added to many brands of toothpaste and to the water supply in some areas through a process called fluoridation.", "Around 5.8 million people in England receive fluoridated water, with schemes in place in the West Midlands, North East, East midlands, Eastern England, the North West and Yorkshire and Humber.", "The claims the post makes about fluoride are a mix of accurate and inaccurate, and there is no evidence that fluoride consumed at levels allowed by UK legislation has any negative health impacts. Below we’ve taken a look at each of the Facebook post’s claims in turn.", "“In 1955, CREST became the first fluoride toothpaste.”", "In 1955 the toothpaste manufacturer Crest launched its ‘Crest with Fluoristan’ toothpaste in several test markets in the United States and had expanded nationally by the following year. This was not the first time fluoride had ever been added to toothpaste, but it was at this time that “fluoride became the standard and ADA-accepted toothpaste additive for the prevention of tooth decay,” according to the Smithsonian Institution.", "In the UK today the main fluoride chemicals found in toothpaste are sodium fluoride, sodium mono-fluorophosphate and stannous fluoride. The maximum amount of fluoride allowed in toothpaste before it is classed as medicine under UK and EU law is equal to 1,500 parts per million, or about 0.15% fluoride.", "“Fluoride CALCIFIES the pineal gland, otherwise known as the third eye which literally has rods and cones, just like your other eyes!”", "The pineal gland is located in the brain and is part of the endocrine system (which produces hormones in your body). This particular gland produces the hormone melatonin which controls the body’s sleep/wake cycle.", "Calcium can sometimes be deposited in the pineal gland over the course of a person’s lifetime and fluoride can bind to calcium. Studies that have looked at the impact of fluoride on the pineal gland have been inconclusive.", "“Fluoride is so TOXIC that it is considered a hazardous waste by the EPA.”", "Fluoride is toxic at high concentrations, but in the amounts added to water it is not. The Drinking Water Inspectorate, which monitors drinking water in England and Wales, checks that supplies don’t contain more than 1.5 mg of fluoride per litre of water.", "The Environmental Protection Agency (EPA) in the USA told us that fluoride is not defined as hazardous waste, but fluorine—the element it comes from—and some other compounds “may be considered hazardous waste”.", "“HITLER fluoridated the water in the concentration camps to SEDATE the prisoners.”", "There is no evidence that Hitler or the Nazi Party ever used fluoride in the water in concentration camps, according to US factchecking organisation Politifact.", "“Fluoride is the same ingredient used in rat POISON and Prozac.”", "The active ingredient in Prozac, which is used primarily to treat depression along with a number of other mental health conditions, is fluoxetine hydrochloride. This is not the same as fluoride—its chemical structure is made up of a variety of elements and fluoride is just part of this.", "Sodium fluoride has been commonly used as a rat poison in the past. Again, the fluoride in that is present in much stronger concentrations than the fluoride found in tap water for example. According to academics at McGill University in California, a rat “would have to drink roughly a hundred liters of fluoridated tap water before suffering the same fate if the water had the usual fluoride concentration of 1 part per million.”", "“According to Dr. Bill Osmunson, there’s the same equivalence of fluoride in an 8 ounce glass of fluoridated tap water as there is in a “pea-sized” amount needed to call the Poison Control Center, as recommended on the back of any fluoridated toothpaste.”", "Dr Bill Osmunson is an American dentist and senior advisor of the anti-fluoride campaign group Fluoride Action Network.", "In an interview Dr Osmunson did say that a pea-sized amount of toothpaste works out at around one quarter milligrams of fluoride—as much as is contained in a glass of Chicago tap water.", "A ‘pea-sized amount’ is thought to be around 0.25g of toothpaste, although there isn’t much guidance available on this. The usual strength of fluoride in a normal tube of toothpaste is between 1,000 and 1,500 parts per million, according to the Cochrane Database of Systematic Reviews (the “leading journal and database for systematic reviews in health care”). If someone was using regular over-the-counter toothpaste available for adults in the UK this would mean they’d consume between roughly one quarter and one third of a milligram (mg) of fluoride every time they brushed their teeth.", "In the UK drinking water that is deliberately fluoridated (rather than water where fluoride occurs naturally) must not exceed 1.5mg per litre. That’s 1.5 parts per million. So in the UK you would need to brush your teeth four to six times a day (with a pea-sized amount, and swallow all that toothpaste) to consume the same amount of fluoride as in a litre of tap water (if it was fluoridated to the maximum amount.)", "There is no recommended maximum amount of fluoride that should be consumed by adults per day in the UK. In the USA this upper maximum is 10mg. Using this as a guide the NHS Special Pharmacy Service says that a 70kg adult could safely consume anywhere between 1.7g and 10g of toothpaste a day—depending on the strength of fluoride in it and the levels of fluoride in the water they are also consuming.", "In the USA the Federal Drug Administration rules say that all fluoride toothpastes, gels and powders have to have a warning on the packaging stating: “Keep out of reach of children under 6 years of age. If more than used for brushing is accidentally swallowed, get medical help or contact a Poison Control Center right away.”", "The NHS says: “There have been some concerns that fluoride may be linked to a variety of health conditions. Reviews of the risks have so far found no convincing evidence to support these concerns.”", "Public health England also says that: “At the levels allowed by UK legislation, the only potential negative impact is a greater risk of dental fluorosis, which is a mottling on the teeth usually in the form of white lines or patches.” It adds that dental fluorosis can happen in areas where the water isn’t fluoridated too.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as mixture\n            as the claims are a mix of correct and inaccurate.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]