["The photo circulated on Facebook pages in Myanmar, including here, here, and here.", "“Bad omens for military fiends,” reads the caption on a Burmese-language post. It has been shared more than 300 times since February 4, 2021.", "“To show his support to the Burma people who bang pots and pans to protest against the military coup, British Prime Minister Boris Johnson, Prime Minister of the United Kingdom, Prime Minister of England, came out to support Myanmar democracy, standing together with the Myanmar people yesterday.”", "Myanmar's military seized power in a bloodless coup on February 1, 2021, detaining de facto leader Aung San Suu Kyi and imposing a one-year state of emergency.", "The coup sparked global outrage and protests in Myanmar, with a movement gathering steam online calling on the public to voice opposition every night by banging pots and pans.", "The military justified its seizure of power by alleging widespread fraud in November elections that Aung San Suu Kyi's NLD won in a landslide.", "But international and local observers -- as well as Myanmar's own election monitor -- reported no major issues that might have affected the integrity of the vote.", "While Britain has condemned the detention of Aung San Suu Kyi and called for her immediate release, the photos circulating on Facebook are unrelated to the coup in Myanmar.", "A reverse image search on Google found a news report featuring the photos of Johnson banging the gong published by UK tabloid The Sun on February 1, 2020.", "The headline reads: “BONG KING BORIS: Boris Johnson chimes in new Brexit era on gong for 80 guests at Downing Street”.", "Britain became the first nation to leave the European Union at 11 pm (2300 GMT) on January 31, 2020, cutting ties with the bloc after more than four decades of membership.", "The split followed years of political wrangling after Britons voted to leave the EU in a 2016 referendum that bitterly divided the nation.", "“Ministers, aides and officials who had assembled in the state room at No. 10 counted down the final ­seconds to Britain’s EU departure at 11pm on Friday. Then, to their surprise, amusement and elation, he produced the miniature gong and struck it 11 times with a tiny mallet,” the article reads.", "The photos were also featured in an article by The Guardian newspaper, which credited the images to Downing Street photographer Andrew Parsons.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]