["About this rating", "On 8 October 2015, the web site IFLScience published a article reporting that the smell of a rare Hawaiian mushroom could cause women to have a spontaneous orgasms:", "Officially discovered back in 2001, John Halliday and Noah Soule were the first to record the effects of a fungus that could instantly induce female orgasm.", "Published in the International Journal of Medicinal Mushrooms, Halliday explains that he and his colleague Soule heard of an unusual fungi growing in recent lava flows on the island of Hawaii — a bright orange mushroom which supposedly caused women to suddenly reach climax for no apparent reason.", "Forming on lava flows 600–1000 years old, the unnamed Dictyophora species was deemed a very intense aphrodisiac when smelled by women — despite, or maybe because, of its “fetid” smell. The pair put the claim to the test by asking volunteers (I wonder how they whittled the number of applicants down?) to take a deep whiff, and recording their arousal levels. The results recorded in the Journal show a significant increase in arousal, with nearly half of the women experiencing spontaneous orgasms. All of the men, on the other hand, claimed it smelled absolutely disgusting.", "IFLScience was not the first to report on this orgasmic fungus: since Holliday and Soule published their paper on it in 2001, dozens of news publications, websites, and blogs have written about this mushroom's alleged abilities to induce olfactory orgasms. It appears, however, that the only people who have not been writing about this titillating phenomenon are other scientists.", "Our research did not turn up any other scientific studies about this orgasm-inducing and unnamed Dictyophora species, and the one extant study is itself a bit flimsy. Holliday and Soule conducted a \"smell test\" in 2001 involving 16 women and 20 men. Six women from that group reportedly experienced spontaneous (but not \"earth-shattering\") orgasms while smelling the fungus, and the other 10 (who received smaller doses) experienced an increase in heart rate.", "What caused the spontaneous orgasms? Halliday speculated that the fetid odor of the mushrooms may have had \"hormonelike compounds present\" that had some \"similarity to human neurotransmitters released during sexual encounters\":", "The island of Hawaii in the Central Pacific, there has long been the rumor of a bright orange colored mushroom with peculiar properties. Found growing only on recent lava flows approximately 600 to 10,000 years old, this variety of mushroom has the reputation of being a potent female aphrodisiac when smelled. In this study the morphology and chemistry of this unnamed Dictyophora species is described, along with the results of a smell test conducted on volunteer participants, showing that there are significant sexual arousal characteristics present in the fetid odor of this unique mushroom. Indeed, nearly half of the female test subjects experienced spontaneous orgasms while smelling this mushroom. These results suggest that the hormonelike compounds present in the volatile portion of the spore mass may have some similarity to human neurotransmitters released during sexual encounters.", "While Holliday's study is certainly intriguing, it's somewhat short of representing a rigorous scientific standard: it's a single, decades-old study that was conducted with a very small sample group and published in a minor journal, one which has not since been replicated or vetted by other researchers in the scientific community.", "On 14 February 2016, Discover published a first-person account of the search for the mysterious fungus.  According to the author of the piece, the results were (in a word) underwhelming.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]