["About this rating", "In the days following a pro-Trump mob's attack on the U.S. Capitol on Jan. 6, 2021, first-hand accounts of the day's chaos were relayed to the public by lawmakers, reporters, congressional aides and photographers.", "One particularly disturbing incident was recounted by Reuters photographer Jim Bourg, who said that he heard at least three different rioters say that they were hoping to find U.S. Vice President Mike Pence and hang him as a traitor:", "I heard at least 3 different rioters at the Capitol say that they hoped to find Vice President Mike Pence and execute him by hanging him from a Capitol Hill tree as a traitor. It was a common line being repeated. Many more were just talking about how the VP should be executed.", "Bourg was not the only one to witness such threats. In fact, a viral video clip showed several members of this mob chanting \"hang Mike Pence\":", "In addition to the chants of \"hang Mike Pence,\" a gallows was also erected outside of the U.S. Capitol.", "The chants of \"hang Mike Pence\" were not the only documented threats against a U.S. politician. In the days leading up to the Capitol riot, there were several calls for violence on social media sites such as Parler. Buzzfeed News reported that an account with the name \"No Trump No Peace #GoTime\" shared an image of a noose next to a caption that read: \"Who would you like to see 'dispatched' first? 1) Nancy Pelosi 2) John Roberts 3) Pence 4) other (please name) I was leaning towards Nancy, but it might have to be Pence.\"", "It should also be noted that in the days leading up to the Capitol riot on Jan. 6, 2021, several social media users, including the president of the United States, falsely claimed that Pence had the authority to overturn the results of the 2020 election. When Pence accurately stated that he simply did not have \"unilateral authority\" to overturn the election results, he drew the ire of the president and his supporters. In fact, roughly 10 minutes before Pence and the other lawmakers at the Capitol were evacuated to a safe location as the mob started to attack, Trump posted the following message on Twitter:", "Mike Pence didn't have the courage to do what should have been done to protect our Country and our Constitution, giving States a chance to certify a corrected set of facts, not the fraudulent or inaccurate ones which they were asked to previously certify. USA demands the truth!", "At least a few Trump supporters said that the news of Pence's decision, presumably from Trump's tweet, had spurred the crowd to action. CBS 17 reported:", "Several of President Donald Trump's North Carolina supporters were in Washington, D.C., as protestors stormed the U.S. Capitol on Wednesday.", "Joshua Flores, Michele Morrow, and other members of Stop the Steal NC made the trip to Washington to protest the results of November's election. They witnessed the peaceful protest unravel.", "\"People got news on their phone that Mike Pence said he is not going to object to these seven states, and he was going to accept the electoral college that promotes (President-elect Joe) Biden,\" Morrow said.", "\"That is when everybody got really upset and that's when they started storming,\" the Cary resident added.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]