["This Facebook video, which has been viewed more than 84,000 times since it was uploaded February 27, 2019, has a caption saying: \"Pakistani flag hoisted after capturing Indian checkpost. Live forever Pakistan army\".", "The footage shows Pakistani soldiers removing a black militant flag from a pile of stones and hoisting Pakistan's national flag before saluting it and making victory signs.", "The same video has been posted repeatedly on Facebook, for example here and here, and viewed ten of thousands of times with captions making similar claims that it shows Pakistani soldiers hoisting their flag at a captured Indian post.", "Below is a screensnhot of one of the misleading posts.", "On February 27, 2019, India and Pakistan claimed to have shot down each other's fighter planes in the disputed Kashmir region. Here is an AFP explainer on the issue.", "An online search found that the video is not recent footage of Pakistan’s border with India, but from a 2017 military operation against militants in the northwestern Khyber tribal district bordering Afghanistan.", "The exact same footage as is used in the misleading posts can be seen here and here in these YouTube videos uploaded in 2017, which show Pakistani soldiers taking down a militant flag and raising the country’s national flag.", "The section of the misleading video showing soldiers saluting the flag can also be seen at 4:00 in this Facebook video of a press conference given by Pakistani military spokesman Major General Asif Ghafoor on August 21, 2017.", "Here is a Dawn newspaper report on the August 21, 2017 press conference. The same clip as is used in the misleading footage can be seen in Dawn’s embedded video at 5:28.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]