["About this rating", "In September 2020, multiple readers asked Snopes to examine a series of tweets posted by a Twitter user with the handle @lifeisasoph, who claimed to be related to the ex-girlfriend of Jacob Blake, a 29-year-old Black man shot several times by police in Kenosha, Wisconsin, some days earlier. Twitter suspended the account on Aug. 31.", "Users posted screenshots of the tweets on The Donald, a website popular among some supporters of U.S. President Donald Trump, especially since Reddit banned the subreddit The_Donald in June 2020 after its users repeatedly engaged in hate speech and harassment.", "On Sep. 2, the right-leaning talk radio host Richard Randall posted on Facebook this message: \"Neither BLM, nor Twitter, care about the life of 'Sabrina' the black woman who was sexually assaulted by Jacob Blake right before police arrived to try to arrest him. Sabrina’s aunt was standing up for her on Twitter, but got banned.\"", "That caption accompanied screenshots of several tweets by @lifeisasoph, which had earlier been posted to Twitter by @Patrici15767099:", "On Aug. 31, the right-wing website Trending Politics published an article that unquestioningly presented @lifeisasoph's tweets, and identity, at face value, writing \"After the rape victim’s aunt took to Twitter to call out the hypocrisy, the social media platform quickly shut down her account.\"", "After Twitter suspended @lifeisasoph on Aug. 31, several principally right-leaning observers integrated that suspension into their promotion of the account's claims, sharing @lifeisasoph's tweets at face value while also claiming Twitter had banned the account precisely because its claims were authentic and accurate. For example, right-wing commentator Evan Kilgore posted several screenshots of @lifeisasoph's tweets, along with the caption:", "\"INSANE: Twitter suspended the account of Jacob Blake's ex-girlfriend's aunt, @lifeisasoph, after she began publicly speaking out against him.\"", "In keeping with a broader pattern of disinformation, which we have examined in depth previously, @lifeisasoph's condemnation of Blake and the racial justice protests that followed his shooting, were given credibility by the claim of a family relationship with Blake's ex-girlfriend, who has accused him of sexual assault and domestic abuse. However, that claim of a family link was bogus.", "A 'Grown Man From St. Louis,' or a Woman From West Africa?", "Before Twitter suspended @lifeisasoph, Snopes gathered ample evidence of past tweets from the account which reveal a pattern of inauthentic behavior, principally used to advance right-wing talking points in online debates. Adopting the persona of the aunt of an alleged sexual assault victim was the latest, and perhaps the most distasteful, example of that tendency.", "Throughout 2020, @lifeisasoph was presented as a Black woman, repeatedly using that claimed identity as a rhetorical weapon. In July, for example, when Kelly Loeffler, co-owner of the Atlanta Dream WNBA franchise, expressed opposition to the Black Lives Matter movement, @lifeisasoph used their claimed identity as a Black woman to support Loeffler's position, writing:", "\"I’m a black woman who opposes the BLM organization. You can do that as a white person too and it not be racist. The leaders of this group are Marxist sellouts.\"", "During the same month, Libertarian presidential candidate Jo Jorgensen tweeted that \"It is not enough to be passively not racist, we must be actively anti-racist.\" @lifeisasoph replied: \"Hi. Black woman here. This doesn’t make any sense. Just be a good person. Fuck.\"", "In June 2020, during a back-and-forth about the Ku Klux Klan, racism, and President Trump, one of @lifeisasoph's interlocutors characterized Trump's past pronouncements as racist, to which @lifeisasoph replied: \"Please tell this 55 year old black woman, working in Washington DC, fighting to overturn policies Joe Biden wrote, sponsored and endorsed, why I need to vote for the white person [approved] candidate...\"", "However, before they presented as a Black, conservative woman fiercely defying white liberal stereotypes of Black views on race and politics, @lifeisasoph presented himself a man. \"I’m a grown man who doesn’t cry of the actions of another grown man,\" he wrote in September 2019, during an argument about the St. Louis Rams NFL franchise (now the Los Angeles Rams):", "In April 2019, he wrote: \"Personally I LOVE feminism. Harder work for women and easier sex for men? Sign me up,\" and in December 2018 he proudly declared to the world \"My balls are hot.\"", "The man behind the account posted several other claims which, although not inherently mutually incompatible, did speak to a broader penchant for issuing self-descriptions that seemed intended to give his arguments greater force or enhanced credibility, rather than being authentic components of an actual biography.", "For example, in March 2019, U.S. Rep. Alexandria Ocasio-Cortez, D-New York, tweeted about the dangers posed by climate change, writing \"The Midwest is drowning as we speak.\" @lifeisasoph replied \"I live in the Midwest and I have no idea what she's talking about.\" Just a few months later, he advocated for gun rights, tweeting \"I live in a border town. I’ll keep my guns thank you.\" Later, @lifeisasoph would repeatedly describe himself as a Black woman living and working in Washington D.C.", "When the Kansas City Chiefs NFL franchise introduced new rules that discouraged or prohibited fans from displaying Native American symbols in the team's stadium, @lifeisasoph claimed to be of Quapaw ancestry, and said \"it’s disappointing that our heritage is being removed.\" During an argument about the transatlantic slave trade, he claimed to be a woman from the West African nation of Benin.", "When defending Trump's alleged description of Haiti and other countries as \"shithole\" countries, @lifeisasoph wrote \"Haiti is a shithole country. Ask my father.\"", "#JusticeForRi", "Perhaps most revealing of all, though, were the inconsistencies and glaring inaccuracies in @lifeisasoph's tweets about the shooting of Blake, and the charges Blake faced of allegedly having subjected his ex-girlfriend, with whom he has three children in common, to sexual assault and domestic abuse. More detailed information about those charges can be found in our Aug. 27 fact check.", "Initially, on Aug. 25, two days after Blake was shot by police in Kenosha, Wisconsin, @lifeisasoph wrote about the shooting in the manner of someone without any personal knowledge of the parties involved. He tweeted: \"Allegedly, he broke into his ex's house who was of age then beat her and raped her,\" and \"Blake had a warrant out for raping someone,\" and \"This narrative that he was just breaking up a fight is plausible I guess but there's obviously more to the story...\"", "In the days that followed, his line of argument changed dramatically, and he began to describe Blake's ex-girlfriend as his \"niece,\" repeatedly tweeting claims that Blake had raped her, describing the woman's suffering, and writing \"she's sitting there watching NBA demand justice for her rapist while we're still trying to get justice for her.\"", "On at least three occasions, @lifeisasoph referred to his \"niece,\" Blake's ex-girlfriend, as \"Ri.\" He even tweeted out the hashtag #JusticeForRi, which users on The Donald picked up on, with one poster writing, \"She wants us to use #JusticeForRi.\"", "In the ensuing days, that hashtag spread, with more than 1,000 posts across Twitter, Instagram, and Facebook, most of them containing @lifeisasoph's Twitter handle, or screenshots of his tweets, and many of them explicitly pointing to the supposed authority and credibility of that account's claims and condemnations of the NBA strike, because @lifeisasoph claimed to be the aunt of \"Ri\" — Blake's ex-girlfriend.", "However, that's not that woman's name, and not even an appropriate abbreviation for it. The man behind @lifeisasoph, who fraudulently claimed to be a 55 year-old Black woman and the aunt of an alleged sexual assault victim in order to add credibility to his views on racial justice, appears to have also fabricated that nickname out of thin air.", "Using various methods and several publicly available sources, Snopes has discovered the actual identity of Blake's ex-girlfriend. We are not naming her, because she alleges to be a victim of sexual assault and domestic abuse, and has so far not chosen to speak publicly. However, we can say with certainty that her name is not \"Sabrina,\" as the talk radio host Richard Randall claimed on Facebook, and it is not at all conducive to the nickname \"Ri.\"", "She is a real person, though, and her experiences and version of events deserve careful and sympathetic attention. As such, her allegations against Blake are being acted upon by prosecutors in Kenosha County, Wisconsin. But the exploits of a \"grown man from St. Louis\" who posed as a West African woman and the aunt of an alleged sexual assault victim had nothing to do with honoring that woman, and everything to do with boosting and amplifying the political views of @lifeisasoph, whoever he is.", "Mac Guill, Dan.  \"Was Jacob Blake Charged With Raping a Child?\"\r\n  Snopes.  27 August 2020.", "Isaac, Mike.  \"Reddit, Acting Against Hate Speech, Bans 'The_Donald' Subreddit.\"\r\n  The New York Times.  29 June 2020.", "Trending Politics.  \"Aunt of Jacob Blake's Rape Victim Speaks Out on Twitter, Gets Immediately Suspended.\"\r\n  31 August 2020.", "The Kansas City Chiefs.  \"A Statement From the Kansas City Chiefs.\"\r\n  20 August 2020.", "Fram, Alan; Lemire, Jonathan.  \"Trump: Why Allow Immigrants From 'Shithole Countries'?\"\r\n  The Associated Press.  12 January 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]