["About this rating", "A number of videos purportedly showing how Breyers brand ice cream does not melt have been circulating on the internet for several years, but the most popular version (\"YOU WILL NEVER EAT THIS ICE CREAM AGAIN, SICKENING RESULTS!\") was published by the YouTube account Mr Eastcoastman in January 2016:", "While the video identified the product as \"ice cream,\" the above-displayed video actually uses a \"frozen dairy dessert.\" This distinction is briefly mentioned in a pop-up comment in the video, but the difference is not adequately explained. Breyers addressed concerns over these products on its web site, explaining that the \"Frozen Dairy Desserts\" label is used for products that do not meet the U.S. Food and Drug Administration's definition for ice cream:", "Frozen Dairy Dessert products are made with many of the same high-quality ingredients that are commonly found in Ice Cream – like fresh milk, cream and sugar – and offer a great taste and even smoother texture. According to the FDA, in order for a product to be labeled ice cream, it needs to meet two key requirements:", "Anything that does not meet both of those requirements is not considered ice cream.", "While it is true that the \"frozen dairy dessert\" shown in the above-displayed video resists melting, this is not a new phenomenon that's caused by the brand skirting FDA regulations. Several dessert manufacturers use FDA-approved ingredients (such as guar gum) to prevent freezer burn and control the melt rate.", "Shortly after a similar rumor circulated about Wal-Mart brand Ice Cream, Consumer Reports posted a video explaining the science behind \"ice cream\" that does not melt:", "Manufacturers add gums and other ingredients like calcium sulfate and mono diglycerides to help control the melting rate of ice cream. They are also added to stop large crystal formations from forming when the products are taken in and out of the freezer.", "While the above-referenced videos do show frozen products not melting, they are misleading: the products shown do not meet the FDA definition of an ice cream.  Also, despite the fact that they're not ice creams, they are approved by the FDA and safe for consumption; the fact that this product does not melt is not an unexplained anomaly that is putting consumers at risk.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]