["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker has indicated he supports a measure being considered in the Wisconsin Legislature that would repeal the state law requiring handgun purchasers to wait 48 hours before taking possession of a handgun they buy from a firearms dealer.", "Amid a surge in murderous gun violence in Milwaukee, the Republican-controlled Wisconsin Senate voted to repeal a state law that requires a two-day wait for handgun purchases.", "Just before the April 21, 2015, vote, the author of the bill, state Sen. Van Wanggaard, made this waiting-period claim:", "\"There’s no statistical evidence that it reduces violence whatsoever,\" the Racine Republican declared.", "With the repeal bill moving to the GOP-controlled Assembly, and likely headed for GOP Gov. Scott Walker, let’s see if Wanggaard is right.", "The law", "The District of Columbia and 10 states, including Wisconsin, Minnesota, Illinois and Iowa, have laws that require a waiting period for purchases of at least some types of guns, according to the Law Center to Prevent Gun Violence. Wisconsin’s law, in place since 1976, applies only to handguns and only to purchases from firearms dealers. It prohibits a handgun buyer from taking possession of the weapon until 48 hours after a background check is started -- even if the check comes back clean within a matter of hours or minutes.", "The City of Milwaukee, the Wisconsin Coalition Against Domestic Violence and the Wisconsin Medical Society are among groups that oppose scrapping the law. Some say the cooling-off period can help prevent crimes of passion, such as domestic violence.", "Under the repeal bill from Wanggaard, who is a retired Racine police traffic investigator, a buyer could take possession of a handgun as soon as the seller completes the background check.", "Groups backing the repeal include the National Rifle Association, the Milwaukee Police Association union and the Wisconsin Wildlife Federation. Some say the wait following a successful background check is an \"unnecessary time tax on both the purchaser and the dealer,\" and that a person who needs a gun for protection can be put at risk.", "Walker has indicated he supports the repeal. Asked about such a measure in February 2015, he told the NRA: \"I think we want to be a leader in this area as well.\"", "Studies", "Here are highlights from some key studies about the effects of waiting-period laws:", "A study done by one researcher from Georgetown University and one from Duke University that was published in the Journal of the American Medical Association in 2000 examined the Brady Handgun Violence Prevention Act, a 1994 federal law that established a nationwide waiting period and background check for handgun sales. (The waiting period provision was later removed.)", "The study concluded that the law’s waiting period was associated with reductions in the firearm suicide rate for people age 55 and older, but not associated with reductions in homicide rates or overall suicide rates.", "Other research has found that people who buy handguns are at a higher risk of committing suicide during the first week after the purchase. For example, an article published in 2000 by members of the Firearm Injury Center at the Medical College of Wisconsin said a Wisconsin study found a \"sharp increase\" in the risk of suicide within one week of a gun purchase.", "But a 2003 report by the U.S. Centers for Disease Control and Prevention that reviewed studies on the effects of waiting periods on violence found that some studies indicated a decrease in violent outcomes associated with the delay, while others indicated an increase.", "And a 2012 study by one researcher from the University of Cincinnati and another from Arizona State University found no statistical effects from waiting periods on gun crimes.", "In a nutshell, except for suicide, the studies show Wanggaard’s claim about waiting periods and violence is largely correct.", "Experts", "Daniel Webster, director of the Johns Hopkins University Center for Gun Policy and Research, told us there is research linking more thorough background checks -- which take longer than an instant FBI check -- with reduced homicide rates. The more thorough checks are more likely to turn up reasons why a person cannot legally purchase a gun. But Webster said he is not aware of research that shows waiting periods reduce violence.", "Similarly, Harvard’s David Hemenway said he was aware only of research that links lower suicide rates with wait periods. Many studies link lower levels of lethal violence with strong gun control laws in general, but not with particular laws such as a waiting period, he said.", "Our rating", "Wanggaard said, \"There’s no statistical evidence that\" a waiting period for handgun purchases \"reduces violence whatsoever.\"", "There is research to indicate that handgun waiting periods are linked with lower suicide rates. But we did not find evidence that waiting periods coincide with less violence being committed by one person against another. If such evidence emerges, we may revisit this item.", "As it stands, Wanggaard’s statement is accurate but needs clarification -- our definition of Mostly True.", "Milwaukee Journal Sentinel, \"Senate votes to end Wisconsin’s handgun waiting period,\" April 21, 2015", "Email exchange, Sen. Van Wanggaard staff member Scott Kelly, April 21, 2015", "Email exchange, Coalition to Stop Gun Violence Director of Communications Ladd Everitt, April 24, 2015", "Law Center to Prevent Gun Violence, \"Waiting periods policy summary,\" June 24, 2013", "Journalist’s Resource, \"Laws and policies that attempt to reduce firearm violence: research review,\" March 7, 2013", "Journal of the American Medical Association, \"Homicide and suicide rates associated with implementation of the Brady Handgun Violence Prevention Act,\" Aug. 2, 2000", "University of Chicago Law School, \"Multiple-victim public shootings, bombings and right-to-carry concealed handgun laws: Contrasting private and public law enforcement,\" 1999", "University of Alabama School of Law, \"Self-defense against gun suicide,\" Sept. 23, 2014", "Injury Prevention, \"Suicide guns: Why collect this information?\" December 2000", "Email exchange, Everytown for Gun Safety/Mayors Against Illegal Guns communications director Erika Soto Lamb, April 22, 2015", "Email exchange, former director of gun research for federal Centers for Disease Control Mark Rosenberg, April 22, 2015", "U.S. Court of Appeals, opening brief of Jeff Silvester v. Kamala Harris, March 25, 2015", "Email interview, Johns Hopkins University Center for Gun Policy and Research director Daniel Webster, April 22, 2015", "Email interview, Crime Prevention Research Center President John R. Lott, Jr.,  April 23, 2015", "Email exchange, Gun Owners of America Director of Communications Erich Pratt, April 23, 2015", "Email exchange, Law Center to Prevent Gun Violence Senior Staff Attorney Laura Cutilletta, April 24, 2015", "Interview, Wisconsin Carry Inc. chairman Nik Clark, April 23, 2015", "Crime & Delinquency, \"The Effectiveness of Policies and Programs That Attempt to Reduce Firearm Violence: A Meta-Analysis,\" February 2012", "Centers for Disease Control and Prevention, \"First reports evaluating the effectiveness of strategies for preventing violence: Early childhood home visitation and firearms laws,\" Oct. 3, 2003", "Journal of Criminal Law and Criminology, \"Easing concealed firearms laws: Effects on homicide in three states,\" Fall 1995", "Email interview, Harvard University professor of health policy David Hemenway, April 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]