["The Economic Freedom Fighters (EFF), a South African political party, launched its election manifesto on 2 February 2019 in the country's Gauteng province. The national election is scheduled for 8 May 2019.The party claims that \"landlessness and joblessness among black South Africans are at crisis levels, posing the biggest challenges that confront South African society today\".This report fact-checks five claims about land occupation, school dropout rates, unemployment, land redistribution and gender balance.", "”80% of the population continues to occupy less than 10% of South Africa’s land”", "”South Africa has one of the highest school dropout rates”", "”Close to 40% of South Africans who need jobs are unemployed, meaning that more than nine million South Africans who need jobs and are capable of working cannot find employment.”", "”The post-1994 governments have cumulatively bought less than 7% of the targeted 30% of land meant for redistribution over a period of 25 years.”", "The EFF…  “has a higher gender balance in parliament.”", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]