["About this rating", "Three simple tests can help diagnose the occurrence of a stroke.", "Making a stroke victim bleed from his fingers won't prevent further harm.", "Asking a stricken victim to stick out his tongue may help diagnose a stroke.", "Each year an estimated 600,000 Americans experience strokes, which are interruptions of the blood supply to any part of the brain, resulting in damaged brain tissue. Of these victims, 160,000 die, making stroke the third leading cause of death in the U.S. Those persons this dread killer does not immediately send to the grave are often left with lifelong debilitating infirmities of speech, movement, and even thought.", "A stroke is a serious medical event, both because it can (and does) kill, and because it can inflict long-term harm on those lucky enough to survive it. There are two types of acute stroke: ischemic and hemorrhagic. Ischemic strokes account for 80 percent of all such \"brain attacks\" and occur when a blood clot lodges in a vessel responsible for supplying blood to the brain, killing off part of that organ. Hemorrhagic strokes occur when a blood vessel in the brain ruptures, resulting in bleeding which causes swelling and hematoma and ultimately impairs brain function. Over the years, e-mail forwards and social media shares have dispensed advice to readers and users about how to identify and respond to a stroke:", "Examples: [Collected via e-mail, 2004]", "How to Recognize a Stroke", "This might be a lifesaver if you can remember the following advice, sent by a nurse, whose husband is a medical doctor.", "Sometimes symptoms of a stroke are difficult to identify. A stroke victim may suffer permanent brain damage when people fail to recognize what's happening. Now, doctors say any bystander can recognize a stroke, simply by asking three questions:", "If he or she has trouble with any of these tasks, call 911 immediately, and describe the symptoms to the dispatcher. Researchers are urging the general public to learn to ask these three questions quickly, to someone they suspect of having a stroke. Widespread use of this test could result in prompt diagnosis and treatment of a stroke, and prevent permanent brain damage.", "You may want to pass this along.", "[Collected via e-mail, 2004]", "Stroke has a new indicator! They say if you forward this to ten people, you stand a chance of saving one life. Will you send this along? Blood Clots/Stroke - They Now Have a Fourth Indicator, the Tongue:", "During a BBQ, a woman stumbled and took a little fall - she assured everyone that she was fine (they offered to call paramedics) ...she said she had just tripped over a brick because of her new shoes.", "They got her cleaned up and got her a new plate of food. While she appeared a bit shaken up, Jane went about enjoying herself the rest of the evening.", "Jane's husband called later telling everyone that his wife had been taken to the hospital - (at 6:00 PM Jane passed away.) She had suffered a stroke at the BBQ. Had they known how to identify the signs of a stroke, perhaps Jane would be with us today. Some don't die. They end up in a helpless, hopeless condition instead.", "It only takes a minute to read this.", "A neurologist says that if he can get to a stroke victim within 3 hours he can totally reverse the effects of a stroke... totally. He said the trick was getting a stroke recognized, diagnosed, and then getting the patient medically cared for within\n3 hours, which is tough.", "RECOGNIZING A STROKE", "Thank God for the sense to remember the '3' steps, STR. Read and", "Learn!", "Sometimes symptoms of a stroke are difficult to identify. Unfortunately, the lack of awareness spells disaster. The stroke victim may suffer severe brain damage when people nearby fail to recognize the symptoms of a stroke.", "Now doctors say a bystander can recognize a stroke by asking three simple questions:", "S *Ask the individual to SMILE.", "T *Ask the person to TALK and SPEAK A SIMPLE SENTENCE (Coherently) (i.e. Chicken Soup)", "R *Ask him or her to RAISE BOTH ARMS.", "If he or she has trouble with ANY ONE of these tasks, call emergency number immediately and describe the symptoms to the dispatcher.", "New Sign of a Stroke -------- Stick out Your Tongue", "NOTE: Another 'sign' of a stroke is this: Ask the person to 'stick' out his tongue. If the tongue is 'crooked', if it goes to one side or the other that is also an indication of a stroke.", "A cardiologist says if everyone who gets this e-mail sends it to 10 people; you can bet that at least one life will be saved.", "I have done my part. Will you?", "The advice given in these much-circulated e-mails appears to be sound, although it needs be pointed out that it has yet to be endorsed by the American Stroke Association. It was drawn from a report presented in February 2003 at the American Stroke Association's (ASA) 28th International Stroke Conference, and news of it can be found on the American Heart Association's (AHA) web site. However, as the ASA says in its official statement about the report, though the research was funded by a grant from the ASA, that body has not taken a position on the topic nor endorsed the test because the results, though positive, arose from a very small study.", "If the study's findings hold up, it would mean that recognizing a stroke has taken place would be something just about anyone could do and would be a skill worth mastering in light of the importance of getting medical attention for stroke victims at the earliest possible moment.", "Focal neurological signs such as slurred speech, unilateral facial droop, blurred vision, discoordination, and partial or total paralysis are often indicative of some sort of brain dysfunction and would be recognized as important markers by those in the medical profession. However, expecting laypeople to diagnose that something has gone terribly wrong in a loved one on the basis of that checklist would be reaching for too much; in that key moment few would be likely to remember what they were supposed to be looking for.", "The e-mailed advice, as circulated in 2006, contains this additional suggestion:", "Another 'sign' of a stroke is this: Ask the person to 'stick' out their tongue. if the tongue is 'crooked', if it goes to one side or the other, that is also an indication of a stroke.", "While that is also likely true, as a test it is far less valuable than the original three because there is room for interpretation of the results. How crooked is crooked, after all? How far to one side does the tongue have to go before its having done so can be regarded as a clear sign of a stroke having occurred? Better to discard this fourth suggested 'test' in favor of remembering the first three.", "By distilling the assessment process down to three simple tests (smile, raise both arms, speak a simple sentence), anyone is likely to remember what to ask of someone they suspect has just undergone a stroke and to correctly interpret the information so gleaned. (The tests are pass/fail, after all, so if the person they were administered to couldn't smile, couldn't raise her arms, and was incoherent, the party observing all this wouldn't be at a loss for what to make of the results — she'd conclude her friend had undergone a stroke.)", "And it is important laypeople learn to recognize such events, because a new drug has been shown to limit disability from strokes caused by clots (ischemic) provided victims receive it within three hours of the onset of stroke symptoms. Tissue plasminogen activator (tPA) is a clot-busting drug administered intravenously in cases of ischemic stroke; however, only one in fifty stroke patients has a chance of this drug helping them because currently only 2 percent of them reach an emergency room in time for tPA to be given.", "(It's possible tPA's effectiveness can be boosted by simultaneous massaging of the clot with ultrasound. Early results from a 2004 study performed in Houston on coupling this drug with such treatment are most encouraging.)", "A 2005 updating of the e-mail included this statement:", "A neurologist says that if he can get to a stroke victim within 3 hours he can totally reverse the effects of a stroke... totally. He said the trick was getting a stroke recognized, diagnosed, and then getting the patient medically cared for within 3 hours, which is tough.", "While getting appropriate medical care for a stroke victim as soon as possible is extremely important, doing so does not come with a 100% guarantee that a stroke identified and treated within a 3-hour timeframe will not cause permanent damage.", "The warning signs of a stroke are:", "Ergo, for once there's a \"Send this to everyone you know!\" missive afoot that really does contain highly useful and important information. Yet the Internet, while sometimes used to disseminate actual fact (such as the above), is also often used to spread utter nonsense. Consider the following piece of cyber advice about strokes, which we first saw in December 2003:", "First Aid for Stroke", "When stroke strikes, the capillaries in the brain will gradually burst. When a stroke occurs, stay calm. No matter where the victim is, do not move him/her. Because, if moved, the capillaries will burst.", "Help the victim to sit up where he is to prevent him from falling over. Again, and then the bloodletting can begin. If you have in your home an injection syringe, that would be the best, otherwise, a sewing needle or a straight pin will do. Place the needle/pin over fire to sterilize it, and then use it to prick the tip of all 10 fingers. There are no specific acupuncture points, just prick about a mm from the fingernail. Prick till blood comes out. If blood does not start to drip, then squeeze with your fingers. When all 10 digits is bleeding, wait a few minutes then the victim\nwill regain consciousness.", "If the victim's mouth is crooked, then pull on his ears until they are red. Then prick each ear lobe twice until two drops of blood comes from each ear lobe.", "After a few minutes the victim should regain consciousness. Wait till the victim regain his normal state without any abnormal symptoms then take him to the hospital, otherwise, if he was taken in the ambulance in a hurry to the hospital, the bumpy trip will cause all the capillaries in his brain to burst.", "If he could save his life, barely managing to walk, then it is by the grace of his ancestors.", "I learned about letting blood to save life from Chinese traditional doctor Ha Bu-Ting who lives in Sun-Juke. Furthermore, I had practical experience with it. Therefore I can say this method is 100% effective.", "In 1979, I was teaching in Fung-Gaap College in Tai-Chung. One afternoon I was teaching class when another teacher came running to my classroom and said in panting, \"Mr. Liu, come quick, our supervisor has had a stroke!\" I immediately went to the 3rd floor. When I saw our supervisor, Mr. Chen Fu-Tien, his color was off, his speech was slurred, and his mouth was crooked — all the symptoms of a stroke.", "I immediately asked one of the practicum students to go to the pharmacy outside the school to buy a syringe, which I used to prick Mr. Chen's 10 finger tips. When all 10 fingers were bleeding (each with a pea-sized drop of blood), after a few minutes, Mr. Chen's face regained its color and his eyes' spirit returned, too.", "But his mouth was still crooked. So I pulled on his ears to fill them with blood. When his ears became red, I pricked his right earlobe twice to let out 2 drops of blood. When both earlobes had two drops of blood each, a miracle happened. Within 3-5 minutes the shape of his mouth returned to normal and his speech became clear.", "We let him rest for a while and have a cup of hot tea, then we helped him go down the stairs, drove him to Wei-Wah Hospital. He rested one night and was released the next day to return to school to teach. Everything worked normally. There were no ill after-effects.", "On the other hand, the usual stroke victim usually suffers irreparable bursting of the brain capillaries on the way to the hospital. As a result, these victims never recover. Therefore stroke is the no. 2 cause of death. The lucky ones will stay alive but remain paralyzed for life.", "It is such a horrible thing to happen in one's life. If we can all remember this bloodletting method and start the life-saving process immediately, in a short time, the victim will be revived and regain 100% normality.", "We hope you can tell others about this first aid method. By doing so, stroke may be removed from the list of major causes of death. Forward this after reading. It will be a good deed indeed.", "As mentioned earlier in this article, there are two types of acute stroke: ischemic and hemorrhagic. However, there are also two kinds of strokes: acute and transient ischemic attack (TIA). The former is the sort that takes lives or leaves those it strikes with permanent and all too often heartbreakingly serious disabilities. With the latter, the focal symptoms resolve within 24 hours, leaving no permanent neurological deficit. With that in mind, the \"miraculous recovery\" described in the e-mail above would have been due to the patient having weathered a TIA episode, not to having had his blood drained from his fingers and ear lobes.", "Because the underlying patholophysiology is the same between acute stroke and TIA, it's important to seek immediate medical attention for all stroke victims. TIA is also often a warning sign heralding increased risk of stroke. (In high risk demographics, the risk of stroke goes up ten-fold after a TIA.)", "As for not moving a stroke victim because so doing might cause \"irreparable bursting of the brain capillaries,\" the initial insult (stroke) has already occurred, so transport is unlikely to cause further harm.", "With regard to pricking fingers to get them bleeding as a possible counter to strokes, according to Dr. Rupinder S. Sahsi of Guelph, Ontario, a medical doctor of our acquaintance, \"I see no physiological reason why minute amounts of peripheral blood loss would have any effect on cerebral blood flow.\" In other words, pricking a stroke victim's fingers to get each of them to drip blood isn't going to do anything to aid that person.", "However, taking the time to stab the victim's fingers before bothering to transport him to a hospital, with even that done at a low speed, will cause harm, because when it comes to obtaining proper treatment for stroke victims, time lost is brain lost. Our physician friend counsels: \"Do not wait for the symptoms to resolve before taking a casual drive to the hospital in your vehicle, as suggested by this e-mail.\"", "Getting a stroke victim to an emergency room in time for tPA therapy to be begun is the most important thing you can do to help prevent further brain damage. Do not waste any of that brief window of opportunity by driving at a snail's pace or by stopping to stab the person's fingers and ear lobes.", "Additional information:", "Stroke Fact Sheet   (Centers for Disease Control)", "Stroke Statistics   (National Center for Health Statistics)", "Casper, Mary Beth.   \"Hospitals Help Fight Stroke.\"\r\n    Newsday.   3 November 2003   (p. A23).", "Lake, Deborah Mann.   \"Stroke Treatment; Enhancing Odds of Recovery.\"\r\n    The Houston Chronicle.   26 February 2004   (p. A28).", "Taylor, Liz.   \"Quick Stroke Recognition Is Key to Helping Victim.\"\r\n    The Seattle Times.   27 October 2003   (p. E6).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]