["The claim was published here on Facebook on October 18, 2020.", "The Sinhala-language text in the image translates to English as: “Contact us if you are a resident in an area affected by the coronavirus / Sri Lanka’s ‘Red Star’ has an allowance of  5000 Sri Lankan rupees for you”.", "The Sinhala-language post caption reads: “The Red Star that comes to you in your time of need..!”", "The Red Star is a relief organisation run by Sri Lanka’s People’s Liberation Front party, known locally as the Janatha Vimukthi Peramuna (JVP) party.", "The claim circulated online just days after Sri Lanka recorded a hike in coronavirus cases. More than 1,000 workers at a factory on the outskirts of Colombo tested positive for the virus; the factory was producing surgical masks for the US until August, according to this AFP report.", "A similar claim was also shared here and here on Facebook.", "Other Facebook posts, including this one published on October 9 and this one on October 10, additionally claimed that the People’s Liberation Front party has completed “all necessary preparations” to quarantine up to 20,000 people with coronavirus.", "These claims were shared alongside a photo showing several beds with pillows that carry the Red Star logo, inside an unknown building.", "The Sinhala-language post states: “The Red Star has made all necessary preparations to quarantine 20,000 persons who have been affected by the coronavirus. The Red Star always comes forward during any national emergency. / Salutations comrade.", "\"-Another social service by the JVP -”.", "The claims, however, are false.", "The People’s Liberation Front party’s Chief of Media Upul Ranjan denied the claims during a phone conversation with AFP on October 20.", "“These claims have been circulated with the very clear aim of making a mockery and tainting the social service commitments fulfilled by [our party]. Aiding coronavirus affected individuals is a task that has to be undertaken by health authorities. We have not taken measures to distribute 5000 Sri Lankan rupees and we have not arranged any facilities to quarantine individuals who have been instructed to self-isolate themselves,” he said.", "A reverse image search on Google of the photo of the supposed quarantine facility found the original photo was published here in a report by Sri Lankan news site Mawratanews on October 8, 2020.", "A closer examination of the Mawratanews photo shows there are no Red Star logos on the pillows in the image, as seen in the misleading posts.", "The report is headlined: ‘Brandix, that infected thousands of coronavirus patients”, and reads, in part: \"Brandix clothing factory, which was ground zero of the new wave of coronavirus infections in Sri Lanka has now been transformed into a quarantine center. This is what the facility looks like today, which was earlier filled with sewing machines\".", "Below is a screenshot comparison of the photo in the misleading post (L) and the Mawratanews photo (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]