["About this rating", "Bernie Sanders made a Facebook post in which he criticized a \"political system in which a handful of very wealthy people and special interests will determine who gets elected.\"", "Sanders did not rescind his endorsement of Hillary Clinton and has continued urging his supporters to vote for her.", "On 17 October 2016, the disreputable YourNewsWire.com web site posted an article claiming that Vermont senator Bernie Sanders had \"suggested that the Presidential election may be rigged, and has unendorsed Hillary Clinton\":", "In an unexpected announcement Bernie Sanders has suggested that the Presidential election may be rigged, and has unendorsed Hillary Clinton.", "In a cryptic Facebook message, Sanders warned American citizens of a rigged system and criticised the overly powerful elite who run it.", "Senator Sanders did issue a Facebook post on the previous day (16 October 2016), but it didn't at all say what YourNewsWire.com misleadingly claimed of it:", "Sanders wasn't suggesting that elections are \"rigged\" (i.e., that voters are suppressed, that votes are cast fraudulently, that votes are not counted accurately); rather, he was decrying the pervasive role money plays in shaping the political process and influencing which candidates are elected, a major plank of his platform as a presidential candidate (and referencing Abraham Lincoln in what many readers construed as a callback to the second presidential debate of 2016). But Sanders did not opine \"that the Presidential election may be rigged,\" nor did he \"unendorse\" Hillary Clinton.", "On and after 16 October 2016, Sanders has continued to tweet and share content promoting Hillary Clinton's candidacy:", "Progressive economists agree: @HillaryClinton's economic agenda will reduce inequality, raise wages and create jobs. https://t.co/jACCRXa19p", "— Bernie Sanders (@BernieSanders) October 18, 2016", ".@BernieSanders answers the most important question: Why should his supporters vote for Hillary Clinton? (a NowThis exclusive) pic.twitter.com/SlT4E5l5vM — NowThis (@nowthisnews) October 17, 2016", "WATCH LIVE: Sens. Bernie Sanders and Elizabeth Warren campaign together for Hillary Clinton https://t.co/PPsKXmSc69 pic.twitter.com/2ZwiDNCDbT", "— NBC News (@NBCNews) October 17, 2016", "The Democratic platform is a very progressive document but no president will be able to implement it unless millions of people stand up. — Bernie Sanders (@BernieSanders) October 16, 2016", "Join Bernie and Sen. Elizabeth Warren in Denver at 6 PM today: https://t.co/JADxiCceb0", "— Bernie Sanders (@BernieSanders) October 16, 2016", "Bernie Sanders, Elizabeth Warren teaming up Sunday to pitch Clinton to progressives https://t.co/BpE4FBMRKV — John Wagner (@WPJohnWagner) October 16, 2016", "Not only hasn't Sanders \"unendorsed\" Hillary Clinton (nor said the election is \"rigged\"), he has belied that claim by continuing to publicly promote her candidacy.", "Shalby, Colleen.   \"Watch Trump and Clinton Argue About Abraham Lincoln at the Debate.\"\r\n    Los Angeles Times.   9 October 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]