["About this rating", "Violent protests captured on video erupted in France in February 2017 after a young black man was allegedly sodomized by a police officer.", "The video seen here captures one of those protests, not Muslim refugees taking over an area in France.", "On 14 February 2017, the anti-Islam Facebook group \"Our Eye on Islam\" shared a video entitled \"France Has Fallen\" which purportedly showed Muslim refugees taking over an area of the European country:", "\"Our Eye on Islam\" provided little context concerning the events glimpsed in the video, and even though an explanation of the cause of the riots was also noticeably absent from the comment sections of the video on Facebook, viewers generally agreed that America needed to \"wake up\" and stop refugees from entering the U.S. or else \"this\" (i.e., Muslim refugees committing violent acts) would soon start happening in America as well:", "Wake up America. This is coming to US! It is just a matter of time before this is happening here. We give them refuge and this is what we get in return. They don't want to be Americans, they what Americans to become Muslims and they will do whatever is necessary to see that happen. Pull your head out of the sand and wake up before it is too late.", "The riots depicted in the video have little to do with Muslims or refugees, however.  Signs glimpsed in the video showing the locale to be the Paris suburb of Seine-Saint-Denis identify the demonstration as one that took place on 11 February 2017,  one of multiple violent clashes between protesters and police took place in France after a young black man was allegedly sodomized by a police officer:", "It begins, as it does so often in France, in the suburbs of Paris. Clichy-sous-Bois, Villiers-le-Bel, Bobigny, Aulnay-sous-Bois — the names evoke beauty and nature, but the streets frequently become riot zones.", "The latest explosion was triggered by what is now known as \"l'affaire Théo.\"", "The actors are new, but the roles are familiar. On the one hand is Théo, a tall young black man, born in France. Facing him is a squad of French police, all white.", "Théo, a community worker with an unblemished police record, made the mistake on Feb. 2 of intervening to try to calm a dispute between a friend and a police constable. He was arrested and beaten and then anally raped with a police truncheon.", "The wounds to his rectum were so serious that Théo, 22, was rushed to hospital for an emergency operation. He's still in hospital.", "News of the incident set off violent clashes between protesters and police in Aulnay-sous-Bois. They've taken place almost every night since — with cars burnt, stores smashed by balaclava-wearing \"casseurs\" or anarchists, dozens arrested in several suburbs — all despite a call for calm from Théo himself, lying in his hospital bed.", "As the Washington Post noted, the protests were sparked by police investigators' conclusion that the injuries suffered by Théo were unintentional and did not constitute rape:", "Thousands marched through the suburbs of Paris, some burning cars and smashing bus shelters, after police claimed that the anal violation of a black man with a baton was an accident, not a rape.", "After a week of nightly clashes between officers and angry residents, Agence France-Presse reported, a huge protest began peacefully outside a courthouse in Bobigny, north of the capital.", "Demonstrators carried signs — “Police rape,” read one, the outlet reported — and smaller groups assembled in other suburbs.", "But before the day was done, at least 37 people would be in jail, and a little girl had to be rescued from a burning car. Police told AFP that “several hundred” people rampaged though the streets of Bobigny, “attacking cars, shops and public property.”", "[Théo] was covered in blood when he arrived at an emergency room Feb. 2.", "Doctors discovered that his primary injury had been caused by a police truncheon that had been forced inside his rectum during a violent encounter with officers in Aulnay-sous-Bois, a suburb north of Paris.", "Théo, a 22-year-old French youth worker whose last name has not been released, said that the injury — which required major surgery to repair — was inflicted intentionally and that he was the victim of a horrific sexual assault.", "More than a week later, investigators have reached an entirely different conclusion: The violent sodomy was accidental and occurred when the officer’s expandable baton happened to slip into the victim’s anus.", "While noting that the violent encounter was “very serious,” the investigation by France’s national police determined that the incident was “not a rape” because of the “unintentional character” of the penetration ...", "Al Jareeza.   \"Paris Rally Over Alleged Police Rape Descends Into Riot.\"\r\n    11 February 2017.", "Holley, Peter.   \"Riots Outside Paris After Police Claim an Officer’s Alleged Rape of a Black Man Was an Accident.\"\r\n    The Washington Post.   12 February 2017.", "Murray, Don.   \"L'affaire Théo: Riots Against French Police Look Familiar — So Does the Proposed Cure.\"\r\n    CBC News.   15 February 2017.", "Agnew, Harriet.   \"Paris Riots Escalate as Police Face Investigation for Alleged Rape.\"\r\n    Financial Times.   12 February 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]