["A video of a man dressed in army fatigues, who is seen brutally stabbing a dead body with a knife, is being shared on social media. Twitter user Mirza Javed Ullah Khan posted the video with the narrative that these are soldiers of the Indian army meting out brutality on these ‘martyred Kashmiri Muslims’.", "Another Twitter user shared the same video with a similar narrative.", "With the help of digital verification tool Invid, Alt News broke the video into multiple frames, which were then used to perform a reverse search on Google. It was found that the video has been manipulated with unrelated audio superimposed over it. This video depicting extremely disturbing visuals is at least seven years old and has been shared in the context of the politics of West-Asia. There is no reference to India in the 2012 article that Alt News found. We found the screenshot of the frames from the viral video posted in a blog published on November 3, 2012. Moreover, the blog claimed that these soldiers were from Syria’s secret police, the Shabiha.", "Alt News was unable to independently ascertain that these visuals depicted Syria’s Shabiha. However, it is clear that the video couldn’t be a recent one from Kashmir.", "In conclusion, a seven-year-old video of a man, dressed in army fatigues, relentlessly stabbing a dead person is being falsely propagated on social media as footage of brutality meted out on Kashmiris by Indian army personnel.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]