["About this rating", "Have you ever gotten so hungry playing a video game that you wish you could just eat whatever was inside your video game console?", "In 2020, fast food chain KFC added another memorable marketing stunt to its end-of-year blitz. First it was a KFC-themed mini-soap opera titled, \"A Recipe for Seduction.\" Now it's KFConsole, a video game console with a storage area that keeps snacks (chicken) warm.", "The idea was initially floated on Twitter in June 2020 when the account for KFC Gaming (which is a thing, no doubt, because it's 2020) posted a video that showed a grill-like device inside a bucket-shaped console. People expressed skepticism. Is it a marketing stunt, or a real gaming console set to be mass-produced for KFC-loving gamers everywhere?", "Then on Dec. 22, 2020, Mark Walton, a spokesman for Intel, assured the wary, \"Yes it's real. Yes, it's powered by Intel. And yes, it has a chicken warmer.\"", "The chicken-warming gaming console resulted from a collaboration between KFC and computer hardware manufacturer Cooler Master, and Cooler Master's announcement about the device comes with some specs, but no details about when it would be available to the public or what games would be playable on it. Cooler Master said the food in the chamber would kept warm by the gaming console's own heat and airflow system. The announcement also suggests that the so-called \"Chicken Chamber\" is a patented invention. Via Twitter, we reached out to Cooler Master about the existence of this patent, but have not received a response.", "On the one hand, a Chicken Chamber-enhanced gaming console produced by a fast food chicken company is an objectively absurd concept. On the other hand, Mario Lopez — in character as a young Col. Sanders —  once uttered the words \"don't call me crouton\" in a Lifetime channel mini-soap opera produced by that same fast food chicken company. Because the product has not been released, all we have to go on are public statements made by the companies allegedly involved in the project: KFC, Cooler Master, Intel, ASUS, and Seagate.", "KFC's corporate office released a news release on Dec. 22, 2020 as part of \"the official launch of the KFConsole in partnership with Cooler Master.\" A spokesperson for Cooler Master, which hosts the landing page for the KFConsole product, is also quoted in the news release as saying the company \"jumped at the chance to get involved and enter the console war.\" In addition to the tweet from their spokesperson Walton, Intel told CNN that they had nothing to add to the details provided by KFC and Cooler Master. Snopes reached out to both ASUS and Seagate for comment, but received no response.", "Because KFC has a track record of following through on ridiculous-sounding marketing notions, and because at least three of the companies involved in the product have confirmed its existence, we cautiously rank the claim that KFC developed a chicken-heating gaming console as \"True.\"", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]