["About this rating", "On 23 April 2015, Hillary Clinton delivered the keynote address at the annual Women in the World Summit in New York City. In a 20-minute speech that touched on the triumphs and challenges of improving the plight of women and girls worldwide, Clinton emphasized the work yet to be done:", "Yes, we've nearly closed the global gender gap in primary school, but secondary school remains out of reach for so many girls around the world. Yes, we've increased the number of countries prohibiting domestic violence, but still more than half the nations in the world have no such laws on the books, and an estimated one in three women still experience violence. Yes, we've cut the mortality rate in half, but far too many women are still denied critical access to reproductive health care and safe childbirth.", "All the laws we've passed don't count for much if they're not enforced. Rights have to exist in practice, not just on paper. Laws have to be backed up with resources and political will. And deep seated cultural codes, religious beliefs and structural biases have to be changed.", "As I have said, and as I believe, the advancement of the full participation of women and girls in every aspect of their societies is the great unfinished business of the twenty-first century, and not just for women but for everyone — and not just in far away countries but right here in the United States.\"", "Interestingly, within a day of Clinton's address, an excerpt from the passage above was being passed around on the Internet, misrepresented as a demand for Christians to renounce their faith.", "\"Sorry Christians,\" a blog called the Right Scoop intoned ominously on 24 April 2015, \"but your religious beliefs against abortion aren’t good enough anymore. They must be changed.\"", "\"Hilary Clinton just said that Christians must deny their Faith through the enforcement of laws, by stating that the Christian belief in being pro-life, and anti-abortion, must change,\" warned Shoebat.com, \"and that this should be done through laws and 'political will.' If Christians must change Christian teachings in regards to abortion, then what Hilary Clinton is essentially saying is that Christians must deny their Faith.\"", "Shoebat continued: \"Notice that she says that the change of Christian beliefs is the 'unfinished business of the 21st century,' which means she wants to persecute Christians.\"", "Having read the pertinent paragraphs from Clinton's actual speech above, one might well wonder how her call for the enforcement of laws protecting the rights of women in countries with deep-seated cultural biases morphed into a demand for American Christians to deny their faith. Quite simply, it was done by editing out the context so only these remarks are left (emphasis added by Shoebat.com):", "Far too many women are denied access to reproductive health care and safe childbirth, and laws don’t count for much if they’re not enforced. Rights have to exist in practice — not just on paper. Laws have to be backed up with resources and political will. And deep-seated cultural codes, religious beliefs and structural biases have to be changed.", "Gone are all references to education, domestic violence, and the mortality rate of women in childbirth — not to mention the international scope of the subject matter — so what remains could be misrepresented as a direct threat to pro-life Christians in America. That was clearly not the original import of the passage.", "For anyone curious to learn what Hillary Clinton actually said in the speech, it was captured in its entirety in the video below:", "Pesta, Abigail.  \"Hillary Clinton Implores Audience to Become 'Agents of Change.'\"\r\n   The New York Times.   23 April 2015.", "Shoebat, Theodore.  \"Hilary Clinton: Christians in America Must Deny Their Faith in Christianity.\"\r\n    Shoebat.com.   24 April 2015.", "The Right Scoop.   \"Hillary Clinton: Religious Beliefs About Abortion Have to Be Changed.\"\r\n    24 April 2015.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]