["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Job seekers check out companies at a job fair in Miami Lakes, Fl. on Aug. 14, 2013. Photo credit: AP.", "When lawmakers returned to Congress after the new year, Democrats and Republicans went back to their corners and began sparring over whether to extend unemployment benefits.", "Georgia’s two U.S. senators, Republicans Saxby Chambliss and Johnny Isakson, both opposed a Democratic-led $6.4 billion proposal to extend the benefits, which expired Dec. 28.", "Americans United for Change, a liberal advocacy group, promptly sent out a press release decrying the senators’ votes. The group included a claim about the economic impact to Georgia about extending those benefits that put PolitiFact Georgia and its Truth-O-Meter to work.", "\"Sens. Isakson’s, Chambliss’ Votes Against Unemployment Insurance Were Votes to Kill Nearly 6,000 Georgia Jobs,\" Americans United for Change wrote in the headline.", "Is that true, we wondered?", "Georgians now are eligible for a maximum of 18 weeks of state-based unemployment insurance, The Atlanta Journal-Constitution reported. Congress typically enacts extended federal benefits during recessions, and the expired benefits ran for a maximum of 47 additional weeks.", "Chambliss and Isakson have supported a GOP proposal to pay for a $6.4 billion long-term unemployment insurance extension and to restore $6 billion in cost-of-living increases for early military pensions. They would pay for that by preventing illegal immigrants from claiming a tax credit for their children.", "Americans United for Change based its claim on a report on the White House website pushing the extension. Called \"The Economic Benefits of Extending Unemployment Benefits,\" the report outlines how many jobs would be saved in 2014 by continuing the insurance. In Georgia, the total was 5,876. Nationally, the impact is 240,000 jobs, the report says. The report was written by the U.S. Labor Department and the Council of Economic Advisors.", "Without the additional unemployment insurance, many of those jobless workers would seek help from other federal programs, such as the Supplemental Nutrition Assistance Program, formerly known as the food stamp program.", "White House officials pointed to a report by the nonpartisan Congressional Budget Office to support the claim. The CBO released a report in December that concluded extending unemployment benefits through the end of 2014 would add about 200,000 jobs nationwide. That estimate is slightly lower but pretty close to the report on the White House website. The CBO and White House reports use the amount of money spent in each state from unemployment insurance and estimate how many jobs it will create or save.", "Unemployment benefits have a trickle-down effect on the economy, some say. The money those unemployed recipients receive in benefits is used to buy groceries and other services that keep others employed or can create additional jobs.", "\"Who provides goods and services? Workers,\" said Heidi Shierholz, an economist for the Economic Policy Institute, a generally left-leaning, Washington-based nonprofit that supports extending the benefits.", "The institute has done its own research on the topic. It concluded 310,000 jobs would be created. Shierholz, who co-wrote the report, said her group used federal data and added a multiplier to come up with its estimate. Shierholz said the Obama administration report used what she described as \"standard\" methodology to come up with its estimate.", "\"Their overall numbers make sense,\" Shierholz told us.", "University of Georgia professor Jeffrey Dorfman was not so convinced about the effectiveness of extending the benefits. He said if you believe that deficit spending will boost the economy, \"then the methodology used is correct and reasonably well done.\"", "\"I personally think these models far overstate the benefits of deficit spending because they do not account for the cost of the lost spending by whoever would have borrowed the money if the government hadn't borrowed it first,\" Dorfman said via email. \"We see the benefits of the government spending but do not see the jobs that would have been created in the private sector instead.\"", "He also questioned the logic of extending the benefits.", "\"Extended unemployment payments are currently scored at $6.5 billion for a 3 month extension. If we figure $26 billion for the whole year versus the 240,000 jobs that the White House says will be ‘saved or created’ by that spending, that works out to $108,333 per job,\" Dorfman said. \"Clearly, we would be better off if the federal government just randomly picked 240,000 long term unemployed people and gave them government jobs at say $40,000 per year.\"", "To sum up, Americans United for Change claimed extending unemployment benefits would save nearly 6,000 Georgia jobs this year. The claim was based on a federal report. Other nationwide estimates suggest the jobs number in the report is on target.", "But it is still an estimate that’s based on economic projections.", "And the overreaching point by American United for Change neglects the fact that Isakson and Chambliss back a GOP plan that would also extend jobless benefits.", "With those caveats, we rate this claim Half True.", "The Atlanta Journal-Constitution, \"Senate plans to vote on reviving jobless benefits,\" Jan. 6, 2014.", "The Atlanta Journal-Constitution Political Insider, \"Saxby Chambliss, Johnny Isakson pitch unemployment fix,\" Jan. 8, 2014.", "Congressional Budget Office, \"How Extending Certain Unemployment Benefits Would Affect Output and Employment in 2014,\" Dec. 3, 2013.", "Economic Policy Institute report on unemployment insurance, Nov. 7, 2013.", "Email interview with Jeffrey Dorfman, professor, University of Georgia, Jan. 9, 2014.", "Telephone interview with Heidi Shierholz, economist, Economic Policy Institute, Jan. 9, 2014.", "White House report on unemployment benefits, December 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]