["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The city of Seattle refreshed the national debate on the minimum wage recently by approving a plan that will gradually hike its hourly minimum wage to $15. The move positions Seattle with the highest minimum wage in the country, almost $5 more than than the $10.10 level sought by President Barack Obama.", "ABC’s This Week spotlighted the decision in a June 8, 2014, segment pitting Wall Street Journal editorial page editor Paul Gigot against The Nation editor Katrina vanden Heuvel.", "Gigot argued the proposal may have detrimental effects by pushing young earners with toes in the workforce out of low-wage jobs. Vanden Heuvel countered with a point that inverted popular understanding of who is affected by minimum wage policies.", "\"Listen, this is smart economics, it’s good politics, and it’s morally right,\" she said. \"First of all, only one out of 10 minimum wage workers today are teen age or a young person.\"", "PunditFact wanted to fact-check her talking point.", "What the numbers say", "We have unpacked similar claims over recent months.", "The notion that most minimum wage earners are young workers starting out their professional careers or teenagers working over the summer or to pay for college is not always cut and dried. A February Congressional Budget Office report says that \"of the 5.5 million workers who earned within 25 cents of the minimum wage in 2013, three-quarters were at least 20 years old and two-fifths worked full time.\"", "But are just 10 percent of minimum wage earners young adults or teenagers?", "The Bureau of Labor Statistics, a reliable federal trove of employment data, is the most detailed source of information on federal minimum wage workers. But even its data isn’t complete because it focuses only on workers who earn the federal minimum wage of $7.25 an hour. That does not account for workers in the 21 states and District of Columbia with higher minimum wage levels, from $7.50 in Missouri to $9.32 in Washington.", "Half of all workers live in states where the minimum wage is more than $7.25 an hour, according to the Congressional Budget Office report, which makes for a significant caveat.", "Still, according to the BLS, workers who are 16 to 24 years old comprise 50 percent of workers who earn at or below the federal minimum wage. (Someone can earn less than the minimum wage thanks to exceptions in the law for vocational students, for example.)", "That’s a far cry from what vanden Heuvel said.", "A different study", "Vanden Heuvel told us she was trying to describe who would benefit from raising the minimum wage, and that the majority of those people would be older workers.", "That’s not what she said, but we’ve seen others make the same mistake -- including Obama.", "Vanden Heuvel appears to rely on data from the liberal Economic Policy Institute, which supports increasing the minimum wage. The institute looked at workers who would benefit from increasing the minimum wage to $10.10, which would include everyone who makes less than that amount, not just those workers earning $7.25.", "The institute also factored in workers making up to $11.10 an hour currently, assuming that if workers below them would get a raise, they would as well, EPI report author David Cooper said in April.", "So what did EPI find? Among the people who EPI believes would get a raise, only 12.5 percent are less than 20 years old. Here’s a breakdown by age bracket:", "Age", "EPI (workers earning up to $11.10)", "19 and under", "12.5%", "20-29", "36.5%", "30-39", "16.6%", "40-54", "20.8%", "55 and over", "13.7%", "So that’s closer to one in 10, though it doesn’t factor in young adults in their 20s and it’s measuring workers who might benefit from raising the minimum wage -- not who is making the minimum wage today.", "\"The number she is using is much more along the lines of who would get a raise, not who is today a minimum wage worker,\" said Heidi Shierholz, a senior economist at the Economic Policy Institute.", "The Congressional Budget Office report also looks at workers who would be affected by a hike in the minimum wage, using the same logic as EPI that some employees would indirectly see a pay increase to retain their spot in a company pecking order. CBO projected 12 percent of workers who would be paid $11.50 an hour or less by 2016 are teenagers (Table 2). CBO did not break down its data by more narrow age groups.", "Our ruling", "During a faceoff with a Wall Street Journal editor on ABC This Week, vanden Heuvel listed several reasons in favor of raising the minimum wage.", "\"Only one out of 10 minimum wage workers today are teen age or a young person,\" she said.", "Her words described the current demographics of minimum wage workers, but that is not what’s reflected by the research we found. According to the BLS, workers who are 16 to 24 years old comprise 50 percent of workers who earn at or below the federal minimum wage.", "Vanden Heuvel was wrongly describing a study of who would get a raise from increasing the minimum wage. According to the liberal Economic Policy Institute, teens would make up 12.5 percent of people who would benefit from raising the minimum wage to $10.10.", "We rate her claim False.", "Bureau of Labor Statistics, Characteristics of Minimum Wage Workers: 2013, March 2014", "PolitiFact, \"White House says most of those helped by its minimum-wage hike are full-time workers, with average age of 35,\" April 8, 2014", "PolitiFact, \"Rob Portman says 'about 2 percent of Americans get paid the minimum wage,' \" Dec. 8, 2013", "Economic Policy Institute, \"Raising the Federal Minimum Wage to $10.10 Would Lift Wages for Millions and Provide a Modest Economic Boost,\" Dec. 19, 2013", "PolitiFact Wisconsin, \"Scott Walker says minimum wage jobs are ‘overwhelmingly’ for young people,\" Jan. 13, 2014", "Interview with Heidi Shierholz, Economic Policy Institute labor economist, June 8, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]