["The image was published here in a Facebook post on November 17, 2019. It has been shared 897 times.", "The purported newspaper front page bears the headline “Are Pakistani courts bitches of the riches?” and features a photo of Nawaz Sharif.", "The post’s caption reads: #American #newspaper from #Virginia raised a very valid question through its headline which is self-explanatory. To this question, I say a big 'Yes' that #Pakistani #Courts are #BitchesoftheRiches and sadly its the people of #Pakistan who will pay for his #corruption.", "Below is a screenshot of the misleading Facebook post:", "Sharif, who was ousted from his third premiership in 2017 and later imprisoned on corruption charges, travelled to London to receive medical treatment on November 19, AFP reported here. Travel was granted by the judiciary and was ultimately allowed after the current government waived steep bail conditions.", "The same misleading image was also posted on Facebook here and here. Another Facebook post here showed a screenshot of a tweet that included the photo and a caption that reads: \"This is what the World thinks of our top Courts - SHAMEFUL.\"", "The claim is false; the image does not show a genuine US newspaper article.", "A review of the Washington-based Newseum’s website, which archives the daily front pages of US newspapers, found that there was no newspaper in Virginia with a name starting with “News,” as the image in the misleading posts appeared to show.", "A reverse image search on Google for the photo of Sharif used in the misleading post found the image was taken from this 2018 report by The International Consortium of Investigative Journalists (ICIJ), a US-based non-profit journalism network.", "The ICIJ article carries the same photo and the same overlay text, which can be seen in the misleading Facebook post. Below is a screenshot comparison of the ICIJ report (L) and the misleading image (R) with the text noted in a red box:", "The photo of Sharif was cropped from an AFP photo taken in London on July 6, 2018, the same day that a court in Islamabad sentenced him in absentia on graft charges. Below is a screenshot of the photo, which can be seen on the AFP Forum here.", "The photo caption states: \"Pakistan's former prime minister Nawaz Sharif arrives at his office in central London on July 6, 2018. Pakistan's former prime minister Nawaz Sharif was sentenced in absentia to 10 years in prison by a corruption court in Islamabad on July 6, 2018, lawyers said, dealing a serious blow to his party's troubled campaign ahead of July 25 elections. Tolga AKMEN / AFP.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]