["“America has been vaccinating cattle for coronavirus for years, yet the news tells you it’s new and gunna kill you,” reads the caption of a Facebook post featuring a photo of a vial of bovine rotavirus-coronavirus vaccine.", "Similar points were made in Facebook posts in French and in Spanish.", "Other posts make a similar point, but with vials of canine coronavirus vaccine.", "“Can anyone explain to me why they made a Corona virus vaccine a year ago for K9s but are acting like this shit is a new virus,” a Facebook user wrote in this post.", "Another post reads: “Now this was 2001 tell me why 19 years later they say there is no vaccine share before they take it down again (sic).”", "The cattle vaccine in the first post is ScourGuard 4K, manufactured by Zoetis, an animal health company, and is unrelated to the novel coronavirus, or COVID-19, that is affecting humans.", "Christina Lood, a spokeswoman for Zoetis, told AFP by email that the vaccine cannot be used on humans or to prevent COVID-19.", "“ScourGuard 4K is for the vaccination of healthy, pregnant cows and heifers as an aid in preventing diarrhea (scours) in their calves caused in part by bovine coronavirus,” Lood said.", "Stephen Cole, an assistant professor of microbiology at the University of Pennsylvania School of Veterinary Medicine, told AFP by email that coronaviruses are a large family of viruses that can infect different species and cause different symptoms.", "“The actual name of the virus that causes COVID-19 is SARS-CoV-2, whereas the coronavirus that the cattle vaccine is for is called BCV or BCoV,” Cole said.", "“They are different viruses and therefore the same vaccine would not likely work,” Cole explained.", "According to the Friedrich Loeffler Institute, Germany’s institute for animal health, there is currently no evidence that farm animals can contract the novel coronavirus.", "The vaccine in the second and third photos is Canine Coronavirus Vaccine, Killed Virus -- a product for dogs that is manufactured by Boehringer Ingelheim Animal Health USA.", "Cole told AFP that vaccines for coronaviruses affecting dogs, CCV or CRCoV, would likely not work across species either.", "To illustrate his point, Cole pointed out that although the virus that causes distemper in dogs belongs to the same virus family that causes measles in humans, morbiliviruses, different vaccines are used to prevent these two diseases.", "There is no evidence that dogs and other pets can transmit COVID-19, according to the World Health Organization (WHO).", "“Possible animal sources of COVID-19 have not yet been confirmed,” the agency stated on its coronavirus information page.", "The US Centers for Disease Control and Prevention (CDC) adds that to date, it has “not received any reports of pets or other animals becoming sick with COVID-19.”", "AFP reported that the first human trial to evaluate a candidate vaccine against the new coronavirus began in the US city of Seattle on March 16.", "On March 18, 2020, WHO chief Tedros Adhanom Ghebreyesus called on all countries to use a comprehensive approach and focus on slowing down transmission and flattening the curve, or keeping the number of cases at a manageable level by engaging in social distancing.", "“This approach is saving lives and buying time for the development of vaccines and treatments,” he told journalists during a virtual press conference.", "As of March 18, there were 7,038 confirmed cases and 97 deaths related to the coronavirus in the United States, according to the CDC.", "AFP Fact Check has debunked more than 130 false and misleading claims about the coronavirus.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]