["About this rating", "In January 2017, white nationalist Richard Spencer was punched in the face, igniting a debate about when it is acceptable to punch someone who espouses beliefs widely regarded as reprehensible (generally taking the form of the question, \"Is it ever acceptable to punch a Nazi?\"). In the ensuing discussion, the following popular quote, often attributed to Adolf Hitler, reappeared and recirculated:", "Daniel Guérin documented this quote in his 1939 book Fascism and Big Business, citing a speech Hitler delivered at the Nuremberg Congress on 3 September 1933.  However, Guérin may have paraphrased Hitler's actual words, as the quote was presented alongside another utterance from a National Socialist leader, Joseph Goebbels, and not with the full text of the speech itself:", "If in the beginning, when the Hitler bands were still weak, the workers' parties had answered them blow for blow, there is no doubt their development would have been hampered. On this point we have the testimony of the National Socialist leaders themselves.", "Hitler confessed in retrospect: Only one thing could have broken our movement — if the adversary had understood its principle and from the first day had smashed, with the most extreme brutality, the nucleus of our new movement.\"", "And Goebbels: \"If the enemy had known how weak we were, it would probably have reduced us to jelly ... It would have crushed in blood the very beginning of our work.\"", "A 1934 book containing Hitler's speeches, titled  \"Die Reden Hitlers am Reichsparteitag 1933,\" includes a German-language version of the referenced speech. A translation of speech from the web site Zuriz confirms that the quote is largely accurate, although as typically presented it lacks some vital context:", "“And so, I established in 1919 a programme and tendency that was a conscious slap in the face of the democratic-pacifist world. [We knew] it might take five or ten or twenty years, yet gradually an authoritarian state arose within the democratic state, and a nucleus of fanatical devotion and ruthless determination formed in a wretched world that lacked basic convictions.", "Only one danger could have jeopardised this development — if our adversaries had understood its principle, established a clear understanding of our ideas, and not offered any resistance. Or, alternatively, if they had from the first day annihilated with the utmost brutality the nucleus of our new movement.", "Neither was done. The times were such that our adversaries were no longer capable of accomplishing our annihilation, nor did they have the nerve. Arguably, they furthermore lacked the understanding to assume a wholly appropriate attitude. Instead, they began to tyrannise our young movement by bourgeois means, and, by doing so, they assisted the process of natural selection in a very fortunate manner. From there on, it was only a question of time until the leadership of the nation would fall to our hardened human material.", "The more our adversaries believe they can obstruct our development by employing a degree of terror that is characteristic of their nature, the more they encourage it. Nietzsche said that a blow which does not kill a strong man only makes him stronger, and his words are confirmed a thousand times. Every blow strengthens our defiance, every persecution reinforces our single-minded determination, and the elements that do fall are good riddance to the movement.”", "While Hitler did say that the rise of the Nazi party could have been stopped by \"smashing the nucleus\" on day one, he also noted that resistance from the opposition helped strengthen his movement.", "The abbreviated version of this quote was first popularized in 1978 when it appeared in David Edgar's play Destiny.", "Guérin, Daniel.    Facism and Big Business.\r\n    Pioneer Publishers, 1939.", "Hitler, Adolf.     Die Reden Hitlers am Reichsparteitag 1933.\r\n    1934.", "Zurowski, Maciej.    \"Smashing the Nucleus.\"\r\n    Zuriz.    6 October 2013.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]