["About this rating", "Portraying one's opponents as elitist, out-of-touch hypocrites with little or no concern for others is an old and common practice in U.S. politics, and there is perhaps no better modern example of the application of that concept than the infamous \"runway haircut\" received by President Bill Clinton in 1993.", "The story, as commonly reported back in May 1993, was that President Bill Clinton hubristically had Air Force One held idle on the tarmac at Los Angeles International Airport (LAX) so that his personal stylist could board the plane and perform a $200 presidential haircut — completely oblivious to (or unconcerned about) the fact that his action triggered the shutdown of half the airport's runways and caused incoming flights to be placed in holding patterns for the duration:", "Two of Los Angeles International Airport's four runways were shut down for nearly an hour on Tuesday, some incoming flights were delayed and Air Force One sat on the tarmac with engines running — all so that President Clinton's Beverly Hills hairstylist, Chistophe, could come aboard and give Mr. Clinton a high-price trim before he took off for Washington.", "Questions about Mr. Clinton's runway razor cut dominated the White House news briefing today, with the communications director, George Stephanopoulos, scrambling to explain why the populist President tied up one of the country's busiest airports to have his hair trimmed.", "The air traffic-diverting $200 haircut was one of the major news stories of its day, garnering front-page headlines in such major newspapers as The New York Times, the Los Angeles Times, and the Boston Globe. The Washington Post, who quipped that Clinton had received \"the most famous haircut since Samson,\" included the incident in nine front-page stories over the span of six weeks. Nearly two decades later, major news publications such as Time magazine were still referencing \"Hairgate\" and stating that the notorious runway haircut had resulted in a \"hold on air traffic\" that \"forced [flights] to circle and made Los Angeles air travelers \"hours late\":", "For a about an hour in May 1993, two of LAX's four runways were shut down. And then-president Bill Clinton never heard the end of it. The reason for the delay was the presence of Air Force One, inside of which the president was in the throes of a $200 trim from a glamorati stylist named, fabulously, Christophe.", "Clinton later insisted that he hadn't asked for (and had been told that there wasn't) a hold on air traffic while \"Hair Force One\" sat on the runway. Yet scheduled flights had already been forced to circle, people had already been made hours late, and \"Hairgate\" solidified an opinion in some quarters of Clinton's out-of-touch excesses.", "And yet, outside of the fact that President Clinton did receive a haircut on Air Force One while the presidential plane sat on an LAX runway, virtually none of the oft-repeated details of \"Hairgate\" was true. By the end of the following month, news sources such as Newsday had already obtained and reported on Federal Aviation Administration (FAA) records documenting that the \"haircut caused no significant delays of regularly scheduled passenger flights — no circling planes, no traffic jams on the runways.\" The single negative outcome of the event was that one unscheduled air taxi flight took off two minutes late:", "The story was that planes were kept circling as President Bill Clinton had his hair clipped on Air Force One at Los Angeles airport last month.", "The runway haircut by Beverly Hills stylist Cristophe became such a metaphor for perceived White House arrogance that the president himself felt compelled to apologize for the reported flight delays.", "But the reports were wrong.", "According to Federal Aviation Administration records obtained through the Freedom of Information Act, the May 18 haircut caused no significant delays of regularly scheduled passenger flights — no circling planes, no traffic jams on the runways.", "Commuter airlines that fly routes reportedly affected by the president's haircut confirmed they have no record of delays that day.", "The FAA records, generated by the regional Air Route Traffic Control Center, show that an unscheduled air taxi flight had the only delay attributed to the closure of two runways for an hour in anticipation of Air Force One's departure. The air taxi took off 17 minutes after leaving the gate — two minutes late, by FAA accounting.", "\"If you understand the air traffic system, you'd find that statement [that planes were circling] ludicrous,\" said Fred O'Donnell, an FAA spokesman at the agency's Western-Pacific regional office, which responded to New York Newsday's request under the freedom of information law.", "O'Donnell said that although two runways were closed, traffic was light that afternoon and arriving flights were simply diverted to the two other runways. \"It did not cause any problems,\" he said.", "O'Donnell said the FAA records an arrival delay if controllers take any action to slow traffic approaching the airport, such as having the pilot circle the airport. A departure delay is recorded whenever it takes an aircraft more than 15 minutes to take off after having pushed off from the gate.", "And yet, corrections to the story that had been featured so prominently and so often in major news publication articles and on television network news reports were scant and cursory:", "Newsday, USA Today and the Houston Chronicle gave [the] corrective story prominent attention. Virtually every other news organization in the country either ignored it or buried it. The Los Angeles Times published five paragraphs, in the local news roundup on Page 2 of the Metro section. The Washington Post ran one paragraph. The New York Times, which had editorialized about \"the haircut that tied up two runways,\" ran not a word. The three major network evening news shows were equally silent.", "The Los Angeles Times, in a lengthy three-part series, hypothesized that the inaccurate reporting of \"Hairgate\" was driven by the press corps' resentment over their treatment by the White House, which \"led to overblown and hostile stories about Clinton\":", "Albert Hunt, executive Washington editor for the Wall Street Journal, argues that the major flaw in early media coverage was the failure of reporters and commentators to differentiate between Clinton's problems on truly serious issues such as the economy and relatively minor incidents such as the haircut and travel office.", "The [Travelgate] story might not have exploded if White House press aides had better relations with the media — or if they had not closed off the upstairs press office so grumbling reporters could have come by to serve as an early warning system on the revolt brewing in the pressroom. But the door was closed, the relationship was already hostile and the failure of aides to recognize the bond between the travel office and press corps was \"the best indication of how out of touch\" the aides were, says Michael Duffy, White House correspondent for Time magazine.", "Newsweek headlined its story on reporters' reaction to the ousters \"Don't Mess With the Media: The White House Press Corps Gets Its Revenge.\"", "Clinton paid for having offended the White House reporters over the travel office firings again when news broke on his now-infamous haircut aboard Air Force One at Los Angeles International Airport.", "\"There was a clear sense of retribution\" in the media's \"appalling\" coverage of the haircut, says Mark Miller of Newsweek, a sense that the media were \"pissed off.\"", "The networks covered the haircut, and it was Page 1 news in the New York Times, Los Angeles Times, Washington Post, Boston Globe and Dallas Morning News, among many others.", "Although Clinton insisted that he had been assured he was not delaying other flights, John McLaughlin, host of television's \"The McLaughlin Group,\" told his viewers that the haircut had tied up \"ground and air traffic, putting as many as 37 planes in a holding pattern.\"", "Six weeks later, Newsday used the Freedom of Information Act to acquire Federal Aviation Administration records that showed no planes had been forced to circle the airport, no runways had been backed up — and only one plane was delayed ... for two minutes.", "In fact, even the one true aspect of the Hairgate story was likely exaggerated. Later reports noted that Clinton's \"$200 haircut\" likely \"cost less than $150, perhaps far less (the hairdresser charged $150 for a first-time haircut, but Clinton was an established customers and thus paid less).\"", "Friedman, Thomas L.   \"Haircut Grounded Clinton While the Price Took Off.\"\r\n    The New York Times.   21 May 1993.", "Kessler, Glenn.   \"Bill's Coif: The Myth; Runway Trim Delayed No One.\"\r\n    Newsday.   30 June 1993.", "Overholser, Geneva O and Kathleen Hall Jamieson (editors).   The Press.\r\n    Oxford University Press, 2005.   ISBN 9780195309140   (pp. 53–54).", "Shaw, David.   \"Did Reporters Let Their Feelings Affect Coverage?\"\r\n    Los Angeles Times.   17 September 1993.", "Steinmetz, Katy.   \"Top 10 Expensive Haircuts.\"\r\n    Time.   2 April 2010.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]