["Representatives of the Nation of Islam and two gangs, the Crips and the Bloods, at a rally against police violence in Baltimore, Md.", "We’ve seen plenty of claims in recent days about the unrest in Baltimore. One that caught our attention was a tweet from an account associated with the Nation of Islam. It read, \"#Baltimore police trained by Israel Mossad & Shin Bet. More planned.\"", "The Mossad is Israel’s foreign intelligence service and the Shin Bet is its internal counter-intelligence agency. They roughly correspond to the American CIA and FBI.", "So, are the Mossad and Shin Bet working with Baltimore police? No.", "Nation of Islam researchers included a link in their tweet that sent us to a page on the Baltimore County Police Department website. While county police were called in to assist during the riots, they are not the city police.", "The link includes no information or evidence that county police were trained by Mossad and Shin Bet.", "What that website says is that county police offered optional training for officers interested in a martial art called Krav Maga (pronounce ma-GAA). Krav Maga does have a strong connection with Israel. It was developed by the Israeli Defense Force in the earliest years of the country’s existence. It emphasizes quick and debilitating counter attacks in one-on-one combat.", "The instructor mentioned on the Baltimore County webpage was Jon Pascal, who had spent 15 years with the Los Angeles County Police Department. There is nothing to suggest that Pascal is a Mossad or Shin Bet agent.", "Krav Maga combines elements of wrestling, boxing and jiu-jitsu. The introductory sessions focus on stripping a knife or gun from an armed attacker, escaping chokeholds, restraining holds, and delivering blows that incapacitate an attacker.", "Elementary training in Krav Maga is not uncommon among American police departments. A local news report from Pittsburgh, Pa., featured officers from the Pittsburgh and Mt. Lebanon, Pa., police departments. An instructor with Krav Maga Maryland lists among his clients officers from Baltimore City, Montgomery, Howard and Prince George’s counties, as well as the Maryland State Police and the Capitol Police. According to that Maryland group, over 400 law enforcement agencies have used some level of Krav Maga training since 1981.", "We tried to reach Nation of Islam Research but no one answered at the phone number listed, nor did we get a reply to a message sent through the Nation of Islam website.", "Our ruling", "The Nation of Islam Research group said that police in Baltimore had been trained by Mossad and Shin Bet. The source they cited referred to optional training in Krav Maga for the wrong police department and listed a trainer who gained experience in Los Angeles.", "There’s no evidence of any training ties to Israel. This claim is utterly unproven.", "We rate the claim Pants on Fire.", "Nation of Islam Research, tweet, April 26, 2015", "Baltimore County Police Department, Krav Maga Program", "Krav Maga Worldwide, Jon Pascal", "Krav Maga Maryland, Tactical training", "Krav Maga Worldwide, Congratulations Black Belt Third Dans!, June 18, 2014", "KDKA/CBS - Pittsburgh, Local Police Learning Krav Maga Techniques, Dec. 12, 2011", "Daily Beast, Bloods and Crips Team Up to Protest Baltimore’s Cops, April 27, 2015", "Million Man March 20th anniversary, Baltimore photo  April 25, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]