["About this rating", "Ron Paul used the words “psychopathic authoritarians” in his farewell address.", "The “psychopathic authoritarians” to which Ron Paul referred were part of a list of people or entities who might “endorse government-initiated change”, not the U.S. Congress alone or specifically.", "A popular meme asserts that Ron Paul, a Republican/Libertarian who was the U.S. Representative for Texas's 22nd congressional district and a presidential candidate, once to referred his U.S. Congress colleagues as “a bunch of psychopathic authoritarians”:", "Ron Paul supposedly made such a pronouncement during his final speech to the House of Representatives on 14 November 2012. In that speech, he affirmed his commitment to limited government and sought to put the history of the country (and his career) into a narrative about retaining personal liberty in the face of an expanding federal government. Paul offered the argument that the use of government to promote social change can lead to the immoral use of force, even when intended to promote humanitarian ideals (emphasis ours):", "Humanitarian arguments are always used to justify government mandates related to the economy, monetary policy, foreign policy, and personal liberty. This is on purpose to make it more difficult to challenge. But, initiating violence for humanitarian reasons is still violence. Good intentions are no excuse and are just as harmful as when people use force with bad intentions. The results are always negative.", "The immoral use of force is the source of man’s political problems. Sadly, many religious groups, secular organizations, and psychopathic authoritarians endorse government initiated force to change the world.. Even when the desired goals are well-intentioned -- or especially when well-intentioned -- the results are dismal.", "While it is true that Paul used the phrase “psychopathic authoritarians,” he was referring not to Congress only or specifically, but -- along with “religious groups” and “secular organizations” -- to people who might be predisposed to endorse “government-initiated change.” Although it is undoubtedly true that some members of Congress, either implicitly or explicitly, support the use of government to effect social change, the notion that Paul was calling everyone serving in the U.S. Congress \"a bunch of authoritarian psychopaths to their faces\" is a misleading reduction of context.", "Campaign for Liberty.   \"Transcript of Farewell Address\"\r\n    14 November 2012.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]