["By Angelo Fichera", "Posted on October 6, 2020", "A popular Facebook post asks why an order by President Donald Trump “PROTECTING PRE-EXISTING CONDITIONS got almost zero coverage,” and suggests it’s wrong to say he is “trying to eliminate that protection.” Trump is trying to repeal the Affordable Care Act, which put such protections into place, and his recent executive order, on its own, doesn’t legally guarantee them.", "President Donald Trump signed an executive order on Sept. 24 expressing his administration’s intent to end surprise medical billing and ensure health coverage protections for those with preexisting conditions.", "But experts say the order is largely symbolic.", "Protections for people with preexisting conditions are already in place under the Affordable Care Act, though the administration — as the order emphasizes — wants to get rid of that law.", "One Facebook user’s viral post, however, misleadingly suggests that the executive order actually guarantees such protections and that Trump’s action was ignored by news organizations.", "“Can someone tell me why Trump signing an EO yesterday PROTECTING PRE-EXISTING CONDITIONS got almost zero coverage, and why the left is STILL running ads falsely saying that he is trying to eliminate that protection?” the post, shared 42,000 times, reads. The Sept. 25 post’s text was repeated in at least one other popular post, too.", "But if the Affordable Care Act were to be overturned, new legislation would be needed to supplant its safeguards for those with preexisting conditions.", "Here’s some of what the executive order says about preexisting conditions:", "“My Administration has been dedicated to providing better care for all Americans. This includes a steadfast commitment to always protecting individuals with pre-existing conditions and ensuring they have access to the high-quality healthcare they deserve.”", "“…access to health insurance despite underlying health conditions should be maintained, even if the Supreme Court invalidates the unconstitutional, and largely harmful, ACA.”", "“It has been and will continue to be the policy of the United States to give Americans seeking healthcare more choice, lower costs, and better care and to ensure that Americans with pre-existing conditions can obtain the insurance of their choice at affordable rates.”", "The order on its own doesn’t — and can’t — legally ensure such protections for those with preexisting conditions, experts say.", "The order “is aspirational,” Karen Pollitz, senior fellow at the Kaiser Family Foundation who works on its Program for the Study of Health Reform and Private Insurance, told us in a phone interview. “It has no force of law.”", "Likewise, Jennifer Piatt, a research scholar with the Center for Public Health Law and Policy at Arizona State University, told Healthline that while Trump “states a policy to preserve coverage for preexisting conditions, a policy statement does not have any legal impact and will not bind insurance companies.”", "The Trump administration has backed a lawsuit by several states to invalidate the Affordable Care Act; the suit is slated to go before the Supreme Court in November.", "The ACA, often referred to as “Obamacare,” instituted protections for those with preexisting conditions. The law prohibits insurers, in any market, from denying coverage, charging more or excluding coverage of certain conditions based on health status.", "Before the ACA, those buying plans on the individual market could face denials or higher premiums based on their health status and history.", "An estimated 6% of the population received coverage on the individual market in 2018, though Pollitz said “people are kind of constantly churning through this market.”", "Prior to the ACA, employer-based insurance policies could also decline coverage for some preexisting conditions for a limited period, if a new employee had a lapse in coverage.", "JoAnn Volk, a research professor at the Center on Health Insurance Reforms at the Georgetown University Health Policy Institute, told us in an email that — if the ACA were overturned — “it would require an act of Congress to reinstate those protections for people with preexisting conditions (which is a growing number, due to COVID-19).”", "It is not clear what Trump means when he says he will protect individuals with preexisting conditions. The Trump administration has not offered a comprehensive alternative to the ACA. In 2017, Trump backed Republican plans that would have weakened the preexisting condition protections in the ACA.", "Trump’s executive order did garner some news coverage, contrary to the Facebook post’s argument that it got “almost zero coverage,” though many stories noted the symbolic nature of the action.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Bagley, Nicholas (@nicholas_bagley). “Those executive orders — and that’s most of them — don’t have legal effect. They’re just internal memos with a fancy header. That’s all they are.” Twitter. 24 Sep 2020.", "“Executive Order on An America-First Healthcare Plan.” White House. 24 Sep 2020.", "“Health Insurance Coverage of the Total Population.” Kaiser Family Foundation. Accessed 1 Oct 2020.", "Keith, Katie. “Trump Administration Asks Court To Strike Down Entire ACA.” Health Affairs. 26 Mar 2019.", "Levitt, Larry. “Protecting People With Pre-Existing Conditions Isn’t As Easy As It Seems.” Kaiser Family Foundation. 5 Oct 2020.", "Mendelson, Dan, et. al. “Repeal of ACA’s Pre-Existing Condition Protections Could Affect Health Security of Over 100 Million People.” Avalere. 23 Oct 2018.", "Pollitz, Karen. Senior fellow, Kaiser Family Foundation. Phone interview. 1 Oct 2020.", "Ries, Julia. “Why Trump’s Executive Order Doesn’t Protect People With Preexisting Conditions.” Healthline. 28 Sep 2020.", "Robertson, Lori. “Biden Misleads on Preexisting Conditions.” FactCheck.org. 1 Sep 2020.", "U.S. Department of Health and Human Services. “About the ACA | Pre-existing Conditions.” 31 Jan 2017.", "Volk, JoAnn. Research professor, Center on Health Insurance Reforms, Georgetown University Health Policy Institute. Email to FactCheck.org. 6 Oct 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]