["About this rating", "On 21 September 2018, Joshua Feuerstein, an American evangelical internet personality who is perhaps best known for stirring up controversy over Starbucks Christmas cups, shared a photograph to his Facebook page purportedly showing a nude model walking the runway with four young girls and claimed that the image documented the \"liberal left\" attempting to \"normalize pedophilia\":", "This photograph is genuine in the sense that it truly captures a nude man in the presence of four young girls, but Feurenstein's post did not properly provide the context in which it was taken.", "To begin with, this picture was taken in Brazil and not the United States, so it therefore has little to do with how the \"liberal left\" in America is supposedly attempting to \"normalize pedophilia.\" This image also doesn't show a nude man \"walking the runway\" (presumably at some form of fashion show). This photograph was taken at the conclusion of a performance of \"La Bête\" by choreographer Wagner Schwartz, held at the Goethe-Institute in Salvador, Brazil, in 2017.", "La Bête is an interactive performance in which audience members can take the stage and move Schwartz's nude body in any position they choose. According to the The Centre National De la Danse, this piece was inspired by \"Bicho,\" an adjustable metal sculpture created by Brazilian artist Lygia Clark in the 1960s:", "For this interactive and participatory solo, Wagner Schwartz is reactivating the famous figure of the Bicho (or “Beast”), the adjustable metal sculpture which the Brazilian artist Lygia Clark produced as a series in the early 1960s. The performer begins by manipulating a plastic replica of the original object, and playing with its system of hinges, before inviting the audience to do likewise, this time with a different kind of beast: his own naked body. Over and above a homage to this visual artist and the addition of Neo-Concretism to the history of body art, The Beast brings about a shift between two types of plasticity (in art / life) so as to examine the intimacy of this reified body, which thus becomes as instrumental as one of Clark’s Bichos. In this performance, Wagner Schwartz extends his reflection on the relationship with the Other, and the Outsider, by organising a resolutely head-on encounter with the public, under the sign of tactility.", "Although Feuerstein presented this image as if it depicted some sort of modeling event featuring male nude models and children, La Bête was not specifically geared toward minors. Most of the images and videos we've found of this performance feature adults interacting with Wagner's body. Here's a video of one such performance.", "[NSFW: The following footage contains nudity]:", "However, children were indeed present at some of these performances.", "The viral photograph included in Feurenstein's post was taken at the Goethe Institute in 2017, while a video taken from a separate performance (which can be viewed here) and showing a young child and her mother interacting with Schwartz' body was taken at the Museu de Arte Moderna de São Paulo.", "These pieces of media were widely circulated in September 2017 along with accusations that Schwartz was a pedophile, and a criminal investigation was opened to determine if Schwartz or the museums had committed a crime (they did not) during this performance.", "The Spanish-language El País newspaper provided some context to this controversy in a February 2018 article (translated via Google):", "Back on September 26, 2017, Wagner Schwartz, 45, was an accomplished Brazilian artist. On that day, he opened the 35th Panorama of Brazilian Art at MAM in São Paulo, one of the most prestigious exhibition spaces in Brazil, with his performance named “La Bête” (The Critter) based on the work of Lygia Clark, one of the leading representatives of Brazilian art. Since 2005, Wagner has presented this work ten times, both in Brazil and Europe. This time, as before, it was an artistic experience. For La Bête to take place, the audience must leave their role as spectators to become participants. Each performance is different from the others, as it is the public that tells the story. The experience created collectively by manipulating the artist’s naked body as if it were one of the Lygia Clark’s geometric figures with hinges.​", "However, in the days that followed, a nightmare began that Wagner had not anticipated.", "A portion of the presentation was posted on the internet, igniting a controversy. A woman and her little daughter could be seen playing with the artist’s body during the performance, like so many other people in the audience did. Then, taken out of its context, the scene was turned into something it was not. And Wagner was called a “pedophile” by millions on the internet.", "In search of exposure and voters, unscrupulous politicians recorded videos and made statements condemning both the museum and the artist. Fundamentalist religious leaders mostly attached to neo-Pentecostal evangelical churches sowed hatred by encouraging their believers to forget the most basic Christian precepts and to condemn the artist and the museum as being “in the service of Satan”. Groups linked with extremist right-wing movements launched protests in front of the museum with the support of angry, anonymous people and even assaulted the museum staff. The internet turned into a medieval square where Wagner Schwartz was lynched as a “monster” and a “pedophile”.", "The artist had to give testimony for almost three hours in the 4th Police Station for Repression of Pedophilia. An investigation was opened by the Public Prosecution Office of São Paulo to determine whether a crime had been committed. In the Senate, the Parliamentary Committee for Investigation of Ill-Treatment decided to take advantage of these allegations to summon the Museum curators, the mother of the child, and the artist to testify.", "All at once, Wagner Schwartz was transformed into a criminal. He was not turned into a perpetrator of any crime, but a “pedophile”, one of the most repulsive characters in society. Yet there was no victim, no fact, and therefore no offense. At no time did his lynchers of all kinds bear in mind there was a person involved, with a history, a life, and feelings. That did not matter.", "The Museu de Arte Moderna de São Paulo and the Goethe-Institut both published statements on Facebook asserting that this performance was not erotic or pornographic, nor was it associated with pedophilia. Both museums also noted that visitors were informed beforehand that the performances would involve nudity:", "[Goethe-Institut] The touch in this context could not be further away from any erotic or pornographic incitement. Nudity, previously communicated to the public, is used only as theatrical artifice and does not carry sexual connotations. Paedophile Associations therefore have no real foundations.", "[MAM] The Museum of Modern Art of São Paulo informs that the performance 'La Bête', which is being attacked in Facebook pages, was held at the opening of the Panorama Show of Brazilian Art, in an event for guests. The room was marked on the content of the presentation, including the nudity of the artist. The work has no erotic or erotic content and it is an interpretive reading of Lygia Clark's Bicho work on the manipulation of articulating objects. Accusations of inadequacy are out of touch with the culture of hatred and intimidation of freedom of expression that quickly spreads across the country and on social networks. The material presented in the digital platforms omits the information that the child that appears in the video was accompanied by the mother, who briefly participated in the performance, and that the room was occupied by the spectators. The insinuations of pedophilia are the result of misrepresentation of the context and meaning of the work.", "Schwartz talked about the controversy in an interview with El País:", "What is the difference between what happens in the performance space and what happened in what turned into a viral video on the internet?", "The difference is that in the museum it is a performance of about 60 minutes. In the image of a fragment, what exists is a brief clipping that can no longer be called performance. In the copy of a small piece, it is not possible to understand the performance context anymore. A cut, the result of a personal choice, can become authoritarian when it takes the place of all that it does not show.", "In the museum, several people watch what is happening on the scene in real time. In the video, someone just presses the enter or play keys on something that is no longer in the performance time. In the photo, you can see only one second taken out of 60 minutes. In the museum, people build together the content of the performance. In the image of a fragment, each person is exposed to something that might have been manipulated in some direction other than the actual live performance.", "​Conclusion: they associated La Bête with the most horrible of the disorders. In public life, they not only removed my security but also the security of my family, of my friends and of those who were in favor of the performance as the São Paulo Museum of Modern Art and the Goethe-Institut (Salvador, Bahia). I have received 150 death threats from people who are free on the streets, with their profiles active on social media. I also received threats from anonymous robots.", "It is necessary to reiterate that in La Bête those who bend and unfold the body of the artist —an artist who must be available to receive the command of the participants— are those who authorize themselves to enter the scene or to speak about it. Participating is a choice, not a condition.", "Reja.   \"Em Performance No MAM, Criança Interage Com Homem Nu.\"\r\n    29 September 2017.", "Ribeiro, Naiana.   \"'A Arte Entende o Corpo nu Muito Além do Sexo', Diz Jorge Alencar Sobre Performance.\"\r\n    Correio.   29 September 2017.", "Brum, Eliane.   \"Fui Morto Na Internet Como Se Fosse Um Zumbi Da Série The Walking Dead.\"\r\n    El Pais.   12 February 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]