["About this rating", "When President George H.W. Bush departed the White House in 1993 after having lost his re-election bid, he did not sulk or criticize the opponent who had defeated him,  Instead, he graciously left a welcoming note behind for his successor, President Bill Clinton, that read as follows:", "Dear Bill,", "When I walked into this office just now I felt the same sense of wonder and respect that I felt four years ago. I know you will feel that, too.", "I wish you great happiness here. I never felt the loneliness some Presidents have described.", "There will be very tough times, made even more difficult by criticism you may not think is fair. I’m not a very good one to give advice; but just don’t let the critics discourage you or push you off course.", "You will be our President when you read this note. I wish you well. I wish your family well.", "Your success is now our country’s success. I am rooting for you.", "Good luck,\nGeorge", "An image of this note was frequently shared via social media during the 2016 presidential election campaign:", "Democratic presidential nominee Hillary Clinton also posted her thoughts about the note to her Instagram account in June 2016:", "You may have noticed a letter that went viral on the internet this week. The letter is from George H.W. Bush’s presidential library. I hadn’t read it in a long time, until yesterday. It moved me to tears, just like it did all those years ago. It’s the letter that President Bush left in the Oval Office for my husband, back in January of 1993. They had just fought a fierce campaign. Bill won, President Bush lost. In a democracy, that’s how it goes. But when Bill walked into that office for the very first time as President, that note was waiting for him. It had some good advice about staying focused on what mattered, despite the critics. It wished him happiness. And it concluded with these words: “You will be our President when you read this note. I wish you well. I wish your family well. Your success is now our country’s success. And I am rooting hard for you. George.” That’s the America we love. That is what we cherish and expect.", "The note also received a boost in popularity after the third presidential debate of 2016, due to Republican presidential nominee Donald Trump's response to a question about whether he would accept the results of the upcoming election.  The note was frequently cited as an example of the American tradition of peaceful transfer of power and an implicit criticism of Trump for saying that he would take a \"wait and see\" attitude towards the election's outcome.", "George H.W. Bush wrote about his leaving the White House and the note he left behind for his predecessor in his autobiography All The Best, George Bush: My Life in Letters and Other Writings:", "And so time goes on and I'm sitting here now alone, the desk is clear and the pictures are gone. I leave a note on the desk for Bill Clinton. It looks a little lonely sitting there. I don't want to be overly dramatic, but I did want him to know that I would be rooting for him.", "Bill Clinton also mentioned the note in his own autobiography:", "I thought about the note to President Bush I would write and leave behind in the Oval Office, just as his father had done for me eight years earlier. I wanted to be gracious and encouraging, as George Bush had been to me. Soon George W. Bush would be President of all the people, and I wished him well. I had paid close attention to what Bush and Cheney had said in the campaign. I knew they saw the world very differently from the way I did and would want to undo much of what I had done, especially on economic policy and the environment. But those were not my calls to make anymore. I had watched the Washington Republicans for eight years and imagined that President Bush would, from the outset of his term, be under pressure to abandon compassionate conservatism by the more right-wing leaders and interest groups now in control of his party. They believed in their way as deeply as I believed in mine, but I thought the evidence, and the weight of history, favored our side.", "George H.W. Bush was not the first President to leave behind a note to his successor. Ronald Reagan had done the same for President Bush when he departed the White House in 1989:", "Reagan's last day in the Oval Office was January 20, 1989. He left in the desk a tablet of cartoonist Sandra Boynton's stationery with the legend \"DON'T LET THE TURKEYS GET YOU DOWN\" for incoming president George Bush, with this note:", "Dear George:", "You'll have moments when you want to use this particularly stationery. Well, go to it.", "George, I treasure the memories we share and wish you all the very best. You'll be in my prayers. God bless you and Barbara. I'll miss our Thursday lunches.", "Ron", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]