["About this rating", "In February 2021, as Texas began to recover from a devastating winter storm that brought record-low temperatures, killed dozens of people, and cut the power to millions of homes, a report emerged online that blamed the administration of U.S. President Joe Biden for supposedly denying requests to increase the electricity supply within the state.", "On Feb. 20, the website Infowars, a notorious producer of conspiracy theories and inflammatory disinformation, published an article with the headline: \"Smoking Gun! Joe Biden’s Dept. of Energy Blocked Texas from Increasing Power Ahead of Killer Storm.\" The article reported that:", "An Emergency Order from the Biden administration’s Department of Energy shows Texas energy grid operator ERCOT was instructed to stay within green energy standards by purchasing energy from outside the state at a higher cost, throttling power output throughout the state ahead of a catastrophic polar vortex.", "Major smoking gun! Infowars has been sent a Department of Energy document, confirmed to be authentic, showing Texas begging for federal authorization to increase power!", "That article was subsequently republished on the website Your News, and both iterations were shared widely on Facebook in the following days.", "The report was highly inaccurate. The U.S. Department of Energy (DOE) actually granted a request from Texas officials to temporarily allow energy providers to produce energy at levels that would ordinarily exceed limits set out in environmental regulations, thus having the opposite effect of that claimed by Infowars.", "The DOE's authorization did come with certain limitations, namely that the excess electricity generated must only meet levels that state officials deemed \"necessary,\" but in reality that was a restriction in principle only and effectively gave officials wide discretion to allow excess energy generation during the winter storm.", "Federal environmental laws and regulations impose certain standards and guidelines on power plants in the United States, limiting the emission of various harmful elements and compounds such as carbon monoxide, mercury, nitrogen oxide, and so on.", "At the same time, federal law — in particular the Federal Power Act — enables the U.S. energy secretary to declare an emergency in a specific location and \"to require by order such temporary connections of facilities and such generation, delivery, interchange, or transmission of electric energy as in [their] judgment will best meet the emergency and serve the public interest.\"", "Where producing and distributing additional electricity comes in conflict with other regulations, such as environmental regulations, the secretary is required to ensure that excess energy generation and distribution takes place \"only during hours necessary to meet the emergency and serve the public interest.\"", "On Feb. 14 the Electric Reliability Council of Texas (ERCOT), the non-governmental organization that runs the electricity grid in the state of Texas, wrote to Acting Energy Secretary David Huizenga, requesting that he issue exactly that kind of emergency order. The letter outlined the dilemma faced by energy providers in Texas as follows:", "ERCOT has been notified by three major generation owners that their generating units will, or are likely to, encounter operating restrictions during the next several days due to various emissions and other limits established in federal permits... These units are subject to a number of environmental limitations that may restrict output.", "ERCOT has been informed that the operation of gas-fired generators during the next few days could be impacted by permit restrictions on nitrogen oxide and carbon monoxide emissions, that coal-fired generators would be impacted by permit restrictions on emissions of sulfur dioxide, nitrogen oxide, mercury, and carbon monoxide, and that generation fueled by distillate fuel oil would be subject to various restrictions on operating duration and/or emissions. ERCOT has also been informed that generators of various fuel types may be subject to wastewater release limits...", "Because the output from all of the generators subject to these restrictions would help mitigate the impact of rotating outages on Texas consumers during this extreme cold weather event, ERCOT seeks an immediate order from DOE authorizing the provision of additional energy from all generating units subject to emissions or other permit limitations.", "Later that day, Huizenga issued Emergency Order No. 202-21-1, declaring that \"an emergency exists in Texas due to a shortage of electric energy, a shortage of facilities for the generation of electric energy, and other causes.\" The order added:", "Given the emergency nature of the expected load stress, the responsibility of ERCOT to ensure maximum reliability on its system, and the ability of ERCOT to identify and dispatch generation necessary to meet the additional load, I have determined that additional dispatch of the Specified Resources is necessary to best meet the emergency and serve the public interest for purposes of FPA [Federal Power Act] section 202(c). Because the additional generation may result in a conflict with environmental standards and requirements, I am authorizing only the necessary additional generation, with reporting requirements...", "So Huizenga's order temporarily authorized ERCOT, from Feb. 14-19, to generate whatever power it deemed necessary to serve the needs of consumers in Texas, even if that additional generation would, in the normal course of events, cause emissions to exceed maximum levels set out in federal environmental laws and regulations.", "In keeping with the provisions of the Federal Power Act, Huizenga ordered that the excess electricity must not go beyond what is necessary to address the ongoing emergency, but left the details of that determination to ERCOT itself, adding:", "ERCOT anticipates that this Order may result in exceedance of emissions of sulfur dioxide, nitrogen oxide, mercury, and carbon monoxide emissions, as well as wastewater release limits. To minimize adverse environmental impacts, this Order limits operation of dispatched units to the times and within the parameters determined by ERCOT for reliability purposes. [Emphasis is added].", "In its report, Infowars wrote that:", "The [Emergency Order] shows the Biden administration basically ordered ERCOT to throttle its energy output by forcing it to comply with environmental green energy standards, while knowing full well Texans could freeze to death in their homes with zero electricity as temperatures plunged into the single digits.", "In reality, as we have shown, the order did precisely the opposite.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]