["About this rating", "In early December 2020, news stories echoed rumors that U.S. President Donald Trump had discussed with aides the possibility of granting preemptive pardons for unspecified crimes to his three eldest children, Donald Jr., Eric, and Ivanka Trump, as well as his son-in-law, Jared Kushner.", "Trump hasn't commented publicly on these stories, but the idea was supported by Fox News personality Sean Hannity, of whom Trump is a known fan. Hannity said that Trump \"out the door, needs to pardon his whole family and himself because they want this witch hunt to go on in perpetuity, they're so full of rage and insanity against the president.\"", "Hannity was referring to the incoming administration of President-elect Joe Biden, although Biden has stated he would let Department of Justice professionals make the call on whether to pursue potential investigations on his predecessor.", "The stories raised a number of questions, mostly legal, about whether the president has the power to grant preemptive pardons for unspecified criminal activities. It also raised the question as to whether any other president has ever used presidential pardoning power granted by the Constitution to pardon a family member.", "That has happened in relatively recent history, in fact. On his last day in office, Jan. 20, 2001, former President Bill Clinton controversially pardoned his half brother Roger Clinton who was convicted for conspiracy to distribute cocaine and distribution of cocaine in 1985.", "What would be unprecedented is pardoning family members who are not currently accused of federal crimes. And although the financial activities of the Trump family's business dealings are being probed by New York state and municipal authorities, the president's pardoning power doesn't extend to non-federal jurisdictions. In other words, a presidential pardon wouldn't get any member of the Trump family out of potential legal hot water in those instances.", "Trump's use of pardons has already been controversial because he has used the power to benefit political allies, including commuting the sentence of his campaign surrogate and supporter Roger Stone and his former national security adviser Michael Flynn. He has also discussed the legally questionable prospect of a president's right to self-pardon.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]