["By D'Angelo Gore", "Posted on September 11, 2020 | Corrected on September 14, 2020", "A Biden campaign TV ad falsely claims that a government analysis of President Donald Trump’s “planned cuts to Social Security” shows that “if Trump gets his way, Social Security benefits will run out in just three years from now.”", "The Social Security Administration’s chief actuary analyzed “hypothetical legislation” that would eliminate the payroll tax that funds Social Security — not a proposal from Trump. The president has said he won’t cut benefits.", "Democratic presidential nominee Joe Biden and others who oppose Trump’s reelection have capitalized on confusing statements Trump made in August. He has said on multiple occasions that, if reelected, he would look at “ending” or “terminating the payroll tax.”", "But White House and Trump campaign officials have said the president actually wants to forgive a four-month payroll tax holiday he authorized via executive action last month. Trump himself has said: “[W]hen I win the election, I’m going to completely and totally forgive all deferred payroll taxes without in any way, shape or form hurting Social Security. That money is going to come from the general fund.”", "Biden, though, has repeatedly claimed that Trump has a “plan” that would “bankrupt,” “defund,” or “wipe out” the Social Security program.", "In remarks during an AFL-CIO virtual event on Sept. 7, Biden said: “And Trump has a plan to gut Social Security. If his Social Security plan … actually became law, the Social Security actuary has said the entire Social Security system will be bankrupt by mid-2023.”", "At the same time, the Biden campaign has been running an ad that says: “The chief actuary of the Social Security Administration just released an analysis of Trump’s planned cuts to Social Security. Under Trump’s plan, Social Security would become permanently depleted by the middle of calendar year 2023. If Trump gets his way, Social Security benefits will run out in just three years from now.”", "Advertising Analytics says the Biden campaign has spent over $1.3 million on the 30-second commercial, which has aired more than 5,500 times in swing states like Michigan and Arizona since Sept. 3.", "The Biden campaign started running a second ad on Social Security in key electoral states on Sept. 8. It features the former vice president saying: “For our seniors, Social Security is a sacred obligation, a sacred promise made. The current president’s threatening to break that promise. He’s proposing to eliminate a tax that pays for almost half the Social Security without any way of making up for that lost revenue.”", "Biden said that in his acceptance speech at the 2020 Democratic National Convention. As we wrote then, it’s not clear what Trump would do in a second term.", "But any permanent changes to Social Security would have to go through Congress, and the temporary payroll tax forgiveness — which Trump’s administration and campaign staff claim he really wants — would not “gut” or “wipe out” the program that pays retirement and disability benefits.", "In 2019, nearly 90% of the funding for Social Security ($944.5 billion) came from a 12.4% payroll tax on income up to a certain threshold ($137,700 in 2020). That tax is split equally between employers and employees, while self-employed individuals pay the full tax.", "In early August, Trump issued a memo allowing the deferral of the employee portion of the payroll tax for workers who earn less than $4,000 in taxable wages biweekly. The break from the tax goes from Sept. 1 to Dec. 31, and so individuals don’t have to pay back that deferred amount next year, the memo instructed Treasury Secretary Steven Mnuchin to “explore avenues, including legislation, to eliminate the obligation to pay the taxes deferred pursuant to the implementation of this memorandum.”", "That’s the only clearly articulated plan related to Social Security retirement benefits put forward by the Trump administration.", "But on the same day he signed the memo, and in the days that followed, Trump suggested he wanted to go even further — and either cut or end the payroll tax.", "In a press briefing on Aug. 8, Trump said: “If I’m victorious on November 3rd, I plan to forgive these taxes and make permanent cuts to the payroll tax. So I’m going to make them all permanent.”", "In another news conference on Aug. 10, he stated: “I signed directives to give a payroll tax holiday, with the understanding that after the election — on the assumption that it would be victorious for an administration that’s done a great job — we will be ending that tax. We’ll be terminating that tax.”", "And on Aug. 12 he declared: “After I hopefully get elected, we’ll be terminating the payroll tax. So that will mean anywhere from 5,000 [dollars] to even more per family and also great for businesses and great for jobs.” He later added: “We’ll be paying into Social Security through the general fund. And it works out very nicely.”", "Then, in a Sept. 8 interview with CBS12 News in Florida, Trump said there might be a payroll tax cut if he wins a second term. He did not mention eliminating the tax entirely.", "“There’s not a payroll tax cut on your second term agenda?” reporter Jay O’Brien asked. Trump responded: “Well, we’re looking to do that. We will do it second term. We’re looking to do something now if we can.”", "White House and Trump campaign officials have said that Trump doesn’t really mean he would permanently eliminate the tax.", "On Aug. 9, one day after the president said he planned to “make permanent cuts to the payroll tax,” White House economic adviser Larry Kudlow told CNN’s Dana Bash: “When he referred to permanent, I think what he was saying is that the deferral of the payroll tax to the end of the year will be made permanent. It will be forgiven. The tax is not going away.”", "Then, on Aug. 13, the day after Trump said “we’ll be terminating the payroll tax” if he is reelected, White House Press Secretary Kayleigh McEnany told reporters: “What he was meaning yesterday is that he wants permanent forgiveness of the deferral.”", "In the Aug. 12 press conference McEnany referenced, Trump even said at one point: “When I win the election, I’m going to go completely and totally forgive all deferred payroll taxes without in any way, shape or form hurting Social Security. That money is going to come from the general fund. We’re not going to touch Social Security. I said from day one that we’re going to protect Social Security and we’re going to protect our people.”", "And when contacted about Biden’s claims about Trump’s so-called “plan” for Social Security, both the White House and Trump campaign again told FactCheck.org Trump was only referring to forgiving the payroll taxes he deferred for the remainder of 2020.", "“The President has called on Congress to make this deferral permanent,” a White House spokesperson said in an email. “If they do not, this action still effectively allows working Americans to get a sizable advance on their pay starting in a month, which is just when working Americans need it most as we are fighting to end the COVID-19 pandemic.”", "Trump campaign spokesman Zach Parkinson said in a statement: “Joe Biden and his campaign’s scare tactics are a sad attempt to distract from his own record. President Trump and Administration officials have repeatedly said he wants to make the payroll tax cut deferral permanent to help America’s workers. The President has been clear: his payroll tax cut will have ‘zero impact’ on Social Security or the seniors that rely on the program. He supports transferring money from the government’s general coffers, protecting the program’s Trust Fund.”", "The Committee for a Responsible Federal Budget has estimated that, depending on how many employers opt to withhold payroll taxes for their eligible employees, up to $100 billion in tax payments could be delayed. (The deferral is reportedly mandatory for federal workers and members of the military who qualify.)", "Whether the executive action will have an impact on Social Security depends on what happens later on Capitol Hill.", "If Congress doesn’t agree to forgive the withheld taxes, as Trump wants, employees will be required to pay the money back in early 2021, between January and April. “Because most of these taxes would be repaid later, we estimate a deficit impact of roughly $5 billion,” CRFB said in its analysis of Trump’s executive actions.", "If lawmakers do forgive the deferred payments, the money needed to make up for the lost tax revenue could either come from Social Security’s trust funds or from general revenues. The first option would speed up the insolvency of Social Security’s trust funds a bit.", "The Bipartisan Policy Center’s William Hoagland told PolitiFact that if the payroll tax deferral costs $80 billion and came from the trust funds, it “would not gut the program,” but would “only impact the date of depletion, possibly a year or two earlier than expected.” The trust funds are currently projected to be exhausted by 2035. At that point, the annual tax revenue for Social Security “would be sufficient to pay 79 percent of program cost, declining to 73 percent for 2094,” the Social Security Board of Trustees said this year. That assumes Congress takes no action to address the shortfall.", "As for claims that Trump’s “plan” would “bankrupt” or “deplete” the program by 2023, that’s based on an Aug. 24 letter from Stephen Goss, the chief actuary for the Social Security Administration.", "Goss responded to an Aug. 19 request from four U.S. senators (three Democrats and one independent) to analyze “hypothetical legislation” that reduces the payroll tax rate to 0% and makes no other changes to current law. He wrote:", "Goss, Aug. 24: If this hypothetical legislation were enacted, with no alternative source of revenue to replace the elimination of payroll taxes on earned income paid on January 1, 2021 and thereafter, we estimate that DI [Disability Insurance] Trust Fund asset reserves would become permanently depleted in about the middle of calendar year 2021, with no ability to pay DI benefits thereafter. We estimate that OASI [Old Age and Survivors Insurance] Trust Fund reserves would become permanently depleted by the middle of calendar year 2023, with no ability to pay OASI benefits thereafter.", "But Goss said he was “not aware that anyone has proposed the hypothetical legislation.”", "In addition, the times Trump has mentioned eliminating the payroll tax, he has also said the money to pay benefits would instead come from the government’s general fund. Goss’ letter said legislation with such a stipulation would leave Social Security “essentially unaffected” — a point ignored by the Biden campaign ad.", "Goss, Aug. 24: If the hypothetical legislation specified that the OASI and DI Trust Funds would be held harmless from the reduction in the tax rate paid by employees, employers, and self-employed individuals (as was the case for the temporary payroll tax rate reductions of 2010, 2011, and 2012, where automatic transfers were specified from the General Fund of the Treasury to the trust funds in the amounts that would have been made in the absence of the tax rate reductions), then OASI and DI Trust Fund income, benefits paid, and the projected depletion date of the trust fund reserves would be essentially unaffected by the legislation.", "Of course, transferring roughly $1 trillion from the general fund each year to cover the projected cost of paying Social Security benefits would increase federal deficits. The Congressional Budget Office projects federal deficits of more than $1 trillion each year from fiscal year 2021 to fiscal year 2030.", "And when asked how that would work with the already nearly $3 trillion deficit for fiscal 2020, Trump misleadingly claimed “tremendous growth” like “you haven’t seen in a long time” could cover Social Security’s costs. However, the CBO projects that real gross domestic product will increase by less than 3% each year from 2022 to 2030, and real GDP already hasn’t grown by more than 3% annually since Trump took office.", "But that doesn’t mean Trump has “planned cuts” that will “bankrupt” Social Security, as Biden and others have claimed.", "Despite his confusing remarks, the White House and Trump campaign say the president wants Congress to make it so that employees don’t have to repay any deferred taxes next year. If Trump actually “gets his way,” as one of the Biden campaign ads says, that lost revenue will be made up with other money from the general fund.", "Correction, Sept. 14: Our story originally included a reference to “execution action” instead of “executive action.”", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Editor’s Note: Swing State Watch is an occasional series about false and misleading political messages in key states that will help decide the 2020 presidential election.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]