["“Students from IIT Varanasi & other Universities discarded traditional European black gown cap and chose truly Indian attire for the Convocation Ceremony”, reads the text inscribed above an image which has been shared more than 46,000 times on Facebook. A photo of students dressed in traditional attire was shared by a Facebook page India 360 with the narrative that students are shedding the colonial relic of black gowns worn at the time of graduation.", "The same image was viral in 2018 and is still being shared by several individuals on Twitter and Facebook.", "Earlier in 2017, the same photograph was quote-tweeted by academician Madhu Purnima Kishwar and Hindutva ideologue Rajiv Malhotra as of IIT BHU students ditching the colonial practice.", "Alt News found that the photograph of men dressed in traditional clothes pertains to the convocation of International Institute of Information and Technology (IIIT), Hyderabad and NOT IIT Varanasi. This picture was taken during the institute’s 15th annual convocation in 2016.", "A saga ends. Another begins! Pictures from the 15th annual convocation of IIIT Hyderabad on 13th August, 2016. pic.twitter.com/RmkAvoZq7y", "— IIIT Hyderabad (@iiit_hyderabad) August 14, 2016", "Furthermore, the claim about students forsaking the colonial ritual of dressing up in black gowns at the graduation ceremony is also untrue, because the students of IIIT-Hyderabad have been sporting traditional dress at convocations at least since 2011. A photo of the 2013 convocation can be seen below, for instance.", "Alt News found a notice on the official website of the institute from 2012. It states, “Dress Code: The trend that has been set last year will continue. We are going to have the dress code that suits our ethos. The following is the dress code for convocation 2012:”", "From the above, it is likely that the college itself has institutionalized this trend, and is not the initiative of students as claimed on social media. Insofar as the claim that this was done in order to discard a colonial relic, there are no media reports regarding the same, and neither has it been mentioned in the notice issued by the institute, which stresses merely on traditional ethos.", "It may be noted that IIT-BHU students had ditched the old colonial black gown and cap in favour of traditional attire at the graduation ceremony in 2013.", "In conclusion, an old photograph of a convocation of an institute was shared with a narrative that the students ditched the colonial practice of wearing gowns at the ceremony.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]