["About this rating", "A vintage photograph of two men astride Harley-Davidson motorcycles is frequently shared online along with the claim that the men pictured are the company's founders, William Harley and Arthur Davidson, and that the image captures the unveiling of their first motorcycles in 1914:", "Although the photograph is a genuine one dating from that time period, the backstory commonly attached to it is not.", "This image first appeared online when it was posted to a web site dedicated to old photographs of Harley-Davidson motorcycles by Ross Hollibaugh. While Hollibaugh wasn't completely certain about the image's origins, he claimed that it showed two of his relatives posing at a Harley-Davidson dealership in Minnesota, not the titular founders of Harley-Davidson:", "\"I was enjoying your page with all the old Harleys and remembered that I have a photo of my cousin's grandfather and his grandfather's brother each sitting on the brand new 1914 Harleys that they purchased in 1914. I am not sure, but I believe the photo may have been taken at the dealership (probably not really a dealership back then, but the guy must have been an HD distributer) in Wanamingo, MN.", "Wanamingo is 6 miles from Zumbrota. I still have family in both Wanamingo and Zumbrota. My cousin still has the original receipt for his grandfather's bike and he scanned a copy of it for me. You can see on the invoice that Lars Johnson of Zumbrota, MN purchased his bike for $245 and only put $10 cash down. Lars was my cousin's (Steve Johnson) grandfather.\"", "The provenance of the photograph aside, a picture taken in 1914 couldn't capture William Harley and Arthur Davidson (who were both 33 years old by then) unveiling their first motorcycle, as the initial production Harley-Davidson motorcycle had come out in 1903, and the first Harley-Davidson dealership had been opened a year later. By 1914, Harley-Davidson had entered the world of motorcycle racing.", "We weren't able to locate a comparable image of Harley and Davidson on motorcycles in 1914, but a photograph of them taken in 1924 clearly shows that the two men seen in the 1914 photograph displayed above are not the famous founders of Harley-Davidson:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]