["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the Florida Legislature moved to end the ban on smoking medical marijuana, a Broward Democrat said that patients awaiting transplants face discrimination if they use marijuana.", "Sen. Gary Farmer raised the issue for medical marijuana cardholders on the Senate floor.", "\"I was shocked to learn that some patients who are on transplant lists for kidney or other organs are being dropped from the list simply because they are shown as a licensed card holder under the database,\" Farmer said March 7.", "Farmer continued: \"It’s one thing if maybe you are talking about a lung transfer and smoking of an item would impact the viability of that organ. But patients should not be discriminated against who need a kidney or some other transplant simply because, again, they are exercising a legal medical option.\"", "Gov. Ron DeSantis signed a bill to allow smoking medical marijuana, reversing the smoking ban the Legislature implemented in 2017 following the passage of a constitutional amendment to allow medical marijuana in 2016.", "READ MORE: All of our fact-checks on marijuana", "Farmer hopes to get language included in a separate bill to protect those awaiting organs who use medical marijuana.", "So how often do transplant centers keep patients off transplant lists or remove them from lists due to medical marijuana?", "We found that it happens, but we can’t tell you how often due to a lack of national data. We found some anecdotal accounts in news reports, and learned it has prompted at least a half dozen states to pass laws to help such patients.", "\"I am aware that such rejections have been issues in California, Maine and Massachusetts,\" Harvard’s Dr. Jordan Tishler, an expert in the field of medical cannabis therapeutics, told PolitiFact. Another wrinkle: A patient could be rejected for an organ based on more than one factor, and whether marijuana was a reason can depend on the organ, or amount of marijuana use.", "Here’s what we found.", "There is no national policy on whether medical marijuana users are banned from organ transplant lists, according to the United Network for Organ Sharing, the organization that manages the nation’s organ transplant system under contract with the federal government.", "It’s up to the approximately 250 transplant centers to determine such rules.", "\"The rules vary from center to center and from organ to organ,\" said Arthur Caplan, founding head of the Division of Medical Ethics at NYU School of Medicine. \"I would not say the majority of centers exclude people for marijuana use, but some do.\"", "One recent survey provides some evidence that patients are rejected.", "The 2016 survey of members of the American Society of Transplantation, including transplant physicians and support staff, drew about 225 responses (or 8 percent of the membership). Because the responses were anonymous, it is unknown how many of the transplant centers were included in the results.", "Approximately 64 respondents said their centers rejected all candidates irrespective of the organ if they used marijuana, while 117 said the center’s policy varied depending upon the organ. The remainder were unknown or didn’t respond.", "To learn more, we interviewed spokespersons for five Florida transplant centers — Jackson Memorial Health in Miami, Tampa General Hospital, Mayo Clinic in Jacksonville, Cleveland Clinic Weston and University of Florida Health — as well as the University of California San Francisco.", "They generally told us that transplant centers take marijuana use into account, including if the person excessively uses marijuana. But the decisions to evaluate applicants based on marijuana use are made on a case-by-case basis — and their hospitals don’t have a blanket ban on marijuana.", "Jackson Health System’s Miami Transplant Institute, which performed the country’s second-largest number of transplants in 2018, described the evaluation process as complex.", "\"A multidisciplinary team evaluates a patient’s eligibility to be listed for a transplant based on medical and surgical grounds, insurance, and psychosocial criteria,\" spokeswoman Tania Leets said. \"We do not turn away patients who use medical marijuana; however, we do take this into consideration during their evaluation for transplantation.\"", "A Tampa General Hospital spokesman told us that the lung program would be the only program to not list a patient using marijuana either legal or illegal but only if that patient is inhaling the drug. (Doctors generally may suggest that certain patients who use medical marijuana avoid smoking it and ingest it in edible or oil form.) The hospital has not removed any patients from its waitlist due to medical marijuana usage.", "The University of California San Francisco transplant center does not remove or deny someone on the transplant list solely on marijuana use. However, if use of marijuana or other substances impair the patient’s ability to function and reliably follow medical prescriptions for dialysis and medication use, that could jeopardize a patient being placed on the transplant list.", "Farmer said, \"Some patients who are on transplant lists for kidney or other organs are being dropped from the list simply because they are shown as a licensed card holder\" for medical marijuana.", "We found a scarcity of national information to show how often someone is kept off a transplant list as a result of marijuana use. But what we did find — including anecdotal reports from several states and some survey data — indicates that some patients have been rejected from transplant lists because of their cardholder status, as Farmer said. It's important to know that every transplant center sets its own rules.", "We rate this statement Mostly True.", "Florida Senate, Floor session, March 7, 2019", "Florida Senate Bill 182, Signed by Gov. Ron DeSantis March 18, 2019", "Clinical Transportation, Marijuana use in transplantation: A call for clarity, February 2019", "Current Psychology Reports, Marijuana Use and Organ Transplantation: a Review and Implications for Clinical Practice, April 2017", "Liver Transplantation, Marijuana Consumption in Liver Transplant Recipients, Jan. 28, 2019", "Clinical Transplantation, Recreational marijuana use is not associated with worse outcomes after renal transplantation, Aug. 4, 2016", "American Journal of Transplantation, Marijuana use in potential liver transplant candidates, February 2009", "Americans for Safe Access, Medical marijuana access in the states, 2018", "AP, Bill would aid marijuana users who need organ transplants, Feb. 4, 2019", "CNN, A 'Catch-22' of medical marijuana and organ transplants, April 3, 2017", "ABC News, Medical Marijuana User Denied Organ Transplant", "BuzzFeed, Smoking Pot Can Get You Kicked Off Transplant Lists — Even In States Where It’s Legal, April 24, 2017", "New Mexico Political Report, Bill grows medical cannabis program, March 16, 2019", "Statesman Journal Salem, Or. Bill to target transplant centers; Candidate treated like 'street junkie, Feb. 4, 2019", "NORML, California: Governor Signs Law Expanding Medical Marijuana Patients’ Rights, July 6, 2015", "Interview, Sen. Gary Farmer, D-Lighthouse Point, March 20, 2019", "Interview, David Mangone, Americans for Safe Access spokesman, March 18, 2019", "Interview, Paul Armentano, NORML Deputy Director, March 18, 2019", "Interview, Dr. Jordan Tishler, a Harvard-trained Holistic Care expert and leading expert on Cannabis therapeutics, March 19, 2019", "Interview,  Gerald Scott Winder, University of Michigan clinical assistant professor of psychiatry, March 19, 2019", "Interview, Dr Arthur Caplan, Professor of Bioethics, Department of Population Health, March 18, 2019", "Interview, Curtis Krueger, Tampa General Hospital spokesman, March 20, 2019", "Interview, Tania Leets, Jackson Memorial Health spokeswoman, March 15, 2019", "Interview, Rossana Passaniti, University of Florida health communications, March 25, 2019", "Interview, Tia Ford, Mayo Clinic spokeswoman, March 25, 2019", "Interview, Arlene Allen-Mitchell, Cleveland Clinic, March 2019", "Interview, Scott Maier, University of California San Francisco spokesman, March 19, 2019", "Interview, Brian Montague, Assistant Professor of Medicine, University of Colorado School of Medicine, March 21, 2019", "Interview, Marilyn Levi, former professor at  University of Colorado, March 21, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]