["On May 28, the Supreme Court heard the Suo Moto case regarding the plight of migrant labourers stranded in different parts of the country due to the lockdown. During the hearing, Solicitor General (SG) Tushar Mehta presented the steps that the government had taken so far to tackle the issue. He argued that the Centre is doing a lot but there are “Prophets of Doom” who spread negativity. He also said that these “armchair intellectuals” do not recognize the nation’s effort.", "Solicitor General Tushar Mehta:", "“Centre is doing a lot to prevent #COVID19 but there are Prophets of Doom in our country who only spread negativity, negativity, negativity. These arm chair intellectuals do not recognize the nation’s effort”", "— Live Law (@LiveLawIndia) May 28, 2020", "The SG then went on to narrate the story of the vulture and the child photographed by Pulitzer prize-winning journalist Kevin Carter during the famine in Sudan — “There was a photographer who went to Sudan in 1983. There was a panic-stricken child. A vulture was waiting for the child to die. He photographed it and the photo was published in NYT and the photographer was awarded the Pulitzer Prize. He committed suicide after 4 months. A journalist had asked him – what happened to the child? He said I don’t know, I had to return home. Then the reporter asked him – how many vultures were there? He said one. The reporter said – no. There were two. One was holding the camera…”", "SG conitnues: “… a journalist had asked him – what happened to the child? He said I don’t know, I had to return home. Then the reporter asked him – how many vultures were there? He said one. The reporter said – no. There were two. One was holding the camera….”", "— Live Law (@LiveLawIndia) May 28, 2020", "Alt News spoke with one of the lawyers who was present in this hearing who confirmed to us that the version reported by Live Law was accurate.", "It turns out that the story narrated by the Solicitor General was doing the rounds on WhatsApp among supporters of Prime Minister Modi since at least a week before. In an attempt to silence any criticism of the government, the message draws parallels with Kevin Carter’s story and compares those highlighting the misery of the migrant workers to vultures. Tushar Mehta got the year of the famine wrong but narrated the rest of the story almost verbatim.", "It is shocking that Solicitor General of India quoted word to word from a viral WhatsApp message in the top court of the country.", "Other versions of the story of the starving child and the vulture with a different messaging have been viral internationally since years. A different message accompanying the story was fact-checked by Snopes in 2008.", "The photograph of the starving child and the vulture is regarded as one of the most iconic images that came out of the 1993 famine in Sudan. Kevin Carter, the South African photojournalist, had committed suicide a few months after being awarded the Pulitzer prize for the image.", "The photograph first appeared in the New York Times on March 26, 1993. When flooded with queries about the fate of the child, in an editor’s note on March 30, 1993, New York Times clarified, “Many readers have asked about the fate of the girl. The photographer reports that she recovered enough to resume her trek after the vulture was chased away. It is not known whether she reached the center.”", "Carter faced a lot of criticism from those who believed he did not help the child and shot a photograph instead. A profile on his life and death in TIME magazine said that the Pulitzer attracted “the critical focus that comes with fame.” Some journalists in South Africa called his prize a “fluke,” alleging that he had somehow set up the tableau, said the article which has no mention of a conversation between another journalist and Carter where he was called a vulture. The closest reference to the statement is an opinion by the St. Petersburg (Florida) Times: “The man adjusting his lens to take just the right frame of her suffering. Might just as well be a predator, another vulture on the scene.”", "However, in another article on the most iconic photos in the world, TIME magazine wrote, “As he took the child’s picture, a plump vulture landed nearby. Carter had reportedly been advised not to touch the victims because of disease, so instead of helping, he spent 20 minutes waiting in the hope that the stalking bird would open its wings. It did not. Carter scared the creature away and watched as the child continued toward the center. He then lit a cigarette, talked to God and wept.”", "Therefore, as it seems, Carter chased away the scavenger to help the child. He could not lift the child because journalists were advised to not touch victims of famine because of disease.", "There is no literature claiming that the vulture and the child photograph was the reason for his death. His work, overall, was emotionally demanding and he often experienced existential lucidity that came with surviving violence again and again. He often used drugs to cope with his miseries. “Carter had bounced from romance to romance, fathering a daughter out of wedlock,” reads the TIME piece hinting at an unstable personal life. Carter’s suicide note mentioned in TIME talked of financial troubles. He wrote: “…depressed … without phone … money for rent … money for child support … money for debts … money!!! … I am haunted by the vivid memories of killings & corpses & anger & pain … of starving or wounded children, of trigger-happy madmen, often police, of killer executioners … I have gone to join Ken if I am that lucky.”", "Ken was one of Carter’s closest friends who had died of a bullet wound covering violence in South Africa’s Tokoza in 1994, close to a month before Carter committed suicide. His death had devastated Carter who told his friends that he, and not Ken, should have taken the bullet. His work assignments covering violence and misery took a toll on his mental health. “Every photographer who has been involved in these stories has been affected. You become changed forever. Nobody does this kind of work to make themselves feel good. It is very hard to continue,” he was quoted telling his friends. His work was not going well on the days leading up to his death. According to his friends, he had begun to openly talk about suicide.", "He committed suicide on July 27, 1994.", "It was later confirmed that the child mistaken to be a girl was a boy and he had survived the famine. However, he died 14 years later from malaria fever. Based on a WhatsApp forward, the Solicitor General blamed Carter for the child’s death and claimed that during a conversation with another journalist he was called a vulture. There is no record of any such conversation and moreover, Carter had chased away the bird when he shot the photograph and the child had survived. An article in Pgurus also promoted the misinformation that Kevin Carter committed suicide due to the horrors of the Sudanese famine.", "Donate Now", "Nobody's cheerleader, I tweet at @samjawed65", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]