["Democratic presidential candidate and California Sen. Kamala Harris speaks at the CNN climate town hall on Sept. 4, 2019.", "During a climate town hall on CNN this week, Democratic presidential candidate and California Sen. Kamala Harris vowed to take on Big Oil and other powerful interests when they \"profit off of harmful behaviors\" such as burning fossil fuels.", "In answer to a direct question, she claimed she already did that as California’s attorney general.", "\"So, Senator Harris, what would you do? Would you sue them? Sue Exxon Mobil?\" asked moderator Erin Burnett.", "\"I have sued Exxon Mobil,\" Harris replied.", "Did she?", "Environmental groups questioned her response.", "We decided to fact check it.", "Our research", "We found Harris’ office investigated Exxon in 2016 over allegations it lied to the public and its shareholders about the risk to its business from climate change. The Los Angeles Times detailed that probe in a January 2016 news article. It said Exxon rejected the allegations.", "But there’s no public record, and nothing that Harris’ campaign could provide, to show she filed a lawsuit against the company.", "\"The facts are Harris opened an investigation against Exxon for lying about climate change. She didn’t take that further even though she should have and other attorney generals did,\" said Kassie Siegel, climate director at the Center for Biological Diversity Action Fund. \"She did bring some cases against oil companies. I’m not aware of a case that she actually brought against Exxon. And she didn’t bring the case against Exxon for lying about climate change.\"", "Ian Sams, a campaign spokesman for Harris, told us she \"launched an investigation into Exxon,\" but he would not directly address her claim that she sued the company.", "He told The New York Times that, \"as attorney general (Harris) sued Chevron, BP, ConocoPhillips and Phillips 66 for pollution activities, helping win $50 million in settlements.\" Sams provided PolitiFact California with links to articles and news releases supporting those actions.", "In their own fact checks, the Times and CNN reported they found no evidence supporting Harris’ claim that she sued Exxon.", "\"As Cal AG, Harris opened a file shortly after the #ExxonKnew news broke in fall 2015. She never did anything with it,\" RL Miller, chair of the California Democratic Party's environmental caucus and president of the Climate Hawks Vote Super PAC, said on Twitter during the town hall.", "Our rating", "Sen. Kamala Harris claimed at a recent climate town hall that she \"sued Exxon Mobil\" as California attorney general.", "She opened an investigation into the oil giant over allegations it was lying to the public and its shareholders about climate change. But there’s no public evidence, or any from her campaign, that she ever filed a lawsuit against the company.", "Harris did sue other oil companies and win settlements over allegations they violated various state laws governing hazardous materials, according to information provided by her campaign. But none of that includes a lawsuit against Exxon.", "Harris clearly tangled with Big Oil as California AG. There’s just no record she sued one of the industry’s biggest companies, Exxon.", "We rate her claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Kamala Harris, CNN climate town hall, Sept. 4, 2019", "Ian Sams, Harris campaign spokesperson, email exchange Sept. 6, 2019", "Kassie Siegel, climate director, Center for Biological Diversity Action Fund, phone interview Sept. 6, 2019", "RL Miller, chair, California Democratic Party's environmental caucus, tweet, Sept. 4, 2019", "The New York Times, ‘I Have Sued Exxon Mobil,’ Kamala Harris Said. Not Quite., Sept. 5, 2019", "CNN.com, Fact-checking presidential candidates at the CNN climate town hall, Sept. 5, 2019", "The New York Times, California Said to Target Exxon in Climate Inquiry, Jan. 20, 2016", "Vox, Kamala Harris’s climate plan would take polluters to court, Sept. 4, 2019", "Los Angeles Times, California to investigate whether Exxon Mobil lied about climate-change risks, Jan. 20, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]