["About this rating", "On 26 March 2016, the entertainment web site The Evening Harold published an article reporting that Donald Trump said that he didn't like Muslims because they were responsible for the death of Jesus:", "Easter is a time for remembering that Muslims killed Jesus, according to Donald Trump.", "“People ask me why I don’t like Muslims, and I say ‘duh’, it’s because they nailed Jesus to the cross with those Muslamic nails of theirs. Page 545 of the Bible I think it is, there in black and white, Muhammad Pilate and his henchmen killing Jesus.”", "“I don’t hear other candidates reminding Americans that Muslims killed Jesus. Is this yet another thing Hillary has conveniently forgotten? Lyin’ Ted Cruz says he’s a Bible man but he hasn’t mentioned it either – has he even read page 545??”", "Donald Trump never actually said this, as the Evening Harold only publishes fictional and satirical articles.", "This site, and the works herein, is the collective product of a number of damaged minds.", "[...]", "All characters featured in the Evening Harold are  entirely fictitious, and any similarities to anyone living or dead are purely coincidental.", "Frankly, if you can’t figure out the difference between real and imaginary this site is probably a bad idea for you, and it might be a good idea to write that down.", "This isn't the first time that a fake news story has been written about Donald Trump and Jesus Christ. In February 2016, a rumor circulated claiming (falsely) that Trump had called Jesus a \"socialist loser.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]