["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Facebook confirmed that it hasn’t shared voter registration information by region or state.", "As part of its 2020 voter information initiative, Facebook displays a tally of users around the country who’ve shared that they registered to vote. It isn’t state specific.", "But the post gets Arizona’s population right.", "Facebook recently launched its 2020 voter information initiative, which aims to connect users to information about voting where they live to help bolster registration and turnout.", "But one post claims the social media platform dramatically overshot the number of registered voters in the state of Arizona.", "Shared thousands of times, the Sept. 23 post reads: \"9,871,525 IS THE NUMBER OF REGISTERED VOTERS IN AZ ACCORDING TO FB. AZ POPULATION IS 7,270,000.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "While the claim gets the population of Arizona right, it’s wrong about the number of registered voters Facebook is reporting there. Here’s why.", "Facebook’s tally of registered voters, which users will sometimes see pinned to the top of their newsfeeds, displays the number of people in the U.S. who’ve used Facebook’s interface to share that they have registered to vote. The figure is not representative only of those in Arizona — or any other single state, for that matter.", "As part of the social media network’s 2020 voting initiative, which the company launched this summer, users 18 and older will see a pinned box at the top of their news feeds that contains information about voter registration. The website’s voting information center also provides details on how to check your registration status and information on where to register, including a link to the user’s state registration website or a voting information organization.", "A spokesperson for Facebook confirmed to PolitiFact that it hasn't shared the number of registered voters by region or state, and said the post is likely referring to the total number of users around the U.S. who’ve shared that they registered, which updates in real time. A tally showing that figure appears above the words \"People who shared they registered to vote in the United States.\"", "The user’s state is listed above that tally, but the number isn’t specific to that state:", "As of July 2019, the population of Arizona stood just over 7.2 million, with 22.5%, or about 1.6 million, being under the age of 18 and therefore not eligible to vote, according to Census data.", "This post gets Arizona’s population right, but the rest of the claim is wrong.", "We rate this post Mostly False.", "Facebook post, Sept. 23, 2020", "Facebook.com, Launching The Largest Voting Information Effort in US History, June 16, 2020", "Facebook.com, Launching Our US 2020 Voting Information Center, Aug. 13, 2020", "The Verge, Facebook will pin voting registration links to the top of the News Feed for all US voters, July 2, 2020", "Census.gov, Arizona quick facts, Updated July 2019 https://www.census.gov/quickfacts/AZ", "AZsos.gov, Voter Registration & Historical Election Data, Updated August 2020", "Email interview, Facebook spokesperson, Sept. 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]