["The video was published here on Facebook, on August 10, 2020. It has been viewed more than 1,400 times.", "The 39-second footage shows a rocket bursting into flames moments after launch. An English-language voiceover is heard throughout the video. It describes the explosion as it occurs.", "The post’s caption, written in traditional Chinese characters, translates to English as: “8:47 am on August 7! The United States failed to launch rockets, and the launch site was blown up. Yellow media [and] biased journalists…will not report on this!”", "The video was also shared here on Facebook and here and here on Twitter alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google using keyframes extracted with InVID-WeVerify, a digital verification tool, found a longer version of the video published here on the YouTube channel of the US television station WAVY-TV on October 28, 2014.", "Below are two screenshot comparisons of the video in the misleading Facebook post (L) and the YouTube video (R):", "The video's title and description reads: “NASA rocket explodes during launch at Wallops Island”.", "Wallops Island, an island in Virginia, US, is where NASA rocket launch site Wallops Flight Facility is located.", "A keyword search found the explosion was also reported by other American media in 2014, including CNN here and National Geographic here.", "The CNN report reads, in part: “Teams of investigators were out at daybreak Wednesday examining damage to NASA's Wallops Flight Facility after an unmanned rocket exploded shortly after launch on the Virginia coast, NASA spokeswoman Rachel Kraft told CNN via email. NASA is warning people in the area not to touch debris if they find any.", "“The Antares rocket, built by NASA contractor Orbital Sciences Corp., and its Cygnus cargo spacecraft ‘suffered a catastrophic failure’ shortly after liftoff Tuesday evening, the company said. The crash caused a huge fire and scattered debris over a large area.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]