["A video of a tractor stunt was shared online, with users claiming that it shows farmers preparing for their upcoming parade on Republic Day. On January 2, farmers’ unions announced that they would hold a parallel tractor parade in Delhi on January 26 if their demands were not met. This video started being circulated with this claim around January 2.", "While sharing the clip, netizens wrote, “How is the preparation for the January 26 parade looking? ‘Jai Jawan Jai Kisan’.” This post by Facebook user Anil Malik garnered 7.5 lakh views and was shared by more than 17,000 people at the time of writing. (Archive link)", "26 जनवरी की परेड़ की तैयारी ठीक है ना। 🇮🇳🇮🇳 “जय जवान जय किसान” Anil Malik #मैं_भी_किसान_हूँ", "Posted by Anil Malik on Tuesday, December 29, 2020", "Several other Facebook users uploaded similar posts.", "Along with Facebook, the stunt video is also viral on Twitter with the accompanying claim.", "26 जनवरी की परेड़ की तैयारी ठीक है ना। 🇮🇳🇮🇳 “जय जवान जय किसान”", "#मैं_भी_किसान_हूँ pic.twitter.com/V4EfqiL0kv", "— Hirenkumar Pawar (@PawarHirenkumar) January 3, 2021", "Alt News performed a reverse image search of screenshots taken from the viral video using Yandex. This led us to a YouTube channel that had shared the original clip on February 11, 2020. The title contained the name ‘Subhash’.", "We found several other videos of the same stunt on this channel. In one of these clips, we noticed a phone number written on the back of the tractor. This video, titled ‘‘सुभाष का खेड़ी गांव वालो ओर कमेटी ने किया मान- समान’, (Khera village committee and residents honour Subhash) was posted on February 5, 2020. We contacted this number and spoke to Subhash Lathwal. He is the person doing the tractor stunt in these clips.", "When asked about this video, he told Alt News that he is the man in the video and did not shoot it. He also stated that he would be participating in the tractor parade to be held on January 26. However, the viral clip has nothing to do with any practice sessions for this.", "There are a number of videos of Lathwal’s tractor stunts on YouTube. Such displays are quite popular in Haryana. The audience even pays the stuntmen after the show. A search on YouTube with the term ‘सुभाष लठवाल ट्रैक्टर स्टंट‘ (Subhash Lathwal Tractor Stunt) throws up dozens of such clips.", "He also shared the video of the viral stunt to his Facebook page on February 3, 2020.", "Posted by Subhash Lathwal on Monday, February 3, 2020", "To sum it up, an 11-month old video of a tractor stunt was falsely linked to the ongoing farmers’ protests. The accompanying claim that the clip showed farmers practicing for their upcoming tractor parade is completely false.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]