["By Katherine Hartzell", "Posted on June 18, 2019", "A story being shared by thousands of Facebook users includes a “quote” about President Donald Trump that has been misattributed to the actress Nicole Kidman.", "The headline of a 2018 article circulating on Facebook reads, “Nicole Kidman Says: Trump Is The Best President In U.S History, We Must Respect Him.”", "There is no evidence Kidman ever said that.", "The article, published on the Cambodian “entertainment news” website Kh Stars, cites Kidman’s January 2017 interview with British journalist Victoria Derbyshire. In the BBC Two interview, Derbyshire noted that Kidman, a dual citizen of Australia and the United States, voted in the 2016 presidential election, and then asked the actress for her views on Trump, who was president-elect at the time.", "Kidman’s response was that she believes U.S. citizens should support their country’s president, whomever that person may be. At no point did she say that Trump is the best U.S. president of all time. Here’s her full answer:", "Kidman, Jan. 10, 2017: I mean, I’m always reticent to start sort of commenting politically. I’ve never done it in terms of America, or Australia. I’m issue-based … so I just say, he’s now elected, and we, as a country, need to support whosever the president because that’s what the country’s based on. And whatever, however that happened, he’s there, and let’s go.", "The Kh Stars story offers no other evidence to support its headline, nor did we find any.", "Days after the BBC Two interview aired, the Associated Press reported that Kidman clarified her comments about Trump in an interview with “Access Hollywood.”", "Video of the latter interview is no longer available online, but the AP reported that Kidman said of her earlier remarks, “I was trying to stress that I believe in democracy and the American Constitution, and it was that simple.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Nicole Kidman: I wish I’d had more children.” Video. BBC Two. 10 Jan 2017.", "“Nicole Kidman Says: Trump Is The Best President In U.S History, We Must Respect Him. Do you Support Her?” Khstars.com. 12 June 2018.", "“Kidman says comments about Trump support weren’t endorsement.” Associated Press. 14 Jan 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]