["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump took a victory lap on the job market during one of his periodic Cabinet meetings.", "\"Unemployment is at a 17-year low,\" he said on Dec. 6, 2017. \"Very shortly it's going to be at a 19-year low. We think the numbers are going to continue to go down. And we're also getting into the pool of the 100 million people that are not working. That pool is now coming back. As you know, that's not considered in the low employment numbers, which means we have a lot of people that want to get to work, and that will be working.\"", "The unemployment rate is indeed at its lowest point since December 2000. But we were curious about Trump’s other assertion -- that would-be workers from a pool of 100 million are coming back into the workforce.", "President Donald Trump at a cabinet meeting on Dec. 6, 2017. (Kevin Dietsch-Pool/Getty Images)", "First off, Trump is in the ballpark when he says that there are 100 million people not working. There are currently 95.4 million people above the age of 16 who are out of the labor force -- meaning neither working nor actively looking for work -- and another 6.5 million people who are unemployed.", "If you look at the raw number of Americans who are not in the labor force -- people who are not working or looking actively for work -- that figure has risen by 1.02 million since January 2017, an increase of about 1 percent.", "Meanwhile, the labor force participation rate -- or the percentage of people age 16 and up who are either working or actively looking for work -- has been bouncing around in a narrow band since Trump took office -- between 62.7 percent to 63.1 percent -- with no clear trend.", "While neither of these measures supports Trump’s assertion, each presents an imperfect view of the labor pool by including everyone 16 and up. Those totals are shaped by demographic changes.", "\"Demographic trends such as the aging of the baby boomer cohort have been the primary drivers for the decline in labor force participation,\" said Chris Lafakis, a director at Moody's Analytics. \"We simply have more retirees now because our population is older.\"", "If you drill down using statistics that are more targeted to working-age Americans, Trump’s assertion looks more credible.", "Consider the employment-to-population ratio for Americans age 25 to 54.", "During Obama’s last 12 months, this measurement rose by half a percentage point. (Rising, for this statistic, is good -- it means a larger percentage of Americans are employed.)", "But in the first 10 months of Trump’s tenure, the statistic rose by six-tenths of a percentage point. That’s not a radical improvement, but it’s better than his predecessor managed in his final year. Here’s the full chart (with Obama months in blue and Trump months in red):", "If you look at the raw numbers, the number of non-workers in the 25 to 54 age range has declined by about 691,000 since January 2017.", "Another statistic also puts the improvement in 2017 in a favorable light.", "That would be the unemployment rate known as \"U-6.\" This statistic uses a more generous definition of unemployment than the most commonly used measure. The U-6 rate includes not just workers who are officially unemployed but also those who are employed part-time when they would prefer a full-time job, and those who want to work but who haven’t looked for work in the preceding four weeks.", "In Obama’s final year, this measure dropped by half a percentage point. (A drop is a good sign.) But under Trump, it has dropped by 1.5 percentage points -- three times faster in a shorter period of time. Here’s the full chart:", "This statistic is an important one for judging Trump’s assertion, because the people who would be driving the declines would specifically be those who find jobs after being unemployed by conventional definitions, plus those who had been forced to work only part time and those who had not looked for work for several months.", "\"President Trump is correct that the ‘pool of non-workers’ continues to shrink,\" said Brookings Institution economist Gary Burtless, though he added that it has done so \"fairly steadily\" since the last quarter of 2011.", "Jed Kolko, the chief economist for the job site Indeed.com, puts significant stock in the two statistics that support Trump’s statement.", "\"Our view is that the labor market is entering 2018 with strength and momentum, with some room to grow,\" Kolko said.", "Finally, it’s worth noting that no president can take full credit for the economy’s achievements (or take full fault for its shortcomings). Many other factors, including the health of the rest of the world economy and changes in demographics and technology, play a role as well.", "Our ruling", "Trump said that \"we’re … getting into the pool of the 100 million people that are not working. That pool is now coming back.\"", "The statistics that shine the most direct light on working-age Americans support Trump’s point. Both the working-age employment-to-population ratio and the U-6 expanded unemployment rate have improved on Trump’s watch. It’s worth noting that they also improved during Obama’s final year, so Trump was fortunate to take office at a time when the economy was already going in the right direction. But the scale of the increase has been bigger under Trump.", "We rate this statement Mostly True.", "Donald Trump, remarks at a cabinet meeting, Dec. 6, 2016", "Federal Reserve Bank of St. Louis, employment-population ratio for ages 25-54, accessed Dec. 7, 2017", "Federal Reserve Bank of St. Louis, U-6 rate, accessed Dec. 7, 2017", "Bureau of Labor Statistics, glossary, accessed Dec. 7, 2017", "Indeed.com, \"The U.S. Labor Market: 2017 Review and Outlook,\" Dec. 5, 2017", "Email interview with Chris Lafakis, a director at Moody's Analytics, Dec. 7, 2017", "Email interview with Gary Burtless, economist at the Brookings Institution, Dec. 7, 2017", "Email interview with Jed Kolko, chief economist for Indeed.com, Dec. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]