["About this rating", "It's difficult to summarize the wide-ranging, ever-expanding, and practically nonsensical QAnon conspiracy theory. For the purposes of this article, readers should know that one of the main tenets of QAnon revolves around the claim that liberals, Hollywood celebrities, and various world leaders are involved in global pedophilia ring (à la Pizzagate).", "With this in mind, it's perhaps not too surprising that supporters of this conspiracy theory were taken in by a satirical article claiming that the Walt Disney Co., a global organization known for its wholesome children's entertainment, had purchased the website Pornhub, which ... well, is known for distinctly adult content.", "On 17 May 2019, the Facebook page QAnon NC posted a link to an article from the satirical website The Beaverton under the caption: \"DID YOU KNOW #DISNEY OWNS #PORNHUB? Why is this not public knowledge? Disney executives pleased to announce acquisition of PornHub.\"", "A number of other social media users posted about Disney's alleged acquisition of Pornhub, including several accounts that mentioned the QAnon conspiracy theory in their profiles:", "For the record, Disney has not purchased Pornhub.", "The article being shared on social media in May 2019 was originally published on the entertainment website The Beaverton in June 2018 and read as follows:", "\"Expanding their media streaming portfolio, Disney executives announced that the company has acquired Canadian adult entertainment site, Pornhub ...", "“This is part of our plan to expand our streaming capabilities,” said Dalton Sterling, VP of Market Strategy in a call to shareholders, adding that it will allow them to leverage existing properties like Star Wars, Marvel, and the original cartoon characters to create franchise specific content that were thus far left to fans to create. “This is what the online world was made for, and it would be unfair to our shareholders to not get a part of the action.”", "This was not a genuine news article, as The Beaverton is a well-known entertainment site that publishes \"news satire and parody.\" A disclaimer on the website reads as follows: \"The Beaverton is a news satire and parody publication. All articles contained within this website and on its social media accounts, however similar to real events, are fictitious. When public figures or actual businesses are mentioned by name, the corresponding story details are invented. In all other cases, any resemblance to actual persons, businesses or events is entirely coincidental.\"", "Pornhub is actually owned by a company called Mindgeek. And while the Walt Disney Co. is truly a media empire that encompasses properties such as ESPN, Pixar, Marvel Studios, Lucasfilm Ltd., ABC News, Hulu, and Twentieth Century Fox in its portfolio, that empire has yet to venture into field of pornographic videos.", "Ellis, Emma.   \"Crying 'Pedophile' Is the Oldest Propaganda Trick in the Book.\"\r\n    Wired.   1 August 2018.", "Hagey-Mackay, Aaron.   \"Disney Executives Pleased to Announce Acquisition of PornHub.\"\r\n    The Beaverton.   22 June 2018.", "Carpenter, William.   \"Top 5 Companies Owned by Disney.\"\r\n    Investopedia.   11 February 2019.", "Gilmer, Marcus.   \"What It's Like to be Pornhub's Social Media Manager.\"\r\n    Mashable.   19 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]