["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "NC Sen. Dan Bishop, who's running for Congress, attacked his opponent Dan McCready during a Trump rally in Greenville, NC.", "President Donald Trump wasn’t the only one trying to score political points off Ilhan Omar during Trump’s rally in Greenville.", "Trump on Wednesday deepened his feud with Democratic Rep. Omar of Minnesota, a Muslim woman who came to the United States from Somalia as a child refugee. Trump accused her of being anti-Semitic.", "At one point during the rally, Trump welcomed Republican NC Sen. Dan Bishop to the stage. And Bishop, who’s running for Congress in North Carolina’s 9th district, took the opportunity to tie his opponent to Omar.", "Bishop said Dan McCready, his Democratic opponent, accepted a campaign donation from Omar.", "\"Dan McCready took money from Ilhan Omar,\" Bishop told the crowd.", "That’s not the whole story.", "DONATION RETURNED", "McCready received a $2,000 donation from Omar on Nov. 6.", "But then, earlier this year, McCready returned that donation. He tweeted about the decision on April 17.", "\"Some folks are asking why I directed the return of Rep. Omar’s donation. I did this weeks ago because I vigorously disagree with any anti-semitic comments. Since this time, dangerous and hateful attacks have started against her... \" McCready tweeted.", "\"I condemn in the strongest terms the hateful rhetoric against her, the Muslim community and people of color. Too many have been hurt by our broken politics. We must end hate speech against all people and groups.\"", "OMAR’S COMMENTS", "McCready at the time didn’t specify which of Omar’s comments made him uncomfortable. But the Los Angeles Times has chronicled some of her controversial statements.", "Earlier this year, Omar apologized for tweeting in 2012 that \"Israel has hypnotized the world, may Allah awaken the people and help them see the evil doings of Israel.\"", "In February, Omar said supporters of Israel were only motivated by money. She tweeted, \"It’s all about the Benjamins, baby!\" and later apologized.", "REACTION", "PolitiFact reached out to Bishop’s campaign and asked why Bishop didn’t mention McCready’s decision to return Omar’s donation. Jessica Proud, a spokeswoman for his campaign, suggested the action doesn’t make a difference.", "\"Rep. Omar has a long and well-documented history of anti-Semitic remarks,\" Proud said in an email, referencing the 2012 tweet. \"So (McCready) should have never taken a cent from her in the first place.\"", "McCready spokesman Matt Fried, contacted by PolitiFact Friday, said McCready would rather serve his community than wade into a hostile and unproductive debate.", "\"It’s clear politicians in Washington have lost touch with the American values that define us as patriots and when they put hate — of any kind — above love for country, we damage this nation to its core,\" Fried said in an email. \"That’s why on Wednesday Dan McCready was in Mint Hill announcing his national service plan and calling on more young Americans to serve their country, through the military like Dan did, or through civilian service like AmeriCorps.\"", "OUR RULING", "Bishop said McCready \"took money from Ilhan Omar.\" Omar did donate to McCready’s campaign last fall. But McCready returned the donation this spring.", "Bishop didn’t mention the returned money on stage, which could leave some Trump supporters believing McCready supports Omar’s controversial comments. The claim is partly accurate but leaves out important details. We rate it Half True.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "Email correspondence with Matt Fried, spokesman for Dan McCready.", "Email correspondence with Jessica Proud, spokeswoman for Dan Bishop.", "News & Observer, \"‘Send her back,’ crowd chants at Rep. Omar during Trump campaign rally in NC,\" published July 17, 2019.", "Campaign finance reports for \"McCready for Congress\" on the Federal Election Commission website.", "Tweets by Dan McCready on April 17, 2019.", "Los Angeles Times, \"Q&A: Rep. Ilhan Omar is a favorite Trump target. What’s going on?\" posted July 18, 2019.", "Charlotte Observer, \"9th District Democrat Dan McCready lays out national service plan,\" published July 17, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]