["About this rating", "In January 2018, shortly after the publication of the book Fire and Fury: Inside the Trump White House, which suggested that President Trump was unfit for office, the President took to Twitter to defend his mental stability:", "....Actually, throughout my life, my two greatest assets have been mental stability and being, like, really smart. Crooked Hillary Clinton also played these cards very hard and, as everyone knows, went down in flames. I went from VERY successful businessman, to top T.V. Star.....", "— Donald J. Trump (@realDonaldTrump) January 6, 2018", "....to President of the United States (on my first try). I think that would qualify as not smart, but genius....and a very stable genius at that!", "— Donald J. Trump (@realDonaldTrump) January 6, 2018", "Trump's tweets sparked a flurry of political punditry (and fodder for comedians). On 8 January 2018, the Facebook page \"Politicked\" published an image purportedly showing former presidents Obama, Bush, and Clinton mocking Trump's claim that he became President of the United States on his first try:", "Politicked describes itself as a \"left wing political satire\" group, which creates its own \"original and biting memes.\" The images of these purported tweets are fake.", "We searched the Twitter timelines for Obama, Bush, and Clinton and didn't find any of these messages. It's also unlikely that the three former presidents posted and subsequently deleted the tweets. Messages sent from President Obama and Clinton are routinely retweeted thousands of times (Bush hasn't used the service since 2010) yet we found no retweets linking back to the original messages.", "Furthermore, it would be highly unlikely for these three former presidents to coordinate a social media joke simply to mock President Trump, before getting cold feed and deleting their posts without being detected by a mainstream media source.", "It is true that Obama, Clinton, and Bush all won presidential elections on their first attempts. Trump's claim that he won the presidency on his first try, however, is a matter of debate (and of how serious one considers his first attempt). He ran for the nomination of the Reform Party in 2000 and appeared on the primary ballot in two states. Trump withdrew from the race before the election.", "Although the 2000 campaign was the only time Trump actually entered any primary races prior to 2016, the real estate mogul toyed with the idea so often that his political aspirations found their way onto the popular cartoon show The Simpsons.", "Helmore, Edward.   \"How Trump’s Political Playbook Evolved Since He First Ran for President in 2000.\"\r\n    The Guardian.   5 February 2017.", "TV Guide.   \"Here's a Timeline of Every Time Donald Trump Ran for President.\"\r\n    18 July 2015.", "Helmore, Edward.   \"How Trump’s Political Playbook Evolved Since He First Ran for President in 2000.\"\r\n    The Guardian.   5 February 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]