["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The TV ad uses a narrator, words on the screen and imagery to invoke COVID-19.", "It then immediately uses the Garcia remark, without indicating that he made it about food stamps.", "Garcia has said he generally favors private charity over federal safety nets.", "A TV ad attacking U.S. Rep. Mike Garcia, R-Calif., uses images, a narrator’s voice and words on the screen to invoke the coronavirus pandemic.", "Then it shows Garcia saying: \"Everyone should have to figure out how to fend for themselves.\"", "Garcia’s remark was about food stamps, and it was made half a year before the outbreak hit California, though he has expressed opposition generally to federal safety nets.", "The ad is from the Democratic Congressional Campaign Committee, which works to elect Democrats to the House. Democrat Christy Smith, a California assemblywoman elected in 2018, is running against Garcia on Nov. 3 for the 25th District congressional seat, north of Los Angeles.", "The race is one of 18 pivotal House and Senate contests up for election on Nov. 3 that PolitiFact is tracking. It is rated a tossup by the nonpartisan Cook Political Report.", "Garcia, a former military pilot, defeated Smith in a special election for the seat in May. That election was held to replace Democrat Katie Hill after she resigned.", "The committee’s 30-second spot opens with the narrator saying: \"Thousands of Californians dead.\" What appears to be a headline pops on the screen and says: \"Los Angeles Death Toll is High.\" Those words are from an Aug. 22 news story about COVID-19.", "The narrator continues: \"Schools and businesses closed. How do we help people in need?\" A woman and child are shown wearing disposable face masks commonly worn to protect against the virus.", "Then the narrator says: \"Well, according to millionaire Congressman Mike Garcia ...\" — at that point, Garcia is shown in a video clip saying: \"Everyone should have to figure out how to fend for themselves.\"", "Small print on the screen indicates Garcia’s comment is from an interview he did on \"The Talk of Santa Clarita\" podcast in August 2019, months before COVID-19 struck California.", "The ad then attacks Garcia claiming he supported tax breaks for millionaires while working families got higher taxes. It closes returning to its original theme, with the narrator saying: \"Millionaire Mike Garcia — leaving us to fend for ourselves.\"", "Here was the exchange with host Stephen Daniels in which Garcia made the remark used in the ad:", "Host: \"Should there be a social safety net? Do you believe in that?\"", "Garcia: \"I believe in Social Security, for sure.\"", "Host: \"What about food stamps?\"", "Garcia: \"Food stamps at a low level I think is — as a purist, I would say no, everyone should have to figure out how to fend for themselves.\"", "He added: \"I do understand that people will get on hard times. Here’s where I land on all the programs: There should be safety nets, but I don’t want the federal government to be the safety net. I want the churches, I want the local community nonprofits, I want our neighbors to be the safety nets.\"", "One of the rotating headlines on the homepage of Garcia’s campaign website says: \"I believe in the Constitution, Capitalism, Competition and Charity.\"", "Garcia has expressed support for providing federal aid to small businesses and their workers affected by COVID-19.", "Democratic Congressional Campaign Committee spokesman Cole Leiter told PolitiFact that \"Garcia was crystal clear when he was asked whether he supported the social safety net.\" Medicare, Medicaid and food stamps \"are the very same social safety net programs that have proved essential to families in California who have been severely impacted by the economic fallout from the pandemic.\"", "Garcia’s campaign did not reply to our requests for information.", "An ad using strong imagery on COVID-19 said Garcia said: \"Everyone should have to figure out how to fend for themselves.\"", "Garcia made the remark about food stamps and other government programs, though the ad gives no indication of that, and that was months before the outbreak. Garcia has expressed opposition to federal safety net programs generally, saying he prefers private sector assistance.", "We rate the statement Mostly False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "YouTube, Democratic Congressional Campaign Committee \"CA-25: Fend\" ad, Sept. 8, 2020", "Yahoo News, \"LA's Coronavirus Death Toll Is High, But The Spread Is Slowing\" Aug. 22, 2020", "YouTube, \"The Talk of Santa Clarita\" Mike Garcia interview (22:55), Aug. 8, 2019", "Interview, Democratic Congressional Campaign Committee spokesman Cole Leiter, Sept. 16, 2020", "Antelope Valley Times, \"Op-ed: Statement from Congressman Mike Garcia on California shutdown,\" July 14, 2020", "The Signal, \"Mike Garcia: Getting to Work in Washington,\" May 23, 2020", "Associated Press, \"Timeline of events during California’s coronavirus outbreak,\" July 1, 2020", "ABCNews7.com, \"Coronavirus Timeline: Tracking major moments of COVID-19 pandemic in San Francisco Bay Area,\" Sept. 15, 2020", "KHTS-AM, \"What You Should Know About Mike Garcia,\" Sept. 9, 2019", "ElectMikeGarcia.com, \"KHTS: What You Should Know About Mike Garcia,\" accessed Sept. 16, 2020", "ElectMikeGarcia.com, home page, accessed Sept. 17, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]