["By Eugene Kiely", "Posted on June 7, 2016", "Donald Trump falsely claimed Iran is “taking over the oil” in Iraq. Experts told us Iran does not control any Iraqi oil fields, and we could find no evidence of it.", "In fact, despite its political instability, Iraq produced and exported a record amount of crude oil last year, and it has reclaimed smaller oil fields in northern Iraq that had been taken by the terrorist Islamic State group, also known as the Islamic State of Iraq and Syria or ISIS.", "“Iraq’s oil is still the property of the people of Iraq,” said Jim Krane, a fellow at the Center for Energy Studies at Rice University who is an expert in geopolitical aspects of energy.", "Trump spoke about Iraq on CNN’s “State of the Union,” where he once again claimed without evidence that he opposed the Iraq war before it started because he felt it would destabilize the Middle East. “I was against it from before it started,” Trump said.", "As we’ve written, there is no public record of his opposition before the war started March 19, 2003. In fact, Trump is on record as giving a halfhearted endorsement for going to war with Iraq six months before it started. (“Yeah, I guess so,” he said when asked by radio personality Howard Stern.) Our timeline of Trump’s comments on the war show he was an early critic once the war started, but on the grounds that it was financially wasteful — not because it would upset the balance of power in the Middle East.", "Anchor Jake Tapper challenged Trump to produce the evidence of his pre-war opposition. Trump responded by saying, “I think there is evidence. I will see if I can get it.”", "It was in this context that Trump made his claim that Iran is “taking over the oil” in Iraq.", "Trump, June 5: So, I was against the war a long time ago, and it destabilized the Middle East. And that’s exactly what I said was going to happen. I also said Iran will take over Iraq, because we ruined the balance of those two militarily. We destroyed — we knocked out one of the two balancing prongs. And Iran is taking — as sure as you’re sitting there, Iran is taking over Iraq. They’re taking over the oil. They’re taking over everything.", "Trump’s campaign did not respond when we asked it to explain Trump’s comments. It may be that he was talking about what may happen in the future, but Trump used the present tense that “Iran is taking over Iraq” and that “they’re taking over the oil” — and none of that is happening, experts tell us.", "We reached out to Middle East experts to ask about Iran-Iraq relations in general and Iraqi oil.", "In general, Ken Pollack, a senior fellow at the Brookings Institution’s Center for Middle East Policy, told us Trump’s comments that “Iran is taking over Iraq” are “exaggerated by any measure.”", "It’s true that Iran’s influence increased “dramatically” in 2014 when “Iran rushed in to help defend Baghdad” from ISIS, Pollack said, as Iran-backed militias took the lead in that fight.", "“All across Baghdad you saw billboards thanking Iran, thanking Ayatollah Khamenei and thanking the Revolutionary Guards,” Pollack said. “And in that period, Iran was the most influential power in Iraq by far, but even then it was limited.”", "However, Iran’s influence has begun to wane more recently as the U.S. has reasserted itself in Iraq, Pollack said.", "“In recent months, Iran’s influence has diminished again pretty noticeably, and American influence has rebounded because the military aid being provided by the United States is having a much greater impact on the battlefield than that provided by Iran and because the U.S. is now helping Iraq secure billions of dollars in loans and desperately needed financial aid to help them deal with their budget crisis,” Pollack said. “So paradoxically, Trump’s statement comes when U.S. influence in Iraq was once again rising, at the expense of Iranian influence, although neither side truly controls Iraq.”", "The concern, as expressed in a Jan. 8 article in The Telegraph, is that the Iranian-backed militias fighting ISIS in Iraq could attempt to take control of Iraq if and when ISIS is defeated.", "Martin E. Dempsey, then-chairman of the Joint Chiefs of Staff, told the Senate Foreign Relations Committee in March 2015 that “the activities of the Iranians to support the Iraqi Security Forces is a positive thing” if it does not worsen sectarian tensions. “But we are all concerned about what happens after the drums stop beating and ISIL is defeated, and whether the government of Iraq will remain on a path to provide an inclusive government for all of the various groups within it,” Dempsey said.", "Pollack said that “would be disastrous” if  the Iranian-backed militias fighting ISIS in Iraq could attempt to take control of Iraq if and when ISIS is defeated. “But we are still a long way from that,” he said.", "As for now, Pollack said he doesn’t know what Trump is talking about when the presumptive Republican presidential nominee says Iran is “taking over the oil” from Iraq.", "“Iran is not taking over any Iraqi oil fields,” Pollack wrote to us in an email. “If it means that Iran has its personnel there running them, then NO. If it means they are taking the oil and selling [it] themselves, then again, NO. None of that is happening.”", "Krane, of Rice University, agreed that the current instability in Iraq doesn’t mean that Iran is “taking over the oil” in Iraq, as Trump claimed.", "“The fact that there is Iranian influence in neighboring Iraq is a long way from Iranian control over the Iraqi oil sector,” Krane said.", "The country has contracts with international oil firms — mostly big-name companies such as Shell, BP and Gazprom — to maintain and operate the oil fields, Krane said. And it has been successful. Iraq last year set a record for oil production and exports, according to the U.S. Energy Information Administration.", "Krane said he is not even aware of any Iranian companies working in Iraqi oil production.", "“Iraq’s oil is still the property of the people of Iraq. It is produced by Iraqi and international firms, often under production sharing agreements,” Krane said. “To my knowledge, there are no Iranian firms directly involved in Iraqi oil production. It is possible that Iran-based contractors are working in the Iraqi energy sector, but if they did, they would be in minor roles alongside firms from many other countries including the United States.”", "Madeleine Moreau, a senior analyst for Global Risk Insights who specializes in investment risk in the Middle East, recalled that for a few days in December 2009 “Iran briefly occupied the Fakka oil field in Maysan province,” in southeastern Iraq. But, she said, Iran was “forced to back off because it angered a strong contingent of Iraq’s population.”", "Moreau said she knows of no “hard evidence” that Iran has any control of Iraqi oil — not even after the Iran-backed militias helped Iraq last fall to recapture the Baiji oil field north of Baghdad.", "“Moving forward, I would argue that the recent high oil production rates in Iraq, likely at Iran’s expense, has the potential to heighten tensions between the two countries in the longer run,” Moreau said. “But for now, I think Iran’s ‘priorities of influence’ in Iraq is current military operations to recapture ISIL-held territories and the current political situation.”", "Trump would be right to say that Iran has influence in Iraq, and he is free to express his opinion that Iran may attempt to take control of Iraq in the future. But there’s no evidence that Iran is “taking over the oil” in Iraq.", "https://www.sharethefacts.co/share/2ef2e495-d2ec-434f-800a-6e4dda185dad", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]