["Carlos Beruff, Marco Rubio’s Republican opponent in the U.S. Senate race, says he’s had enough of people in Washington making decisions and controlling people’s lives.", "Beruff’s new campaign ad, dubbed \"Clean House,\" criticizes government intrusion into American life.", "\"The folks in Washington have it all figured out,\" Beruff says in the ad. \"They’re going to make your choices and run your life.\"", "He continued: \"They’re already forcing you to buy government health care.\"", "PolitiFact is very familiar with inaccurate statements about the health care law. In fact, four out of seven PolitiFact Lies of the Year have been related to the Affordable Care Act, including that the 2010 law was a \"government takeover of health care.\"", "The Lie of the Year in 2010 debunked statements that suggested the Affordable Care Act represented a \"government takeover of health care.\" The main finding was that the plan would increase government regulation, but it would continue to rely on private insurers to provide coverage for most Americans.", "Beruff’s claim falls into a similar trap because it glazes over private insurers’ roles, but doesn’t go as far as to suggest a government takeover.", "The individual mandate", "Beruff’s spokesperson cited the individual mandate in the Affordable Care Act, which requires most individuals to have health insurance or pay a tax penalty, called the individual shared responsibility payment.", "That mandate, which took effect in 2014, is due every month an individual doesn’t have health insurance that meets the minimum essential coverage. The penalty is assessed on tax returns, and increases every year a person remains uninsured.", "No one is forced to buy government health insurance via the individual mandate, but individuals are strongly incentivized to have the minimum essential health coverage to avoid the penalty.", "Some may consider the individual mandate to be \"forcing\" people to get coverage, but people can choose to remain without health insurance and defer to the fine, said Ben Sommers, an assistant professor of health and economics at the Harvard T.H. School of Public Health.", "Beruff’s point isn’t flat-out wrong, but his word choice is problematic, said Gail Wilensky, who ran Medicaid and Medicare under President George H.W. Bush. She said she wouldn’t have used the word \"forced\" because the mandate only strongly encourages having health care coverage, and it doesn’t have to be government coverage if your employer offers private insurance.", "The individual mandate has many exemptions depending on income, membership in groups like Indian tribes, and incarceration. If individuals don’t fall into those categories, the Health Insurance Marketplace lays out 14 categories of hardship exemptions that exempt people from the financial penalty if they cannot afford it. \"Hardship\" exemptions cover homelessness, filing for bankruptcy and foreclosure, and a family member’s death, to name a few examples.", "Dissecting ‘government health care’", "Beruff’s bigger problem is with his characterization of the Affordable Care Act as \"government health care.\"", "Yes, the mandate requires Americans to carry health insurance. But just as before the law, the majority obtain it from private sources, such as their employer or from choosing plans offered in health insurance marketplaces set up by federal or state regulators.", "The law aimed to dramatically expand public health insurance through the federal-state Medicaid program. But a Supreme Court decision has allowed 20 states, including large ones such as Texas and Florida, to not extend coverage to more low-income residents using federal dollars.", "In 2014, 66 percent of people had private health insurance, and 55 percent of all people received insurance from their employers, according to a report from the Census Bureau.", "Any type of private health insurance must meet specific set of rules in the essential benefit package, said Michael Tanner, a health care expert at the libertarian Cato Institute. But it’s still private, not government health care.", "Still, Tanner said it might be fair to call the coverage \"government designated health care\" because individuals can’t buy just any type of health insurance, he said. Beruff’s spokesperson echoed this argument.", "Our ruling", "Beruff said Washington politicians are \"already forcing you to buy government health care.\"", "His statement makes a sweeping generalization, but there is some truth to the \"forcing\" part. The individual mandate incentivizes individuals to have health care or face a tax penalty. Of course, the choice is still theirs.", "The bigger problem is Beruff’s use of \"government health care.\" This talking point was flawed around the law’s passage six years ago, and it’s no more accurate now. Just as before, the country’s health care system largely depends on the free market.", "We rate the statement Mostly False.", "https://www.sharethefacts.co/share/7b94aa27-a11f-4e36-84db-354ba5d567b8", "Email interview, Ben Sommers, Assistant Professor of Health Policy & Economics at the Harvard T.H. Chan School of Public Health, July 6, 2016", "Email interview, Bowen Garrett, Senior Fellow at The Urban Institute for the Health Policy Center, July 6, 2016", "Email Interview with Timothy Jost, professor at the Washington and Lee University School of Law, July 6, 2016", "Interview with Gail Wilensky, former director of Centers for Medicare and Medicaid, July 11, 2016", "Email interview, Michael Tanner, senior fellow at the Cato Institute, July 8, 2016", "Email interview, Chris Hartline, Beruff spokesperson, July 6, 2016", "Youtube, \"Clean House,\" July 6, 2016", "PolitiFact, \"PolitiFact's Lie of the Year: 'A government takeover of health care',\" Dec. 16, 2016", "PolitiFact, \"A look back at Lie of the Year,\" Dec. 21, 2015", "PunditFact, \"Charles Krauthammer: Anyone can get out of individual mandate by claiming hardship without explanation,\" April 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]