["Michigan Gov. Gretchen Whitmer has taken aggressive steps to slow the spread of COVID-19. While polls show wide support for her response, she has faced a fierce backlash from some Michiganders who say the restrictions in the statewide stay-at-home order violate their constitutional rights.", "Whitmer, who extended the order on April 24 and slightly loosened some of the regulations, has said that the restrictions are necessary to protect public safety and that they’re helping to slow the spread of the virus.", "But we recently came across a post on Facebook that’s putting words in her mouth.", "The post, which was shared on April 13, reads: \"Michigan Governor says ‘Now is not the time to live by the Constitution, it’s time to put that Damn thing in a shredder’!!!\"", "Some commenters believed she said it; others asked for proof.", "We’re here to tell you: She didn’t.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "There’s no evidence that Whitmer made this comment.", "A search for the quote in news databases, as well as in transcripts of Whitmer’s recent appearances, interviews and statements, comes up short.", "Whitmer’s office also told us the statement isn’t legitimate.", "\"This is completely false information,\" a spokesperson wrote in an email. \"Posts like these are being spread across social media platforms to create rumors and fear.\"", "This quote is bogus and only exists in unsourced social media posts. We rate it Pants on Fire!", "Facebook post, April 13, 2020", "NBC, Michigan Gov. Whitmer faces fierce backlash over strict stay-at-home order, April 14, 2020", "Detroit Regional Chamber, Detroit Regional Chamber Releases Findings From Statewide COVID-19 Impact Poll, April 19, 2020", "Michigan.gov, Executive Order 2020-59 (COVID-19), April 24, 2020", "Nexis, database search, Accessed April 29, 2020", "Rev.com, Whitmer transcripts, Accessed April 29, 2020", "Email interview, Chelsea Lewis Deputy Press Secretary for Gov. Gretchen Whitmer, April 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]