["By Angelo Fichera", "Posted on December 3, 2018", "The Centers for Disease Control and Prevention is not flying sick migrants from the caravan into the country, as a story that originated on a self-proclaimed “alt-news” website claims.", "A viral story shared on social media falsely purports that the federal Centers for Disease Control and Prevention is “flying diseased caravan migrants into U.S. for medical treatment.”", "The story on the website Right of the Right claims that “a plane registered to the Center for Disease Control landed in San Diego to pick up diseased migrants at the border to fly them to Georgia where they will receive medical care paid for by the U.S. taxpayers.”", "The CDC rejected that account.", "“No such operation has taken place,” Benjamin Haynes, a spokesman with the agency’s Infectious Disease Media Team, told us in an email.", "Thousands of immigrants part of the so-called caravan — many from Central America and seeking asylum — are currently in Tijuana, Mexico, near the U.S. border.", "The story accurately refers to a specific flight that did indeed travel from San Diego, California, to Fort Benning, Georgia, on Nov. 27, according to the flight-tracking website FlightAware.com. But Federal Aviation Administration records show the aircraft, a small jet, is not “registered to the Center for Disease Control” — but to the Georgia-based Phoenix Air Group.", "The pilot of that flight, Randy Davis — who is also senior vice president and general counsel at Phoenix Air — told FactCheck.org in a phone interview that the trip was a routine military transport mission. He flew a serviceman from Marine Corps Air Station Miramar to Fort Benning.", "“That’s part of a government contract to move wounded warriors,” he said. “We do this every day.”", "Phoenix Air does also have the capability to transport individuals with infectious diseases — a service the company provided to the government during the Ebola outbreak in 2014.", "But Davis said Phoenix Air does not have a current contract with the CDC. Also, he added, the photo used in the story — seen in a 2014 Washington Times story about the transportation of Ebola patients — shows one of Phoenix Air’s large Gulfstream aircrafts, not the Learjet used in the flight last week.", "The false story largely republished a portion of a post on a self-proclaimed “alt news” website called rense.com. The post has all the makings of a conspiracy theory, telling, for example, of a “classified program” in which the “government has been flying in dangerously ill illegals into the US for s (sic) long time…most especially from Africa.”", "The Right of the Right story garnered thousands of shares on Facebook.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“CDC Caught Flying Diseased Caravan Migrants Into U.S. for Medical Treatment.” Right of the Right. 28 Nov 2018.", "Davis, Randy. Senior vice president and general counsel, Phoenix Air Group. Phone interview with FactCheck.org. 30 Nov 2018.", "FAA Registry | N-Number Inquiry. Federal Aviation Administration. Accessed 30 Nov 2018.", "Ford, Dana. “Ebola Air? Inside the plane that flies Ebola patients.” CNN. 18 Mar 2015.", "Haynes, Benjamin. Spokesman, Centers for Disease Control and Prevention. Email sent to FactCheck.org. 30 Nov 2018.", "“N71PG Live Flight Tracking and History.” FlightAware.com. Accessed 30 Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]