["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "First, incumbent Mark Sharpe sent out a mailer saying he cut property taxes by 17 percent, making the case that his fiscal conservatism is a top reason he should be returned to the Hillsborough County Commission in these trying times.", "Oh, no he didn’t, challenger Josh Burgin shot back in a flier of his own. It was the first of at least four mail pieces that carried the teaser: \"Voter Fraud Alert.\" Property taxes are actually \"18 percent higher than when (Sharpe) first took office,\" said Burgin, who is seeking to unseat Sharpe in the at-large District 7 Republican primary.", "Awesome, we thought. Two politicians vying for the same seat making wildly opposing claims. This is why PolitiFact Florida exists!", "We looked at Sharpe first, and ruled that his claim was Barely True.", "Now we turn to Burgin’s claim, first calling him to ask him how he derived his figures. He sent us the numbers he used – the overall property tax revenue figures for each of the years Sharpe has been in office since 2004.", "We confirmed the numbers were accurate using Hillsborough County budget documents. In 2004, Hillsborough County collected $553.4 million in property taxes. This year, the number is projected to be $659.8 million.", "That’s actually a 19.2 percent increase. So Burgin was being cautious, gentle even, right?", "There’s just one significant problem with his calculation. And there’s another big asterisk.", "The county prepares its budget books and calculates its revenues and expenditures by fiscal year. And the fiscal year doesn’t mirror the calendar year.", "Fiscal year 2004 covers the period from Oct. 1, 2003 to Sept. 30, 2004. Sharpe first took office in November 2004. To calculate changes in tax revenue or tax rates involving Sharpe, the proper base year would be fiscal year 2005. It was not until September 2005 that Sharpe cast his first budgetary votes, setting property tax rates for fiscal year 2006.", "This is indeed significant because, while this may be hard to remember with property values now plummeting, home and business values were soaring during Sharpe’s first years in office. From fiscal year 2004 to fiscal year 2005, property tax revenues jumped from $553.4 million to $610.8 million.", "With fiscal year 2005 as the base year, that means overall county property tax revenue has increased by nearly 8 percent during Sharpe’s tenure. Burgin claimed a tax increase of well more than double that – a gross exaggeration.", "That one year could make such a difference is a reflection of how overheated the real estate market was in the middle part of the decade. We can illustrate the phenomenon in reverse now, with property values plummeting.", "Sharpe has voted on next year’s tentative budget. If the tax rate approved so far holds, county budget officials project another nearly $74 million drop in property tax revenue. By that time, tax receipts will have fallen 4 percent below what they were when Sharpe took office. That’s right: Up by 8 percent this year, down by 4 percent next year.", "Now for the other asterisk to Burgin’s calculation. Property tax revenues are not a perfect measure of how taxes increased or decreased. That’s because the revenue includes property taxes collected from new construction. Owners of those properties may be paying more in taxes, but it’s a reflection of, say, their home sitting on what a year or two earlier may have been an orange grove.", "Take new construction out of the mix, particularly during the heady building days of Sharpe’s early tenure, and the alleged tax increase is something less than 8 percent, potentially much lower. Even during the anemic market of the current fiscal year, when property values are dropping across Hillsborough County, a projected $1.2 billion in new construction is expected.", "Burgin knows, or should know, his way around a budget book. He spent part of 2004 and 2005 as an aide to former County Commissioner Brian Blair, who tasked him with just these sorts of exercises.", "Fraud is a serious charge to level at anyone, even though some politicians tends to toss the word at opponents rather casually. Burgin has done it at least four times so far this campaign.", "But before accusing someone of an intentional perversion of the truth, it’s probably good to double- and triple-check the basis of your claim. We have no way of knowing if Burgin’s claim was an intentional distortion or an innocent miscalculation.", "Either way, we find this statement to be False.", "\"Voter Fraud Alert\" mailer from Josh Burgin", "County Administrator’s recommended budget, Fiscal Year 2007, pages 58-59.", "County Administrator’s recommended budget, Fiscal Year 2011, pages 84-85", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]