["By Saranac Hale Spencer", "Posted on November 10, 2017", "Q: Has the U.S. Supreme Court issued a warrant for the arrest of one of Barack Obama’s treasury secretaries?", "A: No. The person named in a fictional story doesn’t even exist.", "The U.S. Supreme Court currently has 50 cases on the docket for the term that began in October. None of them directly concerns the Treasury Department.", "But two deceptive websites have fabricated stories claiming that the nation’s highest court is hearing a case about federal funds that were mishandled by the Treasury Department during the Obama administration.", "A story originally published by a website called Freedum Junkshun claims that the Supreme Court has issued “its first bench warrant ever” for the arrest of a man formerly in charge of Obama’s Treasury Department. Facebook users flagged it as potentially false news.", "In addition, a subsequent story from a related website called America’s Last Line of Defense says that the same man has since died under “suspicious circumstances.”", "Both stories are attributed to the same writer with the name Flagg Eagleton, and both websites describe their work as satirical fiction. Other websites, though, have republished the stories without any kind of disclaimer.", "According to the story posted on freedumjunkshun.com, Supreme Court Justices Clarence Thomas and Neil Gorsuch said that they can’t rule on the case until they hear the “in-person testimony of the man in charge at the time, Donald M. Allard.”", "However, no one by that name has ever been secretary of the Treasury Department. The two secretaries who served under Obama were Timothy Geithner and Jacob Lew.", "The Supreme Court also doesn’t hear testimony. It’s an appeals court that reviews the rulings of lower courts and makes its decisions based on its interpretation of the law and the arguments made by lawyers.", "And the follow-up story from thelastlineofdefense.org reports that Allard recently died under “suspicious circumstances” in Washington, D.C. But the photo posted with the story is actually from a 2011 shooting at a motel in Orange County, California.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Supreme Court of the United States. October Term 2017 case list. Supremecourt.gov. Accessed 8 Nov 2017.", "“BREAKING: Supreme Court Issues Its First Bench Warrant Ever.” Freedumjunkshun.com. 6 Nov 2017.", "“BREAKING: Obama Treasury Official Under Sunpoena From SCOTUS Dies Under ‘Suspicious Circumstances.’” Thelastlineofdefense.org. 6 Nov 2017.", "U.S. Department of the Treasury. Secretaries of the Treasury. Treasury.gov. Accessed 8 Nov 2017.", "Emery, Sean. “1 dead, 2 wounded in Cypress shootings.” Orange County Register. 25 Feb 2011.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]