["About this rating", "A Federal Bureau of Investigation raid on the New York offices of President Donald Trump's attorney, Michael Cohen, in April 2018 prompted scrutiny, intrigue, and no small measure of speculation about the lawyer's colorful persona and history. As well, advertising signs and placards began appearing on the New York subway system which appeared at first glance to be advertisements placed by Cohen and promoting himself as \"The Fixer\":", "Sometimes I really love my city #MichaelCohen #NYCSubway pic.twitter.com/sWhqymJbZG", "— sarah apfel (@apfel_sarah) April 20, 2018", "Although the signs themselves are real and not the product of digital manipulation, they are not authentic promotional material for Cohen. The fake ads are the product of a prankster's\nwry take on Cohen's widespread reputation as a loyal and discreet attorney for Donald Trump — and who has also represented Fox News host Sean Hannity, while his own business dealings are the subject of an ongoing federal investigation.", "The web site and phone number listed on the advertising posters are both functional. Calls to \"The Fixer\" are greeted with a voicemail message that states: \"Got problems? You've reached Michael Cohen, The Fixer. Press one if you need a hush payment made. Press two if you need someone threatened with physical violence. Press three if you are the President of the United States. Otherwise, stay on the line and please leave a message.\"", "The person behind the ads spoke anonymously to the New York City news web site The Gothamist, indicating an intent to put up more \"Fixer\" posters around the city and explaining the rationale for targeting Cohen: \"It's just crazy that the PRESIDENT OF THE UNITED STATES has this guy to be his lawyer. Michael Cohen just seems like the type of lawyer who would have a shitty subway ad. It's 2018, so I wouldn't be surprised if he steals the concept and starts posting these exact same subway ad in earnest.\"", "Cohen admitted in February 2018 that he had paid $130,000 to Stephanie Clifford, an adult film star also known as Stormy Daniels, who claims to have had an affair with Trump in 2006. Clifford has also claimed that in 2011, someone associated with Donald Trump threatened her with violence if she did not remain silent about the alleged affair, prompting a denial from Cohen's own attorney that his client was involved in any intimidation of Clifford.", "Carlson, Jen.  \"Michael Cohen Gets the Crappy Subway Ads He Deserves.\"\r\n    The Gothamist.  20 April 2018.", "Apuzzo, Matt.   \"F.B.I. Raids Office of Trump's Longtime Lawyer Michael Cohen; Trump Calls it 'Disgraceful.'\"\r\n    The New York Times.  9 April 2018.", "Haberman, Maggie .  \"Michael D. Cohen, Trump's Longtime Lawyer, Says He Paid Stormy Daniels Out of His Own Pocket.\"\r\n    The New York Times.  13 February 2018.", "Colvin, Jill.   \"White House Disputes Porn Star's Claim She Was Threatened.\"\r\n    Associated Press.  26 March 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]