["The 34-second video was published here on Facebook on July 5, 2020. It has been viewed more than 8,300 times and shared more than 170 times.", "It shows a man putting up a poster featuring a man’s face on a lamp post. A vehicle parked next to the lamp post displays flags for the ruling People's Action Party (PAP). The clip ends as the man appears to place the poster over another poster for the opposition, the Workers' Party (WP).", "Below is a screenshot of the misleading Facebook post:", "The post’s caption states: “Sigh why cannot play fair ..... be gracious to your opponents ... doing underhand stuff to your opponents means you are afraid of them ...Yes ?”", "The post was shared shortly after Singapore dissolved its Parliament on June 23, 2020. A general election was held on July 10, 2020. The PAP retained power in the election, but its support fell sharply, while the opposition made gains, as AFP reported here.", "The video was also shared here, here and here on Facebook with a similar claim.", "The claim is misleading.", "A reverse image search on Google found a longer version of the video published here. The clip is one minute one-second in length.", "This longer video shows the same man eventually hanging the poster for the PAP candidate above the poster for the opposition candidate.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the longer version (R):", "The location of the video is Hougang, located in the North-East Region of Singapore. AFP found the location on Google Maps here.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the image on Google Street View (R):", "The two candidates vying for the constituency were PAP’s Lee Hong Chuang and WP’s Dennis Tan Lip Fong. Tan won with 61.19% of the votes, according to the Elections Department Singapore (ELD) here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]