["The reports are headlined: “Horrifying! Male OFW in Saudi, castrated first then raped by 9 Arabs. 00:32. Sensitive to watch!”", "OFW is an abbreviation for Overseas Filipino Worker.", "Reports about mistreatment or abuse of the Philippines' millions of overseas workers -- whose remittances comprise some 10 percent  of gross domestic product -- are a highly sensitive topic.", "The false sexual abuse reports exploit widespread interest in the treatment of migrant workers to push people into clicking on advertisements.", "When posted on Facebook, the reports use this man’s photograph:", "The image is of a Filipino worker, Aljun Andrade, who was beaten up in Saudi Arabia's capital Riyadh in June 2018.", "In a report about the beating by Philippine broadcaster GMA, the image of Andrade used in the false reports can be seen nine seconds into the clip.", "Andrade’s sister, Charissa Andrade Fernandez, told AFP on September 12 that her brother had not been castrated and raped.", "“That’s not true, it’s all fake news,” she said in Filipino.", "“I saw the posts but I just ignore them because I know what’s true about my brother”.", "The false reports also include footage which a reverse image search shows was taken from another GMA news report about a woman in the Philippines who allegedly castrated her husband in 2013.", "The multiple reports have been shared over 50,000 times to Facebook pages with millions of followers.", "They are clickbait for advertisements. Below is a screenshot of one of the reports, which leads to an advert for a sports live-streaming service.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]