["About this rating", "A customer published claims about finding worms in a package Little Debbie Oatmeal Creme Pies to multiple news outlets' Facebook pages.", "The customer has so far refused to allow the company to test a sample of the supposedly contaminated product.", "Whether the product was genuinely contaminated or purposely tampered with.", "On 14 June 2016 Facebook user Michael Steven Young shared a video to multiple local news outlets' pages, claiming it that depicted his discovery of Little Debbie brand Oatmeal Creme Pies contaminated with live worms:", "Videos of such nature typically spread quickly online, and by 21 June 2016 one social media post of it had racked up tens of thousands of shares. However, commenters remarking on the video were overwhelmingly skeptical, with many positing that the packaging appeared to have been opened and resealed (perhaps with a lighter):", "I work for Little Debbie and can tell you this has to be a very old cake our cakes that come off the line do not look like that. If you have a problem them call them directly and stop slamming a great company.", "I watched this several times and noticed the sealing of the package is different on both ends. One end has ridges and the other doesn't. I'm thinking this was opened then re sealed just for publicity. This is just my opinion.", "The seal looks weird. One end was ridges and the other end looked like it had a clean cut like scissors and sealed back. Not taking up for little Debbie because I don't eat them but something is not right.", "Someone has opened that up and resealed it. Both ends are the same when they come out of the plant. This one has been opened and sealed back up.", "I can tell you right now as an avid Little Debbie snack cake eater, the Oatmeal Creme Pie packaging is not that thick and doesn't make that much noise. Stop buying off brand Creme pies.", "In a separate post made by a different user to Little Debbie's Facebook page, a commenter asserted that Young had \"refused to provide a SAMPLE, not the whole thing, but a sample\" of the purportedly contaminated product to the company for inspection. (We were unable to locate the source of that claim.)", "One of the news outlets approached by Young covered his claims but undertook no additional verification and took them at face value:", "A Tuscaloosa man discovered worms in an unopened oatmeal creme pie.", "Michael Young posted the video on Facebook yesterday which has been viewed over 180,000 times.", "Young said he’d reached out to Little Debbie representatives but was unsatisfied with their response and decided to make his discovery public.", "If you’re squeamish or like me, gag easily, don’t watch the video unless you love worms on your snack cakes.", "Missing from that report was any information about the \"response\" with which Young was unsatisfied or details of communication between him and the brand. We contacted Little Debbie for those absent details and obtained answers to many questionable aspects of the story.", "The representative with whom we spoke stated that the company had dispatched a representative to Young's home shortly after his Little Debbie video began circulating on Facebook. According to Little Debbie, Young was initially reluctant to allow the representative to inspect the package and refused to provide a sample of the product for testing. The rep who briefly inspected the packaging observed what appeared to be a small hole in the corner of the package, and the company believed the depicted insect was a pantry moth. As many Facebook commenters also opined, the representative noted that the \"crackle\" of the packaging sounded atypical.", "The individual to whom we spoke explained that the cakes are baked at 350 degrees, rendering them \"essentially sterile,\" and they're immediately factory-sealed after baking with a puff of air to ensure the integrity of the seal is detectable to consumers. The representative was able to determine that the package in question was manufactured on or around 27 May 2016, and that Young claimed to have purchased it two weeks prior. He opined that given the lifecycle of pantry moths (30 to 300 days), the claim as presented was scientifically implausible. However, the processing procedures cited and timeline suggested that if a pantry moth were introduced to the package, it was unlikely a factory-end issue. It remained possible that the package was contaminated in a grocery store or home environment, but unlikely contamination occurred before it was sealed and shipped to a retail outlet.", "Madison, Kimberly.   \"Tuscaloosa Man Finds Worms in Oatmeal Creme Pie.\"\r\n    95.3 The Bear.   15 June 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]