["President Donald Trump has questioned why undocumented immigrants who came to the United States as children should be deported, a sharp departure from the campaign when he advocated for the removal of all who were violating immigration laws.", "Trump’s administration is phasing out Deferred Action for Childhood Arrivals (DACA), an Obama-era program that shields young undocumented immigrants from deportation.", "At the same time, Trump wants Congress to pass a permanent solution for the so-called \"Dreamers,\" saying the idea has very high support among Americans. (DACA recipients are commonly called \"Dreamers.\")", "\"Look, 92 percent of the people agree on DACA, but what we want is we want very, very powerful border security,\" Trump said Sept. 14 before traveling from Washington to meet with Floridians affected by Hurricane Irma. He said Republican congressional leaders were also on board.", "Later in Florida, he said they were not looking at amnesty or citizenship, but \"looking at allowing people to stay here.\"", "If and when funding for Trump’s border wall will come or what will be part of a DACA deal is still unclear.", "For now, we were curious about Trump’s claim that 92 percent of people agree on a solution for DACA recipients. We did not find a poll showing support that high, but several polls do show that the majority of Americans want a favorable outcome for Dreamers.", "The White House declined to comment for this fact-check.", "We found several polls that asked about DACA and showed majority support for not deporting Dreamers. But we did not find nearly universal support that Trump described.", "• A Morning Consult and Politico poll conducted between Sept. 7-11, after the Trump administration announced it was eliminating DACA, found that of 1,976 registered voters polled, 45 percent said it was the wrong thing to do; 35 percent said it was the right thing to do; 20 percent did not know or had no opinion.", "Asked about the issue in a different way — \"When it comes to legislation regarding Dreamers, which of the following would you most like Congress to pass?\" — 54 percent of respondents said they would want legislation that allowed Dreamers to stay and become citizens if they met certain requirements; 19 percent favored legislation that would allow them to stay legally but not become citizens, if they met certain requirements; 12 percent wanted legislation that removes or deports them; and 15 percent did not know or had no opinion.", "So, for this second question, 73 percent favored legislation that would protect Dreamers from deportation.", "A previous Morning Consult and Politico poll, conducted from April 20-24 asked about 2,000 registered voters what they thought was the best way to handle Dreamers. Fifty-six percent said they should be allowed to stay and become citizens if they met certain requirements, and 22 percent favored allowing them to stay and become legal residents, but not citizens, if they met certain requirements. Overall, 78 percent definitely did not want Dreamers to be deported.", "• An NBC News and SurveyMonkey poll, conducted online from August 24-29 among a national sample of 10,129 adults, found 64 percent support for DACA.", "• A Sept. 3-5 poll from The Economist and YouGov of 1,500 U.S. adults also found that 55 percent of responders somewhat or strongly supported DACA, though support for the program was lower among Trump voters and Republicans.", "Several polling and public opinion experts we reached out to say they were not aware of any recent poll showing a 92 percent support for DACA, but that a solid majority does seem to favor the program.", "Trump said \"92 percent of the people agree on DACA.\"", "We found several polls in which a majority of people said they supported DACA or favored legislation that would allow Dreamers to stay in the United States. But the level of support was not as high as 92 percent.", "Overall, we rate Trump’s statement Half True.", "Twitter, @MSNBC tweet, Sept. 14, 2017", "NBC News, Poll: Most Oppose Trump's Pardon for Ex-Sheriff Arpaio, Booting 'Dreamers', Aug. 31, 2017", "YouGov, Most Americans support DACA - but Trump's base opposes, The Economist/YouGov poll, Sept. 5, 2017", "Morning Consult and Politico poll, Morning Consult National Tracking Poll #170409, April 20-24, 2017", "Politico, Poll: Majority wants Congress to establish path to citizenship for DACA recipients, Sept. 13, 2017", "Morning Consult and Politico, National Tracking Poll conducted Sept. 7-11, 2017", "CNN, Trump, Dems move closer to deal on DACA, Sept. 2017", "PolitiFact, Trump-O-Meter: Terminate Barack Obama's immigration executive orders 'immediately', last updated Sept. 5, 2017", "Email interview, Karlyn Bowman, senior fellow at American Enterprise Institute, Sept. 15, 2017", "Email interview, Steven S. Smith, political science professor and director of Weidenbaum Center on the Economy, Government, and Public Policy at Washington University, Sept. 15, 2017", "Email interview, Kathleen Frankovic, expert in public opinion polling, Sept. 15, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]