["About this rating", "In November 2019, shortly after former New York City Mayor Michael Bloomberg announced that he was entering the 2020 U.S. presidential race, a photograph started to circulate on social media that supposedly showed him with Ghislaine Maxwell, a British socialite and close associate of deceased convicted pedophile Jeffrey Epstein:", "This is a genuine photograph of Bloomberg with Maxwell (right). It was taken on Oct. 1, 2013, at Tamara Mellon's \"In My Shoes A Memoir\" celebration at the Four Seasons Restaurant in New York City by photographer Leandro Justen.", "This image was widely circulated in November 2019 along with the insinuation that Bloomberg was somehow involved with Epstein's illicit activities. Maxwell has been accused of procuring young girls for Epstein. As of this writing, however, she has not been charged with any crimes in relation to the Epstein case.", "Maxwell is a British socialite who has been photographed with countless public figures, such as actors Julianna Margulies and Kyle Maclachlan, reporters Barbara Walters and Piers Morgan, Tesla CEO Elon Musk, and Presidents Donald Trump and Bill Clinton.", "Bloomberg, too, is a well-known public figure who frequents events with the rich and famous. It isn't all that surprising that these two would meet at some point during an event in New York City, and certainly isn't proof that these two were somehow in cahoots to aid Epstein's criminal activities.", "While conspiracy theorists may point to this picture and make vague claims attempting to connect Bloomberg to Epstein, the only thing we can really glean is that two public figures were once photographed together at a public event.", "Merica, Dan.   \"Michael Bloomberg is the Latest 2020 Democratic Hopeful.\"\r\n    CNN.   24 November 2019.", "Fisher, Marc.   \"Epstein’s Accusers Call Her His Protector and Procurer. Is Ghislaine Maxwell Now Prosecutors’ Target?\"\r\n    The Washington Post.   11 August 2019.", "Mariotti, Renato.   \"Why Charging Jeffrey Epstein's Alleged Accomplice is Going to be Difficult.\"\r\n    Politico Magazine.   20 August 2019.", "Bekiempis, Victoria.   \"Ghislaine Maxwell is at the Center of the Epstein Controversy, but She's in Hiding.\"\r\n    The Guardian.   18 November 2019 .", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]