["About this rating", "On 1 April 2016, the Weather Channel posted an article on their Medium page announcing that they had implemented a new policy under which they would be using the Celsius temperature scale exclusively and dropping any references to the Fahrenheit scale used in the U.S. (and elsewhere):", "After much debate, The Weather Channel is proud to announce that, effective immediately, the television network will be using the Celsius scale to report temperatures. This move comes at the expense of the Fahrenheit scale, which has been the exclusive temperature scale for The Weather Channel since its inception in 1982.", "Outsiders have speculated that the move is part of an effort to make The Weather Channel a more attractive weather provider to countries around the world, but a company spokesperson says this simply isn't true.", "\"While we always want to be inclusive of the global world that we all live in these days, the simple truth is that, after much internal deliberation, we've determined that it just doesn't make sense for water to freeze at 32°. People understand something freezing at 0°,\" the spokesperson said.", "While the above-quoted article ended with an obvious reference to April Fools' Day — \"That being said, we would like to inform you, yes you, the one reading this article, to refer to your calendar if you aren't aware of the important holiday taking place today\" — many readers were fooled by the faux announcement, most likely because they didn't read the full article or encountered it via a social media post and didn't click through to the underlying Weather Channel Medium page:", "You can view a round-up of more online 2016 April Fools' Day pranks here.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]