["The three-minute nine-second video was posted on December 6, 2020, on Facebook here, where it has been viewed 91,000 times.", "The post's Indonesian-language caption translates to English as: “Glory be to God.. the recitation of holy verses of the Koran.. A native Papuan mountain boy Walesi district, Wamena, Papua province.. May people who share this video be blessed by God.. Amen, O God the Responder to prayer.”", "Walesi is a district in Wamena regency, in Indonesia’s Papua province.", "Christianity is the predominant religion in Indonesia’s easternmost region, Papua, which comprises Papua and West Papua provinces.", "Indonesian news outlet Tribun Timur posted the video on YouTube on December 12, 2020, with a headline: “Viral, This Boy From Papua Beautifully Recites the Koran.” The clip has been viewed more than 585,000 times.", "The video also appeared with a similar claim on Facebook here, here and here, and on Instagram here.", "The claim, however, is false.", "A Google reverse image search using video keyframes extracted with digital verification tool InVID-WeVerify, followed by a keyword search, found this clip posted by Zimbabwean Muslim preacher and scholar Mufti Ismail Menk. It was shared on his official Instagram account on December 6, 2020.", "The first three paragraphs of the caption reads: “This is young Bakari from a village in Pemba Islands in Tanzania. I posted his recital recently on my YouTube channel.", "“This particular verse is hair raising. The way he reads it is superb. Subhanallah. .", "“It was recorded by a brother from Water Fall Charity UK, who was impressed by his recitation. The video has since gone viral.”", "A post shared by Mufti Menk (@muftimenkofficial)", "Menk also uploaded the same video on his official YouTube channel on December 3, 2020, here.", "Water Fall, a UK-registered charity focusing on water crisis in Africa and India, posted the same video on its Instagram account on December 5, 2020. In the video caption, the organisation says, “One of our students on Pemba Island. Gone viral via @muftimenkofficial”.", "A post shared by Water Fall Charity (@waterfallcharity)", "Below is a screenshot comparison of the video in the misleading post (L) and Water Fall charity’s video (R):", "Pemba Island is part of Zanzibar, Tanzania’s semi-autonomous Indian Ocean archipelago, where 99 percent of the population is Muslim.", "AFP previously debunked a false claim about “a Koran reciter from Indonesia’s Papua region”, in which the man featured in the video is actually a Koran reciter from Tanzania.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]