["About this rating", "We received this email in the Snopes inbox in 2005:", "CANBERRA AUSTRALIA: Muslims who want to live under Islamic Sharia law were told on Wednesday to get out of Australia, as the government targeted radicals in a bid to head off potential terror attacks. A day after a group of mainstream Muslim leaders pledged loyalty to Australia at a special meeting with Prime Minister John Howard, he and his ministers made it clear that extremists would face a crackdown.", "Treasurer Peter Costello, seen as heir apparent to Howard, hinted that some radical clerics could be asked to leave the country if they did not accept that australia was a secular state and its laws were made by parliament. \"If those are not your values, if you want a country which has Sharia law or a theocratic state, then Australia is not for you,\" he said on national television. \"I'd be saying to clerics who are teaching that there are two laws governing people in Australia, one the Australian law and another the Islamic law, that is false.", "If you can't agree with parliamentary law, independent courts, democracy, and would prefer Sharia law and have the opportunity to go to other country which practices it, perhaps, then, that's a better option,\" Costello said. Asked whether he meant radical clerics would be forced to leave, he said those with dual citizenship could possibly be asked to move to the other country.", "Education Minister Brendan Nelson later told reporters that Muslims who did not want to accept local values should \"clear off\". \"Basically, people who don't want to be Australians, and they don't want to live by Australian values and understand them, well then they can basically clear off,\" he said. Separately, Howard angered some Australian Muslims on Wednesday by saying he supported spy agencies monitoring the nation's mosques.", "Variations:   A January 2008 variant combined elements of this piece with a 2001 editorial about immigrants written by a U.S. Air Force veteran, creating the misleading impression that the hybrid version reflected a speech given by Australian prime minister John Howard. A February 2009 variant attributed the entire combined version to Kevin Rudd, who succeeded John Howard as Australia's prime minister in 2007, and a 2010 variant attributed elements of both to Julia Gillard, who succeeded Kevin Rudd in June 2010.", "Origins:   The July 2005 London Tube bombings raised domestic terrorism concerns in countries with large immigrant Muslim populations, such as Australia. The following month, Australian prime minister John Howard held a two-hour summit with moderate Muslim leaders in Canberra to work on a national strategy for addressing intolerance and the promotion of violence, during which issues such as the curriculum of Islamic schools and suggested measures for vetting imams were discussed. The Christian Science Monitor noted of the event:", "As other governments have found, however, deciding who represents the Muslim community can be a delicate matter. Large sections of the youth, as well as conservative and more critical clerics, have been left out of Howard's summit — meaning some of the government's more aggressive proposals may meet resistance.But the groups who attended the meeting hailed it as a successful first step in an ongoing dialogue.", "\"We determined along with the prime minister that there must be more communication between the government and Islamic schools where it comes to teaching common values like democracy, fairness, tolerance and so on, and radicals will be reacted to, whenever they make inflammatory remarks,\" says Ali Roude, the acting president of the New South Wales Islamic Council.", "\"It's much worse for us now, because 7/7 showed the world that the enemy is to be found within\" instead of 9/11 when the terrorists were all foreigners [said the spokesperson for Lebanese Muslims in Australia]. \"Now they are suspicious of all of us, and it's very serious, but the prime minister is only playing politics.\"", "But some Muslims here have a growing sense that they are being defined within the media by the voices of the extremists and that an intervention by the government and moderate Muslims to counter such elements would be useful.", "\"So far it was OK to do your own thing. But if the media is focusing on the extreme elements, we need to do something about it,\" says Chabaan Omran, a senior member of the Federation of Australian Students and Youth, an organization that gives religious advice and teaching to young people. \"Muslims need to interact more with mainstream Australia.\"", "This might sit well with recent calls from ordinary Australians asking Muslims to assimilate. But Mr. Omran is worried about the connotations of the word \"assimilate,\" and talks more of \"positive integration without undermining our religion.\"", "Prime Minister Howard also publicly announced his intent to have Australian intelligence agencies target mosques and Islamic schools in an effort to \"stamp out homegrown terrorism and extremists\":", "Prime Minister John Howard said on top of trying to promote Australian values in Islamic schools, the Government would monitor what was said in certain schools and mosques to ensure they did not foster terrorism.Asked whether he was prepared to \"get inside\" mosques and schools to ensure there was no support for terrorism, Mr Howard was blunt.", "\"Yes, to the extent necessary,\" Mr Howard told Southern Cross radio.", "\"I have no desire and nor is it the Government's intention to interfere in any way with the freedom or practice of religion.", "\"We have a right to know whether there is, within any section of the Islamic community, a preaching of the virtues of terrorism, whether any comfort or harbour is given to terrorism within that community.\"", "The issue of the integration of Muslims into Australian society prompted controversial remarks by some Australian cabinet ministers, such as this exchange between Treasurer Peter Costello and host Tony Jones on the Lateline television news program on 23 August 2005:", "TONY JONES: Now, over the past 24 hours you've been repeating the notion that migrants, evidently Islamic migrants, who don't like Australia, or Australian values, should think of packing up and moving to another country. Is that a fair assessment?", "PETER COSTELLO: What I've said is that this is a country, which is founded on a democracy. According to our Constitution, we have a secular state. Our laws are made by the Australian Parliament. If those are not your values, if you want a country which has Sharia law or a theocratic state, then Australia is not for you. This is not the kind of country where you would feel comfortable if you were opposed to democracy, parliamentary law, independent courts and so I would say to people who don't feel comfortable with those values there might be other countries where they'd feel more comfortable with their own values or beliefs.", "TONY JONES: It sounds like you're inviting Muslims who don't want to integrate to go to another country. Is it as simple as that?", "PETER COSTELLO: No. I'm saying if you are thinking of coming to Australia, you ought to know what Australian values are.", "TONY JONES: But what about if you're already here and you don't want to integrate?", "PETER COSTELLO: Well, I'll come to that in a moment. But there are some clerics who have been quoted as saying they recognise two laws. They recognise Australian law and Sharia law. There's only one law in Australia, it's the Australian law. For those coming to Australia, I think we ought to be very clear about that. We expect them to recognise only one law and to observe it.", "Now, for those who are born in Australia, I'd make the same point. This is a country which has a Constitution. Under its Constitution, the state is secular. Under its constitution, the law is made by the parliament. Under its Constitution, it's enforced by the judiciary. These are Australian values and they're not going to change and we would expect people, when they come to Australia or if they are born in Australia, to respect those values.", "TONY JONES: I take it that if you're a dual citizen and you have the opportunity to leave and you don't like Australian values, you're encouraging them to go away; is that right?", "PETER COSTELLO: Well, if you can't agree with parliamentary law, independent courts, democracy and would prefer Sharia law and have the opportunity to go to another country which practises it, perhaps then that's a better option.", "TONY JONES: But isn't this the sort of thing you hear in pubs, the meaningless populism you hear on talkback radio? Essentially, the argument is if you don't like it here, you should go back home.", "PETER COSTELLO: No. Essentially, the argument is Australia expects its citizens to abide by core beliefs — democracy, the rule of law, the independent judiciary, independent liberty. You see, Tony, when you come to Australia and you go to take out Australian citizenship you either swear on oath or make an affirmation that you respect Australia's democracy and its values. That's what we ask of people that come to Australia and if they don't, then it's very clear that this is not the country — if they can't live with them — whose values they can't share. Well, there might be another country where their values can be shared.", "TONY JONES: Who exactly are you aiming this at? Are you aiming it at young Muslims who don't want to integrate or are you aiming it at clerics like Sheikh Omran or Abu Bakr both from Melbourne?", "PETER COSTELLO: I'd be saying to clerics who are teaching that there are two laws governing people in Australia, one the Australian law and another the Islamic law, that that is false. It's not the situation in Australia. It's not the situation under our Constitution. There's only one law in Australia. It's the law that's made by the Parliament of Australia and enforced by our courts. There's no second law. There's only one law that applies in Australia and Australia expects its citizens to observe it.", "Likewise, Education minister Dr. Brendan Nelson offered his opinion that those who do not accept and teach Australian values should leave the country:", "Dr. Nelson says those who do not accept and teach Australian values should \"clear off\".One of the recommendations at Prime Minister John Howard's terrorism summit was for Islamic schools to be encouraged to denounce extremism and teach about Australian traditions and culture.", "The Minister says it is important for all groups to be integrated into the Australian community, whatever their religion.", "\"If you want to be an Australian, if you want to raise your children in Australia, we fully expect those children to be taught and to accept Australian values and beliefs,\" he said.", "\"We want them to understand our history and our culture, the extent to which we believe in mateship and giving another person a fair go, and basically if people don't want to support and accept and adopt and teach Australian values then, they should clear off.\"", "The individual statements attributed to Australian government officials included in the e-mail reproduced at the head of this page are thus essentially accurate, but the selectively-quoted excerpts of controversial material from different news stories create the misleading overall impression that Australia enacted a formal policy to force some Muslim groups out of the country. The statements quoted were part of the public debate over an issue that flared briefly in the immediate aftermath of the London Tube bombings, then quietly subsided.", "Subsequent versions of this item have been altered to replace the names of out-of-office politicians with their modern counterparts (e.g., Kevin Rudd for John Howard, Julia Gillard for Kevin Rudd), thereby attributing words and thoughts to people who did not express them.", "Bessonette, Colin.   \"Q & A.\"\r\n   The Atlanta Journal-Constitution.   5 March 2002.", "Branom, Mike.   \"Muslim Woman Cannot Wear Veil in Driver's License Photo.\"\r\n    The Associated Press.   6 June 2003.", "Gutierrez, Pero Ruz.   \"State: Veiled Muslim Woman 'Hypersensitive.'\"\r\n    Orlando Sentinel.   26 June 2002", "Loudermilk, Barry.   \"This Is America. Like It or Leave It.\"\r\n    VietNow National Magazine.", "Nelson, Christian.   \"Who Is Barry Loudermilk, Anyway?\"\r\n    VietNow National Magazine.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]