["About this rating", "A Wisconsin teenager who pleaded guilty to the 2014 stabbing of a classmate because she said she wanted to please the fictional horror character \"Slenderman\" petitioned a Waukesha County court on March 10, 2021, for conditional release from a mental health facility.", "Anissa Weier was one of two girls charged in the near-fatal stabbing of their friend and classmate Payton Leutner. Weier pleaded guilty in August 2017 to attacking Leutner in the woods in Waukesha, along with accomplice Morgan Geyser. All three girls were 12 years old at the time of the 2014 stabbing.", "Leutner was stabbed 19 times by Geyser while Weier cheered Geyser on, according to news reports. Leutner survived — but it was a close call. Injuries to her torso damaged organs and narrowly missed a major artery.", "Although Weier pleaded guilty, a jury determined that Weier was not guilty because she was mentally ill; she was sentenced to live in a mental health facility for up to 25 years.", "At a court hearing on March 10, 2021, Weier, who is now 19, submitted a letter to the court stating that she was \"sorry and deeply regretful for the agony, pain and fear I have caused,\" not just to Leutner but to \"my community as well.\"", "Weier stated that \"I hate my actions May 31, 2014, but through countless hours of therapy, I no longer hate myself for them.\"", "Weier stated she took responsibility for her actions. She also said she was committed to complying with treatment for her mental health issues, and she wanted to demonstrate to others who deal with such struggles that \"this is not the end of who you are, this does not define you,\" and that she wants to \"give reality checks to people who are asking for help.\"", "The judge hasn't ruled on Weier's release but set another court date to consider her request for June 2021, television news station WISN reported.", "WISN, which attended the March court hearing, reported that family members of both Weier and Leutner were in attendance but did not comment.", "Both Geyser and Weier stated during investigations and trials that they had stabbed Leutner in an attempt to please Slenderman, and they believed if they had not done so, the character would have harmed them and their families. Geyser was sentenced to 40 years in a mental health facility. Her February 2021 appeal to have her case reevaluated by the Wisconsin Supreme Court was denied.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]