["About this rating", "A set of gruesome photographs supposedly showing the aftermath of a \"pico jackfruit snake\" bite is frequently shared online. We'll be posting these photographs below. As they show a severe hand injury, this article may not suitable for all viewers.", "The photographs first went viral in August 2017 after they were posted to the Facebook group Faculty of Veterinary Medicine in New York. The first photograph in the set shows what appears to be a small cut on a person's thumb. Subsequent photographs show the injury worsening, due to the snake's venomous bite, until eventually the thumb is amputated.", "Again, the following photographs may not be suitable for all viewers:", "We haven't been able to uncover too many specifics about these photographs, such as where they were taken or the identity of the snake-bit victim. When these images first started circulating on Facebook in 2017 (the original post has since been deleted), the snake was identified as a \"sharp-nosed viper,\" not a \"pico jackfruit snake.\"", "In fact, we found no snake by the latter's name. It likely refers to a bushmaster snake, another genus of venomous pit-vipers, which is known by a variety of names across South America, such as the pineapple snake, the silent rattlesnake, and the stinging jackfruit.", "Regardless of the specific species of snake, these photographs appear to provide a genuine look at the painful aftermath of a venomous snakebite. News.com.au talked to Brian Fry, an associate professor in the school of biological sciences at the University of Queensland, when these images first went viral:", "“That type of snake [Sharp-nosed viper] has a venom that is extremely tissue destroying,” Dr Fry told news.com.au.", "“The reason for this is that they kill their prey by haemorrhagic shock, where some parts of the venom damage the blood vessel walls, while other parts destroy the ability of the blood to clot, leading to a state of massive internal bleeding in a prey animal.”", "As Associate Professor in the School of Biological Sciences at the University of Queensland, Dr Fry said because it is a Chinese snake; antivenom for a bite like this might be hard to come by in remote areas.", "“If it was in a private collection somewhere, they probably didn’t have it and likely none of the nearby zoos would either,” he explained.", "“Thus, they’d have to suffer through the full effects.”", "While we haven't been able to find much information about this specific set of photographs, we have found other snake-bite cases that resulted in similar injuries. A 2015 article from the BBC explained some of the science behind deadly venomous snake bites:", "Snake venom is made up of several hundred proteins which all have a slightly different toxic effect on the human body. One snake's poison may not be like another's, even if they are from the same species.", "But, on the whole, there are two main ways snakes make us suffer — by attacking the circulatory system (ie. the blood) and/or the nervous system.", "Haemotoxic venom goes for the bloodstream. It can trigger lots of tiny blood clots and then when the venom punches holes in blood vessels causing them to leak, there is nothing left to stem the flow and the patient bleeds to death.", "Other venoms can increase blood pressure, decrease blood pressure, prevent bleeding or create it. They are all bad news.", "Neurotoxic venom tends to act more quickly, attacking the nervous system and stopping nerve signals getting through to the muscles.", "This means paralysis, starting at the head, moving down the body until, if untreated, the diaphragm is paralysed and the patient can't breathe. A classic sign of this is ptosis, when people can't keep their eyes open.", "Around the area of the bite, necrosis can set in. That happens when the venom destroys nearby muscles, tissues and cells. Long-term, this can lead to amputations, the loss of the use of a limb or the need for multiple skin grafts.", "In sum, the above photographs most likely show the gruesome aftermath of a snake bite, but because we were unable to uncover specific details about the pictures, we've rated this claim \"Unproven.\"", "Brown, Vanessa.   \"Horror Snake Bite Causes Victim’s Thumb to Turn Black Before Being Amputated\"\r\n    News.com.au.   15 August 2017.", "Weisberger, Mindy.   \"What Should You Do If You're Bitten by a Venomous Snake?\"\r\n    Live Science.   2 June 2019.", "BBC.   \"The amazing science behind fatal snake bites.\"\r\n    13 September 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]