["The photos were published here in a Facebook post on October 7, 2019.", "They were published by a page with more than 232,000 followers.", "The misleading post has been shared more than 800 times.", "Below is the screenshot of the misleading Facebook post:", "Text in English superimposed above the images states: “These are the unsung heroes of Hong Kong. Night after night, they put our streets back in order cleaning up the city after a day of chaos. There's nowhere in the world they work as efficiently as these 'cleaner bees' in Hong Kong. They have my utmost respect (heart emoji)”.", "All three photos show cleaners in Hong Kong; the top one shows a group taking a break; the bottom left photo shows a group sweeping a street in the Causeway Bay shopping district; the bottom right image shows a single cleaner with rubbish bags.", "The post’s traditional Chinese language caption translates to English as: “After the future pillar of our society have fun causing damage, our ‘useless old people’ are left to clean up the mess that is Hong Kong.”", "The three photos were also published either separately or together on Facebook here, here, here and here; on Weibo here, here and here; and on an online forum here alongside a similar claim.", "The claim is false; reverse image searches on Google found all three photos appeared online before June 2019, when mass pro-democracy demonstrations broke out in Hong Kong.", "The photo of a group of cleaners taking a break was included in this article published by Hong Kong newspaper The South China Morning Post (SCMP) on January 10, 2019.", "The photo is credited to Felix Wong, a photographer for SCMP.", "Its caption states: “A study by Oxfam Hong Kong and Chinese University found that Hongkongers needed to earn at least HK$54.70 an hour to ensure a basic standard of living.”", "Below is a screenshot of the photo published by SCMP:", "The second photo of a group of cleaners sweeping a street was published by the Associated Press here.", "The photo was captured by photographer Vincent Yu. Its caption states: “Workers sweep after police cleared barricades and tents on a main road in the occupied areas at Causeway Bay district in Hong Kong Monday, Dec 15, 2014. Hong Kong police pulled down barricades Monday and folded up tents at the third and final pro-democracy protest camp, putting an end to demonstrations that have blocked traffic in the southern Chinese city's streets for 2 1/2 months.”", "Below is a screenshot of the photo on the AP website:", "The photo was captured here near Yee Wo Street in the shopping district of Causeway Bay.", "Hong Kong saw weeks of pro-democracy protests in 2014, which were dubbed the “Umbrella Revolution”. Here is a 2016 AFP retrospective article about the movement.", "The third image of a single cleaner with rubbish bags was published in this November 13, 2016, article by Hong Kong news site Hong Kong Free Press.", "The photo, used as an illustrative image, was credited to Hong Kong newspaper Apple Daily. Its caption states: “Street cleaner.”", "The article’s headline states: “The exploited: Inadequate regulation puts outsourced workers at risk of labour abuses.”", "Below is a screenshot of the photo published by Hong Kong Free Press:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]