["A new TV ad by a Democratic campaign committee describes Rep. Jeff Denham, R-Turlock, as Donald Trump’s ‘Man in Washington DC.’", "It says Denham was deeply involved in the GOP nominee’s development of Trump International Hotel in DC.", "Trump took time away from the campaign trail this week to celebrate the hotel’s opening.", "\"When Trump wanted to turn a taxpayer-owned building into an $800 a night hotel, Denham helped broker the deal and bragged about it,\" the ad by the Democratic Congressional Campaign Committee says.", "Denham is locked in a close race against Democratic challenger Michael Eggman for the 10th Congressional District seat in the Central Valley. Eggman and the DCCC have tried to tie Denham to Trump through several campaign ads in recent months.", "We wanted to know whether this eye-opening claim that Denham \"helped broker\" the hotel deal for Trump was true. We set out on a fact check.", "Our research", "Denham has long pushed for the sale and redevelopment of excess government properties.", "As chairman of the House subcommittee on Economic Development, Public Buildings and Emergency Management in 2011, Denham held a committee meeting in the Old Post Office. The partially vacant federal building about three blocks from the White House was costing taxpayers $6.5 million in upkeep at the time. He advocated for redeveloping that site, as well as others, to save taxpayers money.", "Trump’s development company, the Trump Organization, was selected about a year later to turn the property into a 250-room luxury hotel while preserving its historic nature. This is the ‘taxpayer owned building’ the ad refers to.", "To say, however, that Denham \"helped broker the deal\" is a far stretch.", "The Obama Administration’s General Services Administration handled the bids and selection process. GSA received 10 bids and described its process this way in February 2012:", "\"After closely evaluating the submissions, GSA determined the Trump Organization proposal represented the strongest development team, best long term potential for the local community, and most consistent stream of revenue for the Federal Government.\"", "Dan Tagherlini, then-acting administrator of the General Services Administration, praised the 60-year Trump lease in 2013, as one that will \"save millions of taxpayer dollars while restoring a unique and important historic asset,\" according to a McClatchyDC.com news article.", "Asked for evidence to back up the claims in the ad, a DCCC spokeswoman said it used news articles from Turlock City News and Time magazine along with a 2013 press release from Denham’s office. None of those, however, show Denham helped \"broker\" the deal.", "Denham’s campaign spokesman said the congressman \"was not involved in the selection process\" of the property’s developer.", "A GSA spokeswoman said Denham \"did not vote on any legislation or make a recommendation related to the selection of the Trump Organization as the preferred developer for Old Post Office project.\"", "Denham told the Modesto Bee in August he supports Trump for president. We asked his campaign spokesman this week whether Denham continues to support the Republican nominee, and have yet to hear back.", "In this 2013 photo, Rep. Jeff Denham, R-Calif., testifies on Capitol Hill in Washington. AP Photo/Evan Vucci", "Bragged about it?", "Denham’s news release does show the congressman was pleased. It says Denham joined Trump Sept. 12, 2013 at the architectural and design unveiling of what’s now called Trump International Hotel.", "\"I am pleased to see Trump International Hotel’s design unveiled today,\" Denham said in the release. \"This is one of the projects that has been important to me in my efforts to generate economic growth and streamline federal processes, and as the chairman of the Economic Development subcommittee last Congress, I worked closely with the GSA on this project.\"", "$800 a night?", "The Time article shows rooms at the hotel were originally priced at $800 or more per night. Yet, the same article said \"Rates will go down after the soft opening period, starting at about $472 a night.", "There were several rooms available early this week, with nightly rates from $588 to $668, not including local taxes, according to the hotel’s website.", "Our rating", "A TV ad by the Democratic Congressional Campaign Committee says Rep. Jeff Denham of California \"helped broker\" a deal for a Washington DC hotel for Donald Trump \"and bragged about it.\"", "In reality, Denham chaired a House committee that sought to sell or redevelop excess and underused federal properties, including the Old Post Office Trump later turned into a luxury hotel.", "While the congressman played a role the overall process, a federal agency under the Obama Administration, not Denham, selected the Trump Organization to redevelop the property after reviewing competing bids.", "Denham joined Trump at the hotel’s design unveiling in 2013 and said in a press release he was pleased the property was being redeveloped.", "But there’s no indication, and no evidence from the DCCC, that Denham had any direct role in choosing Trump as the developer.", "The DCCC advertisement greatly exaggerates Denham’s role in the process and falsely describes him as helping \"broker\" the deal.", "We rate the claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/64c2aefc-6a2b-4b4d-8e91-5c0c8d0a7b60", "CA10: Trump's Man, Democratic Congressional Campaign Committee", "TV advertisement, accessed October 2016", "U.S. General Services Administration, GSA Seeks to Redevelop D.C.'s Old Post Office, March 24, 2011", "U.S. General Services Administration, GSA Selects the Trump Organization as Preferred Developer for DC's Old Post Office, Feb. 7, 2012", "Modesto Bee, editorial, Denham’s support of Trump is a disqualifier, Oct. 15, 2016", "Turlock City News, Congressman Denham, Donald Trump, Unveil New Hotel in Old Government Building, Sept. 12, 2013", "Rep. Jeff Denham, House Lawmakers Demand The Fed Stop Sitting On Our Assets, Feb. 10, 2011", "Rep. Jeff Denham, Denham Joins Trump Family for Unveiling of Hotel in Old Post Office Building, Sept. 10, 2013", "Time, You Can Stay at Donald Trump’s New Washington D.C. Hotel for $800 a Night, Sept. 12, 2016", "Los Angeles Times, Democrats airing three new ads connecting California Republican congressman to Trump, Oct. 4, 2016", "McClatchyDC.com, Democrats deploying Donald Trump as weapon against Rep. Jeff Denham and House GOP, Oct. 4, 2016", "Interview, Dave Gilliard, spokesman, Jeff Denham for Congress, Oct. 24, 2016", "Interview, Barb Solish, spokeswoman, Democratic Congressional Campaign Committee, Oct. 24, 2016", "Interview, Renee Kelly, spokeswoman, U.S. General Services Administration, Oct. 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]