["About this rating", "Shortly after Philando Castile was killed by a police officer during a traffic stop in Falcon Heights, Minnesota, on 5 July 2016, the disreputable web site Got News\n assembled a variety of images mixed with a healthy serving of innuendo in an attempt to prove that he was a member of the notorious CRIPS gang:", "Is #FalconHeightsShooting an elaborate hoax perpetrated by a disturbed young woman who is shacking up with a now dead gang banger? It sure looks that way.", "Here’s the proof he was a Crip:", "Got News' main pieces of evidence were an alleged mugshot of Castile, a photograph of Castile giving the camera the middle finger, a photograph of a man in a blue shirt making a \"C\" shape gesture with his arms, and a Facebook group called \"Crips,\" of which Castile was a member:", "The man pictured in the above-displayed image is indeed Philando Divall Castile, but while Got News sandwiched the photograph between two paragraphs calling Castile a gang member, this mugshot had nothing to do with any gang-related crime or activity. The photograph seen here was taken in 2011 when Castile was arrested on charges related to a traffic violation (i.e., driving with a revoked license), a fact curiously left out of the Got News report.", "Castile did not have a felony record. While he has been arrested several times, those arrests were typically related to minor traffic violations, such as speeding or not wearing a seat belt:", "When Philando Castile saw the flashing lights in his rearview mirror the night he got shot, it wasn't unusual. He had been pulled over at least 52 times in recent years in and around the Twin Cities and given citations for minor offenses including speeding, driving without a muffler and not wearing a seat belt.", "He was assessed at least $6,588 in fines and fees, although more than half of the total 86 violations were dismissed, court records show.", "Was Castile an especially bad driver or just unlucky? Or was he targeted by officers who single out black motorists like him for such stops, as several of his family members have alleged?", "Immediately following the boast that they were going to provide \"proof\" that Philando was a member of the crips, Got News posted two images of Philando Castile displaying a middle finger. The web site failed to document how these images connected Castile to gang activity and instead employed the ipse dixit fallacy (i.e., \"it's true because I say it is\") by captioning these photographs with phrases such as \"He’s giving a middle finger to the camera. The media is giving a middle finger to you,\" and \"Philando is a Crip\":", "While flipping the bird may be deemed impolite in certain circles, it is not \"proof\" that the finger-giver is a gang member:", "Got Newsmade another attempt to indict Castile as a gang member with two photographs, the first showing Castile making a \"W\" gesture with his hands, and  the second showing a man (not Castile) with his arms raised in a \"C\" position:", "The hand gesture shown above could possibly be considered a gang symbol, but putting fingers in a certain position does not \"prove\" that one is in a gang, and this symbol in particular does not refer to the Crips gang.", "According to the ACLU, the City of Caldwell, and the Institute of Police Technology and Management, the hand symbol seen here refers to West Coast gangs, specifically the West Side Loma Locos:", "Got News captioned this photograph \"Crips going to crip. That’s a weird pose to make. Unless you’re dressed all in blue, like a Crip, making a C, which stands for Crip,\" but this image alone is hardly proof that Castile was a member of a gang. In addition to the fact that Castile is not the person making the \"C\" gesture, it's impossible to tell exactly what is going on in this photograph without additional context. Got News also claimed that the pictured man was striking a pose, but it's also possible this photograph simply captured a fleeting movement.", "Got News' final piece of evidence was taken from social media, showing that Castile was a member of a Facebook group called \"Crips.\" However, there are dozens of groups on Facebook bearing the \"Crips\" name, and the page Castile belonged to is not official social media presence of the notorious street gang:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]