["The illustration was published in this Facebook post on July 7, 2020. It has been shared hundreds of times.", "The text overlaid above the illustrations reads: “I was wondering why the PCR test for COVID-19 had to be so far back and it got me thinking…how far does it go? So I did some research and found these two pictures and overlapped them. The suprising evidence was shocking! The blood brain barrier is exactly where the swab test has to be placed.”", "The Facebook post's caption includes a similar message: “Do NOT CONSENT TO NOSE SWAB TESTING!", "“Avoid the Covid-19 test at all costs. These swabs may be (and probably are) contaminated with something dangerous, like viruses or something we don’t understand. People should be just as concerned with the swab as they are about the vaccine.”", "The PCR test -- formally known as the reverse transcriptase Polymerase Chain Reaction test -- is a type of COVID-19 testing technique that directly detects the virus in a person’s nasal secretions or saliva, Australia’s Department of Health explains here and here. The test requires a deep and vigorous swap in the mouth and nose that can be quite uncomfortable.", "The images were shared alongside a similar claim on Facebook here, here, here and here; and on Instagram here, here and here. The claim also circulated on Facebook pages in other languages, including Danish, Dutch, French and Portuguese.", "The claim is misleading, according to experts.", "“The swab is not placed on the blood brain barrier and does not compromise the blood brain barrier and thus does not pose any threat to our nervous system,” Professor John Dwyer, an immunologist and Emeritus Professor at University of New South Wales, told AFP in a July 10 email.", "Dwyer added that while the PCR test can be “momentarily unpleasant,” there is “no way that a simple swab could damage the blood brain barrier.”", "The Queensland Brain Institute explains here that the blood–brain barrier “provides a defence against disease-causing pathogens and toxins that may be present in our blood.”", "Professor John Mathews, an epidemiologist at the University of Melbourne, also stated that the PCR swab “does not compromise the blood brain barrier in any way.”", "“Routine nasopharyngeal swabs to test for other viruses or for other laboratory results have been collected safely for many years,” he said in an email to AFP on July 10.", "Hoaxes about possible contamination of COVID-19 tests, and those that raise doubts about their accuracy, were previously debunked by AFP here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]