["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during a press briefing with the coronavirus task force, at the White House, (AP Photo/Evan Vucci)", "A review found the World Health Organization’s test did not give false positives when similar viruses were present.", "The White House provided no evidence that the WHO test fell short.", "The WHO test lacked FDA approval because it was never submitted to the FDA for evaluation.", "A persistent but inaccurate talking point is that the United States turned down coronavirus testing kits from the World Health Organization. We found that WHO never offered kits to the United States, and when a reporter asked President Donald Trump if that was true, he confirmed, and took it a step further.", "\"No. 1, nothing was offered,\" Trump said March 17. \"No. 2, it was a bad test.\"", "There is zero evidence that the WHO’s preferred test is unreliable.", "Based on a test developed in Berlin, Germany, by the end of February, WHO had purchased and sent materials to over 100 countries for 1.4 million tests.", "A review from the National University of Singapore reported that the German test gave neither false positives, nor false negatives. In technical terms, it was \"highly sensitive and specific,\" and did not \"cross-react with other coronaviruses.\"", "Before Trump spoke, top officials explained that the United States wanted a test that came through American commercial vendors and had been approved by the Food and Drug Administration.", "The head of the U.S. Public Health Service, Adm. Brett Giroir, said the WHO protocol had not been submitted to the FDA.", "The head of the White House coronavirus response, Deborah Birx, said that a few months from now, the public would see that other tests used around the world were not as good as the U.S. one. We asked the White House press office if Birx was talking about the WHO test and got no comment.", "Trump said that the coronavirus test used by WHO \"was a bad test.\"", "In the lab, the test was found to produce neither false positives nor negatives.", "The White House produced no evidence that the test under-performed.", "We rate this claim False.", "C-SPAN, President Trump and Coronavirus Task Force Hold Briefing, March 17, 2020", "World Health Organization, Diagnostic detection of 2019-nCoV by real-time RT-PCR, Jan. 17, 2020", "Journal of Clinical Medicine, Potential Rapid Diagnostics, Vaccine and Therapeutics for 2019 Novel Coronavirus (2019-nCoV): A Systematic Review, Feb. 26, 2020", "NUS Saw Swee Hock School of Public Health, COVID-19 Science Report: Diagnostics, March 12, 2020", "Washington Post, How U.S. coronavirus testing stalled: Flawed tests, red tape and resistance to using the millions of tests produced by the WHO, March 16, 2020", "PolitiFact, Biden falsely says Trump administration rejected WHO coronavirus test kits (that were never offered), March 16, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]