["“DMK Manifesto Page 112..People occupying encroached Temple lands will be regularised and ownership transferred. Page 85..Encroached Waqf properties will be reclaimed and handed over to Wakf”, tweeted Madhu Kishwar on March 21. Her tweet has garnered over 6000 retweets already.", "The Tamil Nadu based Dravida Munnetra Kazagham (DMK) had launched its manifesto for the 2019 Lok Sabha elections on March 19, in which it announced a slew of promises. Kishwar has insinuated discrimination against the majority community in the party manifesto, claiming that Pages 85 and 112 of the manifesto suggest that while encroached Waqf properties will be reclaimed and handed over to the Waqf board, in the case of encroachment of temple lands, ownership would be transferred to the encroachers by regularising them.", "Kishwar’s tweet was quote-tweeted by a social media user, whose tweet in turn has been retweeted close to a thousand times. Another quote-tweet has been retweeted over 600 times so far.", "A copy of the manifesto is available on the website of the DMK. Alt News accessed the English version of the manifesto and found that the entire manifesto is merely 76 pages. There are no pages 85 and 112.", "The same was reiterated by the spokesperson of DMK via Twitter.", "This news is so FAKE that it need not be answered but I will.", "There are no Pages 85 & 112.", "Please issue a clarification. https://t.co/QhQZ7oao1i", "— Manuraj S (@manuraj1983) March 22, 2019", "Further, Alt News found no reference to either the Waqf board or encroachment of temple lands anywhere in the manifesto. The only section dealing with religious matters is the concluding section of the manifesto titled ‘PROTECTION OF RELIGIONS AND RELIGIOUS HARMONY” found on page 69.", "Alt News found that the reference to protection of Waqf board properties and temple lands was incorporated in the party manifesto of 2016, ahead of the assembly election in Tamil Nadu. Under the section ‘Welfare of Minorities’ on Page 84, it is mentioned, “Properties of Waqf Board will be recovered from encroachments and protected.”", "Insofar as the question of protection of temple lands is concerned, under the section ‘Hindu Religious and Charitable Endowment Department’ on page 111, the manifesto clearly spells out, “Besides regulating and collecting rent to be received by the temple trust from temple lands, a Land Bank will be established for protecting vacant land belonging to temples. Moreover, a high level committee led by a retired judge will be constituted for considering the demand of the people, who are offering to purchase the temple land within the legal framework.” The 2016 manifesto of the DMK thus referred to both, protection of Waqf properties AND temple lands.", "It may be reiterated that there is no reference to either the Waqf board or encroachment of temple lands in the DMK manifesto for the 2019 Lok Sabha election. Madhu Kishwar’s claim is simply false.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]