["About this rating", "No, smart phone-wielding teenagers were not the first to use the phrase \"OMG\" as an abbreviation for \"Oh my God.\" Try a British Royal Navy man — more than 100 years ago.", "That's right, OMG was first employed by a retired English naval admiral in a letter to British Prime Minister Winston Churchill, who was famous for his soaring oratories while leading England to victory in World War II.", "The letter can be found in a book, authored by John Arbuthnot Fisher, better known as Lord Fisher. In an interview with National Public Radio on the 100th anniversary of the letter (Sept. 9, 2017), linguist Ben Zimmer discussed Lord Fisher in explaining the original use of OMG:", "Well, amazingly enough, it was in a letter that was written to Winston Churchill on September 9, 1917, by a retired admiral of the British Navy named John Arbuthnot Fisher. And Lord Fisher sent this letter. He was already in his 70s at the time, retired from the Royal Navy. And he was complaining about Britain's naval strategy in World War I against Germany. And he was actually using it in a kind of a sarcastic way.", "And at the end of his letter, he said, I hear that a new order of knighthood is on the [tapis] - that means on the table - OMG, oh, my God, shower it on the admiralty. So he used it as a sort of a playful way to suggest that this would be some new order of knighthood, but he just kind of invented it on the spot for that letter.", "In a piece penned for the Wall Street Journal on Sept. 8, 2017, Zimmer said researchers for the Oxford English Dictionary were the first to make the discovery of OMG's surprisingly long history:", "Lord Fisher’s letter went unnoticed for nearly a century until it was unearthed by lexicographers at the Oxford English Dictionary, when they added an entry for “OMG” in March 2011. The OED makes a point of tracking down the earliest known example of every word or phrase, and initial research had taken the interjection “OMG” back to 1994, in an online forum for soap-opera fans (“OMG! What did it say?”).", "The editors asked one of the OED’s longtime library researchers, Jon Simon, formerly a research librarian at the Library of Congress, to track down another mid-’90s example of “OMG” that cropped up in the Arkansas Democrat-Gazette. But Mr. Simon didn’t stop there: He looked carefully through the Google Books database of digitized texts until he found the surprising 1917 letter, included in Lord Fisher’s memoirs published two years later.", "In fact, the page in Lord Fisher's book, \"Memories,\" that contains the letter is archived online.", "Zimmer said that although the first instance of \"OMG\" was written by Fisher in 1917, the phrase didn't catch on until the mid-1990s, associated with digital communications like \"chat rooms, text-messaging and social media.\" Nevertheless, Zimmer concluded, \"we can thank cranky old Lord Fisher for showing us that concocting playful new abbreviations is a time-honored tradition and hardly the death knell of English.\"", "Zimmer, Ben. \"OMG! It Started in 1917 With a Letter to Churchil.\"\r\n  Wall Street Journal. 8 September 2017.", "NPR. \"'OMG' Turns 100.\"\r\n  9 September 2017.", "Fisher, John Arbuthnot. \"Memories.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]