["About this rating", "On July 6, 2020, DeAnna Lorraine, a proponent of the \"QAnon\" movement who tried unsuccessfully to win a seat in U.S. Congress, posted a message on Twitter claiming that Dr. Anthony Fauci, one of the lead members of the Trump Administration's White House Coronavirus Task Force, was married to the sister of Ghislaine Maxwell, a British socialite recently arrested on charges related to Jeffrey Epstein's sex trafficking ring:", "There is no truth to this claim.", "Lorraine's post included a photograph of Fauci and his wife, Christine Grady, and a screenshot of the Wikipedia page of Maxwell's sister, Christine Maxwell. But these Christines are two different individuals.", "Christine Grady, Fauci's wife, was born in New Jersey in 1952, attended Georgetown University, authored hundreds of papers in the field of bioethics, served on the President’s Commission for the Study of Bioethical Issues from 2010 to 2017, and is currently the Chief of the Department of Bioethics for the National Institutes of Health.", "Christine Maxwell, Ghislaine Maxwell's sister, was born in France in 1950 and co-founded Magellan, one of the internet's early search engines. According to The Daily Beast, Maxwell was a doctoral candidate at the The University of Texas at Dallas in 2019.", "Lorraine eventually deleted her tweet and admitted that she had been wrong about Dr. Fauci being married to Maxwell's sister:", "CNET.   \"Magellan Cofounder Finds Email.\"\r\n    21 February 1997.", "National Institute of Health.   \"Meet Our Doctors: Christine Grady, MSN, PhD.\"\r\n    Retrieved 6 July 2020.", "Kennedy, Dana.   \"Jeffrey Epstein ‘Friend’ Ghislaine Maxwell Has More Skeletons in Her Family Closet Than a House of Horrors.\"\r\n    The Daily Beast.   18 August 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]