["About this rating", "Avon, Mary Kay and Estée Lauder still test their products on animals in some countries where such testing is required by law.", "Avon, Mary Kay and Estée Lauder have not resumed testing their products on animals in the U.S.", "In March 2015, a rumor claiming that cosmetic companies Avon, Mary Kay, and Estée Lauder had resumed animal testing started circulating on social media sites, stemming from an article published by the Dog Files web site in 2012:", "Animal testing for cosmetics is a hot topic in the beauty industry, with most consumers and many companies deciding to avoid products made with animal testing. After more than two decades following a \u001cno testing on animals\u001d policy, cosmetics giants Avon, Mary Kay, and Estée Lauder have resumed the practice without letting consumers know.According to a press release from Rush PR, the news was broken after animal rights organization PETA removed the companies from their cruelty-free list after discovering that they had returned to using testing on animals for their products. The three companies began the tests again in order to satisfy regulations from the Chinese government so they could sell their products in China. However, PETA contends that there are alternative testing methods that are just as effective and widely used in the US.", "While it's true that PETA includes Avon, Mary Kay, and Estée Lauder on its \"companies that do test on animals\" list, that categorization is not completely accurate. Avon, Mary Kay, and Estée Lauder do not use animal testing for the majority of their products, but they do make exceptions in countries where local laws mandate additional safety testing on animals be performed:", "In June 1989 Avon announced a permanent end to animal testing of our products, including testing done in outside laboratories. Avon was the first major cosmetic company in the world to end animal testing. For more than 20 years Avon has independently substantiated the safety of its products without animal testing.Avon does not conduct nor request animal testing in order to substantiate the safety or efficacy of any of its products or raw ingredients. Our approach to safety evaluation utilizes data from computational modeling, in vitro (test tube/cell culture) evaluation and clinical tests on human volunteers, as well as utilization of pre-existing data.", "Some products may be required by law in a few countries to undergo additional safety testing, including animal testing. In these instances, Avon will first attempt to persuade the requesting authority to accept non-animal test data.", "Similar statements can be found on web sites for Estée Lauder and Mary Kay, as well as clarification on why these companies have chosen to continue selling their products in countries that require animal testing:", "What does \"except where required by law\" mean?", "Some scientific or regulatory authorities may still conduct or require animal testing by law of cosmetic products or ingredients to demonstrate safety. For example, before we are able to import any of our products into China, the Chinese government requires all importers of cosmetics, including us, to pay for animal testing that is conducted by a government-mandated laboratory in China.", "Can't you choose not to sell your products in these countries?", "As a global company, we are committed to providing our products and services to our consumers where they live, and we must comply with all legal requirements in the countries where we do business.", "It should also be noted that the laws requiring animal testing in countries such as Brazil and China have changed since PETA decided to boot Mary Kay, Avon, and Estée Lauder from its \"companies that do not test on animals\" list. For instance, in January 2014 Governor Geraldo Alckmin signed a bill that prohibited cosmetics testing on animals in Sao Paulo, Brazil. China has also decided to lift the animal testing requirement on ordinary cosmetics produced and sold in that country.", "Unfortunately, animal testing is still required in several locations around the world. Companies such as Avon, Mary Kay, and Estée Lauder continue to sell their products to these places. It is not wholly accurate to say, however, that these companies have \"resumed animal testing.\"", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]