["A video of a young woman being hounded by a group of men has been shared on social media with child-kidnapping rumours. The message claims that two women were caught by locals in Pali’s Housing Board, Rajasthan. They had kidnapped three children but people intervened and handed one of the kidnappers to the police. The other one fled. The message warns this gang is named ‘Mummy Mido’ and they are scattered across Pali.", "सावधान आज दिनॉक 19/8/2019 पाली के हाउसिंग बोर्ड साई बाब मन्दिर के पास बने वाटर बाक्स मे भोपाल से आयी दो बच्चे चुराने वाली गेग को पकडा लोगो ने ईस दोरान एक को पकड लिया गया लेकिन एक ओरत भागने मे कामयाब हो गई लोगो का कहना है कि वह पाली शहर के हाउसिंग बोर्ड एरिया मे करीब तीन बच्चे चुरा कर लेजा रही थी ईसी दोरान दिनांक 18/8/19 को रात 11:30 पर लोगो ने इसे पकडा यह लडकी महिला पुलिस थान पाली मे है पूछ ताछ के दौरान ईसने कहा की ईसकी गेग का नाम मम्मी मिडो है जो कि पुरी पाली मे फैलि है सावधान", "Posted by Pappuram Ratohre on Monday, 19 August 2019", "A Facebook user Shubham Badgujar shared a photograph of the same girl.", "Alt News performed a Google search with the keywords “हाउसिंग बोर्ड बच्चा चोर” and found an August 20 report by Dainik Bhaskar which said that the incident took place on August 18 when a minor girl was interrogated by locals in Pali, Rajasthan on false suspicions of being child kidnapper.", "According to Dainik Jagran, the girl hails from Madhya Pradesh and her father was married to two women. After his death, the girl’s birth mother married another man and left the child with the stepmother. A friend of the stepmother, Deepika, who used to conduct illegal marriages, entrapped the girl and got her married to two different men – one from Jodhpur and the other from Ratlam. Deepika was taking the girl to get her married a third time – to a man from Housing Board, Pali – when they lost their way and were unable to find the man’s house. This was late in the evening and a few men spotted unidentified women roaming in their locality. Suspecting them to be child-kidnappers, the men surrounded them. Deepika and the others accompanying her fled in the middle of the commotion while the minor girl was left behind. Later, the police searched for Deepika and her accomplices in hotels and bus and railway stations but were unable to find them.", "Housing Board police inspector Govindan and his team rescued the girl and a case of kidnapping and human trafficking has been registered at the direction of the child welfare committee.", "In a conversation with Alt News, inspector in-charge Govindan said, “She wasn’t a child kidnapper. She was a 17-year-old who was trapped by a middleman who had brought the girl to the area to wed her off. She is from Bhopal, MP. We have informed her mother but she hasn’t come to take her yet. The girl is lodged at a child welfare home in Jodhpur. We are on the lookout for the woman who brought her here. A case has been registered against the woman under JJ Act.”", "A minor, who was a victim of trafficking, was hounded by a group of men on false suspicions of being a child-lifter. Since last month, multiple such cases have come to light. Alt News has compiled a list of instances when people, falsely believed to be child-kidnappers, were hounded and beaten by mobs.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]