["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Gov. Greg Abbott speaks at a commission meeting at the Texas Capitol. [JAMES GREGG/AMERICAN-STATESMAN]", "In an effort to dissuade local governments in Texas from cutting police funding, state leaders have pledged to pursue legislation next year that would freeze property tax revenue for any city or county that cuts its law enforcement budget.", "The move came as the Austin City Council approved its $4.2 billion budget for the upcoming fiscal year, which included plans for $21.5 million in immediate cuts to the city’s police budget and plans to shift to other city departments another $128 million in spending on civilian functions currently overseen by police.", "During an Aug. 18 press conference announcing the property tax proposal, Gov. Greg Abbott warned that now, more than ever, is a dangerous time for the city to cut its police budget.", "\"A new study showed that Austin, Texas, is the No. 1 city in America in the year-to-year percentage increase in murders, with a percentage increase of more than 64% for the first half of this year,\" Abbott said. \"Austin also has a year-to-year increase in the percent rate of aggravated robberies, increasing by 14%, and robberies increasing by 16%. When crime is on the rise, the last thing that we should do is to defund law enforcement.\"", "Abbott’s comments on the percentage increase in homicides caught the most attention and drew pushback from some city leaders who said the statistic lacks important context. Namely, that the number of homicides in Austin is much lower than in other cities, which means any change will result in a large percent increase compared with earlier years.", "Abbott’s figures came from a Wall Street Journal article examining homicides in major cities during the coronavirus pandemic. The report found \"a sharp rise in homicides\" in 36 of the 50 biggest cities in the country, including in Austin.", "His statement reflected the numbers included in the report for Austin, but they lack important context about crime and homicides in the city.", "\"Assessing, even generally, the safety of a city just using crime statistics, they don’t tell you a lot of the story,\" said Carsten Andresen, an assistant professor of criminal justice at St. Edward's University. \"They don’t capture who goes in and out of a city, which parts of a city are safe.\"", "Wall Street Journal data", "The Wall Street Journal analysis looked at data from police departments in each of the 15 largest cities in the country and compared the number of homicides recorded for the first six months of 2020 with the number of homicides recorded over the same period last year. The information was shared in a graph that accompanied the article.", "The analysis found that, of those cities, Austin recorded the largest percentage change in total homicides, with a 64.3% increase from the first half of 2019. By the end of June, the city had recorded 23 homicides, up from 14 at the same time last year.", "For comparison, six months into 2018 there were 18 homicides, in 2017 there were 13 and in 2016 there were 12.", "Chicago reportedly had the second largest percentage change in total murders, with an increase of 52.5%. By the end of June, the city had 433 homicides.", "Of those 15 cities, Austin had the second lowest count of homicides during the first six months of the year.", "Context behind Austin’s numbers", "The numbers included in the Wall Street Journal article are reflected in the June 2020 edition of Austin Police Chief Brian Manley’s monthly reports, which are published online.", "But the numbers alone don’t tell the whole story. Lt. Jeff Greenwalt, who heads the Austin Police Department’s Homicide and Aggravated Assault unit, said \"the percentage you see is a little more alarming than the actual numbers.\"", "\"I think there is an underlying story to the snappy headline,\" Greenwalt said. \"While there is an increase, it is only a handful more because we have low numbers in the first place. The real statistic is going to be at the end of the year, where we compare to years past.\"", "Even then, Andresen said using percentage change in this instance won’t accurately represent the situation at hand.", "\"First of all, homicide is such a small number,\" he said. \"You’re going to have huge percentage changes. I’ve always been told: don’t use percentages for numbers that are under 50. If you’re looking at 30 or 45, don’t use a percentage difference because the percentage changes are so big.\"", "Homicides in particular are tricky to analyze over an extended period of time, as they tend to be isolated incidents and some months may see more than others.", "In order to speak to changes in the number of murders within a city, using six months of data is not enough, according to Michelle Richter, an associate professor of criminology at St. Edward’s University.", "\"You should be looking at at least five years’ worth of data,\" she said, noting that this kind of analysis should also account for changes in population size.", "\"I would not be alarmed by (that percentage), and this is the reason why: Austin has, for the most part in terms of long-term trends and patterns, one of the lowest violent crime rates,\" she said. \"You have to look at bigger data.\"", "From 2014 to 2018 (complete 2019 data has not been produced), the number of murders in Austin fluctuated:", "∙2018: 32 murders, or 3.3 murders per 100,000 residents", "∙2017: 25 murders, or 2.6 murders per 100,000 residents", "∙2016: 39 murders, or 4.1 per 100,000 residents", "∙2015: 23 murders, or 2.5 per 100,000 residents", "∙2014: 32 murders, or 3.5 per 100,000 residents", "Andresen said an analysis of month-to-month or year-to-year changes, should be focused on \"missed opportunities to be able to reduce those homicides in the future.\"", "Greenwalt said his unit is working to investigate any identifiable trends or \"anything unusual going on\" in murders this year, but so far they have the same underlying causes the department experiences in other years.", "\"Most of the time, our homicides involve drugs and robberies,\" he said. \"Every once in a while we see family violence or an acquaintance.\"", "He also noted that the department has nearly a \"100% solve rate\" on homicides this year.", "\"What he’s saying in and of itself is accurate, however there is just a lot more to the story,\" Greenwalt said of Abbott’s remark.", "Our ruling", "Abbott said crime is on the rise in Austin, which is \"the No. 1 city in America in the year-to-year percentage increase in murders, with a percentage increase of more than 64% for the first half of this year.\"", "Abbott’s figures are from a Wall Street Journal analysis of homicides in cities across the country, and they are reflected in reports from the Austin Police Department.", "But the issue is the conclusion he is drawing from these figures. Experts said crime data of this scale (changes in small numbers over a short time period) does not accurately reflect a crime trend or the safety of a specific area. They also said focusing on the percentage change in discussions of shifts in smaller values can overstate increases or decreases over time.", "Abbott’s statement is accurate, but leaves out important details and needs more context. We rate it Half True.", "NBCDFW, Texas Cities That Defund Police Should Have Property Tax Rates Frozen Forever: Gov. Abbott, Aug. 18, 2020", "Austin American-Statesman, Austin council OKs budget with $150M in police cuts, Aug. 13, 2020", "Email interview with John Wittman, spokesman for Gov. Greg Abbott, Aug. 20, 2020", "Wall Street Journal, Homicide Spike Hits Most Large U.S. Cities, Aug. 2, 2020", "Austin Police Department, Chief’s Monthly Reports, accessed Aug. 20, 2020", "Phone interview, Austin Police Lt. Jeff Greenwalt, Aug. 26, 2020", "Phone interview, Carsten Andresen, assistant professor of criminal justice at St. Edward's University, Aug. 28, 2020", "Phone interview, Michelle Richter, an associate professor of criminology at St. Edward’s University, Aug. 28, 2020", "Email interview, Eric Warr, professor at the University of Texas at Austin, Aug. 28, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]