["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Annette Taddeo, right, campaigned for lieutenant governor with Democratic gubernatorial candidate Charlie Crist in Miami on Nov. 3, 2014. (Getty Images photo)", "Congressional hopeful Annette Taddeo warned Florida seniors preparing for a Thanksgiving feast that a Jeb Bush presidency could starve their plans for retirement.", "Taddeo, the former chair of the Miami-Dade Democratic Party, attempted to link Bush’s plan for Social Security to her Republican opponent, Carlos Curbelo of Miami, in a fundraising email PolitiFact Florida received Nov. 24, 2015 (click here to read the letter).", "\"Have you seen presidential hopeful Jeb Bush’s plan for Social Security? It’s disastrous for seniors and raises the retirement age to 70,\" the email read. \"But Bush is the candidate Annette’s opponent, Congressman Carlos Curbelo, thinks should be leading our country. Not that that’s a surprise after Curbelo called Social Security a ‘Ponzi scheme’ and voted for Speaker Ryan’s devastating budget. South Florida needs someone who will fight for Social Security — not work to end it.\"", "Curbelo did call Social Security a Ponzi scheme in his first bid for Congress. That is not an accurate description of the program, so we rated Curbelo's statement False.", "For this fact-check, we wanted to know if Bush really released a Social Security plan for seniors that raises the retirement age to 70. (We won’t weigh in on whether it’s \"disastrous.\")", "We found that Bush's plan doesn't suggest a specific age, and he also doesn't think the eligibility age should change for current seniors.", "Bush’s comments", "Taddeo’s campaign directed us to a condensed version of Bush’s plan to reform Medicare and Social Security on Medium.com, which linked to the full plan on his website.", "Bush proposes allowing small businesses to set up collective or individual retirement accounts for workers. He also wants to slow down the growth of costs by cutting payments to higher-income seniors who have been able to save more while increasing minimum payments.", "Relevant to this fact-check, he suggests raising the retirement age, although he doesn’t say by how much. He says working longer is something many workers desire.", "\"We need to recognize that Americans are living longer, healthier lives, and we should make it easier for those who choose to work longer,\" Bush wrote. \"Life expectancy has increased substantially since Social Security was created in 1935. Yet Social Security’s structure still discourages work past the age of 62. Reforms should update Social Security to respect seniors’ desires and abilities to work later in life.\"", "That doesn’t mention 70 as the potential new retirement age for full benefits, though Bush did use that number earlier this year on CBS’ Face the Nation. Host Bob Schieffer noted during the May 31 interview that Bush favored raising the age and asked him how high.", "\"I think it needs to be phased in over an extended period of time. I have seen ideas that are 68, for example,\" Bush said. \"So people that already have the supplemental retirement system, which is a contract, I don't think we violate that. For people that are about ready to be beneficiaries of their supplemental retirement, I don't think we change that. But we need to look over the horizon and begin to phase in over an extended period of time going from 65 to 68 or 70. And that by itself will help sustain the retirement system for anybody under the age of 40.\"", "Bush has made similar comments at other points this year, though he only gave a specific age range to Schieffer. He has repeatedly said his plan would not affect current retirees or Americans nearing it.", "Bush told an audience in New Hampshire on April 17, \"I think we need to raise the retirement age, not for the people that already nearing (or) receiving Social Security ... but raise it gradually over a long period of time for people that are just entering the system.\"", "And on June 2, a few days after appearing on Face the Nation, Bush told Fox News’ Neil Cavuto, \"Social Security — I think we need to adjust it, because life expectancy has gone up, … adjusted by retirement age going up. … If we're going to fix it for the next 50 years, we need to start working on it now and progressively raise the retirement age. But people that are near retirement or already in retirement, I don't believe there should be any (impact).\"", "We should note that in his Face the Nation comments, Bush was wrong about the current retirement age. Bush suggested that the current retirement age for full benefits is 65, but that’s only for people born in 1937 or earlier. For people born between 1943 and 1954, the current retirement age for full benefits is 66, and the age rises incrementally after that. Those born in 1960 or later will get full benefits at 67.", "It’s clear Bush has brought up raising the retirement age for future Social Security beneficiaries as a way to stabilize the program. But Taddeo’s characterization of what he has said falls short on several fronts.", "Our ruling", "Taddeo said Bush’s plan for Social Security is \"disastrous for seniors and raises the retirement age to 70.\"", "Taddeo has a point that Bush said he is open to the idea of raising retirement ages, but her email mischaracterizes his plan. Her email attempts to convince seniors nearing retirement that benefit changes are imminent if Bush is elected.", "Bush has repeatedly said he does not intend to alter Social Security for current retirees or those who would be joining the program soon. And while 70 is one of several ages Bush threw out in an interview, his official plan doesn't establish specifics beyond stating age reforms are needed.", "Taddeo’s statement contains an element of truth about Bush’s plan for Social Security but exaggerates that point to scare seniors. We rate the statement Mostly False.", "Annette Taddeo, fundraising email text, accessed Nov. 24, 2015", "MSNBC, \"Jeb Bush: raise the retirement age,\" April 17, 2015", "The Hill, \"Bush: Retirement age should be phased in to ’68 or 70’,\" May 31, 2015", "Face the Nation, \"Face the Nation Transcripts May 31, 2015: Jeb Bush, John Brennan,\" May 31, 2015", "Huffington Post, \"Is Jeb's Social Security Flub the Worst Bush Gaffe Yet?,\" June 1, 2015", "Fox News, \"Jeb Bush on 2016 plans: 'I won't be the last guy in',\" June 3, 2015", "Washington Post, \"This presidential election could totally change when you can retire,\" June 4, 2015", "CNN, \"Jeb Bush rolls out proposals for Social Security, Medicare,\" Oct. 27, 2015", "Jeb2016.com, \"Jeb Bush: My Plan to Preserve, Protect and Reform Medicare and Social Security,\" Oct. 27, 2015", "Medium.com, \"My Plan to Preserve, Protect and Reform Medicare and Social Security,\" Oct. 27, 2015", "Money, \"Here’s What the Republicans Plan To Do About Taxes and Social Security,\" Oct. 29, 2015", "Social Security Administration, \"Retirement Planner: Full Retirement Age,\" accessed Nov. 25, 2015", "Interview with Shaun Daniels, Taddeo spokesman, Nov. 25, 2015", "Interview with Allie Brandenburger, Bush spokeswoman, Nov. 25 & 30, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]