["The video was published here on Facebook on August 3, 2020. It has been viewed more than 4,900 times.", "The one-minute 44-second video shows a clash between a group of people. Text superimposed on the video says: “@MBS”.", "The post’s caption states: “Fight happen at MBS this AM”.", "“MBS” refers to Marina Bay Sands, a resort in Singapore's Marina Bay.", "The same video was also shared alongside a similar claim on Facebook here, where it has been viewed more than 45,000 times, and on YouTube here.", "The claim, however, is false.", "A Google reverse image search of the keyframes of the video using video verification tool InVID-WeVerify, followed by a keyword search, found an identical video posted on Twitter here on July 25, 2020. The caption states: “They fighting in hardrock”.", "They fighting in hardrock ???? pic.twitter.com/emS4clMuiA", "Below is a screenshot comparison of the video in the misleading post (L) and the earlier Twitter video (R):", "The same user also uploaded the second video of the fight here.", "The South Florida Sun Sentinel newspaper reported on the incident on July 27, 2020, here. The report's headline states: “Big brawl breaks out at Hard Rock’s guitar-shaped hotel; three arrested.”", "The report reads in part: “The minutes-long brawl, recorded on a bystander’s cellphone camera, has drawn more than 4.5 million views on Twitter. The large fight broke out Friday at Seminole Hard Rock Hotel & Casino Hollywood, spilling from the entrance of a restaurant to the next.", "“About 10 to 15 men and women were involved, but police reviewed surveillance video and ultimately arrested three people for the fight. All the fighters have been banned from the Hard Rock.”", "Seminole Hard Rock Hotel & Casino Hollywood, also known as \"the Guitar Hotel”, is a hotel and casino resort near the city of Hollywood in Florida.", "The interior seen at the 42-second mark in the misleading video matches the corridor shown at the two-minute 52-second mark in this video titled “A Quick Lobby Tour & Elevator Ride at the Seminole Hard Rock Hotel & Casino in Hollywood, FL”.", "The interior seen at the one-minute nine-second mark in the misleading video matches the entrance to the Guitar Tower seen at the 18-minute 39-second mark of this video, which is titled: “GUITAR HOTEL Grand Opening Celebration at Seminole HARD ROCK Hotel & Casino in Hollywood, Florida.”", "Below is a screenshot comparison of the misleading video (L) and the two YouTube videos (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]