["About this rating", "On or around 3 December 2015, the web site Huzlers published an article titled \"17 Year-old Does 'Condom Challenge' With Used Condom Gets Herpes,\" saying:", "The “Condom Challenge” craze has claimed another victim. 17 year-old Hector Cruz contracted herpes after using a used condom he found in his fathers bedroom. Most recently 17 year-old Emily Stone died while doing the “Condom Challenge”. So the question is why are teens and college kids still doing the “Condom Challenge”?", "Part of it is because they don’t believe that anything bad will happen to them. “In adolescence, there’s a feeling of invincibility,” Michelle Tyson, Ph.D., clinical professor of psychology at the Dallas M&P institute and clinical psychologist in private practice in Dallas, Says. “Because this generation is full of f*cking idiots who anything to be cool. They don’t think about the consequences look at Hector he looks like a walking ebola infected monster”.", "For unknown reasons, the weeks-old claim shot to the top of Facebook's \"What's Trending\" list on 22 December 2015:", "The \"condom challenge\" involves filling condoms with water, and then dropping them, or having them dropped, on your head.  The \"Hector Cruz\" claim wasn't Huzlers' first attempt to capitalize on the briefly socially viral trend. The web site also published a fabricated tale of a teen who died engaging in the activity.", "Huzlers is well-known as a fake news site, and at the bottom of every page a disclaimer reads:", "Huzlers.com is the most notorious urban satirical entertainment website in the world with the most shocking headlines and articles shared by trillions around the world.", "Earlier Huzlers hoaxes included claims that semen was found in Starbucks drinks nationally, that McDonald's used \"human meat\" in their food, that Chipotle was busted serving cat and dog meat, and that an Ebola victim rose from the dead as a zombie. Satire notwithstanding, the likelihood of contracting herpes from contact with a surface or object is infinitesimally low.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]