["So this guys Aatish Taseer works as PR manager for Indian National Congress. No doubt Time magzine has lost their credibilty and has become mouthpiece of Leftist.", "The above message was tweeted by a pro-BJP social media user, Chowkidar Shashank Singh (@pokershash), alluding to the author of the recent article in TIME magazine critical of Prime Minister Narendra Modi. Chowkidar Shashank Singh is followed on Twitter by union minister Chowkidar Smriti Irani.", "The cover story of TIME featuring PM Modi with the words ‘India’s divider-in-chief’ has been a major talking point, with extensive coverage by mainstream media and animated discussions among social media users.", "So this guys Aatish Taseer works as PR manager for Indian National Congress. No doubt Time magzine has lost their credibilty and has become mouthpiece of Leftist. pic.twitter.com/ZIUWUuB9TZ", "— Chowkidar Shashank Singh (@pokershash) May 10, 2019", "This tweet has been retweeted over 500 times. The user has attached a screenshot of the Wikipedia write-up on Aatish Taseer. Taseer is a British-born journalist and writer. The screenshot shows that according to the description on Wikipedia, Taseer “is working as PR manger for Indian National Congress.”", "The implication here is that Taseer’s article is motivated and not sincere because he works with the Congress party as its PR manager. Interestingly, the word manager has been spelt as ‘manger’, in the above screenshot.", "The text seen in the screenshot shared on Twitter has been edited. This is because Wikipedia allows users to edit pages and articles. The page on editing states, “Wikipedia is a wiki, meaning that anyone can edit any unprotected page and improve articles immediately for all readers. You do not need to register to do this. Anyone who has edited is known as a “Wikipedian” (commonly referred to as, simply, editors) and, no matter how trivial the edit may seem, can be proud that they have helped make Wikipedia what it is.”", "Alt News found that the Wikipedia page of Aatish Taseer was edited repeatedly on May 10. The first edit was at 7:59 am, when the bit about Taseer being “the PR manger for the Congress” was added to the ‘Career’ section of the page.", "Moreover, Taseer’s page is now ‘protected’, due to ‘persistent disruptive editing’, which means that the contents of the page have now been protected from further malicious alteration due to excessive activity on the page, since the TIME magazine article came out.", "The video posted below illustrates the changes which have been effected on the page. These alterations can be viewed in the ‘View History’ tab of the page.", "Aatish Taseer’s Wikipedia page was vandalised- the contents of the page were mischievously edited, and a screenshot of the same was shared on Twitter.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]