["About this rating", "During the 2020 U.S. presidential campaign, social media postings repeatedly warned readers that Democratic candidate Joe Biden was planning to slap a 3% federal tax on the value of homes, above and beyond any property taxes homeowners were already paying:", "However, this warning about a Biden-backed federal property tax was specious. Property taxes in the U.S. are set and collected at the state, county, and city levels, and the announced Biden Tax Plan includes nothing that could be remotely construed as imposing an additional federal property tax on privately-owned homes.", "The Tax Foundation, an independent tax policy nonprofit, summarizes the Biden tax plan as including the following primary elements applicable to individuals (rather than businesses):", "Imposes a 12.4 percent Old-Age, Survivors, and Disability Insurance (Social Security) payroll tax on income earned above $400,000, evenly split between employers and employees. This would create a “donut hole” in the current Social Security payroll tax, where wages between $137,700, the current wage cap, and $400,000 are not taxed.", "Reverts the top individual income tax rate for taxable incomes above $400,000 from 37 percent under current law to the pre-Tax Cuts and Jobs Act level of 39.6 percent.", "Taxes long-term capital gains and qualified dividends at the ordinary income tax rate of 39.6 percent on income above $1 million and eliminates step-up in basis for capital gains taxation.", "Caps the tax benefit of itemized deductions to 28 percent of value for those earning more than $400,000, which means that taxpayers earning above that income threshold with tax rates higher than 28 percent would face limited itemized deductions.", "Restores the Pease limitation on itemized deductions for taxable incomes above $400,000.", "Phases out the qualified business income deduction (Section 199A) for filers with taxable income above $400,000.", "Expands the Earned Income Tax Credit (EITC) for childless workers aged 65+; provides renewable-energy-related tax credits to individuals.", "Expands the Child and Dependent Care Tax Credit (CDCTC) from a maximum of $3,000 in qualified expenses to $8,000 ($16,000 for multiple dependents) and increases the maximum reimbursement rate from 35 percent to 50 percent.", "For 2021 and as long as economic conditions require, increases the Child Tax Credit (CTC) from a maximum value of $2,000 to $3,000 for children 17 or younger, while providing a $600 bonus credit for children under 6. The CTC would also be made fully refundable, removing the $2,500 reimbursement threshold and 15 percent phase-in rate.", "Reestablishes the First-Time Homebuyers’ Tax Credit, which was originally created during the Great Recession to help the housing market. Biden’s homebuyers’ credit would provide up to $15,000 for first-time homebuyers.", "Expands the estate and gift tax by restoring the rate and exemption to 2009 levels.", "Similar analysis of Biden's tax plan by other entities include no mention of a federal property tax.", "Watson, Garrett et al.   \"Details and Analysis of Democratic Presidential Nominee Joe Biden’s Tax Plan/\r\n    Tax Foundation.   22 October 2020.", "Committee for a Responsible Federal Budget.   \"Understanding Joe Biden's 2020 Tax Plan.\"\r\n    30 July 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]