["The image was published here on Facebook on December 14, 2019. It has been shared more than 16,000 times.", "It shows a man standing next to a wall painting of a train.", "The Sinhala-language text underneath the image translates to English as: “A wonderful drawing done by a new teacher in a school building, where its students had never seen a train as it is located in such a remote area. How can you not appreciate this talent?”", "Below is a screenshot of the misleading Facebook post:", "Sri Lanka has seen a recent rise in street art, as reported here by Sri Lanka's Sunday Observer newspaper on December 8, 2019.", "While the text did not explicitly state that the painting was situated in Sri Lanka, some Facebook users appeared to believe the image showed a school in Sri Lanka.", "Below is a screenshot of one comment on the post that suggested the Facebook user believed the mural was in Sri Lanka:", "Another Facebook user's Sinhala-comment language comment translates to English as: “There are talented artists in our country. Where is the recognition for these people? It is very sad.”", "The same image was shared  here and here on Facebook, alongside a similar claim.", "This claim is misleading; the photo shows a mural created by an Indian artist at a school in the Indian state of Kerala.", "A reverse image search on Google for the photo in the misleading posts found a screenshot of a page from English-language Indian newspaper Deccan Chronicle published in this Facebook post by Indian artist Sajeesh Vengara on September 18, 2017.", "Below is a screenshot of the Deccan Chronicle article in Vengara's post:", "A keyword search found this article published by Indian news outlet The News Minute on June 5, 2017, with the headline: “In pictures: This Kerala govt school welcomed students back with bright colors and a 'Learning Express'”.", "Below is a screenshot of The News Minute article:", "The report states that the train was painted on the wall of a school in Pilicode, a village in the Indian state of Kerala.", "“The school turned to local artist Sanjeesh Vengara to carry out the transformation within a month – before the school reopened. With the school located quite close to a railway track, Sanjeesh did not look far for inspiration for his paintings, the subject of which he fixed on himself.”", "Below is a screenshot comparison of the image in the misleading posts (L) and the The News Minute photo (R):", "AFP has recently debunked multiple misleading claims about purported murals in the country, including here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]