["A video of a man with multiple sores and blood oozing out from his wounds is widely circulating on social media with the claim that he is ‘Siddhar (Yogi)’ who was buried alive 300 years ago in Valliyur, Tamil Nadu and was recently found during the renovation of Vallipoor temple. The viral message adds that he has been sitting in ‘yogasana’ for three centruries. Below is a screenshot of a fact-check request of the video on the Alt News mobile application.", "The video is viral with the same message in different languages. The message in Hindi reads, “यह है सिद्धार्थ योगी जिन्होंने 300 साल पहले तमिलनाडु के वल्लियुर में समाधि ली थी वल्लियुर मंदिर के लिए मिट्टी खोदते समय उन्हें जीवित पाया गया सिद्धार्थ योगासन में बैठे नजर आए थे ऐसा है भारत जिसकी दुनिया कल्पना भी नहीं कर सकती”", "The one in Gujarat is as follows: “તામિલનાડુ ના વલ્લિયાર માં 300 વર્ષ પહેલાં એક સિધ્હાર યોગીએ સમાધી લીધેલ હતી અને તે જમીન પર તેનું મંદિર બનાવેલ હતુ અને આજે 300 વર્ષ પછી તે મંદિર ને રિનોવેસન કરવા માટે ખોદકામ કરાવ્યું તો તેની માટી માંથી તે યોગી નુ જીવિત શરીર મલ્યું તો દર્શન કરો તેવા મહાપુરુષ નાં”", "A differently-worded message in Kannada – “5 ವರುಷದಿಂದ ಸಮಾದಿಯಲ್ಲಿ ಇದ್ದವರು ಎದ್ದು ಬಂದಿದ್ದಾರೆ ಮಾತಾಡುತ್ತ ಇದ್ದಾರೆ ತುಂಬಾ ತುಂಬಾ ಆಶ್ಚಾರ್ಯ ಪುರಾಣದಲ್ಲಿ ಕೇಳಿದ್ದುವಿ ನೋಡಿರಲಿಲ್ಲ” – claims that the man came back to life.", "The same video was earlier shared by international publications including Daily Mail which claimed that the man was found in a “mummified state” after spending a month in a bear cave. The video was fact-checked by AFP at the time. Most of the outlets had cited Russian organisation The Siberian Times as the source. The video earlier appeared on EurAsia Daily but had been doing rounds on YouTube, sans the ‘bear cave’ claim, before international media picked it up.", "In reality, the man’s name is Alexander. According to AFP, he was identified by “a group dedicated to finding missing people in the city of Aktobe in Kazakhstan called Zello Poisk.”", "The portion underlined in blue in the screenshot above reads: “We have found that the man in this video is from our city. He is being treated in one of our city’s [Kazakhstan] hospitals and his health is improving.”", "Rustem Isayev, director of the Aktobe Medical Centre, confirmed to AFP that the man was his patient and was not attacked by a bear. He said that Alexander, a resident of Aktobe, was suffering from the skin disease psoriasis.", "This was earlier reported by UK-based tabloid The Sun which wrote that Alexander, 41, died of “chronic psoriasis and became critically ill after he ignored his symptoms for months.” The report also stated, “Now a senior medic in the Kazakh city of Aktobe has revealed the former oil worker has died from sepsis caused by a large infected wound.” Alexander passed away on July 25, 2019.", "Therefore, social media claims suggesting that he is a ‘yogi’ who was found in a meditative state when dug out from a temple 300 years after being buried alive is false and quite bizarre, to say the least.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]