["“This is not sand in front of the two bald heads. it is human crowd at the BJP Kolkata rally. Yesterday was an unusual day in Kolkata. Modi ji was in town! Mamta B was not! On the vast Brigade Ground was a massive crowd of 10+ lakh Karyakartas(figure given by the Kolkata Police)”, reads a message posted along with an image purportedly of a rally that was addressed by Prime Minister Narendra Modi and BJP president Amit Shah in Kolkata. Modi visited Kolkata for an election campaign rally on April 3.", "Several other individuals on Facebook and Twitter have claimed that this was the scene at the recent Modi-Shah rally in Kolkata.", "Alt News had debunked this morphed image earlier when it was shared as that of a “tsunami of supporters” in a Modi-Shah rally. Alt News was able to trace back the image to December 2017 when PM Modi and Amit Shah were sharing dais in Shimla. The event was the swearing-in ceremony of Himachal Pradesh CM Jai Ram Thakur.", "PM Shri @narendramodi at the swearing-in ceremony of the Council of Ministers of the Himachal Pradesh Government in Shimla. pic.twitter.com/6vdGNfHOm4", "— BJP LIVE (@BJPLive) December 27, 2017", "The attire donned by the BJP president also matches with other images of the same event posted by News agency ANI.", "Shimla: Virender Kanwar and Vikram Singh take oath as cabinet ministers of Himachal Pradesh government pic.twitter.com/Dgbqg012XV", "— ANI (@ANI) December 27, 2017", "In the comparison below, the photoshopped image is placed alongside the original image.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]