["Gargling water mixed with salt or vinegar eliminates the new coronavirus from your throat.", "There is no evidence for this.", "Drinking lots of water will eliminate the new coronavirus from your throat.", "There is no evidence for this. It is a common myth.", "A post on Facebook shares a common piece of false advice on how to treat the new coronavirus. It says that sufferers can cure themselves in the early days of an infection by drinking lots of water, and gargling with warm water mixed with salt or vinegar. This is not true.", "The post reads: “Corona virus before it reaches the lungs it remains in the throat for four days and at this time the person begins to cough and have throat pains. If he drinks water a lot and gargling with warm water & salt or vinegar eliminates the virus. Spread this information because you can save someone with this information.”", "The incubation period for Covid-19 (the time it takes for symptoms to develop), which is caused by the new coronavirus, is thought to be between one and 14 days, according to the World Health Organisation (WHO). It says that most commonly symptoms seem to emerge after around five days.", "But it’s incorrect to suggest that people who have Covid-19 could cure themselves (either during this initial period or at any other time) by drinking water or gargling. The NHS says that adults can soothe an ordinary sore throat by gargling with warm, salty water. This is not advice for people who are infected with the new coronavirus. The NHS says, “There is currently no specific treatment for coronavirus.”", "The WHO has also said that there is no evidence that regularly rinsing your nose with saline is likely to prevent infection with the new coronavirus.", "False rumours that salt water might kill the virus have been common since the early days of the outbreak in China. We have written about it before, as have other factcheckers.", "Gargling salt water may soothe a sore throat, and people are advised to drink water in order to stay hydrated when they are ill with either flu or the new coronavirus.", "Current advice from the UK government, at the time of writing, is that people who experience a new, continuous cough or a fever should isolate themselves at home for seven days.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as false\n            because drinking and gargling water are not treatments for infection with the new coronavirus.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]