["On December 19, NewsX conducted a debate on the nationwide student protest against Citizens Amendment Act (CAA). The 57-minute debate, titled ‘Young students on CAA, Let’s solve this CAA Warzone’ is available on YouTube.", "On December 20, Twitter user @theotherdemon02 alleged that NewsX posed some of its journalists as students during the show. “ANI moment for #NewsX channel. NewsX panel posts own journalists as students, 4 of the 6 people on the panel are from the channel, and speaking against the interest of real students,” he wrote.", "ANI moment for #NewsX channel. NewsX panel posts own journalists as students, 4 of the 6 people on the panel are from the channel, and speaking against the interest of real students. Pls investigate @zoo_bear @free_thinker Full link here. 😂 https://t.co/CFI0QU7gNq pic.twitter.com/MpmDTLx7BN", "— Panpompur (@theotherdemon02) December 19, 2019", "Alt News reached out to a former NewsX employee (identity concealed at request) who could immediately identify two guests on the panel as current journalists with the channel – Arshiya Bhalla and Srishti Goel. According to the source, both Arshiya and Shristi work for NewsX digital team.", "While introducing the panellists, anchor Devika Chopra said, “…I have with me, several students in the studio right now…” As a result, the viewers were likely to believe that all the guests on the show were students.", "The second “guest” was Arshiya Bhalla. While introducing her at 5:20, Chopra said, “Arshiya Bhalla also joins us…” NewsX subsequently introduced her as a student at 5:54. However, later in video Bhalla was addressed as a ‘professional’ or ‘young professional.’", "As per Bhalla’s comments during the show, it seems she doesn’t approve the protests. Her last words on the debate appropriated the PM’s statement – “identify people from their clothes.” [Translated from – कपड़ों से पहचानो]", "At 8.30, Devika Chopra introduced the third “guest” Shristi Goel. “I also have Shristi Goel who is a Jamia student with me on the broadcast,” the anchor stated. At 8:39, Goel opened her statements with, “First of all, as you said I’m a Jamia student…” and expressed her views on the anti-CAA protest in the varsity.", "On-screen, NewsX introduced Goel for the first time at 10:12 as a ‘Jamia student.’ Just like Bhalla, in the latter part of the show, Goel was addressed as a ‘professional’ or a ‘young professional.’", "Goel came across as a person who believes in citizens’ right to protest. She also expressed concerns with NRC, however, said that the government should have been prepared like they were with Kashmir.", "Update: Another “guest” on the show ‘Adarsh’ was introduced by Devika Chopra at 15:54. He too was identified as a student via an on-screen graphic at 16:22 and subsequently referred as a student throughout the length of the debate.", "Adarsh opened his statements by saying, “I believe there is a problem on both sides..” however condemned the discriminatory nature of the law and police excess.", "Alt News found Arshiya Bhalla and Srishti Goel anchoring a segment for NewsX YouTube live on December 22. Bhalla can be seen on ‘Bigg Boss 13 Live : Weekend Ka Vaar – Episode – 82‘. According to her Facebook and LinkedIn profiles, she currently works at NewsX.", "Both Bhalla and Goel have author profiles on the NewsX website.", "It is noteworthy that Goel was first identified as ‘Sristi’ (refer to screenshot 2) but the channel later changed the spelling to ‘Shristi’ (at 14:50), which matches with her spelling on NewsX website.", "Goel can be seen anchoring ‘Bigg Boss 13 Live : 17th December Full Episode‘ for NewsX.", "Adarsh’s full name is Adarsh Shukla. He is a journalist with inKhabar which is a part of India News. Both NewsX and inKhabar are managed by the same parent organisation ITV Network.", "Alt News found Shukla anchoring a show for inKhabar– ‘Vashishtha Narayan Singh Death, जिन्हें नाज़ है हिंद पर वो कहां हैं? | India News’ – on November 14.", "Shukla also has an author profile on inKhabar’s website which addresses him as the chief sub-editor. The last report under his byline was published on December 23.", "NewsX, therefore, placed at least three journalists as students during a discussion on protests against the Citizenship Amendment Act. While Arshiya Bhalla and Srishti Goel are associated with NewsX digital, Adarsh Shukla is a journalist with inKhabar.", "The debate, broadcast as ‘Hear the students’, had individuals from the parent organisation ITV Network posing as student voices on the controversial legislation. Alt News tried contacting NewsX via text, email and phone but we are yet to get a response.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]