["Since the past few days, a video of Pangong Tso lake has been massively shared by Congress members and supporters of the party. Jammu and Kashmir Congress leader Salman Nizami claimed that the video shows Chinese tourists at the lake. He questioned, “Can someone ask ’56 inch’ Chowkidar if Indians now need a visa to visit Pangong Lake?” insinuating that the water body is now under China’s complete control. The clip drew over 3.7 lakh views from Nizami’s handle.", "Chinese tourists in Ladakh’s Pangong Lake. Can someone ask ’56 inch’ Chowkidar if Indians now need a visa to visit Pangong Lake? pic.twitter.com/6LKiMu12PP", "— Salman Nizami (@SalmanNizami_) September 8, 2020", "India-Sino border dispute has been ongoing for months, leading to the death of 20 Indian army men in Galwan Valley in the month of June. The casualty on the Chinese side is unknown but both countries have blamed each other for cross-border firing and trespass violations amidst stand-off consensus.", "Congress member George Kurian similarly claimed that the Bharatiya Janata Party (BJP) government is in denial about any incursions by the Chinese army at Pangong Tso while China has “started generating revenue” from tourists visiting the lake.", "BJP Government in denial mode about any incursions by Chinese army at Pangong Tso and China has started generating revenue from Pangong Tso #WakeUpBJP #PangongTso pic.twitter.com/cjXaW0g76P", "— जॉर्ज कुरियन (@GeorgekurianINC) September 8, 2020", "Congress National Convenor Saral Patel expressed anger at the video.", "Chinese tourists at Panging Tso. 😡 pic.twitter.com/ettfLQMyWQ", "— 𝐒𝐚𝐫𝐚𝐥 𝐏𝐚𝐭𝐞𝐥 (@SaralPatel) September 8, 2020", "Gaurav Pandhi, national coordinator of Congress’ Digital Communications, and Twitter handle Rofl Republic (@i_theindian) made similar claims.", "This slideshow requires JavaScript.", "The video does not show Chinese tourists on the Indian side of Pangong Tso. According to The Indian Express, the lake is 135-km long, out of which about 45 km-long western portion is under Indian control while the rest is controlled by the Chinese. The video has been shot on the China-controlled portion of the lake.", "Pangong Tso is also known as ‘Bangong Co’ or ‘班公错’ in Chinese. Alt News searched for visuals of the lake on the Chinese side with a keyword search on Baidu in the Chinese language. Baidu is a Chinese search engine akin to Google.", "We found several Chinese websites carrying images of the lake, one of which has been attached below. This image is from a travel blog with several other photographs of the area. The traveller has added multiple pictures of his journey to the lake. The one we have chosen for the purpose of this fact-check has been described as, “Arrived at the easternmost side of Pangong lake (along Route 219).”", "Route 219 is China National Highway 219 also known as G219. It stretches along China’s western border and Tibet Autonomous region. G219 connects to Bangong Co, as evident from the Google Earth screenshot below.", "Alt News will compare the mountain range seen in the image on the travel blog with the range seen at about 23 seconds in the viral video. In the course of the comparison, you will observe that both ranges are the same. We want to draw your attention to five specific aspects:", "1. Marked in blue – a low-lying mountain which is darker than the mountain right behind it.", "2. Marked in red – the left-most peak behind the darker low-lying mountain.", "3. Marked in green – a low-lying mountain between the two peaks.", "4. Marked in yellow – the right-most peak", "5. Marked in pink – a low-lying mountain which is a shade darker than the right-most peak.", "(Readers are requested to use laptops/PCs for ease of understanding. The marking below would be visible better on large display screens.)", "That the location is the same is further verified upon comparing the ridges on the left-most peak.", "Moreover, pictures of the same mountain range are also available on Google Earth. They have identical ridges as highlighted above and are all geo-mapped to the Chinese side of the lake.", "Below is a Google Earth representation of the range. It is to be noted that Google Earth images are not real-time but 3D representation of Earth, based primarily on satellite imagery. Google compiles photographs and maps into digital form.", "Congress members, therefore, tweeted a video of tourists at the Chinese side of Pangong Tso with the misleading claim that China has “occupied” the region amid tensions with India. It is noteworthy that Twitter handle Rofl Republic (@i_theindian) claimed that Chinese tourists were spotted “holidaying” at Pangong Tso first time in 72 years. This claim is also false. There are pictures of tourists at the Chinese side of the lake on Google Earth which date back to 2006. Times Now had earlier misidentified the Indian side of the lake as Chinese tourists on the region controlled by China.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]