["Does Nigeria spend seven times more person on healthcare than South Africa as reported by ThisDay? We checked this claim.", "WHO data shows this seven-fold different was accurate in 2010 and 2011", "But most recent data shows this has since narrowed to five times more", "Experts say Nigeria needs to spend notably more on its healthcare", "The Nigerian government has a “poor attitude” towards financing healthcare, a national newspaper stated recently. To make its case, it compared Nigeria’s health spend to that of South Africa.", "“It has been reported that South Africa spends about seven times more per head on healthcare than Nigeria does,” ThisDay’s article noted.", "Nigeria has budgeted N340.5 billion for health in 2018, or about 3.9% of the total budget, the paper said - “magically” hoping it will be “enough to cater for the myriads of healthcare challenges bedeviling the nation, including malnutrition, incessant outbreaks of diseases, cancers, typhoid fever, malaria [and] primary healthcare concerns, just to mention a few. (Note: The African Union’s Abuja Declaration, incidentally signed in Nigeria, urges members to commit at least 15% of their annual budgets to health.)", "Does the claim about health spending in two of Africa’s largest economies get a clean bill of health? We consulted professionals in the field.", "The article’s writer told Africa Check the claim was informed by online research and he provided a link to an article.", "Published five years ago, the article attributed the statistic to a “BusinessDay research report”. But Africa Check could trace it neither the South African or Nigerian business-focused publications that go by this title.", "We then turned to the Global Health Expenditure Database of the World Health Organisation (WHO) which provides statistics stretching back to 2000. Its latest data is for 2015, the national health accounts department at the UN agency told Africa Check.", "Global health professor at the Institute of Health Metrics and Evaluation at the University of Washington, Joseph Dieleman, recommended comparing health expenditure per person converted to a common currency.", "“Because South Africa and Nigeria use different currencies, you need to adjust [them] to a common currency. US$ or PPP would be appropriate,” Dieleman said", "Purchasing Power Parity (PPP) is an indicator used to bridge international differences in the cost of living. The World Bank-coordinated International Comparison Programme calculates purchasing power parities for 177 countries.", "Dieleman further pointed out that as the newspaper’s claim did not distinguish between government and private health spending, so it would be useful to look at both.", "The WHO lists Nigeria’s government and private health spend per person in 2015 at US$97. In the same year, South Africa’s was US$471, or about five times more.", "This difference represents a steady fall from 2010 and 2011 when it was seven times more. Before that, the lowest difference was five times in 2008 and the highest in 2000, at 15 times.", "When adjusted for the cost of living, Nigeria’s per capita spend on healthcare was PPP$215 in 2015, while South Africa’s was PPP$1,086 - also five times more.", "Where Nigeria really falls short is in government funding of healthcare. When public funds for healthcare in 2015 is considered, South Africa spent approximately 16 times more per person than Nigeria. (Note: This is the case for both US dollar and PPP.)", "“Because of the formal sector tax base and a government priority on health (note increased funding for AIDS treatment), South Africa does put more funds into health care available to the general population in comparison to the level of spending in Nigeria,” Prof Frank Feeley, who is chair of the department of global health at Boston University, told Africa Check.", "“Perhaps the most telling difference is the proportion of health expenditures made out of pocket, without insurance or public funding. Nigeria clearly loses by this measure.”", "The WHO data shows that 70.3% of health expenses in Nigeria are made out-of-pocket, whereas for South Africa the figure is 7.7%.", "“Considering the level of poverty in the country, it means that many Nigerians don’t have access to quality healthcare,” Lekan Ewenla, a health economics expert who is on the council of the National Insurance Scheme, told Africa Check.", "The president of the Nigerian Medical Association, Dr Mike Ogirima, blamed poor health funding by government for the emigration of Nigerian doctors. He is a professor of orthopaedic and trauma surgery at the Ahmadu Bello University in Zaria.", "“I don’t have sufficient equipment to work with; my working environment is poor and my patients can’t afford many treatment options offered to them,” he said.", "To highlight what it said was the Nigerian government’s low investment in healthcare, a national newspaper claimed that South Africa spends seven times more on its people.", "Data from the World Health Organisation show that while this was accurate in 2010 and 2011, the difference has since narrowed. South Africa spent five times more per capita than Nigeria in 2015, according to the most recent data available.", "Nigerians are particularly worse off in two aspects: government spending on health (16 times less than South Africa) and out-of-pocket spending (70.3% of health expenses versus 7.7%).", "Additional reading:", "https://africacheck.org/factsheets/factsheet-why-do-nigerias-doctors-feel-unloved/", "https://africacheck.org/reports/does-nigeria-have-the-lowest-health-budget-in-africa/", "https://africacheck.org/reports/does-sas-private-healthcare-sector-only-provide-care-for-16-of-the-population/", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]