["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Tulsi Gabbard is an Army National Guard major and served in Iraq. (Getty Images)", "A Facebook post portrays Democratic presidential candidate Tulsi Gabbard as a supporter of the anti-fascist movement, claiming that a photo shows her posing with someone who leads the movement.", "\"Antifa Fascist Fangirl Tulsi Gabbard posing with Evan Duke, leader of Portland Antifa and Occupy ICE,\" said an Oct. 22 Facebook post that’s been shared more than 100 times. (The post says \"antifa fascist\" — yet antifa is short for anti-fascist.)", "The picture used in the post does include a man named Evan Duke who appears to support the antifa movement. But Duke and an antifa group in Portland, Ore., told PolitiFact that Duke does not lead antifa nor Occupy ICE. The photo circulating on Facebook was taken in North Dakota when Gabbard went there to support veterans and others protesting the construction of the Dakota Access Pipeline and its potential impact on water safety and tribal lands.", "The Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "PolitiFact requested comment from Gabbard’s congressional office and presidential campaign. Her congressional office referred us to her campaign, which did not respond to our queries.", "Antifa is a term used for a collection of far-left, anti-fascist groups across the country that rally against white supremacy and other causes, at times resorting to violence. The antifa movement goes back decades, but regained attention after antifa groups counterprotested white nationalists in Charlottesville, Va., in August 2017.", "Conservative group Turning Point USA in August 2019 asked Gabbard if she would be willing to denounce antifa. \"I have denounced antifa,\" Gabbard said.", "Occupy ICE is a movement that protests and wants the abolishment of the federal immigration agency Immigration and Customs Enforcement, or ICE. The movement gained traction in June 2018 with protests of the Trump administration’s \"zero-tolerance\" immigration policy.", "The Facebook photo features Gabbard and seven other people.", "Gabbard, a congresswoman from Hawaii and a major in the Hawaii Army National Guard, posted a similar picture of the group on her Facebook page on Dec. 10, 2016. She described the people in the image as a group of veterans helping with safety and security operations at a camp protesting the Dakota Access Pipeline.", "\"I'm honored to have met these incredible veterans, who inspire as they continue their mission of service,\" Gabbard’s post said. \"They are in this for the long haul, planning to stay until the drilling pad and construction equipment are removed. #nodapl #mniwiconi #waterislife #veterans.\"", "The photo in the Oct. 22 Facebook post also appears on a website called Hallwalls, on a page that promoted a January 2017 event by a group called VeteransRespond. The group planned to present a \"storytelling event featuring United States military veterans who stood at Standing Rock.\" The page describes VeteransRespond as a national service organization formed by veterans who went to the Standing Rock Sioux Reservation in North Dakota.", "The Hallwalls caption for the photo identified one of the men as \"Evan Duke (Occupy Wall St.)\"", "Snopes.com found a Facebook account for someone named Evan K Duke III, who on Dec. 9, 2016, posted a picture similar to the one posted by Gabbard and to the one now circulating on Facebook.", "Duke’s post said:", "\"#NoDAPL #StrengthAndHonor Occupy/Veterans camp built an HQ and barracks for incoming vets at Standing Rock with donations from people across the United States. We processed and housed as many people as we could on the ground during the blizzards. We were invited to be Tulsi Gabbard's security detail during her stay at camp. Before she left she came to our little plywood and 2x4 HQ to tell us how proud of us she was. With tears in her eyes she told us we were on the right path to creating the change this nation needs. We shed tears with her and said our Alohas. We taught her the Lakota word Doksha (until we see you again). Farewell relative. You are one of us!\"", "PolitiFact reached out to that account, and the user confirmed he was in the picture being shared on Facebook. Duke’s account includes antifa-related posts, but he said he was not the leader of antifa nor of Occupy ICE.", "\"Whoever made such claims clearly has no understanding of how de-centralized movements work,\" Duke said. \"There are no leaders, there is no formal organization, their (sic) are no meetings, plans, rosters. Within those movements there are simply autonomous activists organizing as they see fit.\"", "Duke’s Facebook account also posted a detailed message on Aug. 26, 2016, to actress Shailene Woodley’s Facebook page. Duke wrote that he was with \"Occupy Inauguration Planning Committee,\" a mass rally scheduled for Inauguration Day in January 2017 in D.C. He asked Woodley for her endorsement and participation. (Woodley had supported protests against the Dakota Access Pipeline.)", "PolitiFact reached out to a group called Rose City Antifa (whose website said it was founded in 2007 in Portland, Ore.) asking if Duke was the \"leader of Portland Antifa and Occupy ICE,\" as the Facebook post claimed.", "\"Evan Duke is not the leader of Portland Antifa, he is not a member of our organization, and he is not the leader of Occupy ICE,\" the group responded in an email. They said he had never been the leader of the groups, either.", "Our ruling", "A Facebook post claim to show, \"Antifa Fascist Fangirl Tulsi Gabbard posing with Evan Duke, leader of Portland Antifa and Occupy ICE.\"", "Gabbard is in the picture along with a group of people; they were in North Dakota protesting the construction of the Dakota Access Pipeline. The picture includes a man named Evan Duke, who appears to support the antifa movement. But Duke and an antifa group in Portland told PolitiFact that Duke has not led Portland Antifa nor Occupy ICE.", "Gabbard has said that she \"denounced antifa.\"", "Though the photograph itself is real, the Facebook post presents the image out of context and with factual inaccuracies. We rate it Mostly False.", "Facebook post about Tulsi Gabbard, Antifa, Oct. 22, 2019", "Email interview, Rose City Antifa, Oct. 24, 2019", "Email interview, Tulsi Gabbard congressional press office, Oct. 24, 2019", "Facebook messenger interview, Evan Duke, Oct. 26, 2019", "Snopes.com, Is This a Picture of Tulsi Gabbard with Antifa?, Oct. 22, 2019", "MPRNews.org, North Dakota pipeline construction halted until court date, Aug. 18, 2016", "NYMag.com, Thousands of Veterans to Form a Human Shield Around Standing Rock Protestors, Dec. 1, 2016", "ADL.org, Who are Antifa?", "Twitter, @CharlieKirk11 tweet, Aug. 18, 2019", "The New York Times, The Conflicts Along 1,172 Miles of the Dakota Access Pipeline, updated March 20, 2017", "Tulsi Gabbard Facebook post, Dec. 10, 2016", "Hallwalls.org, Warrior's Call: The Fight to Stop the Dakota Access Pipeline", "Evan K Duke II Facebook post, Dec. 9, 2016; post to Shailene Woodley’s Facebook page, Aug. 26, 2016", "Rose City Antifa About page", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]