["A 33-second video published on July 13, 2019 in this Facebook post shows a man dressed in a green waistcoat and orange trousers dancing exuberantly along with others.", "The post's Urdu-language caption translates as: “The finance minister of the state of Medina after imposing taxes…!!!”", "The \"state of Medina\" refers to Khan's election pledge to transform Pakistan into an \"Islamic welfare state\" modelled after the city of Medina, which was established by the Prophet Muhammad and his earliest followers.", "Subtitles on the video say in English: \"Hafeez Shaikh after imposing taxes on Pakistan\". Shaikh is Khan's finance advisor; here is his website.", "The video post has been viewed more than 920,000 times and shared more than 31,000 times. It can be seen in the screenshot below:", "The video has been viewed hundreds of thousands of times in other Facebook posts here, here and here, with the same claim that the man is Shaikh, dancing after imposing taxes.", "Many of the more than 1,200 people who left comments on the post pictured above appeared to believe the claim, as seen in the screenshot below:", "The three comments, which mix English and Urdu, read as follows:", "Taimur Khan: It’s his private life he can do anything what he wants. In weddings everyone enjoying so didn’t do anythin wrong shame on u admin patwari", "Fahmin Hakim Dawar: Appreciated…, it’s a gathering of friends, enjoy life… No doubt you can criticize his policy being a Pakistani, but not who he is.", "Arman Ullah: The life of public figures is considered public property.", "The claim is false; the video of the dancing man is not from Pakistan but matches the clip in this tweet from India – dated July 7, 2019 – which says the man was dancing at his 25th wedding anniversary.", "Namaah Kumar, the woman who tweeted the video under the handle @thehappyn00dle, confirmed to AFP that the man dancing in the video is her uncle and the clip was filmed in India's Mumbai, not in Pakistan.", "Here is a screenshot of the tweet:", "AFP used the video verification tool InVid to analyse keyframes from the video on Google.", "Reverse image searches found this article about the video, posted on a news website on July 8, 2019 – days before the clip was posted on Pakistani pages on Facebook, purporting to show Shaikh.", "Here is a screenshot comparison of the dancing man (L) and Shaikh (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]