["About this rating", "On 3 June 2015, the web site Huzlers published an article reporting that Caitlyn Jenner had decided to transition back to male:", "After breaking a twitter record for the quickest person to reach one million followers in just four hours, Caitlyn Jenner, formerly known as Bruce Jenner, has announced that he regrets becoming a female and wants to be a man again.", "Caitlyn Jenner has reached massive publicity in the last few days after his/her appearance on the front cover of Vanity Fair. Caitlyn Jenner has even won the ESPY courage award, somehow.", "There is no truth to the article. Huzlers is one of many fake news sites that aims to drive traffic by penning fictitious articles about trending issues:", "Huzlers.com is the most notorious urban satirical entertainment website with the most shocking headlines and articles.", "The site has previously published fictitious stories about a man selling his son for an Apple Watch and human urine being found in cans of AriZona Iced Tea. The site is prominently featured on Snopes.com's \"Do Not Share\" list.", "Huzlers wasn't the only web site that attempted to capitalize on the transphobia that descended on the web after Caitlyn Jenner's Vanity Fair cover. In addition to the baseless rumor that Jenner had won the Arthur Ashe Courage Award over \"runner up\" Noah Galloway, another \"entertainment\" web site penned a fake article claiming that Kris Jenner was planning to transition to male so that she could get back together with Caitlyn Jenner.", "In May 2016, the story re-circulated, given slightly more credibility by Kardashian family biographer Ian Halperin, who quoted \"anonymous sources\":", "Ian Halperin, the author of “Kardashian Dynasty: The Controversial Rise of America’s Royal Family,” said that, while researching his book, multiple sources told him that the former Olympian had been miserable for months and has considered transitioning back to a man.", "“One source confirmed to me Caitlyn has made whispers of ‘sex change regret,’ hinting she might go back to being Bruce Jenner,” Halperin said.", "Halperin said that one long-time friend told him that, while Jenner was “thrilled” to champion transgender issues, the reality TV personality could de-transition “in the next couple years.”", "Jenner's representative immediately dismissed the claims:", "Not worth commenting on such an idiotic report.... Of course it's not true.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]