["“Trudeau laughs with reporters over $600 million media bribe,” says the caption of a video viewed more than 210,000 times on Facebook. “You won’t believe what Justin Trudeau was just caught admitting on camera,” adds Canada Proud, one partisan Facebook page that also shared the video on Twitter.", "The video was also shared more than 12,000 times from this page which says it is not directly affiliated with Conservative Party leader Andrew Scheer’s campaign despite it’s appearance.", "The video is real, but it is only a short snippet of the May 2019 Parliamentary Press Gallery Dinner, a yearly Canadian tradition during which accredited parliament journalists bring politicians, MPs, and diplomats as their dates for an evening usually punctuated by jokes and jabs between journalists and politicians.", "It was in that context that Trudeau jokingly referred to his government’s promise to grant Cad$595 million in subsidies to various Canadian media organizations. Critics have called the plan a media buyout from the Liberals, so the prime minister jokingly pointed out that the reason media was so kind to him was because he paid them.", "“You don’t get stellar headlines like these, without greasing the wheels a bit,” he said as headlines from major Canadian media criticizing Trudeau appeared on a screen next to him. They included, “Justin Trudeau is tampering with Canada’s brand” and “Trudeau has lost the moral mandate to govern.”", "This latter part of the joke was not included in the video shared by Conservative leaning groups, thus giving the video the appearance of an admittance from the prime minister.", "A video of the entire Parliamentary Press Gallery Dinner is available from several sources online, and although it is a private event, what happens inside is not kept secret. Watching the speech in full makes it clear that Trudeau was not “caught admitting” a secret plan to buy Canadian media.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]