["About this rating", "Since its debut in 1997, the Harry Potter franchise has included seven books, eight movies, and a host of a peripheral content based on the popular book series from author J.K. Rowling. But judging by the popularity of a video supposedly showing a trailer for a new Harry Potter movie that is set for release in 2020, plenty of people apparently still want to take one more trip to Hogwarts.", "On Oct. 14, 2019, Facebook user Márcia Farias posted a video entitled \"TRAILER HARRY POTTER 2020,\" which has racked up more than 20 million views since its initial posting:", "This is not a genuine trailer for a new Harry Potter movie. This is a fan-made trailer that cuts together existing footage from old Harry Potter movies with clips of the actors (Danielle Ratcliffe, Rupert Gint, and Emma Watson) from other non-Harry Potter films.", "At the 1:01 mark, for instance, Ratcliffe can be spotted in a hammock. This clip comes from the 2017 movie \"Jungle,\" not a new Harry Potter movie. A few seconds earlier, viewers can glimpse actress Watson gazing up at the sky. Again, this footage was taken from an unrelated movie (in this case the 2017 movie \"The Circle\") and does not show footage from a new Harry Potter film. Likewise, the images of Grint in a tuxedo come from the Crackle show \"Snatch.\"", "This is hardly the first time we've covered false rumors about a new Harry Potter movie. In April 2018, a fake movie poster for a \"Harry Potter and the Cursed Child\" movie was circulated on social media. We've also previously addressed false rumors about a Harry Potter Netflix show and an eighth book in the series.", "As of this writing, no official announcements have been made regarding a new Harry Potter film. However, fans will have a few more chances to visit this fictional universe. J.K. Rowling and Warner Bros. have produced a spin-off series called \"Fantastic Beasts and Where to Find Them.\" Two movies in this series have already been released and three more are scheduled over the next few years. A stage play also was created called \"Harry Potter and the Cursed Child.\" While it's possible that \"Curse Child\" will eventually gets a movie adaptation, Warner Bros. has made no announcements to that effect.", "Khatchatourian, Maane and Dave McNary.   \"‘Fantastic Beasts and Where to Find Them’ to Be Five-Film Franchise.\"\r\n    Variety.   13 October 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]