["The misleading images emerged hours after Pakistan said it had shot down two Indian warplanes in its airspace. Here is an AFP story on that incident.", "This tweet by Pakistani journalist Wajahat Kazmi, published on February 27, 2019, and shared more than 700 times in four hours, contains three pictures – two showing smoking plane wreckage and one graphic image of a charred body.", "Kazmi's Twitter account has more than 400,000 followers and is verified. He describes himself as a former correspondent for national newspaper Dawn and TV network Samaa.", "The tweet's caption says: \"#PakistanAirForce shoots down two Indian Air Force IAF jets in #Budgam killing one Indian pilot while arresting another one alive. More retaliation to follow soon. This escalation isn't going to be over anytime soon - #PakistanStrikesBack #PakistanArmyZindabad #PakistanZindabad\"", "The same images of the burning planes have also been shared on Facebook, for example here, used in media reports about Pakistan shooting down the Indian jets, such as here, and posted on YouTube for example in this video, where it has been viewed more than 4,000 times in the hours since it was uploaded.", "The two planes' tail numbers, TU657 and A3492, are clearly visible in the pictures carried by the misleading post, as can be seen in the composite image below:", "The picture of the jet with the tail number TU657 is an AFP image dated August 1, 2016. Here is the photo on AFP's Image Forum.", "The photo's caption says: \"Officials gather around the remains of an Indian Air Force Mig 27 fighter jet that crashed into a residential building in Jodhpur in India's western Rajasthan state on June 13, 2016.\"", "Local media reports also covered the Jodhpur crash at the time and used the same AFP photo, for example here in The Tribune. Here is an NDTV report of the same crash.", "The picture of the plane with the tail number A3492 is from a 2015 crash in Odisha. The same image is used in this report in The Hindu published June 3, 2015. Here is an Indian Express report on the same incident.", "Some Indian media outlets have also debunked the misleading use of the photo, such as here by India TV news.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]