["About this rating", "In June 2018, several social media pages centered on presenting odd or unexpected facts shared a story about how the Golden State Fence Company had been fined $5 million for hiring undocumented workers to build a border wall:", "This story was true, but because the sources replicating it failed to note exactly when the fine was levied, and because the political conversation at the time was extremely focused on border security (but many participants in that conversation seemed unaware that walls separating portions of the United States and Mexico had existed for many years), quite a few viewers assumed the fence company fine was a recent event connected to the Trump administration.", "Some pages even explicitly cited a link, making statements such as \"Trump and his cronies are nothing but a bunch of corrupt hypocrites.\"", "Although it is true that the Golden State Fence Company was fined $5 million for hiring undocumented workers, that fine was levied in December 2006, back in the days of the George W. Bush administration, as NPR reported at the time:", "A fence-building company in Southern California agrees to pay nearly $5 million in fines for hiring illegal immigrants. Two executives from the company may also serve jail time. The Golden State Fence Company's work includes some of the border fence between San Diego and Mexico.", "After an immigration check in 1999 found undocumented workers on its payroll, Golden State promised to clean house. But when followup checks were made in 2004 and 2005, some of those same illegal workers were still on the job. In fact, U-S Attorney Carol Lam says as many as a third of the company's 750 workers may have been in the country illegally.", "Memes also made it seem as if the Golden State Fence Company's sole project was constructing a border wall, but the company was found to have hired undocumented workers for a variety of projects over the years. NBC News reported that one of the company's projects was constructing part of a fourteen-mile-long border fence in San Diego in the late 1990s, stating that \"Prosecutors allege the company hired more than 100 illegal immigrants from 1999 to 2005, and continued to employ dozens of undocumented workers even after two government audits ... Among its projects: construction of part of a 14-mile border fence in San Diego in the late 1990s.\"", "Golden State Fence Company was indeed fined $5 million for hiring undocumented workers, but that activity took place took place in 2006, not during the Trump administration. Furthermore, the company's involvement with building a border wall occurred in the late 1990s, during the presidency of Bill Clinton.", "NPR.   \"Border Fence Firm Snared for Hiring Illegal Workers.\"\r\n    14 December 2006.", "NBC News.   \"Execs Plead Guilty to Hiring Illegal Immigrants.\"\r\n    14 December 2006.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]