["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Oxycodone pills, a prescription pain-killer at the center of the opioid abuse crisis. (AP/Mark Lennihan)", "Does West Virginia have the nation’s leading rate of overdoses?", "On Oct. 3, Sen. Joe Manchin, D-W.Va., tweeted, \"#WV has the highest overdose rate per capita of any state in our nation. That’s why I made sure the SUPPORT for Patients & Communities Act included a set aside for states like WV. This language more than tripled the amount of funding coming to our state for this coming year.\"", "#WV has the highest overdose rate per capita of any state in our nation. That’s why I made sure the SUPPORT for Patients & Communities Act included a set aside for states like WV. This language more than tripled the amount of funding coming to our state for this coming year. pic.twitter.com/88rgNIDOPg", "Here, we’ll focus on whether West Virginia \"has the highest overdose rate per capita of any state in our nation.\"", "We turned to an analysis of data from the Centers for Disease Control and Prevention that was collected and analyzed by the Kaiser Family Foundation. The data is from 2016.", "Manchin’s tweet wasn’t specific about whether he was referring to opioid overdoses specifically or overdoses generally. The Kaiser Family Foundation analysis includes data for both, so we looked at both categories.", "On both lists, West Virginia has the unhappy distinction of ranking No. 1.", "Here’s a chart showing the data for opioid overdoses specifically. The data looks at the number of overdoses per 100,000 population, which is an equivalent measure to per capita. The opioid overdose rate in West Virginia easily outpaces the second-ranking state, New Hampshire.", "As for overdoses overall, West Virginia finishes first, with Ohio ranking second.", "Manchin said that West Virginia \"has the highest overdose rate per capita of any state in our nation.\"", "Official government data shows that West Virginia ranks first per capita in both opioid overdoses specifically and in overdoses more generally. We rate the statement True.", "Joe Manchin, tweet, Oct. 3, 2018", "Kaiser Family Foundation, \"Opioid Overdose Death Rates and All Drug Overdose Death Rates per 100,000 Population (Age-Adjusted),\" accessed Oct. 31, 2018", "The Herald-Dispatch, \"Joe Manchin, Marco Rubio: Bipartisan efforts fight against opioid epidemic,\" Oct. 15, 2018", "WV MetroNews, \"Opioid death rate in West Virginia may be slowing,\" July 24, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]