["About this rating", "The Centers for Disease Control and Prevention offered recommendations to parents and guardians in advance of the 2020 academic year, which included advice to prepare for a “sudden sleepover” in the event of an unexpected emergency or natural disaster.", "Health officials did not specify that students would be kept overnight at schools in the event of an emergency, COVID-19-related or otherwise.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As some schools reopened in fall 2020 following nationwide closures in response to the COVID-19 pandemic, a rumor circulated that health officials had recommended parents and guardians plan for a possible \"sudden sleepover\" at school in the event of an emergency or natural disaster, which could include COVID-19.", "Snopes readers asked our team to verify whether this advice was, in fact, issued by the Centers for Disease Control and Prevention (CDC). We found the rumor to be based in truth but taken out of context and seasoned with a political spin.", "The reported advice was first published by Intellihub, a website that media background-checking tool Newsguard found to have “promoted false and unsubstantiated conspiracy theories” and has “inconsistent” information about its content creators, for example, referring to its reporters as \"staff writers\" or omitting their names altogether. The Intellihub article in question read that \"the government must be expecting some sort of disaster,\" which placed the CDC's advice in a paranoid context. Many of Intellihub's other articles include similar tactics that appear to try to scare readers, such as those that claimed that \"tsunami waves will swamp Washington coast,\" or the suggestion that governments were \"igniting wildfire[s] in California from space.\" USSA News, a blog launched in opposition to the 2010 passage of the Affordable Care Act and that goes by a tagline of the \"Tea Party's Front Page,\" subsequently shared the Intellihub article in its entirety, which read:", "The Center for Disease Control issued a three-step preparedness card questionnaire that asks parents the unthinkable and insinuates what should be done when it comes to protecting “your child during emergencies in the school day.”", "The CDC guidelines say it’s as “easy as ABC.”", "“How would you be reunited with your child in an emergency?” the questionnaire asks parents.", "“Bring extra medicines, special foods, or supplies your child would need if separated overnight,” it reads. “Complete a backpack card and tuck one in your child’s backpack and your wallet.”", "Additionally, it reads: “An emergency might require a sudden sleepover. Tell school administrators about any extra supplies your child may need to safely make it through a night away from home.”", "It is important to note that the Intellihub article did not mention COVID-19. That reference was added when the story was picked up on Sept. 5, 2020, by Ohio Statehouse News, a media source described on its Facebook page as a “political news outlet, minus the liberal-media slant.” The publication noted that the CDC was “advising parents to prepare for a ‘sudden sleepover’ for their children in the case of a disaster, which could include COVID-19.”", "The CDC did offer advice to schools for reopening amid the COVID-19 pandemic, including a printable “backpack emergency card” available on the agency's website. In it, health care experts recommended three steps for parents to take in order to ensure that their child is safe in the event of an emergency or evacuation at school. This advice includes: Asking how a parent or guardian would be reunited with their child during an emergency; Bringing extra medicines, special food, or supplies that a child might need if they were separated overnight; and Completing a backpack card to be kept in both the child’s backpack and in the caregiver’s wallet.", "It is not known whether the backpack card was created specifically for the 2020-21 academic year or if it had previously existed as part of general emergency planning recommendations. Snopes contacted the CDC for further clarification but did not hear back at the time of publication.", "It is true that the backpack emergency card posits that an “emergency might require a sudden sleepover” and advises caregivers to tell their school administrators about any extra supplies that a child might need to “make it through a night away from home.\" However, there is no mention of COVID-19 or coronavirus listed anywhere in the infographic. Additionally, the CDC did not specify that children are expected to stay the night at school. Rather, parents and guardians should consider that an emergency might mean that a relative or emergency contact may need to pick up a child from school and, as such, the child should have the resources necessary to plan for possible overnight arrangements away from home.", "The card is part of the CDC’s “Caring for Children in a Disaster” campaign aimed at helping parents and guardians prepare for an emergency at the launch of the 2020 academic year.", "“From tornadoes to water main breaks, emergencies can occur with little or no warning— even during the school day. As children head back to school, take a few steps to help protect your child from an emergency and to reunite with your child quickly and safely,” wrote the agency on its website, which also included a link to a separate web page that provided a more in-depth description outlining school and childcare responses to COVID-19.", "The Ohio Statehouse News article went on to report that the CDC had listed COVID-19 as a “biological threat” that may require children to unexpectedly stay overnight at a school. Though it is true that the health agency included infectious diseases as a biological threat that may pose particular harm to children, the CDC specified that for an infectious disease to be considered a biological threat, it must be intentionally released. To date, there is no evidence to suggest that SARS-CoV-2 was a “bioweapon” either created by humans or intentionally released to cause harm to the global population.", "In the event that a student or staff member tests positive for COVID-19, the CDC noted in a July 24 update that individual schools should have a response plan that the agency said should be communicated to parents. However, in the document, there is no reference to a “sleepover,” “slumber party,” or other “overnight” arrangements.", "Fears about children being separated from their families was a theme among COVID-19 rumors submitted to Snopes in 2020. It appeared that these blog posts were yet another attempt at stoking that fear.", "Intellihub.   \"CDC Announces ‘Emergency Might Require A Sudden Sleepover’ of Schoolkids.\"\r\n    26 August 2020.", "USSA News.   \"CDC Announces ‘Emergency Might Require A Sudden Sleepover’ of Schoolkids.\"\r\n    26 August 2020.", "Stephen, Cheryl.   \"CDC Advises Parents to Prepare for ‘Sudden Sleep-over’ for School Children.\"\r\n    Ohio Statehouse News.   9 Sept. 2020", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]