["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Researchers Paul Auer and Yi Zhang are shown Sept. 27, 2017 at the Medical College of Wisconsin in Wauwatosa. They created a company called GenoPalate, part of the class at startup accelerator Gener8tor.(Mark Hoffman/ Milwaukee Journal Sentinel", "State Rep. Dana Wachs took aim at Wisconsin’s business climate while pitching his candidacy for governor in a radio appearance.", "Amid criticism of the funding package for Foxconn Technology Group, the Eau Claire Democrat dropped a brief reference to new businesses activity in the state:", "\"We are last in the nation in startups — 50th,\" Wachs said in the Jan. 29, 2018, appearance on \"The Devil’s Advocates\" show in Madison. \"You can’t get any worse.\"", "Are 49 other states really ranked higher on startups than Wisconsin? Let’s ask the experts.", "Study supports startup claim", "Startup research is a niche field that experts say is only addressed in detail by one group — the Ewing Marion Kauffman Foundation.", "Olivia Hwang, a spokeswoman for Wachs’ campaign, said that is the research the candidate was referring to in the radio appearance.", "The foundation, one of the country’s leading entrepreneurship advocacy and research organizations, has put out an annual report for years ranking each state’s \"startup activity.\"", "It’s a customized metric that combines number of startup firms per capita, percentage of the adult population that become business owners in a given month and percentage of new entrepreneurs starting businesses because they saw market opportunity (i.e. that weren’t previously unemployed).", "Their latest study, released in May 2017, ranked Wisconsin dead last for the third straight year.", "Nevada, Oklahoma, Wyoming, California and Texas topped the list, while New Hampshire, Rhode Island, Pennsylvania and Alabama joined Wisconsin at the bottom.", "We should note other measures of Wisconsin’s business climate place Wisconsin closer to the middle of the pack, as we noted in a 2017 fact check on Gov. Scott Walker’s claim that Wisconsin was a \"Top 10\" state for business.", "Wisconsin is 15th among all states in business survivability, with 51% of businesses remaining in operation at least five years. And Kauffman rated Wisconsin second in the nation for Main Street Entrepreneurship, another combined metric that looks at the survival rate and the per capita number of businesses and business owners.", "Wachs, a member of the Wisconsin Economic Development Corp. board, is one of 16 Democrats vying for a spot on the November general election ballot opposite Walker. Major opponents include state schools Superintendent Tony Evers; Milwaukee businessman Andy Gronik; state firefighter union President Mahlon Mitchell; Sen. Kathleen Vinehout of Alma; former state Democratic Party Chairman Matthew Flynn; Madison Mayor Paul Soglin; former state Rep. Kelda Roys; and political activist Mike McCabe.", "Our ruling", "Wachs said Wisconsin is last in the nation in startups.", "The go-to national research on the subject shows Wisconsin is indeed last — and has been for the last three years.", "We rate Wachs’ claim True.", "Devil’s Advocate Radio, interview with Dana Wachs (10:20 mark), Jan. 29, 2018", "The Kauffman Index, Startup Activity – State Trends, May 2017", "Milwaukee Journal Sentinel, For third straight year, Wisconsin ranks last in business startup activity, May 18, 2017", "Email exchange with Olivia Hwang, spokeswoman for Dana Wachs campaign, March 5, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]