["A message has gone viral on social media which claims that Supriya Sule is the daughter-in-law of Bal Thackeray’s sister. “Balasaheb Thackeray’s sister is Sudha Bhalachandra Sule who is the mother of Sadanand Sule who is the husband of Supriya Sule whao is the daughter of Sharad Pawar You will now Understand Politics”, reads the viral message which is being shared on WhatsApp. Supriya Sule is the Nationalist Congress Party MP from Maharashtra’s Baramati constituency.", "She has been at the centre stage of the NCP along with her father and party chief Sharad Pawar during the political tumult in the state. On November 28, Uddhav Thackeray was sworn-in as the chief minister of Maharastra after getting elected as the head of Maha Vikas Aghadi, the alliance of Shiv Sena, NCP and Congress.", "Twitter handle @ugtunga also posted the same claim, “So Supriya Sule, daughter of Sharad Pawar is the wife of Sadanand Balachandra Sule who happens to be the son of Sudha Balachandra Sule who is the sister of late Bala Saheb Thackeray. Uff…!! This relationships, I can never understand.” The tweet has garnered more than 1,000 retweets so far.", "So Supriya Sule, daughter of Sharad Pawar is the wife of Sadanand Balachandra Sule who happens to be the son of Sudha Balachandra Sule who is the sister of late Bala Saheb Thackeray.", "Uff…!! This relationships, I can never understand 😩", "— Mauna (@ugtunga) November 12, 2019", "In another tweet, the handle posted an article by Dainik Bhaskar published on June 30, 2016. The article stated that Sadanand Sule, the husband of Supriya Sule is the nephew of late Shiv Sena supremo Bal Thackeray.", "Some are saying this news is not true. https://t.co/eks5fnzTdU", "Does Dhainik Bhaskar give false news? If so why haven’t anyone lodged complaint to take down this news? Why it is still there?", "— Mauna (@ugtunga) November 12, 2019", "Recently, three more media outlets – News18, The Lallantop, and Asianet News Hindi – have published reports where it is being claimed that the husband of Supriya Sule, Sadanand Sule, is a nephew of Bal Thackeray.", "With a Google search, we found that Sadanand Sule, the husband of Supriya Sule, is the son of former Mahindra and Mahindra Managing Director Bhalchandra R. Sule. In an obituary of Bhalchandra Sule published on the official website of Mahindra, it is stated that Bhalchandra Sule’s wife name is Anne Sule.", "While the name of Bal Thackeray’s sister is Sudha Sule, the name of Supriya Sule’s mother-in-law is Anne Sule. According to an Economic Times profile of companies, Mrs Anne Bhalchnadra Sule was on the list of current board members and directors of KLM Engineering Co Ltd.", "However, Bhalchandra Sule’s first wife was Shashi Bhatt, who died when Sadanand Sule was just two years old. Bhatt’s name is mentioned in the book, Contemporary Political Leadership in India: Sharad Pawar, the Maratha legacy by S.R Bakshi, Sita Ram Sharam, and S. Gajrani. “Sadanand’s mother, Shashi Bhatt, was a badminton singles and doubles champion in her time. Her father, M. D. Bhatt, I.C.S. rose to become Chief Secretary of the composite Bombay State. Shashi died in 1964 of cancer, when Sadanand was just two years old.”", "In November 2012, Supriya Sule expressed her grief over the death of Bal Thackeray and deemed it a personal loss to the family. She said, “की हमारे तो फैमिली के संबंध थे। जबसे में पैदा हुई तबसे ४० साल से ठाकरे और पवार फ़ैमिली की बड़ी अच्छी दोस्ती थी। तो हमारे लिए तो सिर्फ महाराष्ट्र, देश के एक लीडर नहीं, पर्सनल लोस्स हमारे फॅमिली को हुवा है। की हमारे इदेओलॉजिकल डिफरेंस जरूर होंगे। लेकिन मेरे फादर और बालासाहेब की दोस्ती बोहोत ही सालों से आती रही है। इसलिए हमारे लिए तो एक बड़ा पर्सनल लोस्स है। We had family relations. Since the time I was born, from the last 40 years, Thackeray and Pawar family had cordial relations. Hence for us, it’s not just a loss of Maharastra’s or a country’s leader, it’s a personal loss to the family. We surely might have had ideological differences but my father friendship with Balasaheb has been going-on from many years. Thus, it’s a big personal loss for us. (-translated)”", "We also found a 2013 interview of Sanjeevan Karandikar, the sister of Bal Thackeray. At 1:20 mins in the News 18 Lokmat interview, she can be heard saying that when their sister had passed away, Balasaheb had said to her that now only two of us are left. Mrs Karandikar later grieves that when Balasaheb died she said to herself that she is alone now. In the interview, she refers to four elder sisters, two elder brothers and one younger brother excluding herself. Hence, her elder sister Sudha Sule is no more.", "Furthermore, Alt News contacted journalist Dhaval Kulkarni, who penned the book: “The Cousins Thackeray: Uddhav, Raj and the Shadow of their Senas”, regarding the claim viral on social media. Rubbishing the claim, He said, “Balasaheb had six sisters, of which five were elder to him. However, of Prabhodhankar Thackeray’s 10 children, only one survives. Namely, Sanjeevani Karandikar, who is 80+. His eldest sister’s name was Sudha Sule, but she is not Supriya’s mother in law. I have double-checked this with the family”.", "In a conversation with Alt News, Shiv Sena’s deputy leader Priyanka Chaturvedi also refuted the claim and took a jibe at the opposition by saying, “This is absolutely incorrect and not true. In the past few days, we have seen how Shiv Sena has been the target of fake propaganda, which clearly points to an agenda of our opponents. They are clearly rattled with the coming together of Maha Vikas Aghadi that thwarted them from an attempt to subvert the constitution and democracy as we know it”.", "Thus, the claim that NCP leader Supriya Sule’s mother-in-law is the sister of Bal Thackeray is false. The name of Supriya Sule’s mother-in-law is Anne Sule and not Sudha Sule as claimed on social media.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]