["In an October 11 ‘exclusive’ story, broadcast at around 3:30 PM, Times Now claimed that Pakistani social media accounts were behind trending the hashtag #GoBackModi ahead of the Prime Minister’s meeting with Chinese President Xi Jinping in Chennai.", "“#GoBackModi is trending on Twitter. Just hours before Prime Minister Modi meets Chinese President Xi Jinping in Mahabalipuram, it has now been revealed there is an insidious plot by Pakistan behind this trend on Twitter,” claimed the Times Now anchor while “Pak hand behind #GoBackModi trend” and “Spooked by India-China Bonhomie” were flashed on television screens. The anchor asserted that most users tweeting this hashtag were from Pakistan.", "#Breaking | Insidious Pak plot to defame India. Pak resorts to cheap twitter tactic with #GoBackModi trend.", "More details by TIMES NOW’s Padmaja Joshi. | #GoBackModiConspiracy pic.twitter.com/ZbMhOTbMiR", "— TIMES NOW (@TimesNow) October 11, 2019", "CNN News18 broadcast a similar reportage at around 4 PM – “This is a dangerous international conspiracy to defame India and its elected leader because we are learning that a lot of Pakistan-based Twitter handles are really behind this, presumably under the watch of its propaganda wing actively involved in pushing this trend is what Bhupendra Chaubey our executive editor is picking up…”", "#NewsAlert – Pak propaganda cell caught fueling spurious ‘Go Back Modi’ trend on Twitter. Pakistan spooked by Modi-Xi bonhomie in Tamil Nadu? | @bhupendrachaube with details. pic.twitter.com/8HKwbnz4iZ", "— News18 (@CNNnews18) October 11, 2019", "Chaubey went on to add, “This is a very very shocking activity which we are now seeing play out before us. The fact that the Indian Prime Minister who clearly is India’s politician number one absolutely no debate about that…what we have learnt from our sources that these handles have had a habit of retweeting and supporting a lot of stuff coming from Pakistan, from Imran Khan…”", "The journalist also wrote similar words in a tweet, “…conspiracy being hatched against @narendramodi by Pakistani handles.“", "Absolutely bizzare that #GoBackModi is trending on a day when our PM is meeting Chinese premier in #Mamallapuram . Presence of some handles propagating this hashtag makes it look like some conspiracy being hatched against @narendramodi by Pakistani handles. #Beware", "— bhupendra chaubey (@bhupendrachaube) October 11, 2019", "News18’s Amish Devgan and the organisation’s Kannada outlet made similar assertions.", "The Times of India and India Today also suggested that “Pakistan-based elements” were behind the trend. But the latter took it a step further in a 10 PM show on the same topic.", "India Today attempted to analyse the tweets made using the hashtag #GoBackModi in a later broadcast anchored by Rahul Kanwal. “70% if the tweets originated from India. If you check the state-wise location map, 60% came from Tamil Nadu only,” said a channel correspondent, Nikhil Rampal, to which Kanwal replied, “But I can fake that also if I am running a sophisticated operation. Make it seem like it’s coming from Tamil Nadu but this could be the ISI as well.”", "Furthering Kanwal’s theory, Rampal explained how the ‘operation’ might have taken place – “I want to show you an example. I just tweeted from Karachi and the Twitter location is showing me in Karachi right now. When Twitter gets my data, I just use a third party fake geotag…Twitter locations can be faked very easily, Twitter trends can be manipulated from these locations because these are obtained services. So I fake a GPS, I put my location in Karachi and I write my tweet from New York, Chile, Antigua wherever I want to. That’s how trends can be manipulated.”", "Are Pakistani handles tweeting against Modi? India Today’s @NikhilRampal1 gets us the important information#NaMosteXi#Newstrack with @rahulkanwal LIVE at https://t.co/4fqxBVUizL pic.twitter.com/7WlV7s4pHF", "— India Today (@IndiaToday) October 11, 2019", "Most media reports claimed that Pakistani users were behind trending #GoBackModi in India. However, Twitter trends are region-specific which means that for a topic to trend in India, users from India need to tweet on the issue, and similarly, if users are tweeting from Pakistan, the hashtag would trend in Pakistan. Furthermore, issues show up in the global trend list when people tweet about the topic from multiple countries at the same time.", "“Trends are determined by an algorithm and, by default, are tailored for you based on who you follow, your interests, and your location,” per Twitter trend FAQs which further states, “Location trends identify popular topics among people in a specific geographic location.”", "However, India Today attempted to sow seeds of doubts when the channel claimed that location can easily be altered to manipulate Twitter. While false locations can be provided to Twitter, changing your location by providing fake coordinates does not mean that your tweet with a certain hashtag is adding to a trend in another country. This is because the mechanism that Twitter employs to determine a user’s location is far more elaborate.", "“Your profile location is part of your public account profile and is completely optional. Your profile location is your place to express yourself and show the world who you s hare,” according to Twitter. Profile location essentially lets a person sitting in the US put ‘Australia’ or ‘Indonesia’ or whichever country he/she wants to appear to be from. Further, Twitter also allows one to specify a geolocation (latitude, longitude) while tweeting, and there are ways of providing a fake geolocation.", "However, does this mean that a tweet posted from one country will add to a trend in another country if the location is altered?", "No, and Twitter explains why – “When you access Twitter, we may receive information about your location, such as your IP address, precise location information from GPS, or information about wireless networks or cell towers near your mobile device.”", "The sub-section ‘location information’ in Twitter privacy policy further elaborates on how the platform determines a person’s location – “When you use Twitter, even if you’re just looking at Tweets, we receive some personal information from you like the type of device you’re using and your IP address.”", "In layman’s terms, a change in profile location does not hide your actual location because Twitter picks up users’ IP address (and other data) which reveals their location. For instance, the IP address of the server used by Alt News discloses that the organisation is based out of Ahmedabad, Gujarat.", "Furthermore, let us also look at what was trending in both India and Pakistan on October 11, especially between 3 PM- 6 PM since this was when most media reports were published. Had a majority of users been from Pakistan, the hashtag would have trended in the country during this time. However, this was not the case.", "#GoBackModi or any other hashtag related to the Prime Minister’s meeting with his Chinese counterpart did not trend in Pakistan between 3 PM to 6 PM . The only hashtag related to India trending in Pakistan was #KashmirChained. This was revealed by searching for worldwide Twitter trends on the website trends24.in.", "We observed that the hashtag was picked up in Pakistan only after 9 PM when it was at the 20th spot.", "At around 11:30 PM, it gained momentum and was trending at the 12th position.", "Indian social media users were tweeting in large numbers with the hashtag #GoBackModi between 3 PM to 6 PM on October 11.", "More importantly, the hashtag maintained the top position during the hours leading up to the media broadcasts blaming Pakistani for trending #GoBackModi.", "Alt News also performed a language-based search via Twitter search operators to determine the number of #GoBackModi tweets made in Urdu – the most prominent language used in Pakistan. We used the syntax ‘#GoBackModi lang:ur since:2019-10-10’ to search for all tweets made in Urdu since October 10. Till 12:30 PM on October 12, there were some 100 tweets and most of them were related to Kashmir.", "Contrastingly, a similar search for all tweets made in Tamil since October 10 – ‘#GoBackModi lang:ta since:2019-10-10’ – throws up uncountable results. It is noteworthy that Tamil is an unpopular language in Pakistan.", "India Today itself claimed that 70% #GoBackModi tweets were from India and 60% of these originated from Tamil Nadu. But the channel did not provide any evidence on how this was an ‘ISI conspiracy’. Other media outlets – Times Now, News18, The Times of India – also alleged a mass conspiracy without backing its claim. Each of these organisations needs to come up with a logical explanation of the assumption that thousands of users in Pakistan managed to fake their IP addresses, GPS locations and all other parameters that Twitter uses to determine the location of an individual and gamed Twitter to get a hashtag to show up in the Indian trending list.", "[Update: Details about how geolocation can be faked were added to this story.]", "Donate Now", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]