["After NDA regained power in Bihar assembly elections, RJD made allegations of foul play in the counting of postal ballot papers. Some images are now viral on social media where a man is carrying an EVM machine through a forested area. A Twitter user shared the images and wrote, “EVM machines should be checked again, will Nitish Kumar go to jail? Bihar is asking, where is he taking the EVM machine after stealing them? Modi commission (reference to the Election Commission) is a thief.” (archive link)", "EVM की होगी जांच, नितीश जाएंगे जेल? पूछता है युवा, पूछता है बिहार EVM चोरी करके कहां ले जा रहा है। मोदी आयोग चोर है।#Recounting_Bihar_Election@RJDforIndia @yuva_rajad @Rofl_Lalu @NikkuYadavJi @NehaBishwas @RohiniAcharya2 @Rofl_Swara @OfficialAaKu @shanu_sab @WasiuddinSiddi1 pic.twitter.com/fTtfa46KbC", "— Ashkar ahmad اشکار ठेठ बिहारी 🇮🇳 ❁ (@Ashkarahmad11) November 12, 2020", "Former state secretary of NSUI and incumbent coordinator of NSUI Rajasthan Krishna Mohan Sharma also shared these images on Twitter. (archive Link)", "ये हो क्या रहा हैं..??? देश में आपको पता भी हैं या आप लोग सो ही रहे हों,चोर सरे आम चोरी कर रहे हैं pic.twitter.com/4w6d7ic40d", "— Krishna Mohan Sharma (@KrishnaMohanSha) November 12, 2020", "They were also shared on Facebook with the same caption.", "False claim", "Alt News found that Twitter handle ‘DEO Raigad’ had posted the images on October 20, 2019. “Employees arriving at polling stations in remote areas like Kalkarai. We are very proud of you,” read the tweet.", "कळकराई सारख्या दुर्गम भागात मतदान केंद्रावर पोहोचणारे कर्मचारी. आम्हाला तुमचा सार्थ अभिमान आहे 🙏🏻#vidhansabha2019@CEO_Maharashtra @MahaDGIPR @MahaCyber1 pic.twitter.com/8f9KRt5wob", "— DEO Raigad (@ElectionRaigad) October 20, 2019", "We also discovered a tweet by the District Information Office of Raigad that shared the same images last year in October during the Maharashtra legislative assembly elections.", "कळकराई सारख्या दुर्गम भागात मतदान केंद्रावर पोहोचणारे कर्मचारी. आम्हाला तुमचा सार्थ अभिमान आहे 🙏🏻#vidhansabha2019@CEO_Maharashtra @MahaDGIPR @MahaCyber1 pic.twitter.com/c2f4ya5HOk", "— DISTRICT INFORMATION OFFICE, RAIGAD (@InfoRaigad) October 20, 2019", "Therefore, images of election commission officials carrying EVM machines to remote areas last year during Maharashtra polls is falsely viral as the machines being ‘stolen’ during the recent Bihar elections.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]