["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, a rumor started to circulate on social media that 59 people in South Africa had died after a pastor told them to drink Dettol, a disinfectant cleaning product similar to Lysol, in order to prevent COVID-19 coronavirus disease.", "An article on the website Kenya Today was accompanied by an image supposedly showing this pastor, Rufus Phala, giving a woman Dettol to drink:", "South African Prophet Rufus Phala allegedly gave his members of Dettol, a household bleach to drink as a preventing medicine to Coronavirus and also as a sign of faith during a church service.", "Fifty-nine of them have been confirmed dead while four are in critical condition after drinking the Dettol.", "The claim that 59 people died after a pastor gave them Dettol to prevent coronavirus is false. This photograph is several years old, this news report has dubious origins, and this claim has been disputed by local authorities.", "South Africa police spokesman Brigadier Vishnu Naidoo told the AFP news organization that this claim is false and that police were not involved in any investigations concerning 59 people who died from drinking Dettol.", "This claim appears to be a variation of a rumor that has been circulating since 2016. At that time, it was reported that South African pastor Phala had told his congregation to consume cleaning products such as Dettol as a sort of miracle cure. The above-displayed photograph, which was widely shared in 2020 as if it showed a recent incident, was included in a report by South Africa's The Citizen on the 2016 allegations against Phala.", "In fact, this image, as well as several similar ones, has been attached to a variety of dubious claims over the years. In 2018, for instance, these same photos were used to illustrate a story about six people dying after drinking bleach in church. In 2019, these same images accompanied claims of 27 people dying from drinking JIK, another cleaning solution, in order to cast out demons:", "While it appears, based on 2016 press reports, that this pastor truly suggested the consumption of cleaning products in order to prevent or cure diseases, these photos do not come from March 2020 and are not evidence that 59 people died after a pastor told them to drink Dettol to prevent coronavirus.", "It should be noted that drinking Dettol, Lysol, bleach, or any similar cleaning products could truly result in death. In fact, when it was reported in 2016 that Phala was using Dettol as a miracle cure, Dettol released a statement explaining that Dettol was could be dangerous to one's health if ingested:", "Dettol South Africa is aware of reports regarding Prophet Rufus Phala’s practice of instructing his congregation to drink Dettol Antiseptic Liquid.", "Dettol Antiseptic Liquid has been proven to be safe and effective when used as per recommended directions. However, Dettol Antiseptic Liquid is not for human consumption and is for external use only, and we condemn the reported usage as inappropriate. Oral consumption of this product can be dangerous to one’s health.", "We have been in contact with Prophet Rufus Phala and have asked him to stop this practice.", "Anyone who has consumed Dettol Antiseptic Liquid should consult a healthcare practitioner or the nearest hospital casualty.", "Rocketman Oyaore.   \"6 Dead After Drinking JIK Household Bleach In Church.\"\r\n    15 September 2018.", "Faces of Malawi.   \"27 Congregants Dead, 18 in Critical Condition After Pastor Made Them Drink ‘Jik’ in the Name of Casting Out Demons.\"\r\n    29 April 2019.", "AFP South Africa.   \"Police Dismissed the Claims as a Hoax, Which Were Based on an Old Story.\"\r\n    1 April 2020.", "Sunday News.   \"From Pastor Doom to Pastor Disinfectant!.\"\r\n    11 December 2016.", "The Citizen.   \"Another Pastor Strikes, Makes Congregants Drink Dettol.\"\r\n    9 December 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]