["About this rating", "Two women entered a closed beachside amusement park and then sued its operators after they injured themselves while improperly self-operating a slide.", "The women withdrew their lawsuit within days of filing it.", "In August 2019, a Citizens Against Lawsuit Abuse (CALA) group made a post on Facebook promoting a #DontSueSummer campaign, urging readers to \"help us stand up to the frivolous lawsuits getting in the way of everyone’s summer fun.\" The post offered the case example of \"two women in South Carolina [who] tried to avoid the lines and broke into a water park for a private ride while the park was closed\" and then \"decided to take the slide operator to court\" when they got hurt:", "The gist of the claim was true: Two women from New York who were visiting Myrtle Beach, South Carolina, in 2017 entered the closed Pavilion Park amusement park area during early-morning hours, moved an unsecured gate at the entrance to the Pipeline Slide dry slide, climbed the stairs to the top of the attraction, slid down the dry slide, then suffered broken bones when they collided with a metal barrier at the bottom of the slide.", "In November 2018, the two women filed a lawsuit against the park's operators and the ride's manufacturers, asserting that the closed attraction was improperly secured with nothing more than a plastic gate:", "Ally Mulcahy and Jillian McGovern were in Myrtle Beach area on the weekend of April 29, 2017 for a friend’s wedding, the lawsuit says. Following the wedding, the two women went to Broadway at the Beach. In the early morning hours of April 30, 2017, both women walked back to their hotel, passing Pavilion Park Central, which was closed.", "“Even though it was closed, the plaintiffs were easily able to move the unsecured gate at the entrance to the Pipeline Slide and climb the stairs to the top of the slide,” claims the lawsuit. “Without any employees present to instruct them, the plaintiffs were not aware that they needed to have the slide sprayed with water, nor did they know that they needed a burlap sack to safely go down the side.”", "“Without these safety precautions, the plaintiffs slid down the slide at a very high velocity, colliding with the metal barrier at the bottom of the slide,” the lawsuit also claims. “As a result of the collision, both plaintiffs sustained significant injuries.”", "Mulcahy “sustained a broken right ankle, broken left ankle and multiple fractures to her left tibia, which has required surgeries and therapy to repair,” while McGovern “sustained a broken tibia, shattered knee plate and two broken ankles.”", "“The defendants failed to secure Pipeline Slide, knowing that patrons of Broadway at the Beach would be passing through and have open access to Pavilion Park at all hours of the day,” the lawsuit further claims. “In the manufacture and design of the slide, BN failed to install proper safety equipment to secure the Pipeline Slide when not in use.”", "“When Pavilion Park is closed, there is no barrier or separation to keep patrons from Broadway at the Beach from entering any of the entrances of Pavilion Park, including the one at Pavilion Park Central,” claims the suit. “In addition to patrons being able to access the park after hours, Pavilion Park fails to secure its rides and amusements, including Pavilion Slide. After hours, there is only a plastic gate blocking the entrance to the slide, and it is not locked nor otherwise secured to prevent after hours access to the ride.”", "The extent to which this lawsuit might be considered \"frivolous\" is subjective, but it hardly represented an abusive waste of court resources or the ruin of anyone's \"summer fun.\" After the lawsuit drew \"hundreds of social media comments\" condemning it within days of its filing, the women dropped it before it was even served on the putative defendants:", "2 NY women sued Friday for breaking their legs after they rode on a closed Myrtle Beach amusement park slide in the early hours of the morning last year.\nTheir lawyer dismissed the suit Monday before it was served to the defendants.\nBackground: https://t.co/6HDggoMSi2 pic.twitter.com/zv3zKmt2mB", "— Andy Shain (@AndyShain) November 19, 2018", "We note that a Center for Justice & Democracy fact sheet cautions that \"Citizens Against Lawsuit Abuse\" groups are often fronts for \"major corporations and industries seeking to escape liability for the harm they cause consumers\":", "Since 1991, \"tort reform\" advocates have set up dozens of tax-exempt groups in at least 18 states (currently there are 26 active groups) with consumer-friendly names like Citizens Against Lawsuit Abuse, Stop Lawsuit Abuse, Lawsuit Abuse Watch, and People for a FAIR Legal System. These groups are known as \"CALAs.\"", "While CALAs represent themselves as grassroots citizens groups, and they say they are sustained by small donations from ordinary citizens, they actually represent major corporations and industries seeking to escape liability for the harm they cause consumers. The money trail from these groups leads directly to large corporate donors, including tobacco, insurance, oil and gas, chemical and pharmaceutical companies, medical associations, and auto manufacturers. They are also funded by the American Tort Reform Association (ATRA), as well as professional associations, local businesses and industries that also wish to be shielded from consumer lawsuits.", "Lang, Alex.   \"Women Who Injured Themselves on Broadway at the Beach Slide Sack Lawsuit.\"\r\n    Myrtle Beach Online.   19 November 2018.", "Watson, Casey.   \"NY Women Who Sustained ‘Significant Injuries’ on Closed Slide at Broadway at the Beach File Lawsuit.\"\r\n    WIS-TV.   18 November 2018.", "WMBF-TV.   \"Lawsuit Filed by Two Women Injured on Closed Slide at Broadway at the Beach Dismissed.\"\r\n    20 November 2018.", "WBTW-TV.   \"NY Women Sue After Breaking Bones on Closed Slide in Myrtle Beach.\"\r\n    18 November 2018.", "Center for Justice & Democracy.   \"Fact Sheet: 'Citizens Against Lawsuit Abuse' Groups.\"\r\n    Accessed 5 September 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]