["The photo was published in this Facebook post on May 15, 2020. It has been shared more than 3,600 times.", "The photo shows Syed Murad Ali Shah (circled in white), chief minister of the southern Pakistani province of Sindh, attending a rally.", "The post's Urdu-language caption translates to English as: “There is coronavirus in the mosques, but there is no coronavirus here? Have some shame.”", "The photo circulated online on May 15, 2020, the 21st day of the holy month Ramadan when Muslims commemorate Youm-e-Shahadat Ali, or Youm-e-Ali, the martyrdom anniversary of the fourth caliph Ali.", "The misleading post accuses Shah of breaking a social restriction order his government imposed on the province of Sindh during the COVID-19 pandemic by attending a memorial rally for Ali.", "The photo has been shared on Facebook with a similar claim here and here.", "The claim is false; the photo was taken in 2018 on Ashura, a Muslim holy day.", "A reverse image search found the photo published here on the Twitter account of the Sindh chief minister in September 2018.", "Karachi: (September 21st, 2018): Sindh Chief Minister Syed Murad Ali Shah leads the procession of 10th Muharram ul Haram Julos in Karachi. pic.twitter.com/qUvVLNgMy7", "The tweet states: “Karachi: (September 21st, 2018): Sindh Chief Minister Syed Murad Ali Shah leads the procession of 10th Muharram ul Haram Julos in Karachi.”", "Below is a screenshot comparison of the photo in the misleading Facebook post (L) and the Sindh chief minister’s tweet (R):", "The photograph was also published here alongside an identical caption on the website for the Sindh government’s Information & Archives Department.", "The Urdu-language banner in the background of the photo translates to English as: “Today is the day of martyrdom of Imam Hussein.”", "Hussein, the grandson of the Prophet Mohammed, is commemorated annually on Ashura, which is the 10th day of the first month in the Islamic calendar, or Moharram.", "In 2018, Ashura fell on September 21, which corresponds with the publishing date of the photo of Shah.", "Despite the Sindh government’s ban on mass prayers and public processions in the face of the COVID-19 pandemic, more than 200 people attended processions to mark Youm-e-Ali on May 15, 2020, Pakistani newspaper The Express Tribune reported here.", "Below is an image of the Sindh government's notification banning religious gatherings, processions and mass prayers issued on April 27, 2020. The notification was circulated by the government among local reporters in Karachi via WhatsApp.", "Shah did not take part in any Youm-e-Ali processions in May 2020, according to his spokesman Rasheed Channa.", "“Chief minister Murad Ali Shah did not take part in the Youm-e-Ali (martyrdom anniversary of Ali) procession this year. It is an old pic which is wrongly attributed to his visit to the procession,” Channa told AFP by phone on June 1, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]