["This Facebook post, published October 13, 2017, and shared more than 134,000 times since, contains the image alongside a Japanese-language caption.", "The caption, translated to English by AFP’s Tokyo bureau, says: “A deer covered with tumours after eating plants sprayed with Monsanto's Roundup. It appears there are quite a lot,” meaning that there seem to be many deer with the same condition.", "Monsanto is an agro-chemical company owned by German pharmaceutical giant Bayer, this is its website.", "Roundup, a weedkiller brand produced by Monsanto, has been accused of causing cancer in humans. Here is an AFP report published on May 14, 2019, about the legal proceedings brought against the company.", "Below is a screenshot of the misleading Facebook post:", "The same photo has been shared alongside similar claims elsewhere on Facebook, for example here and here, and on Japanese blogging website Ameba here and here. Some of these posts also claim that the deer is in Japan.", "There is text in English and Japanese at the top of the image in the misleading Facebook posts which says, translated to English: “Post by Your Wild Ohio - Hunter”.", "The \"about\" section here of the Facebook page called “Your Wild Ohio - Hunter” states its association to Ohio Department of Natural Resources Division of Wildlife, a US state government agency.", "The Facebook post embedded below, posted here by the “Your Wild Ohio - Hunter” on October 12, 2017, contains the same image as in the misleading post:", ".", "The caption of the post says, in part: “Have you ever seen deer with these odd growths? These unsightly growths are called fibromas. We encounter fibromas in Ohio deer frequently.”", "Fibromas in deer are caused by a viral infection, not by chemicals, according to multiple sources of scientific and specialist information available online.", "None of the pages reviewed by AFP mention weedkiller or any other chemicals as the cause of these tumours.", "For example, the Pennsylvania Game Commission has an information page on fibromas in wildlife here. It says, in part: “Fibromas are wart-like growths on the skin caused by viruses which are host species specific.", "“Different species of poxviruses cause fibromas in different species of wild and domestic animals. Deer fibromas can be caused by poxviruses, but are more commonly the result of papillomavirus infections.”", "Below is a screenshot of the site, which includes a picture of another deer with fibromas in the bottom right-hand corner:", "This article in the Canadian Veterinary Journal titled “Deer Fibroma: A Review” describes deer fibromas as “often dark brown to black, with a smooth or wrinkled surface”.", "The article also says: “Virus particles, similar to those found in fibrous skin tumors of several wild and domestic species, have been identified in some species”.", "And the text on this page titled “Fibromatosis in deer” on the website of the Oregon Department of Fish and Wildlife says that deer fibromas are caused by a virus.", "“Deer with fibromatosis are generally unaffected by the condition,” it says; below is a screenshot of the information page, which contains a picture of a deer with fibromas:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]