["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In early March 2020, amid the COVID-19 coronavirus disease outbreak that would later grow into a pandemic, the massive retail and delivery company Amazon launched the Amazon Relief Fund, which among other things, offers grants to contract and seasonal workers so they can receive sick pay if they contract the coronavirus.", "The $25 million fund established by Amazon sparked an online backlash after a liberal newsletter pointed out that seasonal and contract workers would have to file an application to receive the funds, and that Amazon, a behemoth corporation whose founder and CEO Jeff Bezos is the richest person in the world, solicited public donations for the program.", "Anger over the idea that a famously profitable corporation was soliciting donations from the public to fund sick leave for some of its workforce during a pandemic was initiated by reporting from Popular Information, described as a \"newsletter about politics and power.\" The letter's founder, Judd Legum, posted this Twitter thread on March 24, 2020:\nWe reached out to Amazon for comment and received the following statement:", "We are not and have not asked for donations and the Amazon Relief Fund has been funded by Amazon with an initial donation of $25 million. The structure to operate a fund like this, which hundreds of companies do through the same third-party, requires the program to be open to public contributions but we are not soliciting those contributions in any way.", "Amazon truly did launch a $25 million fund to provide sick leave for contract workers and seasonal employees through a grant program to which those workers must file applications before receiving benefits.", "Although the wording on the page has since been updated to indicate that donations are not expected, initially the language did indicate that Amazon was seeking — or at the very least suggesting — donations. An archived version of the page from March 19, 2020, included this statement (shown in the screen capture below): \"The Fund relies primarily on individual donations from individuals and support from Amazon.com Services LLC to fund this program.\"\n\nThe page has since been updated. The highlighted sentence above was removed and the page now explicitly states that donations from the public are not expected, as follows:\nWe reached out to Legum, who told us via email that he believed Amazon changed the wording on the relief fund page \"because the optics were clearly bad and the company is trying to cover up its actions.\" Legum added that in his view, \"Amazon has ample resources to simply pay their contractors while they are out sick during this pandemic.\"", "According to Amazon's announcement, the Amazon Relief Fund will provide their delivery partners and drivers \"the ability to apply for grants approximately equal to up to two-weeks of pay if diagnosed with COVID-19 or placed into quarantine by the government or Amazon.\"", "Additionally, the statement reads, \"this fund will support our employees and contractors around the world who face financial hardships from other qualifying events, such as a natural disaster, federally declared emergency, or unforeseen personal hardship. Applicants can apply and receive a personal grant from the fund ranging from $400 to $5,000 USD per person.\" The company also announced it is offering unlimited unpaid time off for hourly staff during the month of March.", "Whether or not Amazon actively solicited donations, the original wording on its Amazon Relief Fund page did call for individuals to donate to the fund. Even though the wording has been updated to state explicitly that no donations from the public are expected, a \"Donate\" button still exists on the page, which could be interpreted as an invitation to do so. We therefore rate this claim \"True.\"", "Legum, Judd.   \"Amazon Soliciting Public Donations to Pay Workers' Sick Leave.\"\r\n    Popular Information. 24 March 2020.", "Galetti, Beth.   \"COVID-19 Update: More Ways Amazon Is Supporting Employees and Contractors.\"\r\n    DayOne, the Amazon blog. 11 March 2020.", "Palmer, Annie.   \"Amazon Launches $25 Million Relief Fund for Delivery Drivers and Seasonal Employees Amid Coronavirus Outbreak.\"\r\n    CNBC.   11 March 2020.", "Greene, Jaye.   \"Amazon Workers Test Positive for Covid-19 at 10 U.S. Warehouses.\"\r\n    Washington Post. 25 March 2020.", "[CORRECTION 03/25/20]: A previous version of this article erroneously stated that Amazon was offering \"unlimited paid time off\" to hourly staff during the month of March; that has been corrected to \"unlimited unpaid time off.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]