["About this rating", "Outspoken San Francisco 49ers quarterback Colin Kaepernick, who last made headlines by refusing to stand during the playing of the national anthem before an NFL football game, continued to act as a lightning rod for controversy by appearing at a 30 August 2016 press conference wearing a T-shirt emblazoned with photographs of '60s Nation of Islam leader and black power advocate Malcolm X and Cuban dictator Fidel Castro.", "A slogan on the shirt read, \"Like Minds Think Alike.\"", "It's unsurprising that Kaepernick would make a fashion gesture aligning himself with radical historical figures, given that he has explained his personal boycott of the national anthem in terms of a protest against the oppression of minorities in this country:", "I am not going to stand up to show pride in a flag for a country that oppresses black people and people of color. To me, this is bigger than football and it would be selfish on my part to look the other way. There are bodies in the street and people getting paid leave and getting away with murder.", "According to an article in Slate, the photos adorning Kaepernick's shirt were taken during an historic September 1960 meeting between Malcolm X and Fidel Castro in Harlem, New York. Some observers, notably Cuban-Americans, have taken Kaepernick to task for expressing tacit approval of Castro, an unrepentant communist dictator whose own human rights record isn't exactly a shining beacon of liberty.", "This is what Orlando Sentinel reporter George Diaz, whose family fled Cuba in 1961, had to say:", "There is no question that racial inequality needs to be a topic of conversation in the United States. But that gets us back to Cuba, where such conversations can get you in prison.", "My family left there in 1961. We left our home, our furniture, most of valuables and our relatives behind because we were seeking freedom. It wasn’t for money, nor the opportunity to visit Disney and Universal.", "We wanted to be free, and the United States, bless its soul, gave us that opportunity.", "So yes, I find it personally insulting that  Kaepernick is oblivious to the fact that Castro is one of the most vile dictators of modern times with extensive human rights violations.", "Contrary to what some sources have claimed, Kaepernick did not discuss his national anthem protest during this press conference.", "Diaz, George.  \"Colin Kaepernick Castro T-Shirt Is Ignorant of Facts, Insulting.\"\r\n   Orlando Sentinel.  30 August 2016.", "Houser, Christine.  \"Why Colin Kaepernick Didn't Stand for the National Anthem.\"\r\n   New York Times.  27 August 2016.", "Llorente, Elizabeth.  \"Cuban Americans Blast 49ers' Kaepernick for Wearing Fidel Castro T-Shirt.\"\r\n   Fox News Latino.  31 August 2016.", "Onion, Rebecca.  \"When Malcolm X Met Fidel Castro.\"\r\n   Slate.  30 August 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]