["People seeking shelter from below freezing temperatures rest inside a church warming center Feb. 16, 2021, in Houston. (AP)", "Blackouts that began Feb. 15 left millions of Texans without power and heat amid single-digit temperatures, huddling together in their dark and cold homes.", "The blackouts were caused as electric plants of all energy sources \"began tripping offline in rapid succession,\" according to the Electric Reliability Council of Texas.", "On Feb. 17, a Facebook user who identifies himself as a Fort Worth resident on his profile, shared a post making this claim:", "\"FEMA IS PAYING FOR HOTEL ROOMS!!!\"", "The post also said to call an 800 number that it listed.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Within a day, the Federal Emergency Management Agency was knocking down such claims as bogus.", "We called the 800 number on the afternoon of Feb. 18. An automated message said the line is for the FEMA Internet Technical Help Desk, for help with online system or software problems. Then a recording from a human’s voice said: \"FEMA is not currently providing assistance directly to individuals and families for the winter storm in Texas.\"", "The Twitter account for FEMA Region 6, which includes Texas, tweeted on Feb. 18:", "\"There is a false phone number being shared with a message about FEMA paying for hotels for Texas Disaster Relief. This is a scam. The best information on legitimate sources of help in your area will come from local officials & @TDEM,\" which is the Texas Department of Emergency Management.", "The tweet said FEMA is providing Texas with generators and fuel to help facilities such as hospitals, as well as water and blankets.", "A FEMA spokesperson also confirmed by email that the post we’re checking is false.", "The Texas Division of Emergency Management retweeted FEMA's warning about the scam.", "Carman Apple, a district coordinator with the Texas agency, said in an email:", "\"We have been made aware of a false claim and phone number being circulated with a message about FEMA paying for hotels for Texas disaster relief in response to the February winter storms.  We echo our partners at FEMA in saying that ‘This is a scam.’  The best information on legitimate sources of help in your area will come from local officials and TDEM.\"", "We rate the post False.", "Facebook post, Feb. 17, 2021", "Twitter, FEMA Region 6 tweet, Feb. 18, 2021", "Twitter, Texas Division of Emergency Management retweet, Feb. 18, 2021", "Email, Carman Apple, district coordinator, Texas Division of Emergency Management, Feb. 18, 2021", "KSAT-TV, \"FEMA warns of hotel scam for people looking for shelter during Texas freeze,\" Feb. 18, 2021", "Associated Press, \"Audit: FEMA paid for unused rooms for 2017 disaster victims,\" Feb. 16, 2021", "Email, FEMA Region 6 news desk, Feb. 18, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]