["About this rating", "A photograph purportedly showing three naked women campaigning for Democrats ahead of the 2018 midterm election was shared by a Facebook user in November 2018:", "This picture has virtually nothing to do with Democrats, the 2018 midterm elections, or U.S. politics in general.  This image is a photograph taken in 2005 and shows a protest staged at the entrance of the Presidential Palace in Mexico City, Mexico.", "The picture was snapped by Juan Barreto and is available via Getty Images with the following caption:", "MEXICO CITY, MEXICO: Naked women, from the '400 People Movement', protest at the entrance of the Presidential residence of Los Pinos in Mexico City, against the expropriation of their lands by federal deputies,16 May 2005. AFP PHOTO/Juan BARRETO (Photo credit should read JUAN BARRETO/AFP/Getty Images)", "The pictured women were members of an indigenous organization known as \"the Movement of 400 Peoples\" who were participating in an annual protest to demand the return of land they say was taken from them by the government. According to a 2008 report from the Inter Press Agency, the group has been holding such marches in the nude since 2002:", "Every year, some 300 indigenous people from the eastern Mexican state of Veracruz march naked through the streets of the capital to demand land. But while their unusual form of protest certainly attracts attention, there is little chance that it will achieve their goals.", "The protesters, most of them from the Nahua indigenous community, are members of an organisation known as the Movement of 400 Peoples. The organisation suffered a heavy blow in 1992 when the police evicted them from a parcel of over 2,000 hectares of private land in Veracruz that they had occupied in 1988.", "Following the eviction, they began to demonstrate in the capital to air their grievances.", "First they demanded the release of 100 members of the group imprisoned on charges of squatting, theft, assault and murder. Once this had been achieved, they began to call for the restitution of the land they originally occupied or to be granted ownership of other land, as well as punishment for the authorities who evicted them 15 years ago.", "In 2002, during one of their annual visits to the capital, where they spend two or three months living in tents set up between the busy downtown thoroughfares of Reforma and Insurgentes Avenues, they decided to take off their clothes as a form of protest. Since then, they have continued to stage their nude demonstrations every year.", "Cevallos, Diego.   \"MEXICO: A Naked Call for Indigenous Peoples’ Right to Land\r\n    Inter Press Agency.   2 January 2008.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]