["Marco Rubio holds a town hall meeting at the St. Anselm's College Institute of Politics in Manchester, N.H., on Feb. 4, 2016 (Louis Jacobson)", "The 2016 presidential campaign has inspired discussion of plenty of scary foreign-policy scenarios, from ISIS attacks to cyber warfare. But at a Feb. 3 town hall in Manchester, N.H., Republican presidential candidate Marco Rubio offered one we hadn’t heard much about – the possibility that China could blow an American satellite out of the sky.", "China, Rubio said, is \"practicing how to blow up our satellites.\"", "Experts told PolitiFact that Rubio is basically right. \"Regrettably true,\" Michael Krepon, a space-policy expert and co-founder of the Stimson Center, said of the claim.", "Most spectacular was an incident on Jan. 11, 2007, when a six-foot-long Chinese weather satellite flew over China and was blasted to smithereens by an 18,000-mile-per-hour missile launched by China. \"And then it was gone, transformed into a cloud of debris hurtling at nearly 16,000 mph along the main thoroughfare used by orbiting spacecraft,\" as Popular Mechanics magazine put it.", "China’s destruction of its own missile inspired \"a great deal of international rebuke,\" said Laura Grego, a senior scientist with the global security program at the Union of Concerned Scientists.", "In addition to bringing up the touchy notion of the militarization of space, the satellite destruction created a sizable debris field in its heavily trafficked band around the earth, potentially causing secondhand damage to other nations’ satellites for the foreseeable future. There are about 1,300 active satellites, according to Scientific American.", "The technology China used, known as \"hit-to-kill,\" doesn’t technically \"blow up\" the satellite, as Rubio had said. No explosives are involved, only the force of impact of a missile-launched \"kill vehicle.\"", "\"This is the same technology that the U.S. missile defense systems are based on,\" Grego said. \"In fact, the U.S. used the Aegis ship-based missile defense system to destroy the USA 193 satellite just over a year after the Chinese test.\"", "Which brings up a point worth noting: China isn’t the only one playing this game. Russia and the United States have been testing anti-satellite technology since the 1960s.", "In fact, when the United States, a year after China destroyed its satellite, destroyed one of its own, cables released by Wikileaks suggest was a mission with military significance.", "\"Russia and the United States either have experimented with or deployed similar technologies\" as China, said Theresa Hitchens, a senior research scholar at the Center for International and Security Studies at the University of Maryland. \"Indeed, the Chinese are actually behind both Russia and the United States regarding development of these technologies. Nothing China has tested is anything that the U.S. has not tested before.\"", "A further complication: Technologies that can be used to destroy satellites can also be used for benign purposes. Ballistic missiles can destroy satellites – or they can be used legitimately for missile defense. And satellites themselves can be maneuvered to damage or destroy nearby satellites – or they can be maneuvered for repair or refueling, Hitchens said. This is known as \"dual-use\" technology.", "This makes it hard to discern motives. In fact, China has \"officially said its tests are not aimed at any other country, and it has been a longtime proponent of trying to manage this issue using space arms control,\" Grego said.", "But it’s difficult to prove a purely defensive motive when dealing with such dual-use technologies, Hitchens said.", "\"We see them doing dual-use experiments and assume it’s for nefarious purposes, and they see us doing dual-use experiments and assume nefarious purposes,\" she said. This kind of thinking can produce an arms race.", "Still, experts said it was fair for Rubio to point out China’s development of technologies that can be used to attack satellites, since it’s a threat to national security even if we’re working on much the same thing.", "\"The reality is that satellites are increasingly valuable to civil, economic, scientific, and military operations, yet they are physically quite vulnerable, since launch mass is at a premium and no one armors their satellites, and satellite positions are predictable,\" Grego said.", "Our ruling", "Rubio said China is \"practicing how to blow up our satellites.\"", "For years, China has been pursuing technologies that can be used to destroy satellites (as well as legitimate things). In fact, the Chinese destroyed one of their own satellites in 2007, in a move that was roundly condemned internationally. While the United States and Russia have also been developing similar technologies, and in one case destroyed an actual satellite, that doesn’t undercut Rubio’s statement. We rate it True.", "Marco Rubio, comments at a town hall at the St. Anselm’s College Institute of Politics, Feb. 4, 2016", "Popular Mechanics, \"China's Space Threat: How Missiles Could Target U.S. Satellites,\" Dec. 17, 2009", "Scientific American, \"War in Space May Be Closer Than Ever,\" Aug. 10, 2015", "Slate.com, \"How To Blow Up a Satellite,\" Feb. 15, 2008", "Shanghaiist, \"Wikileaks: US and China blow sh*t up, IN SPACE!\" Feb. 3, 2011", "Email interview with Michael Krepon, co-founder of the Stimson Center, Feb. 4, 2016", "Email interview with Theresa Hitchens, senior research scholar at the Center for International and Security Studies at the University of Maryland, Feb. 4, 2016", "Email interview with Laura Grego, senior scientist with the global security program at the Union of Concerned Scientists, Feb. 4, 2016", "Email interview with John Pike, director of globalsecurity.org, Feb. 4, 2016", "Email interview with Alex Burgos, spokesman for Marco Rubio, Feb. 4, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]