["By Brooks Jackson", "Posted on May 20, 2016", "A primary challenger to Rep. Walter Jones of North Carolina falsely claims Jones “caved to Obama” and “empowered Obama to cut a deal with Iran.”", "Actually, all Jones did was co-author a letter in 2012 beseeching the president to conduct “robust, sustained diplomacy” with Iran as an alternative to war.", "And far from “caving,” Jones voted against Obama’s Iran nuclear deal in 2015, stating that “it does not provide for adequate inspections and verification.”", "The misleading attack ad is the work of GOP hopeful Taylor Griffin, a former aide to the late Sen. Jesse Helms. Griffin is challenging Jones for a second time in the June 7 congressional primary, after falling 6 percentage points short of defeating Jones in 2014. The district is solidly Republican, and the primary winner will most likely be elected in November. Jones is seeking his 11th term.", "In the ad, Griffin denounces Obama for avoiding the use of the term “radical Islamic terrorism,” then says Jones “is taking the president’s way.” On screen the ad shows an image of Obama next to an image of Jones.", "Griffin goes on to say, “Congressman Jones empowered Obama to cut a deal with Iran.”", "That’s false; Obama did not need any new power to negotiate a deal with Iran. Congress had already granted the president broad power to lift sanctions related to Iran’s nuclear program when it imposed them years earlier.", "Griffin would have been correct to say Jones urged Obama to negotiate a nuclear deal rather than go to war.", "The letter shown in the ad was authored by Jones and Democratic Rep. Keith Ellison of Minnesota. Eventually it was signed by 37 House members.", "Dated March 2, 2012, the letter began, “As tension with Iran continues to escalate, we urge your Administration to utilize all available tools of diplomacy to resolve the crisis over Iran’\u0092s nuclear program and prevent another costly war in the Middle East.”", "The letter warned that a military strike against Iran’s nuclear facilities would lead to a wider conflict, and concluded: “[W]e believe that robust, sustained diplomacy is the best option to resolve our serious concerns about Iran’s nuclear program, and to prevent a costly war.”", "Though not mentioned in the ad itself, the Griffin campaign also points to Jones’ cosponsorship of a Democratic bill in 2012 that would have directed the president to appoint a high-level envoy to Iran. But that didn’t “empower” Obama either; it died without getting out of committee.", "Conspicuously absent from the ad is any mention of Jones’ opposition to the Iran nuclear deal itself. On Sept. 11, 2015, Jones joined other House Republicans in casting a vote against a measure stating simply that “Congress does favor” the deal. That measure failed 162 to 269.", "Moments later, Jones voted in favor of a measure that would have suspended the president’s existing authority under previous law to grant Iran relief from sanctions. That passed the House 247 to 186, but Senate Democrats were able to block a similar measure from being taken up by the Senate.", "Unlike some of his colleagues who voiced disapproval of the deal before it was even made public, Jones engaged in what he called a “careful review” before announcing his opposition.", "On his House website, Jones explained his votes this way: “In my judgment, President Obama’s deal falls short because it does not provide for adequate inspections and verification. As a result, the American people will never be able to trust that Iran isn’t cheating their way to a nuclear bomb.”", "We also note that the ad is misleading in the way it jumbles and confuses the issues of Islamic State terrorism and Iran’s nuclear capability. The first part of the ad is devoted to images of what appear to be Islamic State fighters marching and carrying the Islamic State flag while Griffin says “they’ve declared war on America.”", "Then Griffin pivots to the Iran deal. But the fact is, Iran’s Shia regime is an enemy of the Sunni Islamic State insurgency.", "Iranian warplanes have conducted strikes in neighboring Iraq against fighters of the Islamic State, which is also known as the Islamic State of Iraq and Syria, or ISIS. Iran is also deeply involved in the fighting in Syria. The BBC recently reported that a high-ranking Iranian general “has been co-ordinating the Iraqi government’s operations against Islamic State” in Syria. Earlier, Iranian media reported that hundreds of Iranian “volunteers” had died fighting in Syria against the Islamic State forces.", "To be sure, Iran is still officially considered a “state sponsor of terrorism” by the U.S. State Department, mainly because of its arming and training of Hezbollah fighters in Lebanon, and its support for the Assad regime in Syria.", "The ad concludes with Griffin saying, “I’ll stand with our friends, and against our enemies. I know the difference.” But this ad should make voters wonder if he knows the difference between ISIS and Iran.", "https://www.sharethefacts.co/share/ad02f8d9-07b6-4bc5-9b5d-f9cd5c87fd86", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]