["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A man wears a mask to help prevent the spread of the coronavirus while using his phone on a rainy day. (AP)", "• The post inaccurately summarizes a CDC report. In reality, the report found a correlation between regular mask wearing and lower COVID-19 transmission.", "• Scientific studies have consistently found that face-mask use is one of the most effective means of preventing the transmission of COVID-19. ​", "Health researchers have consistently found strong correlations between wearing a face mask and reducing the spread of disease like COVID-19.", "But new posts on Facebook inaccurately claim that wearing a mask makes you more likely to contract COVID-19, misinterpreting a survey from the Centers for Disease Control and Prevention along the way.", "The post features a screenshot of a data table from the CDC’s Morbidity and Mortality Weekly Report. A highlighted row shows that 70.6% of these people who tested positive for the virus reported that they \"always\" wore masks or cloth face mask coverings.", "\"This is really REALLY BIG,\" the post reads. \"HUGE… From the CDC… 70.6% of those testing positive wore masks ALWAYS. 3.9% of those testing positive wore masks NEVER. This means that people who wear masks, are actually ‘collecting’ the virus in their masks. The airborne particles are being absorbed into the Masks and staying on our faces rather than dissipating. A clear indication there is a correlation to more infected people wearing masks than those who do not.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Texas A&M University-Texarkana virologist Ben Neuman evaluated the post and the CDC report from which it’s purportedly sourced for PolitiFact.", "\"There’s nothing in this (report) that indicates that mask wearing is associated with more coronavirus,\" he said. \"Honestly, I don’t even know how that could be possible.\"", "The CDC paper never claims that mask use increases your likelihood of contracting the coronavirus. The CDC continues to recommend that people wear masks in public settings and when around people who don’t live in their home.", "Instead, the paper summarizes findings from a survey of 314 people. 154 of these people had tested positive for the coronavirus. The other 160 participants (the study’s control group) had tested negative for the coronavirus.", "From the results of the survey, the CDC report found that two activities were linked to a positive COVID-19 test: close contact with someone who tested positive for coronavirus and going to locations with on-site eating and drinking options, such as bars and restaurants.", "The correlation between frequenting on-site eating locations and a positive COVID-19 test probably indicates that masks play a role in preventing the spread of the virus. The paper notes that masks \"cannot be effectively worn while eating and drinking,\" so diners and bar-goers are likely exposed to infectious respiratory droplets when they lower their masks to take a drink or a bite of food.", "The table featured in the Facebook post doesn’t show that mask use is correlated with the spread of the coronavirus. In fact, it shows the opposite: more people who tested negative for the coronavirus reported that they \"always\" wore masks than people who tested positive.", "Of the 160 survey participants who tested negative, 74.2% reported that they \"always\" wore a face mask or cloth face covering. Of the 154 participants who tested positive, 70.6% reported that they \"always\" wore a mask or face covering.", "Neuman took issue with the survey asking participants to self-report their rates of mask use.", "\"Conducting science by survey has problems,\" he said. \"There are certain things that are embarrassing or politically and socially sensitive, and you generally won’t get honest answers if you just ask them on a questionnaire because (participants) don’t know if they can trust the person on the other end, don’t know if they’ll be repercussions, or may just be embarrassed about telling the truth.\"", "The CDC did not respond to our request for comment by deadline.", "The Facebook post’s claim that masks are \"collecting\" infectious airborne particles mischaracterizes the science behind masks and how they stop viral spread.", "Masks are most effective as \"source control,\" preventing infected people from spreading the virus to other people. Although masks do provide the wearer some protection, people can still be infected while having them on.", "Respiratory droplets with the virus are expelled into the air when infected people cough, talk, sneeze, or breathe. These droplets quickly evaporate and shrink to become tiny airborne particles, which are extremely difficult to remove. However, if an infected person is wearing a mask, it will catch and contain the larger droplets in the humid space between the person’s mouth and the mask. In this environment, droplets take nearly a hundred times as long to transform into airborne particles.", "Neuman shared three studies of hundreds of thousands of infected people that all found that mask-wearing reduces the likelihood of contracting the coronavirus. Unlike the CDC report, these studies didn’t rely on survey data and self-reported rates of mask use.", "The first paper, which analyzed trends in infections in Wuhan, China, Italy, and New York City, found that face mask mandates were \"the most effective means to prevent interhuman transmission.\" The researchers found that a mask mandate reduced infections by over 75,000 in Italy from April 6 to May 9 and over 66,000 in New York City from April 17 to May 9.", "The second paper, which reviewed 172 studies conducted on a total of 25,697 patients with COVID-19, SARS, or MERS across 16 countries and six continents, found that face masks \"were associated with a much lower risk of infection.\"", "The third paper, which analyzed 15 U.S. states found that daily infection rates decreased significantly after mask mandates were introduced. In seven of the 15 states, researchers from UC San Diego and Texas A&M found that the number of new infections per day increased steadily only to fall after face-mask requirements were implemented. In the six states the researchers analyzed that never implemented mask mandates, infections continued to increase on the same upward line. They estimated that mask mandates had prevented a total of 252,000 infections on May 18, equivalent to nearly 17% of infections in the nation at that point in time.", "A Facebook post says that a CDC report found that \"people who wear masks, are actually ‘collecting’ the virus in their masks.\"", "The CDC report cited in the post actually found the opposite: More people who tested negative for COVID-19 reported wearing masks than people who tested positive.", "Other scientific studies have consistently found that mask wearing decreases the spread of coronavirus.", "We rate this post Pants on Fire! ​", "A Facebook post, Oct. 12, 2020", "CDC, Considerations for wearing masks, Aug. 7, 2020", "CDC, Morbidity and Mortality Weekly Report, Jul. 2020", "PNAS, Identifying airborne transmission as the dominant route for the spread of COVID-19, Jun. 11, 2020", "The Lancet, Physical distancing, face masks, and eye protection to prevent person-to-person transmission of SARS-CoV-2 and COVID-19: a systematic review and meta-analysis, Jun.-July 2020", "Science of the Total Environment, Understanding transmission and intervention for the COVID-19 pandemic in the United States, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]