["About this rating", "On 25 February 2016, multiple high-volume Twitter accounts published warnings claiming that the meetup app \"Down to Lunch\" was a tool for human traffickers:", "DOWN TO LUNCH IS A SEX TRAFFICKING APP DO NOT DOWNLOAD pic.twitter.com/rs9MDQJM0b", "— Dory (@Dory) February 25, 2016", "DOWN TO LUNCH IS A SEX TRAFFICKING APP DO NOT DOWNLOAD pic.twitter.com/ADnDSsVHYQ — Common White Girl (@CommonWhiteGirI) February 26, 2016", "It was an odd claim, since purpose of Down to Lunch was well documented, the app was hugely popular, and there was no information available to substantiate the allegations. A TechCrunch profile introduced the app in August 2015 as an alternative to group texts:", "Frustrated by how difficult it was to have spur of the moment get-togethers with friends, Stanford classmates Joseph Lau and Nikil Viswanathan spent a Friday afternoon in San Francisco’s SoMa district building what they called Down To Lunch. “I want to emphasize how simple or silly it was,” said Lau. “We didn’t know who was free, and who was where, and who was able to hang out,” Viswanathan explained. “We literally made the simplest app we could think of — which was one button,” joked Lau, describing the app’s speedy development in early March. Perhaps it is Down To Lunch’s straightforwardness that has allowed it to to grow so organically in the face of other full-time competitors like Free, which was co-founded by former Path employees. Unlike competing apps that require users to enter text or downselect into an activity type, Down To Lunch’s simplicity makes it a useful tool without adding extra work for users.", "Between August 2015 and February 2016, Down to Lunch remained a popular app for real-time networking, but on 24 February 2016, a tweet shared a screenshot of an App Store review from a few weeks earlier. The review claimed that Down to Lunch was a covert trafficking app, but the story that it offered (which featured strangers in sunglasses and trench coats, random middle-aged people crashing lunches and talking about photography, and — of course — a creepy van) wasn't substantiated by any evidence:", "DO NOT DOWNLOAD \"DOWN TO LUNCH\" IT IS A SEX TRAFFICKING APP pic.twitter.com/Xzh7EaRYSr — emily ;; 79 (@sebductive) February 25, 2016", "We contacted Down to Lunch about the sudden viral rumors. Co-founder Nikil Viswanathan told us that the review (since removed) appeared to have kicked them off:", "... I actually thought this was pretty funny when I saw it yesterday. Someone wrote a fake app store review (apple flagged it and pulled it down) saying it was human trafficking and to be honest I thought it was a pretty funny review. Turns out it's more serious than we realized. The twitter accounts that are promoting this review turned out to be paid accounts ... This whole situation is ridiculous, hilarious, and flattering - we're just two friends who made this app for fun and its been blowing up all across the country in the last few weeks.", "Down to Lunch tweeted about the claims:", "Pretty stoked to see that people care enough to start a fake smear campaign about DTL! (you can pay for tweets: https://t.co/gMn6J99ONK) — Down To Lunch (@downtolunch) February 26, 2016", "In June 2015, Twitter was abuzz with rumors of human traffickers using job interviews to attract college students. There were two similarities between the individual rumors: they were of the always-popular \"human trafficking warning\" sort, and they took off after \"Common White Girl\" style accounts shared the rumor.  Those accounts frequently shared such content to generate traffic for Twitter accounts:", "Where @TweetLikeAGirl sourced the message from was unclear, and neither the sender nor the recipient of the depicted text message was identified. That Twitter account is quite popular (with more than 1.3 million followers), however, and is identified in its description as a \"parody account.\" While some followers may have mistaken the tweet for a first-person tale, it was not: all the content on that particular timeline was aggregated from other sources.", "The account's owner likely received an impressive response to the human trafficking warning tweet above, as roughly an hour after posting it he tweeted a similar (false) warning about a shopper's purported encounter with human traffickers in an Oklahoma Hobby Lobby store:", "A November 2014 BuzzFeed article (\"Meet the Network of Guys Making Thousands of Dollars Tweeting As 'Common White Girls'\") included comments from Cameron Asa, a 21-year-old college student behind some of the accounts involved in the June 2015 claims. Asa explained to BuzzFeed how sharing breathless warning tweets was a lucrative content game for popular Twitter feeds:", "Asa's new game is keeping his account relevant and relatable — and it's working. He's now pulling in pretty massive money. He was a little uncomfortable discussing the amount he makes per retweet, but he said that it can be as high as hundreds of dollars.", "\"Lately I've been posting for different apps, and it can range from anywhere from $500 - $1,000 per post — it's awesome,\" Asa said. \"I actually did an app tweet last week and I ended up getting the app 20,000 downloads off one tweet.\"", "Warnings about human or sex trafficking are almost guaranteed to reach near-instant virality (the claim about Down to Lunch wasn't even the only rumor of that type that we saw circulating on 25 February 2016), and while the intent of the Down to Lunch reviewer remained to be seen, the rumor was predictably shared by opportunistic Twitter accounts which seem to exist solely to collect retweets and earn money.", "While the issue of human trafficking is real and extremely serious (explained here by the United Nations Office on Drugs and Crime), Down to Lunch was in no way a risk for users based on its functionality and the ways in which trafficking typically occur. The app uses a device's contact list to simplify the process of coordinating social meetings between friends, and no aspect of it appeared to expose user information in an unsafe way.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]