["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In late December 2020, social media users shared a meme claiming that the transition team for U.S. President-elect Joe Biden was \"removed\" from the Pentagon for leaking intelligence to the Chinese government:", "The text of the meme reads:", "Last week the Biden transition team was removed from the Pentagon and now we know why. The Secretary of Defense gave disinformation to the Biden team about Naval movements in the South China Sea. Within 30 minutes the intel was leaked to the CCP. Anyone that is okay with this needs to have their head checked. Biden is in bed with China.", "Notably, the meme didn't include any evidence to support its claims — and there is no evidence that Biden's team was \"removed\" from the Pentagon or had leaked any intelligence to the Chinese Communist Party, the ruling political party in China.", "Had such a stunning event actually happened, we'd doubtlessly see mainstream news coverage. We found no credible news reports that the incoming presidential administration leaked intelligence to China, which would be a bombshell report.", "In fact, it's been an ongoing issue that outgoing U.S. President Donald Trump has not only refused to admit his electoral loss in the Nov. 3, 2020, election, but his administration has also demonstrated an unprecedented lack of cooperation with the incoming administration.", "On Dec. 18, 2020, Axios reported that Trump's acting Secretary of Defense Chris Miller had \"ordered a Pentagon-wide halt to cooperation with the transition of President-elect Biden, shocking officials across the Defense Department,\" citing \"senior administration officials.\"", "Miller said in a statement that his staff had been cooperating, and would continue to do so after a \"mutually-agreed upon holiday pause.\" Biden's team responded by stating Miller's comments were false and that they had never agreed on a holiday break in transition meetings.", "Biden's national security adviser Jake Sullivan said in a Dec. 29, 2020, interview with NPR that Trump's political appointees have continued to obstruct the transition process and haven't turned over vital information pertaining to things like a massive Russian cyberattack against American government agencies or plans to distribute COVID-19 vaccines to the American public.", "Biden called the lack of cooperation from the Trump administration \"nothing short, in my view, of irresponsibility.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]