["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Muslims rally at the Texas Capitol in January 2017. It's not correct that Arabic is the third most-common language spoken in Austin (Photo, Jay Janner, Austin American-Statesman).", "An Austin appointee declared Arabic the Texas capital’s third most-common language.", "De veras?", "Maram Museitif, confirmed by the Austin City Council in May 2017 to serve until 2020 on the Central Health Board of Managers, was quoted saying in a press release announcing the appointment: \"I'm very familiar with Central Health's mission and the needs of the people we serve. I bring a broader representation to the board.\"", "Museitif went on: \"Austin has a growing Muslim, Arab, and refugee community and they need a voice at the table. I can be that voice. I'm a Muslim and speak fluent Arabic, which is the third most-common language in Austin.\"", "That’s not so for all of Austin, we found, but it has been so among patients seeking care at clinics overseen by Central Health.", "For all of Texas, we previously found True a 2016 claim by Sen. John Cornyn, R-Texas, that Vietnamese is the state’s third most-spoken language. Cornyn’s statement was backed up by U.S. Census Bureau survey results. Those results placed Arabic about No. 10 in the state.", "Spokesman: Appointee meant to limit claim", "Ted Burton, a Central Health spokesman, responded to our request for the basis of Museitif’s statement by saying she meant to say something less. \"Museitif,\" Burton wrote, \"was referring to CommUnityCare’s patient population – meaning patients in our community that Central Health serves.\" He said the online press release quoting Museitif would be amended to quote her calling Arabic \"the third most common language in the CommUnityCare patient population.\"", "Central Health says it works through a network of health care partners and community members to connect uninsured, underinsured and low-income residents with high-quality, cost-effective health care. Its all-volunteer board consists of four members appointed by the council, four by the Travis County Commissioners Court — plus one joint appointee", "Burton wrote that in fiscal 2015, a little over half of the entity’s patients spoke English, nearly 44 percent spoke Spanish--and, third in concentration, 1.1 percent reported speaking Arabic, according to self-reported patient data. In the year, Burton said, about 20 clinics served more than 88,000 patients.", "Burton provided a chart breaking out patients’ \"language\" responses:", "Top 10 Languages spoken by CUC patients, FY15", "(excluding unknown or other)", "Language", "%", "1", "English", "51.9%", "2", "Spanish", "43.5%", "3", "Arabic", "1.1%", "4", "Burmese", "0.4%", "5", "Nepali", "0.4%", "6", "Vietnamese", "0.3%", "7", "Persian", "0.2%", "8", "American Sign Language", "0.2%", "9", "Swahili", "0.1%", "10", "Amharic", "0.1%", "Total", "98.1%", "SOURCE: Email citing patient-submitted responses, Ted Burton, director of communications, Central Health, May 26, 2017", "Burton, asked for more detail, emailed us a document showing that Arabic also proved to be CommUnityCare patients’ third most-common language in 2014 and 2016.", "Asked why Arabic has been so widely used among patients, Burton put us in touch with an Arabic-speaking CommUnityCare physician assistant, Amneh Amro, who speculated by phone that there’d been an Austin-area uptick in refugees from Arabic-speaking countries including Syria. A decade earlier, Amro said, Asian languages were likely more prevalent among patients. When we asked, Burton said Central Health has no data on patients' countries of origin.", "Surveys: Chinese third most-common Austin language", "So, which languages are most prevalent in Austin?", "We heard back from a couple of authorities on that.", "Jewel Jordan, a Census Bureau spokeswoman, pointed out results from the single-year 2015 American Community Survey indicating that behind English and Spanish, the third most common spoken language in Austin was Chinese. According to those survey results, Arabic was Austin’s 12th most-common spoken language — though we noticed that if you apply the survey’s margin of error figures as much as possible to drive up the number of Austin Arabic speakers and apply respective margins of error to drive down the number of speakers of some other languages, it’s possible to place Arabic fifth in the city, behind English, Spanish, Chinese and \"Other Asian Languages.\"", "Ryan Robinson, the City of Austin demographer, drew on the bureau’s five-year ACS results through 2015 to provide a chart showing Arabic 10th in prevalence among spoken languages in Austin behind English, Spanish, Chinese, Vietnamese, other Asian languages, Korean, Hindi, French and other Indic languages. The chart also presents estimates of the number of individuals primarily speaking about 30 other languages.", "Our ruling", "Museitif called Arabic Austin’s third most-common language.", "That’s incorrect; in 2015, Chinese ranked third in prevalence in Austin behind English and Spanish, according to federal surveys. Arabic was evidently third most common among languages spoken by patients at clinics overseen by Central Health.", "We rate Museitif’s statement False.", "FALSE – The statement is not accurate. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Truth-O-Meter article, \"John Cornyn says Vietnamese third most common language spoken in Texas,\" PolitiFact Texas, May 26, 2016", "Emails (excerpted) and phone interview, Ted Burton, director of communications, Central Health, May 26 and June 2, 2017", "Chart, \"LANGUAGE SPOKEN AT HOME BY ABILITY TO SPEAK ENGLISH FOR THE POPULATION 5 YEARS AND OVER,\" Austin, 2015 American Community Survey 1-Year Estimates, U.S. Census Bureau, undated (accessed May 26, 2017)", "Chart showing languages spoken in Austin, Five-Year American Community Survey, U.S. Census Bureau, 2015 (received by email from Ryan Robinson, City of Austin demographer, May 26, 2017)", "Phone interview, Amneh Amro, physician assistant, CommUnityCare, June 2, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]