["About this rating", "New Orleans Saints linebacker Demario Davis was fined by the NFL for violating the \"personal message\" provision of the league's dress code policy by sporting a \"Man of God\" headband. The fine was later overturned.", "Davis was not fined due to the religious nature of the message on his headband.", "On Sept. 22, 2019, New Orleans Saints linebacker Demario Davis wore a headband bearing the words \"Man of God\" during a game against the Seattle Seahawks. The National Football League (NFL) ended up fining Davis $7,017 because his wearing of the headband violated the league's dress code policy, as reported by The Washington Post:", "During a Sept. 22 game against the Seattle Seahawks, the New Orleans Saints linebacker wore a headband matching the team’s colors bearing the words, “Man of God.” He said he was fined $7,017 for a first-offense uniform violation even though the headband wasn’t visible beneath his helmet. NFL rules are strict when it comes to game-day apparel, and personal messages are prohibited.", "It's undeniable that Davis' was fined after he wore a \"Man of God\" headband during an NFL game, but some people spread news of Davis' fine as if it documented that the league held an anti-Christian bias and/or that the penalty was predicated purely upon the \"Man of God\" message.", "Conservative commentator Todd Starnes, for example, suggested that the phrase \"Man of God\" (or religious expression in general) was a \"big no-no\" in the NFL:", "Demario Davis, a starting linebacker for the New Orleans Saints, was fined more than $7,000 for wearing a headband with a Christian message.", "The headband was emblazoned with the words “Man of God” -- a big no-no in the National Football League these days.", "The NFL has a famously strict dress code policy that has led to the levying of some unpopular fines over the years. In 2015, two players were fined for honoring their late mothers by wearing pink and purple items (to represent causes related to domestic abuse and breast cancer) with their uniforms. In 2013, a Detroit Lions player was fined for wearing blue and black socks instead of the league-approved blue and white socks. And a few weeks after Demario Davis was fined in September 2019, Pittsburgh Steelers quarterback Ben Roethlisberger was similarly fined for wearing an Apple Watch on the sidelines.", "The aforementioned fines were not levied by the NFL because the league has something against charity, blue and black socks, or smartwatches. These fines were handed out because the players violated a provision of the league's five-page-long dress code policy. Here's the \"personal message\" portion of the NFL's dress code policy that relates to Davis' fine (emphasis ours):", "Throughout the period on game-day that a player is visible to the stadium and television audience (including in pregame warm-ups, in the bench area, and during postgame interviews in the locker room or on the field), players are prohibited from wearing, displaying, or otherwise conveying personal messages either in writing or illustration, unless such message has been approved in advance by the League office. Items to celebrate anniversaries or memorable events, or to honor or commemorate individuals, such as helmet decals, and arm bands and jersey patches on players’ uniforms, are prohibited unless approved in advance by the League office. All such items must relate to team or League events or personages. The League will not grant permission for any club or player to wear, display, or otherwise convey messages, through helmet decals, arm bands, jersey patches, or other items affixed to game uniforms or equipment, which relate to political activities or causes, other non-football events, causes or campaigns, or charitable causes or campaigns. Further, such armbands and jersey patches must be modest in size, tasteful, noncommercial, and non-controversial; must not be worn for more than one football season; and if approved for use by a specific team, must not be worn by players on other teams in the League.", "Davis was fined for displaying an unapproved personal message, regardless of its content. A player's wearing a headband bearing the words \"Hail Satan,\" \"Avengers Endgame Was a Bad Movie,\" or \"Trump 2020\" would have, theoretically, resulted in the same penalty.", "It should also be noted that fines collected for dress code violations don't go to the NFL, but to two charities that support former players. The NFL also started the \"My Cause, My Cleats\" campaign in 2017, which allowed players to wear personalized cleats in support of a charity during one week of the NFL season.", "Demario Davis is selling \"Man of God\" and \"Woman of God\" headbands to raise money for St. Dominic's Hospital:", "I accept the fine but the mission continues! Obstacles are made to be conquered and I'm here to serve!!! We all can. Me, my family, and my headband are partnering with @stdomhospital so that 100% of proceeds can help save lives. You in?! #ManOfGod You can get your headband and help me support St. Dominic’s by going to: bit.ly/56manofgod (link in bio)", "A post shared by  Demario Davis #56 (@d56davis) on Oct 5, 2019 at 6:06pm PDT", "Davis appealed the fine and on October 9, 2019 he announced that the NFL had reversed their decision:", "The New Orleans Saints' starting weak-side linebacker fielded a message from his agent, telling him that he wouldn't have to pay the $7,014 fine stemming from the \"Man of God\" headband he wore during the Seattle Seahawks game.", "\"It's a huge win,\" Davis said Wednesday.", "Davis and his team cited several reasons for their appeal. Davis said he didn't know the headband was a fine-worthy offense. He also argued that the headband wasn't offensive and that he wouldn't wear the headband during a game again.", "Just, Amie.   \"Demario Davis Talks 'Man of God' Appeal, New Orleans Students' Handmade Headbands.\" \r\n    Nola.com.   9 October 2019.", "Schefter, Adam.   \"Sources: NFL Fines Ben Roethlisberger $5,000 for Wearing Apple Watch on Steelers' Sideline.\"\r\n    ESPN.   6 October 2019.", "Wilson, Ryan.   \"Lions' Louis Delmas Fined $5,000 for Wearing Wrong Color Socks.\"\r\n    CBS Sports.   21 September 2013.", "Boren, Cindy.   \"NFL Fines Will Gay, DeAngelo Williams for Honoring Their Late Mothers.\"\r\n    The Washington Post.   28 October 2015.", "Ley, Tom.   \"The NFL's Uniform Policies Are Even More Tight-Assed Than You Thought.\"\r\n    Deadspin.   5 August 2015.", "Boren, Cindy.   \"An NFL Player Will Stop Wearing His ‘Man of God’ Headband After the League Fined Him $7,000.\"\r\n    The Washington Post.   3 October 2019.", "Starnes, Todd.   \"NFL Punishes Player For Wearing 'Man of God' Headband.\"\r\n    Toddstarnes.com.   6 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]