["“This is Pelosi yesterday for her photo op after impeaching Trump. The interesting part is members of Congress don’t get secret service details. Think about that for a moment,” said a January 14, 2021 Facebook post which is no longer available.", "“If you zoomed in closely you can see that these are US Marshalls. Anyone care to guess why they’re all female? When you are under arrest with 24 hour supervision and are female, they don’t put a man on your details,” it said, adding that “Nancy Pelosi is 100% arrested.”", "Examples of the claim can be found on Facebook here, here and here, and in an online article here.", "While the image is authentic, it does not show Pelosi under arrest.", "A Google reverse image search located the original version of the photo in the posts, which was taken by Associated Press photographer J. Scott Applewhite.", "Its caption says it shows Pelosi returning to her office after opening House debate on the impeachment of then-president Donald Trump on January 13, 2021.", "The Democrat-controlled House of Representatives impeached Trump with support from 10 Republicans for \"incitement of insurrection,” after a deadly January 6 riot by his supporters at the building where Congress meets.", "Drew Hammill, Pelosi’s deputy chief of staff, told AFP in an email that the claims about Pelosi being arrested or under supervision of the US Marshals Service were “false.”", "And William Delaney, Chief of Congressional and Public Affairs at the US Marshals Service, said by email: “I can confirm that any report that we have arrested Speaker Pelosi is absurd and false.”", "He added: “The law enforcement officers that are in your photograph are not deputy US Marshals. Our deputies have badges that are considerably different, with a large silver star.”", "A photo of the current badge for US Marshals can be seen here.", "AFP Fact Check has debunked other inaccurate claims about Pelosi here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]