["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "• A photo purporting to show Kamala Harris with her parents actually shows her posing at a gala with two people unrelated to her. ​", "Sen. Kamala Harris is the first Asian American and the first Black woman to be on a major-party ticket. But misinformation questioning the ancestry of the Democratic vice presidential pick has already begun to spread on Facebook.", "One photo we saw on Facebook shows Harris posing with two people at a gala — a woman in a sari and a man in a suit. A caption above the photo reads: \"These are Kamala Harris’s parents. Her dad is Jamaican. Her mom is Indian. So why does she refer to herself as an ‘African American?’\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This photo does not show Harris with her parents. The people in the picture are California residents Suneil and Rohini Parulekar, who are unrelated to Harris.", "The Parulekars confirmed that they were the couple in the photograph in an interview with PolitiFact. Suneil Parulekar laughed when presented with the image.", "\"We are not Kamala Harris’s parents,\" he said. \"But unfortunately we live in an era of misinformation.\"", "Parulekar said that the photo was taken four years ago when Harris was California attorney general. She was a guest of honor at a gala held by the nonprofit organization Pratham, of which the Parulekars are board members.", "The text is correct in stating that Harris’s father is Jamaican and her mother is Indian. However, it also wrongly implies that Harris cannot have African ancestry because \"her dad is Jamaican.\" According to a 2011 census, 92.1 percent of Jamaicans are Black, with genetic studies showing that the vast majority hail from sub-Saharan Africa.", "Harris’s father Donald J. Harris is a former Stanford economics professor. Her late mother, Shyamala Gopalan, died of cancer in 2009, seven years before the picture at the gala was taken.", "This post does not show Harris’s parents. We rate this Pants on Fire!", "Facebook post, Aug. 11, 2020", "AP, \"Photo does not show Sen. Kamala Harris with her parents,\" Aug. 12, 2020", "BMC Evolutionary Biology, \"Interdisciplinary approach to the demography of Jamaica,\" Feb. 23, 2012", "Legacy.com, \"Dr. Shyamala G. Harris,\" March 22, 2009", "Pratham USA, \"Partners and supporters,\" June 19, 2020", "Reuters, \"Fact check: Photo questioning Kamala Harris’ African ancestry does not show her parents,\" Aug. 3, 2020", "Statistical Institute of Jamaica, \"Population and housing census: 2011,\" 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]