["About this rating", "The 1951 Refugee Convention gives migrants the right to apply for asylum in the United States, regardless of whether they entered or remained in the country legally or illegally.", "It is illegal to enter or be present in the United States without authorization or proper documentation, regardless of the circumstances a migrant might have fled. Under a June 2018 ruling by the U.S. Attorney General, escaping gang violence is unlikely to form the basis of a successful application for asylum in the United States.", "In the autumn of 2018, controversy surrounded a caravan of thousands of migrants travelling mainly from Honduras, but also from Guatemala, towards Mexico and the southern border of the United States.", "President Donald Trump claimed (without presenting evidence) that the contingent included \"criminals and unknown Middle Easterners,\" and as the caravan slowly approached Mexico, some conservative opponents of illegal immigration stoked fears with false or misleading claims that the migrants were burning U.S. flags, and that the caravan was a liberal conspiracy funded by the financier George Soros.", "Public attention was also focused on the personal circumstances of some of the migrants and their motivations for travelling to the United States. Like Guatemala and El Salvador, Honduras is the site of rampant violence related to gangs and drug trafficking and has one of the highest murder rates in the world.", "In June 2018, the Council on Foreign Relations, a non-partisan think tank with a focus on international affairs, wrote of this crisis that:", "Tens of thousands of Salvadorans, Guatemalans, and Hondurans, many of them unaccompanied minors, have arrived in the United States in recent years, seeking asylum from the region’s skyrocketing violence. Their countries, which form a region known as the Northern Triangle, were rocked by civil wars in the 1980s, leaving a legacy of violence and fragile institutions.", "The region remains menaced by corruption, drug trafficking, and gang violence despite tough police and judicial reforms. While the United States has provided the three governments billions of dollars in aid over the past decade, some analysts believe U.S. immigration policies have exacerbated threats to regional security.", "The number of asylum seekers worldwide originating from the Northern Triangle reached 110,000 in 2015, a five-fold increase from 2012. Unaccompanied minors accounted for much of this surge. Migrants from all three countries cite violence, forced gang recruitment, and extortion, as well as poverty and lack of opportunity, as their reasons for leaving.", "Against that background, observers sympathetic to the plight of those who were part of the October 2018 caravan began sharing a meme which sought to reject an argument frequently made by those who opposed the migrants' right to enter the United States: that the migrants' actions were illegal.", "On 22 October, the General Board of Church and Society of the United Methodist Church, one of the largest Christian denominations in the United States, posted the following meme to Facebook:", "Myth: Crossing a border without proper authorization and documentation is an illegal act.", "Reality: The Geneva Convention, established after WWII, gives migrants fleeing violence the right to enter legally.", "The following day, the meme was further promoted (in a modified format) by the left-wing Facebook page \"The Other 98%\":", "A convention in Geneva vs. \"the Geneva Conventions\"", "Article 14 (1) of the 1948 Universal Declaration of Human Rights states: \"Everyone has the right to seek and to enjoy in other countries asylum from persecution.\"", "Built on this foundation, the two major pieces of international law which set out the rights and obligations of countries as regards refugees and asylum-seekers are the 1951 Convention Relating to the Status of Refugees (commonly known as the Refugee Convention) and the 1967 Protocol Relating to the Status of Refugees. Both documents can be found here.", "The 1951 convention took place in Geneva, Switzerland, which occasionally prompts observers to refer to it as the \"Geneva Convention,\" as the October 2018 meme does. However, \"Geneva Conventions\" should be reserved for describing a separate series of agreements signed in 1949 (and afterwards) which set out the humanitarian rules of war, placing obligations on countries around the treatment of wounded enemy combatants, prisoners of war, and so on.", "With that clarification in mind, let's look at what international and U.S. law says about the legality (or otherwise) of entering the United States \"without proper authorization and documentation.\"", "'An illegal act'", "The U.N. Refugee Agency describes the 1951 Refugee Convention as follows:", "The 1951 Convention protects refugees. It defines a refugee as a person who is outside his or her country of nationality or habitual residence; has a well-founded fear of being persecuted because of his or her race, religion, nationality, membership of a particular social group or political opinion; and is unable or unwilling to avail him— or herself of the protection of that country, or to return there, for fear of persecution ... People who fulfill this definition are entitled to the rights and bound by the duties contained in the 1951 Convention.", "Those rights include:", "As one of the signatories to the Refugee Convention, the United States is obliged to honor these provisions. Federal law (U.S. Code Title 8, Section 1158) sets out the following:", "Any alien who is physically present in the United States or who arrives in the United States (whether or not at a designated port of arrival and including an alien who is brought to the United States after having been interdicted in international or United States waters), irrespective of such alien’s status, may apply for asylum in accordance with this section or, where applicable, section 1225(b) of this title.", "The key phrase there is \"irrespective of such alien's status.\" This means that, whether a migrant entered or is present in the United States legally or illegally, they still have the right under international and U.S. law to apply for asylum and remain in the United States while their application is being processed.", "So the language in the meme is somewhat inaccurate or muddled. Firstly, it is not a \"myth\" that entering the U.S. \"without proper authorization and documentation\" is illegal. It is illegal, by definition. But when it comes to asylum, the point is that whether a refugee entered the country legally or illegally doesn't impinge on their right to apply for asylum.", "Article 31 (1) of the 1951 Refugee Convention states:", "The Contracting States shall not impose penalties, on account of their illegal entry or presence, on refugees who, coming directly from a territory where their life or freedom was threatened in the sense of article 1, enter or are present in their territory without authorization, provided they present themselves without delay to the authorities and show good cause for their illegal entry or presence.", "Second, the meme claims that the Refugee Convention \"gives migrants fleeing violence the right to enter legally.\" This is a somewhat confused assertion. Non-citizens don't exactly have a \"right\" to enter the U.S. Rather, the U.S. government and its agents and officials can give non-citizens conditional permission to enter the United States. The 1951 Refugee Convention has no bearing on whether or not a migrant or non-citizen has permission to enter the United States.", "What the meme appears to be claiming is that if a migrant is fleeing violence, their entry into the United States is legal by virtue of the fact that they are fleeing violence. This is inaccurate.", "Whether a migrant is fleeing violence or persecution does not have a bearing on the legality or illegality of their entry into the United States, although obviously such factors could potentially form the basis of a successful asylum application later on.", "The asylum application process", "The procedures involved in requesting and getting asylum in the United States can be relatively complicated and time-consuming. However, based on guidelines published by the American Immigration Council and U.S. Citizenship and Immigration Services (USCIS), an agency of the Department of Homeland Security, the following is a rough outline of how a migrant can obtain asylum in the United States:", "'Fleeing violence'", "As we have outlined, the legality of a migrant's entry or presence in the United States is determined by whether they have the correct authorization and documentation, and not whether or not they are fleeing violence or persecution in their home country. Likewise, migrants have a right to apply for asylum in the U.S., regardless of whether they entered or remained in the country legally or illegally.", "However, it should be pointed out that fleeing gang violence of the kind often seen in Honduras and Guatemala, the home countries of those who joined the \"migrant caravan\" in October 2018, may well not form the basis of a successful asylum application.", "In June 2018, Attorney General Jeff Sessions published a major ruling which overturned a 2014 decision by the Board of Immigration Appeals, relating to domestic abuse and gang violence as grounds for asylum. In brief, Sessions ruled that asylum should be reserved for individuals who are suffering persecution or violence on the basis of their membership of a group that has a \"common immutable [unchanging] characteristic\":", "An applicant seeking to establish persecution on account of membership in a “particular social group” must demonstrate: (1) membership in a group, which is composed of members who share a common immutable characteristic, is defined with particularity, and is socially distinct within the society in question; and (2) that membership in the group is a central reason for her persecution. When the alleged persecutor is someone unaffiliated with the government, the applicant must also show that her home government is unwilling or unable to protect her ...", "The mere fact that a country may have problems effectively policing certain crimes or that certain populations are more likely to be victims of crime, cannot itself establish an asylum claim. To be cognizable, a particular social group must exist independently of the harm asserted in an application for asylum.", "The Attorney General drew a distinction between victims of group-based persecution and violence, and what he called \"victims of private criminal activity.\" On the question of gang violence, Sessions wrote:", "Victims of gang violence often come from all segments of society, and they possess no distinguishing characteristic or concrete trait that would readily identify them as members of such a group ...", "A criminal gang may target people because they have money or property within the area where the gang operates, or simply because the gang inflicts violence on those who are nearby. That does not make the gang’s victims persons who have been targeted “on account of” their membership in any social group.", "The American Civil Liberties Union has challenged Sessions' ruling in federal court, in a case that was still pending as of 25 October 2018.", "For the time being, however, the Refugee Convention alluded to in the United Methodist Church's meme may not offer much protection or assistance to those Central American migrants approaching the U.S. in the October 2018 caravan, even if they are fleeing violence, and regardless of whether they enter the country legally or illegally.", "Higgins, Tucker.  \"Trump Declares Without Evidence That 'Criminals and Unknown Middle Easterners Are Mixed In' With Migrant Caravan Making Its Way From Honduras.\"\r\n  CNBC.  22 October 2018.", "Evon, Dan.  \"Are Central American Caravan Members Burning the American Flag?\"\r\n  Snopes.com.  23 October 2018.", "Palma, Bethania.  \"Did Members of the Migrant Caravan Paint a Swastika on an American Flag and Set It on Fire?\"\r\n  Snopes.com.  23 October 2018.", "Evon, Dan.  \"Did the FBI Confirm George Soros Was Funding the Migrant Caravan?\"\r\n  Snopes.com.  24 October 2018.", "Evon, Dan.  \"Did George Soros Pay Refugees in Honduras to Join a Caravan and Storm the US Border?\"\r\n  Snopes.com.  19 October 2018.", "Labrador, Rocio Cara; Renwick, Danielle.  \"Central America's Violent Northern Triangle.\"\r\n  The Council on Foreign Relations.  26 June 2018.", "Pew Research Center.   \"Religious Landscape Study.\"\r\n    2014.", "The United Nations.  \"The Universal Declaration of Human Rights.\"\r\n  1948.", "The UN Refugee Agency.  \"The 1951 Convention Relating to the Status of Refugees and Its 1967 Protocol.\"\r\n  2011.", "Legal Information Institute.  \"U.S. Code, Title 8, Chapter 12, Subchapter II, Part I, Section 1158 -- Asylum.\"\r\n  Cornell Law School.  Accessed 25 October 2018.", "American Immigration Council.  \"Fact Sheet -- Asylum in the United States.\"\r\n  14 May 2018.", "U.S. Citizenship and Immigration Services.  \"Obtaining Asylum in the United States.\"\r\n  19 October 2015.", "MacGuill, Dan.  \"Attorney General Sessions Reverses Protections for Asylum Seekers Fleeing Domestic Violence, Gangs.\"\r\n  Snopes.com.  11 June 2018.", "Office of the U.S. Attorney General.  \"Interim Decision #3929 -- Matter of A-B-, Respondent.\"\r\n  U.S. Department of Justice.  11 June 2018.", "The American Civil Liberties Union.  \"Federal Lawsuit Targets Denial of Asylum Protections for Immigrants Fleeing Domestic and Gang Violence.\"\r\n  7 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]