["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Tom Nelson (left) and Republican Mike Gallagher are running to succeed Green Bay-area GOP U.S. Rep. Reid Ribble.", "The competitive race for an open congressional seat in the Green Bay area has been marked by attack ads on Social Security.", "Democrat Tom Nelson and Republican Mike Gallagher are vying in the Nov. 8, 2016 election to succeed Reid Ribble, a Republican who decided not to run for a fourth term.", "The Rothenburg and Gonzales Political Report, as well as the Cook Report, both recently shifted the race from \"toss up\" to \"leans Republican.\"", "On Sept. 1, 2016, Nelson, the Outagamie County executive, released a TV ad accusing Gallagher of having a plan that would \"cut Social Security benefits for two-thirds of seniors.\" Our rating was Half True.", "Gallagher, a former U.S. Marine and former congressional aide, has not made such a proposal. However, he has praised a proposal that would make those cuts, saying he is most influenced on Social Security by the proposal’s author.", "On Sept. 12, 2016, it was Gallagher’s turn. He released a TV ad accusing Nelson of having \"backed higher taxes on Social Security, costing Wisconsin seniors $95 million.\"", "Let’s see how this one rates.", "2005 votes", "Gallagher points to a vote that Nelson, then a member of the Wisconsin Assembly, took on the 2005-’07 state budget -- a 394-page document with thousands of figures and provisions.", "One provision in the budget, which was adopted by the Republican-controlled Legislature and signed by Democratic Gov. Jim Doyle, eliminated state income taxes on Social Security benefits.", "So, despite Gallagher’s claim, there was not a proposal for higher taxes on Social Security.", "But eliminating the tax did save Wisconsin Social Security recipients an estimated $99.7 million per year, roughly what Gallagher claimed, according to the nonpartisan Legislative Fiscal Bureau.", "Nelson voted against the budget. But does that mean he voted against the Social Security provision it contained?", "When voting on something as huge as a state budget, a lawmaker could vote no for any number of reasons having to do with spending, policies or other factors. In other words, a no vote on the overall budget doesn’t mean a lawmaker opposed every single provision, or even any particular provision.", "Nelson has said he voted no because the budget reduced funding for education.", "The budget didn’t actually reduce funding for public schools. It added $458 million over the two-year period. But the amount was less than half of the $938 million increase advocated by Doyle, the Milwaukee Journal Sentinel reported at the time.", "There’s one more point -- a significant one.", "Nelson voted for an amendment that added the repeal of the tax on Social Security benefits to the budget.  So, he was for the repeal, even though he voted against the overall state budget that ultimately accomplished the repeal.", "Gallagher’s campaign called it a \"show\" vote.  But unlike the budget, it was an up-or-down vote on a single provision and, as such, gives a clearer idea of his position.", "Our rating", "Gallagher says Nelson \"backed higher taxes on Social Security, costing Wisconsin seniors $95 million.\"", "Nelson voted against the 2005-’07 state budget, which ended the state income tax on Social Security benefits, saving seniors more than $95 million per year.", "But that’s not the same as backing higher taxes on Social Security, something that was not even on the table. And a vote against the overall state budget doesn’t mean Nelson opposed eliminating the tax on Social Security benefits. Indeed, he voted for the amendment that added that provision to the budget.", "We rate Gallagher’s statement False.", "YouTube, Mike Gallagher \"Called out\" TV ad, Sept. 12, 2016", "Email, Tom Nelson campaign spokesman Ethan Susseles, Sept. 16, 2016", "Email, Mike Gallagher campaign spokeswoman Madison Wiberg, Sept. 22, 2016", "Tom Nelson campaign, statement on \"Called out\" ad, Sept. 12, 2016", "Milwaukee Journal Sentinel, \"Nelson and Gallagher tangle on taxes, deficits,\" Sept. 17, 2016", "Waupaca County News, \"Social Security focus of race,\" Sept. 21, 2016", "Milwaukee Journal Sentinel, \"Veto of entire budget seen as unlikely Many encourage Doyle instead to make adjustments,\" July 7, 2005", "Milwaukee Journal Sentinel, \"State budget goes to Doyle Assembly approves Senate's 2-year plan,\" July 6, 2005", "Milwaukee Journal Sentinel, \"Tax bills are likely to drop by a dollar But $400 million in spending pushed past '07,\" August 17, 2005", "Wisconsin Legislative Fiscal Bureau, \"State Tax and Fee Modifications Included in 2005 Act 25,\" July 12, 2006", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]