["By Isabella Fertel", "Posted on May 18, 2020", "Viral posts suggest that COVID-19 can’t be a serious disease if it hasn’t “wiped out the homeless.” But recent reports published by the Centers for Disease Control and Prevention have found high rates of homeless residents testing positive for the novel coronavirus, known as SARS-CoV-2.", "As the total number of COVID-19 cases in the U.S. surpassed 1.4 million, including more than 89,000 deaths, in mid-May, viral memes misleadingly suggest that if COVID-19 was “so deadly,” it would have a devastating effect on the homeless population.", "One frequently shared post, which uses a photo of actor Heath Ledger in his role as the Joker, states: “IF THE CORONAVIRUS IS SO DEADLY WHY HASN’T IT WIPED OUT THE HOMELESS.” It continues: “THEY LIVE OUTSIDE THERE IS NO SOCIAL DISTANCING AND THEY CAN’T WASH THEIR HANDS.”", "One social media commenter added: “Yes the virus is real but it’s not as serious as they say it is, …”", "A similar post on Facebook reads: “Serious question: How come we are not finding tens of thousands of homeless dead people in tents?” Other versions of the post ask the same question.", "But the disease has indeed struck the homeless living on streets and in shelters throughout the U.S., and cases are likely to climb among this highly at-risk group.", "A recent report published by the nonprofit National Alliance to End Homelessness projects that the homeless population in the U.S. “will be twice as likely to be hospitalized, two to four times as likely to require critical care, and two to three times as likely to die as the general population” as a result of the pandemic.", "Actual numbers of how many homeless people have been infected or have died from COVID-19 are not known yet. “There’s an ad hoc nature to not just the response to this crisis just generally speaking, but with the data tracking,” Daniel Treglia, a co-author of the NAEH report, told us.", "“Testing has been incredibly limited, and therefore the numbers are based on how many people are symptomatic, and we know those are understatements,” said Treglia, a post-doctoral fellow at the University of Pennsylvania’s School of Social Policy and Practice.", "Reports by the Centers for Disease Control and Prevention show that the pandemic has hit residents and workers in homeless shelters.", "A CDC report on homeless shelters in four U.S. cities — Boston, Seattle, San Francisco and Atlanta — found that 25% of residents in 19 shelters tested positive for the novel coronavirus, known as SARS-CoV-2, from March 27 to April 15.", "Another CDC report on three homeless service sites in Washington state concluded that “COVID-19 was diagnosed in 35 of 195 (18%) residents and eight of 38 (21%) staff members.” That report also noted that “COVID-19 can spread quickly in homeless shelters; rapid interventions including testing and isolation to identify cases and minimize transmission are necessary.”", "News media across the country also have reported infections and coronavirus-related deaths among local homeless populations.", "With 150,000 homeless people throughout the state, California has ramped up efforts to transport homeless individuals to hotel rooms, the Associated Press reported on April 18. San Francisco experienced an outbreak at a homeless shelter where more than 100 people tested positive, including 10 staff members, according to the AP story. More than 30 homeless people tested positive for COVID-19 in Los Angeles County; six were living in a shelter, but most cases involved people living on the street.", "In Boston, about 200 homeless individuals tested positive for the virus, WBUR reported on April 6. In New York City — after a reported 460 homeless individuals tested positive and 27 had died by mid-April —  Mayor Bill de Blasio announced new protective measures to mitigate the spread of COVID-19 in the city’s homeless population, according to an ABC News story.", "In Washington state’s King County, which had 112 confirmed cases of COVID-19 among its homeless population or people working at service sites by April 20, shelters have made efforts to space out cots and sleeping areas within their facilities, the Seattle Times reported.", "CDC estimates that there are 1.4 million people living in homeless shelters each year. It is a population with the potential for widespread transmission of COVID-19 because “[h]omeless shelters are often crowded, making social distancing difficult,” and “[m]any persons experiencing homelessness are older or have underlying medical conditions, placing them at higher risk for severe COVID-19–associated illness,” the CDC said.", "According to Treglia, co-author of the NAEH report, homeless people have about twice the mortality rate as the general population. The homeless population is “at much higher risk of chronic diseases including diabetes, hypertension — things that are associated with negative outcomes in COVID-19,” he said.", "Other factors that make the homeless especially susceptible to the coronavirus include food insecurity and lack of proper nutrition, insufficient rest, difficulty complying with social distancing guidelines, and limited access to running water needed for hand washing and hygiene.", "“It is impossible for people who are sleeping on the streets or who are in shelters to stay at home,” Treglia added. “It just isn’t an option for them.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Coronavirus Resource Center. “COVID-19 Dashboard by the Center for Systems Science and Engineering.” Johns Hopkins University of Medicine. Accessed 18 May 2020.", "Silva, Karen Millhouse. “Serious question: How come we are not finding tens of thousands of homeless dead people in tents?” Facebook. 9 May 2020.", "Wagoner, Judy. “HOW COME WE ARE NOT FINDING TENS OF THOUSANDS OF HOMELESS DEAD IN TENTS?” Facebook. 8 May 2020.", "Parks, Daniel. “Serious question: How come we are not finding tens of thousands of homeless dead people in tents?” Facebook. 9 May 2020.", "Need, DB. “IF THE CORONAVIRUS IS SO DEADLY WHY HASN’T IT WIPED OUT THE HOMELESS THEY LIVE OUTSIDE THERE IS NO SOCIAL DISTANCING AND THEY CANT WASH THEIR HANDS.” Facebook. 13 May 2020.", "“Assessment of SARS-CoV-2 Infection Prevalence in Homeless Shelters — Four U.S. Cities, March 27–April 15, 2020.” Centers for Disease Control and Prevention. 1 May 2020", "“COVID-19 Outbreak Among Three Affiliated Homeless Service Sites — King County, Washington, 2020.” Centers for Disease Control and Prevention. 1 May 2020.", "Culhane, Dennis et. al. “Estimated Emergency and Observational/Quarantine Bed Need for the US Homeless Population Related to COVID-19 Exposure by County; Projected Hospitalizations, Intensive Care Units and Mortality.” National Alliance to End Homelessness. 23 Mar 2020.", "Gerda, Nick. “Homeless Deaths Are Spiking in Orange County.” Voice of OC. 12 May 2020.", "“California Struggles to Slow COVID-19 Among Homeless.” Associated Press. 18 Apr 2020.", "Katersky, Aaron and Ella Torres. “At least 27 New York City homeless, among hundreds of cases, have died from COVID-19.” ABC News. 15 Apr 2020.", "Jolicoeur, Lynn and Lisa Mullins. “Surge In Coronavirus Cases In Boston’s Homeless Population ‘More Dramatic Than We Anticipated.‘” WBUR. 6 Apr 2020.", "Homeless Research Institute. “Population At-Risk: Homelessness and the COVID-19 Crisis.” National Alliance to End Homelessness. Accessed 15 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]