["About this rating", "A meme produced by the conservative Turning Point USA organization employed problematic logic and ignorance of factual events in order to reinforce its pro-gun argument. \"If guns kill people,\" the meme asks, \"how does anyone get out of a gun show alive?\"", "If the argument is that people don't die at places with lots of guns, that's not true, as demonstrated by at least two high-profile incidents of accidental shootings, one at a gun show and another at a gun range: In 2008, an 8-year-old boy died after accidentally shooting himself in the head at a gun show in Massachusetts. In 2014, a 9-year-old girl accidentally shot and killed her instructor at a gun range in Arizona.", "In addition, a number of gun-related deaths and injuries have occurred at gun shows proper, according to numerous news reports. Among them, five people in three states were injured when weapons accidentally went off at gun shows in one day in January 2013, while a man seriously injured himself outside an Iowa gun show by accidentally shooting himself in 2018.", "A 2017 study by the University of California at Berkeley found \"a nearly 70 percent increase in deaths and injuries from firearms in California communities within convenient driving distance of Nevada gun shows.\" The state of Nevada \"has some of the least restrictive firearm laws in the country and no explicit regulations on gun shows\" whereas California \"has some of the strongest firearm laws in the country,\" per the study.", "In other words, not only are the facts behind the meme incorrect, but the logic is flawed. The meme appears to be an effort to support the gun-advocate talking point, \"Guns don't kill people, people kill people.\" The problem, however, is that gun shows are not just full of guns but also people.", "So if people kill people, then logically one must ask: What would explain the purported lack of gun deaths at gun shows that the meme asserts? Furthermore, the Berkeley study appears to show that the degree of violence associated with gun shows is dictated not by the presence of guns at those shows, but gun regulations in the states they are held in. We therefore rate this claim as \"False.\"", "McGee, Kimberly and Fernanda Santos. \"A 9-Year-Old at a Shooting Range, a Spraying Uzi and Outrage.\"\r\n  The New York Times. 27 August 2014.", "Associated Press. \"Boy, 8, Accidentally Kills Self at Gun Show.\"\r\n  27 October 2008.", "Courier Lee News Service. \"UPDATE: Man Seriously Wounded in Accidental Shooting at Davenport Gun Show.\"\r\n  5 March 2018.", "Israel, Brett. \"Study: Gun Deaths, Injuries in California Spike Following Nevada Gun Shows.\"\r\n  Berkeley News. 23 October 2017.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]