["About this rating", "Several articles and informational memes label a portion of the Alnwick Garden in Northumbria, U.K., as \"the most deadly garden in the world.\" Indeed, this is a real place fittingly named the \"Poison Garden.\" As described on the Alnwick Garden website:", "The Alnwick Garden plays host to the small but deadly Poison Garden—filled exclusively with around 100 toxic, intoxicating, and narcotic plants. The boundaries of the Poison Garden are kept behind black iron gates, only open on guided tours. Visitors are strictly prohibited from smelling, touching, or tasting any plants, although some people still occasionally faint from inhaling toxic fumes while walking in the garden.", "The Alnwick Garden, on the grounds of the Alnwick Castle, has been around in some form since 1750, when the first Duke of Northumberland, Hugh Percy, planted the grounds' original garden. It was significantly revamped beginning in 1997 by the current Duchess of Northumberland, Jane Percy. According to head gardener Trever Jones, the Duchess came up with the idea for the poison garden, which opened in 2005. \"It was the brainchild of the Duchess,\" Jones explained in a video produced by Great Big Story. \"So rather than having a herb garden, she decided to create more interest and have a poison garden.\"", "Explaining the decision on an earlier version of the garden's website, she wrote:", "I wondered why so many gardens around the world focused on the healing power of plants rather than their ability to kill. ... I felt that most children I knew would be more interested in hearing how a plant killed, how long it would take you to die if you ate it and how gruesome and painful the death might be.", "\"Every plant here in the poison garden is poisonous and has the ability to kill you,\" Jones explained, before listing off several plants as examples:", "This plant is giant hogweed: Will get up to around about eight foot high but it's photo toxic, so it will burn your skin and give you blisters for up to seven years. …", "This plant is Akhenaten, or monkshood. Wonderful blue flowers, but the whole of the plant is poisonous. The berries crushed up and fed to you will kill you. The leaves themselves will kill you also as well. …", "This plant is laurel. It produces cyanide, and we all know what that'll do to you.", "As Jones points out, many of the plants in the garden are quite common and often planted by people who are unaware of their chemical properties.  \"They're very, very common plants,\" he said. \"In fact, a lot of them are what we call crossover garden plants. And they're grown in many people's gardens, but people don't know how harmful they actually are.\" In addition to common plants that are poisonous, the garden also hosts several narcotic or hallucinogenic plants. \"The Duchess got government permission to grow plants like cannabis, opium poppies, magic mushrooms, and coca,\" the website Atlas Obscura explained.", "While we cannot speak to the claim that this is properly categorized as \"the most dangerous garden in the world,\" the Poison Garden in Northumbria is a real place, and as such its existence is factual.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]