["Several social media users have shared two pictures of Congress leader Priyanka Gandhi to expose her ‘hypocrisy’. In the first picture, she is wearing Hindu prayer beads while in the second, she is seen purportedly sporting a Christian cross.", "दादा गड गए कब्र में, मां क्रॉस लटकाए वोट पाने की चाह में बेटी गंगा नहाए pic.twitter.com/ICrsAUxF1e", "— Adv HarshVardhan Singh Nathpura (@NathpuraHarsh) February 15, 2021", "The images are massively widespread on Facebook.", "Last year, Gandhi met the family of the Hathras victim on October 3 after several confrontations with Uttar Pradesh police. Gandhi, along with her brother and Congress MP Rahul Gandhi, had sought the resignation of UP Chief Minister Yogi Adityanath over the alleged rape of a Dalit woman and the state government’s handling of the case.", "A few social media users had shared the same images of Gandhi in 2020.", "It was being claimed that the first picture was shot in Ayodhya and the other was taken in Kerala.", "This was also viral in 2019 with the claim, “जनेऊधारी दत्तात्रेय ब्राह्मण की जनेऊधारी बहन के गले मे मंगलसूत्र की जगह क्रॉस लटका हुआ है, और बोलती है मे गंगा की बेटी हूं, एक नम्बर की फर्जी चोरी करके बेल पे रहने वाली फैमिली! (Janeudhari sister of janeudhari dattatrey Brahmin sports a cross on her neck instead of mangalsutra, and she says i am the daughter of Ganga, this is a family that has looted and is out on bail.)”", "The same photograph of Priyanka Gandhi was shared two years ago implying that she is actually a Christian and is simply masquerading as a Hindu.", "जनेऊधारी दत्तात्रेय ब्राह्मण की जनेऊधारी बहन के गले मे मंगलसूत्र की जगह क्रॉस लटका हुआ है, और बोलती है मे गंगा की बेटी हूं, एक नम्बर की फर्जी चोरी करके बेल पे रहने वाली फैमिली!@priyankagandhi pic.twitter.com/jfXIHrXJZj", "— विиαу शुкℓα (@iVinayShukla_) March 29, 2019", "One of the groups where the claim was shared was WE SUPPORT NARENDRA MODI.", "The Congress leader’s photograph has been morphed. Upon reverse searching the image on Google, the original photograph can be accessed. The video posted below illustrates how the image was fact-checked.", "It has been carried by multiple media organisations including ABP News, The Statesman and Republic TV. While Republic TV has credited the photo to PTI, according to ABP News and The Statesman, the source of the image is AFP. The photograph was published by news outlets in January and February 2019 after Priyanka Gandhi had officially announced her entry into politics, taking charge of Eastern UP.", "Alt News found that the image dates back to February 2017. Posted by The National, the description below the image says, “Priyanka Gandhi arrives at a Congress party rally in Rae Bareli district on February 17, 2017, during campaigning for Uttar Pradesh state elections. Sanjay Kanojia / AFP”.", "Posted below is another image taken at the same gathering.", "It is clear from the above image that Priyanka Gandhi is wearing a pendant and not a cross. The two photos – original and photoshopped – have been juxtaposed and posted below for comparison.", "It may be reiterated that the photo of Priyanka Gandhi wearing a cross is photoshopped.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]