["About this rating", "A video purportedly showing a disturbing scene in which a group of people are being herded into and locked inside a mobile gas chamber has racked up millions of views ever since it was shared by the Facebook page ISLAM Media in May 2018:", "This video was shared with the following caption (translated via Facebook):", "اسرائیلیوں کی ایسی ظلم و ضبط مسلمانوں کے ساتھ جس کو دیکھنے کے بعد،آپ لوگوں کا ہوش اُڑ جائے گا. ہمارا مقصد صرف آپ لوگوں کو سچ دیکھانا ہے.\nویڈیو اتنا شئیر کریں کے پوری دنیا ان بیغیرتوں پر لعنت بیجے.", "This is such a gruesome cruelty and injustice of Israelites with Muslims which will blow your mind. Our sole aim is only to show you the truth.", "Share the video so much so that the whole world curses these unashamed people.", "This video clip does not document a war crime or atrocities being committed against Muslims by Israelis.  The footage was taken from a 1991 Swedish short film entitled World of Glory (Härlig är jorden), directed by Roy Andersson.", "Here's an excerpt from a blog post about the film from the website Lights in the Dusk:", "World of Glory (Härlig är jorden, 1991) -- which seems to take place in the present day, but nonetheless begins with a sequence deliberately intended to evoke the horrors of the Second World War -- may be the greatest and most penetrating comment ever made on the issues of genocide, shame and collective guilt. Expressing its ideas through incredibly simple though never simplistic static tableaux -- where the intention of scenes is to present the void-like moral decay form within the very soul of its ghostly central character (played by Klas-Gösta Olsson) -- World of Glory grabs the viewer's attention from the very first frame; establishing a particular tone of disquieting, deadpan surrealism, before eventually leading us, scene by scene and minute by minute, through the painful empty life of this enigmatic central figure, in a way that seems to underline or exaggerate the absolute vacant misery of his pitiless existence.", "In the unforgettable opening sequence, a group of officious, grey-suited spectators stand beside the rear of a monstrous diesel-fuelled truck, watching a huddled mass of naked women and children being loaded into the hold. The piercing cries of the smallest child, central to the frame, are shattering, as the small fat man to the left of frame kicks out at the boarding-ramp to hasten their ill-fated departure. As the heavy-metal doors are slammed shut, locked and bolted, muting but failing to drown out the horrible screams from within, one of the spectators, a thin man with a sinister moustache, turns to face the camera.", "At this moment, as the large, industrial hose is led from the exhaust to the small vent at the back of the truck, the audience is being explicitly acknowledged -- worse, implicated -- in these events, but can only experience the unfolding massacre, hopeless and removed.", "The viral video clip comes from the opening scene of this 15-minute film. World of Glory can be viewed in its entirety below. [NSFW Warning: The film contains nudity and violence]", "Although this footage depicts a fictional event, similar mobile gas chambers were truly used for extermination purposes by Nazis after the German invasion of the Soviet Union during World War II:", "After the June 1941 German invasion of the Soviet Union and Einsatzgruppe mass shootings of civilians, the Nazis experimented with gas vans for mass killing. Gas vans were hermetically sealed trucks with engine exhaust diverted to the interior compartment. Use of gas vans began after Einsatzgruppe members complained of battle fatigue and mental anguish caused by shooting large numbers of women and children. Gassing also proved to be less costly. Einsatzgruppen gassed hundreds of thousands of people, mostly Jews, Roma (Gypsies), and mentally ill people.", "Lights in the Dusk.   \"World of Glory.\"\r\n    10 September 2010.", "United States Holocaust Memorial Museum.   \"Gassing Operations.\"\r\n    Retrieved 10 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]