["A fake news story used this photo of Colgate toothpaste and told consumers to get rid of it, but the U.S. Food and Drug Administration's rule about an ingredient did not apply to the toothpaste.", "A headline warns consumers about triclosan, an ingredient in some consumer products: \"If you are using this toothpaste .... throw it away immediately!\"", "Facebook users flagged the Nov. 28 story on Shared This as being potentially fabricated, as part of the social network’s efforts to combat fake news.", "The article could leave readers with an inaccurate picture about actions the U.S. Food and Drug Administration took with respect to triclosan, but it also contains some factual information.", "Shared This wrote that the FDA issued a warning \"this week\" that it will ban triclosan, a common antibacterial agent used in soaps, detergents, toys, cosmetics, and toothpaste.", "\"Apparently, the chemical poses a high-degree of health risks and side effects. Colgate Total is just one of many products that list triclosan as an active ingredient,\" wrote Shared This.", "The website included an image of the word \"recall\" and a photo of Colgate toothpaste showing that it contains triclosan. That could give readers the false impression that the FDA banned triclosan in toothpaste -- and that’s not the case.", "Here’s what actually happened: Natural Resources Defense Council filed a lawsuit in an effort to force the FDA to take action related to triclosan.", "In September 2016 the FDA issued a new rule banning the use of triclosan in antibacterial soaps.", "\"That rule was specific to consumer hand washes,\" Sandy Walsh, a spokeswoman for the F.D.A. told PolitiFact. That means the ban doesn’t apply to toothpaste.", "Colgate Total Toothpaste was approved in 1997 as a toothpaste containing fluoride and triclosan, which was shown to be effective in reducing plaque and gingivitis.", "\"Based on the scientific evidence, the balance of benefit and risk has been shown to be favorable for this product,\" Walsh said.", "The New York Times reported in September 2016 that triclosan remained in toothpaste because Colgate Total convinced the FDA that the benefit of triclosan outweighed the risks. Colgate Total is the only toothpaste in the United States that contains triclosan.", "A spokesman for Colgate-Palmolive, Thomas DiPiazza, told the New York Times that Colgate’s product had a far more rigorous safety review than other toothpastes.", "When the company sought approval to use triclosan in 1997, it conducted a comprehensive evaluation of human safety. The original FDA submission for Colgate Total included more than 100 toxicology studies.", "DiPiazza directed PolitiFact to a statement on Colgate’s website which cited a 2013 review of 30 studies by Cochrane Oral Health Group. The review concluded that there were benefits including reduction in plaque, gingivitis and bleeding gums in using a triclosan/copolymer fluoride toothpaste when compared with one without the ingredient.", "\"There was no evidence of any harmful effects associated with the use of triclosan/copolymer toothpastes in studies up to three years in length,\" Cochrane reported.", "But a debate about triclosan has continued.", "Several months after the FDA’s September 2016 rule was published, an article by 200 scientists and medical professionals published by Environmental Health Perspectives raised multiple concerns about triclosan.", "The authors concluded that the ingredient has detrimental effects on aquatic organisms, overuse may contribute to antibiotic/antimicrobial resistance, and that potential implications for human reproduction and development merit further study.", "The authors recommended that people avoid the use of triclosan except if there is an \"evidence based health benefit (e.g., physician-prescribed toothpaste for treating gum disease) and there is adequate evidence demonstrating they are safe.\"", "Colgate-Palmolive and the FDA however continue to stand by the use of triclosan in Colgate Total toothpaste.", "\"It has been approved as safe and effective through the U.S. FDA rigorous New Drug Application process,\" DiPiazza said.", "Shared This is a website that posts articles about health, beauty, news and other topics. We sent a message to the website on Facebook and did not get a reply.", "Our ruling", "Shared This stated that the FDA issued a ban on triclosan, which is an ingredient in soap, toothpaste and other products. The article included photos of Colgate toothpaste and uses an image of the word \"recall.\"", "In reality the FDA’s ban in September 2016 only applied to antibacterial soaps and not Colgate Total toothpaste.", "We rate this statement False.", "Shared This, \"If You Are Using This Toothpaste… Throw It Away Immediately!\" Nov. 28, 2017", "U.S. Food and Drug Administration, \"5 Things to Know About Triclosan,\" Sept. 2, 2016", "Federal Register, \"Safety and Effectiveness of Consumer Antiseptics; Topical Antimicrobial Drug Products for Over-the-Counter Human Use,\" Sept. 6, 2016", "Colgate-Palmolive, \"Colgate Total toothpaste with Triclosan: The Trusted Choice of Dentists,\" August 2017", "New York Times, \"Why a Chemical Banned From Your Soap Is Still in Your Toothpaste,\" Sept. 8, 2016", "Consumer Reports, \"Why Is Triclosan in Toothpaste?\" Nov. 20, 2017", "Cochrane Oral Health Group, \"Triclosan/copolymer containing toothpastes for oral health,\" Dec. 5, 2013", "Environmental Health Perspectives, \"The Florence Statement on Triclosan and Triclocarban,\" 2017", "Washington Post, \"Scientists call for new restrictions on microbials in personal-care products,\" June 21, 2017", "Florida Today, \"Scientists: Common chemicals can harm,\" June 21, 2017", "American Dental Association, Oral health topics, Accessed Dec. 11, 2017", "National Resources Defense Council, \"The Dirt on Antibacterial Soaps,\" March 15, 2016", "National Resources Defense Council, \"What the Triclosan Victory Means and Doesn't Mean,\" Sept. 6, 2016", "Associated Press, \"Not real news: A look at what didn't happen this week,\" July 28, 2017", "Interview, Sandy Walsh, U.S. Food and Drug administration spokeswoman, Dec. 11, 2017", "Interview, Thomas DiPiazza, Colgate-Palmolive spokesman, Dec. 11, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]