["The claims have been shared more than 40,000 times on Facebook in countries including Australia, India and South Africa.", "“Corona virus (sic) arrives in any country, sooner or later...so please use as much as possible of natural vitamin C to strengthen your immune system,” the post reads.", "“Slices of lemon in a cup of lukewarm water can save your life”.", "Many Facebook users commented on the posts, expressing gratitude for the “life-saving advice”.", "More than 4,600 people have died from the novel coronavirus disease, or COVID-19, with most cases in China.", "Similar claims have been circulating in French, Spanish and Portuguese.", "Contacted by AFP, Henry Chenal, director of the Integrated Bioclinical Research Centre (CIRBA) in Abidjan, Ivory Coast said that consuming a high amount of vitamin C “has never proved effective against coronavirus”.", "“Kiwis actually provide more vitamin C than lemons, so if this theory was correct, lemons wouldn’t be the fruit to consume,” the said.", "The World Health Organization’s recommendations include washing hands regularly and thoroughly, coughing and sneezing into a disposable tissue, and staying at home if you feel unwell.", "Some posts incorrectly claim that drinking water and lemon can fight not just COVID-19, but also cancer.", "“Hot lemon can kill cancer cells!” reads a post on the Facebook page of a “health coach” in Ghana with more than 60,000 followers.", "The post recommends drinking hot water with a lemon “cut into three parts” in order to “release the anticancer medicine”.", "Health organisations say there is little evidence to support alternative or herbal cancer treatments, and warn they can cause harmful side effects.", "Contacted by AFP, Nicolas Boisel, a hematologist at Saint-Louis hospital in Paris, said there was “no proof” that drinking hot water and lemon could cure cancer.", "“Derivatives of lemon, like many other plants, have been shown to exhibit anti-cancer activity. That probably explains the confusion,” he said.", "The posts attribute the false claims to “Laila Ahmadi from China, Faculty of Medical Sciences, Zanjan University”.", "While there is no such university in China, a Google search revealed a “Leila Ahmadi” working at the department of midwifery at Zanjan University of Medical Sciences in Iran.", "According to the university's website, Ahmadi is a lecturer and holds a master’s degree in midwifery. AFP contacted her but has not yet received a reply.", "Posts also mention a “Professor Chen Horin, CEO of the Beijing Military Hospital”, who says that that drinking lemon and warm water “can save your life”. AFP found no trace of the professor.", "The posts also claim that the coronavirus disease “appears to be caused by the fusion of the gene into a snake and a bat”.", "The novel coronavirus is thought to have come from bats, but researchers think it might have spread to humans via another animal.", "Chinese health officials have said the virus likely emerged from a market in the central city of Wuhan that sold wild animals as food.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]