["About this rating", "On Aug. 7, 2019, U.S. President Donald Trump traveled to hospitals in El Paso, Texas, and Dayton, Ohio, to visit with patients who had been injured in two mass shootings that had taken place a few days prior. Photographs of these visits started to make their way around the internet about the same time a few news outlets published reports that some of the victims were unwilling to meet with the president. This may have led some people to believe that Trump had staged these photographs using \"crisis actors.\"", "One photograph in particular, which showed Trump standing next to a young woman in a hospital bed, was widely shared on Twitter with the claim that it showed \"Emma Breier,\" the daughter of American diplomat Kimberly Breier, and that the latter was merely posing as a victim:", "This claim is not based on medical records or firsthand reporting, and it did not originate with credible sources. The claim hinges almost entirely on the notion that these two people bear a passing resemblance to one another, and was apparently prompted by reports that no children were injured in the shooting. However, the assumption that the patient shown with the Trumps is the same age as Emma Breier (much less the same person) is based solely on appearances. Although the hospital wouldn't divulge personal details about the patients, a representative did confirm to Snopes that all the survivors treated there in the wake of the massacre were adults.", "The image on the left of the above-displayed meme was uploaded to the White House's official Flickr account on Aug. 7, along with several of other images from Trump's visit to the Miami Valley Hospital in Dayton. It was accompanied by the following caption: \"President Donald J. Trump and First Lady Melania Trump meet with survivors, families, hospital staff, and first responders, Wednesday, August 7, 2019, at Miami Valley Hospital in Dayton, Ohio. (Official White House Photo by Andrea Hanks).\"", "The image on the right was posted to Twitter by Ivanka Trump along with a message thanking Kim Breier for her service. Breier recently announced that she was resigning from her position as assistant secretary of state for Western hemisphere affairs:", "Thank you @WHAAsstSecty Kim Breier for your friendship and great service. While Jared and I will miss working with you, we are happy that Emma will now get to see more of the mom she is so proud of! pic.twitter.com/7j8I6Kh5MT", "— Ivanka Trump (@IvankaTrump) August 8, 2019", "While these two individuals may look similar at first glance, that is hardly evidence that they are the same person. A closer look reveals several notable differences. For one, the young woman who was injured during the Dayton shooting has brown hair (see below-right), compared to Breier's black hair (below-left). The shooting victim also has attached earlobes, whereas Breier's are free. Some notable differences in facial structure are also apparent, such as the shape of their noses, chins, and eyes:", "We should also note that this woman was not the only mass-shooting survivor that Trump met with in Dayton. While some victims in El Paso were unwilling to meet with Trump — the El Paso shooting is being investigated as an act of domestic terrorism and possible hate crime and many critics have connected it to Trump's incendiary anti-immigration rhetoric — that didn't seem to be as much of an issue in Dayton. Trump visited with a few other victims at the Miami Valley Hospital.", "In other words, it wouldn't make much sense (even by conspiracy-theory standards) to stage one photograph with a \"crisis actor\" while Trump was photographed with several other real victims:", "Given the information available, we rate this claim \"False.\"", "BBC.   \"Texas Walmart Shooting: El Paso Attack 'Domestic Terrorism.'\"\r\n    5 August 2019.", "Koerner, Claudia. .   \"Injured Victims At An El Paso Hospital Refused To Meet Trump During His Visit.\"\r\n    Buzzfeed News.   8 August 2019.", "Williams, Abigail.   \"Top U.S. diplomat for Western Hemisphere, Kimberly Breier, to Step Down.\"\r\n    NBC News.   8 August 2019.", "Updated with additional information from the hospital regarding the ages of treated survivors.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]