["“Breaking: Israel nukes Beirut,” says an image in an August 4, 2020 Facebook post.", "The image appears to be a screenshot of a headline from the “Veterans Today” website, which advertises itself as “Serving the Clandestine Community.”", "Other claims that the Beirut blast was nuclear appear on Facebook here, here and here, Instagram here and here, and Twitter here.", "The August 4 explosion at Beirut’s port was devastating, killing more than 150 people and leaving thousands wounded. But it was not nuclear.", "Lebanon’s Prime Minister Hassan Diab said 2,750 tons of the agricultural fertilizer ammonium nitrate that had been stored for years in a portside warehouse exploded, sparking “a disaster in every sense of the word.”", "US President Donald Trump said on August 5 that the explosion may have been an accident, after earlier claiming US generals had told him it appeared to have been caused by a “bomb of some kind.”", "And US Defense Secretary Mark Esper said that “most believe that it was an accident as reported.”", "Lebanon’s President Michel Aoun said on August 7 that the explosion was due to “either negligence or foreign interference through a missile or bomb,” though he made no mention of a possible nuclear blast.", "Some posts claim that “Jeff Smith of the IAEA confirms this is a nuclear explosion.” A person by that name has also been tied to unsubstantiated claims of a possible nuclear blast in Yemen.", "But International Atomic Energy Agency spokesman Fredrik Dahl told AFP by email: “The IAEA has made no such statements.”", "Experts meanwhile said evidence does not indicate that the Beirut explosion was nuclear.", "“It doesn’t look anything like a nuclear explosion,” Jeffrey Lewis, a nonproliferation expert at the Middlebury Institute of International Studies at Monterey, told AFP by phone.", "“If this were a nuclear explosion, there would have been a bright flash of light, which there wasn’t,” and “generally speaking, nuclear explosions are much, much, much larger than this,” he said.", "Lewis also noted that the reddish-brown color of the cloud that rose over Beirut following the blast is “very typical of ammonium nitrate.”", "“There’s nothing about it that looked nuclear, and a lot of things about it that looked like an ammonium nitrate explosion.”", "Vipin Narang, an associate professor of political science at MIT who specializes in nuclear weapons and proliferation, agreed.", "“It was an intense blast, and it is a tragedy for the people of Beirut. But it was not nuclear,” Narang told AFP by email.", "There was “no double flash. The double flash is the characteristically unique feature of a nuclear detonation: an intense flash of light which dims as the shockwave obscures the fireball, but then brightens as the shockwave dissipates,” he said.", "Additionally, “nuclear mushroom clouds are not red,” as was the cloud in Beirut.", "The explosion comes during the collapse of Lebanon’s economy -- yet another problem with which the crisis-hit country now has to contend.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]