["The claim was published in this Facebook post on November 11, 2020.", "Alongside a photo of Leni Robredo, the post states: “The Supreme Court (SC) warned Vice-President Leni Robredo to immediately stop from publicly discussing the election protest of former senator Bongbong Marcos. / According to the the (sic) SC Public Information Office, ‘any more violation of this order will be dealt with severely.’”", "Former senator Bongbong Marcos filed a poll dispute after losing to Robredo in the 2016 vice presidential race in the Philippines.", "A similar claim was also shared in Facebook posts here and here.", "The claim, however, is misleading.", "The Supreme Court in fact issued a warning directed at both the Robredo and Marcos camps, not just Robredo alone.", "The court issuance, published November 10, 2020 here in the court’s official website, states in part: “The Presidential Electoral Tribunal ('Tribunal') again warns the parties in PET Case No. 005 (Marcos, Jr. v. Robredo) to strictly observe the sub judice rule pursuant to its earlier resolutions.", "“In view of the recent appearances and statements of the parties, their counsels and their agents in various media outlets including print, broadcast and social media, the Presidential Electoral Tribunal reiterates its Resolutions dated February 13, 2018 and March 20, 2018 directing the parties to strictly observe the sub judice rule. These are not the proper venues to litigate their case. The parties, their counsels and their agents are STERNLY WARNED that any more violation of this order shall be dealt with more severely.”", "A “sub judice” case refers to a case that is currently being studied in court, meaning it contains details that cannot be discussed in the media, according to this definition from the Cambridge dictionary.", "Multiple news organisations accurately reported on the Supreme Court warning, for example CNN Philippines here, ABS-CBN here and the Philippine Daily Inquirer here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]