["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "More than 387,800 people worldwide have died from COVID-19, according to Johns Hopkins University, which is tracking cases of the disease worldwide.", "An image of one person easily carrying a makeshift body bag doesn’t change that.", "In the foreground of that photo, shared in a Facebook post, more than a dozen such body bags line the ground, adorned with a wreath, a teddy bear and photos in what looks like a memorial.", "\"She’s just casually carrying a body with 1 hand..?\" reads the caption on the post. \"Sure.. More evidence of coronavirus being a complete hoax with props & street theater.. Everything you see on TV is a psyop to control your behavior and thinking.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The body bags look fake because they are. The photo, taken by European Pressphoto Agency photographer Cristobal Herrera on May 27 in the Torch of Friendship Park in Miami, shows a \"symbolic funeral procession to protest against the economy reopening without coronavirus relief\" in the city,\" according to the original caption from the photo service.", "The caption for another image from that event taken by an AFP photographer says that protesters set up bags representing dead bodies during a funeral procession demonstration.", "\"NewFM held the protest to honor the lives lost in the coronavirus pandemic and hold Florida Governor Ron DeSantis and US President Donald Trump accountable for their inaction and recklessness,\" according to AFP.", "We rate this Facebook post False.", "Facebook post, June 3, 2020", "John Hopkins University, COVID-19 dashboard, visited June 4, 2020", "European Pressphoto Agency, Symbolic funeral procession photo, May 27, 2020", "AFP, Virus protest photo, May 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]