["President Donald Trump speaks during a meeting with Democratic leaders the Oval Office of the White House, Tuesday, Dec. 11, 2018, in Washington. (AP)", "Lawmakers don’t want to be blamed for the partial federal government shutdown, which is now the longest in American history.", "So, after President Donald Trump’s speech Jan. 8, some Republicans took aim at Democrats Nancy Pelosi and Chuck Schumer for withholding support for Trump’s plan. U.S. Rep. Richard Hudson, a Republican from Concord, was among those critics.", "\"Just last week, Democrats voted to give $54 billion in foreign aid. All @POTUS@realDonaldTrump is asking for is 10 cents of every dollar they want to give to foreign governments to go to secure our border and build a wall. Is that too much to ask?\" Hudson tweeted after Trump’s speech.", "According to the White House website, Trump \"has requested $5.7 billion for construction of approximately 234 miles of new steel barrier on the Southern Border, a $4.1 billion increase over the Senate bill.\"", "To be clear: Experts, even right-leaning ones, agree that neither Trump’s request nor a wall would be enough by itself to secure the border. (Taxpayers for Common Sense, a nonpartisan watchdog organization, called the wall a \"waste\" and The Cato Institute, a libertarian think tank, last year said the wall \"won’t work.\")", "But let’s set that aside and look solely at Hudson’s math and his characterization of the bill the Democrat-controlled U.S. House passed on Jan. 3. Hudson’s tweet mischaracterizes both what it pays for and who has supported it.", "Not quite $54B in aid", "Generally speaking, estimates on foreign aid spending sometimes vary depending on which agencies and funds are considered, according to the Council on Foreign Relations. For instance, the council estimates aid at more than $40 billion per year, and The Economist reports that foreign aid levels remained at $35 billion for 2017 and 2018.", "As it relates to the bill in question – HR 21, which has passed the House but hasn’t come up for a vote in the Senate – FactCheck.org and the Washington Post noted that the $54 billion includes more than foreign aid. It also includes $16 billion for the State Department, they reported.", "The State Department operations budget typically includes a range of items, from embassy security to Secretary of State Mike Pompeo’s salary, said Stephen Ellis, vice president of Taxpayers for Common Sense. So it \"would be wrong\" to conflate department funding with foreign aid funding, Ellis told PolitiFact in an email.", "Hudson spokesman Tatum Gibson acknowledged that State Department funding was included in the number the congressman cited, but didn’t explain why.", "\"The point is Democrats voted for tens of billions of dollars for that – roughly $12 billion more than what the president requested – but won’t support President Trump’s requested $5 billion to secure our own borders,\" Gibson said.", "If we subtract the $16 billion for the state department from Hudson’s claim, that leaves us with $38 billion in foreign aid spending. Trump’s $5.7 billion request is about 15 percent of that.", "Not exactly Democrats' idea", "Now to the origins of the $54 billion spending plan. It’s misleading to cast the spending plan as a Democratic proposal.", "Spending at the same level was first proposed when Republicans controlled the House, as both FactCheck.org and the Washington Post included in their stories.", "In June, the House Committee on Appropriations approved a $54 billion State and Foreign Operations bill. And in July, the Senate Committee on Appropriations approved a similar $54.4 billion budget.", "Our ruling", "Hudson said \"Democrats voted to give $54 billion in foreign aid,\" and that Trump is asking for \"10 cents of every dollar they want to give to foreign governments to go to secure our border and build a wall.\"", "Hudson has a point that Trump’s $5.7 billion request is far less than the amount spent on foreign aid. But he incorrectly included standard State Department funding in his claim about foreign aid funds. More importantly, his tweet misleads by giving the impression that the spending plan was Democrats’ idea. We rate his claim Mostly False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "A tweet by Congressman Richard Hudson, a Republican from North Carolina, posted Jan. 8, 2019.", "Email correspondence with Tatum Gibson, spokesman for Congressman Richard Hudson.", "Story by USA Today, \"House OK's spending bills to reopen government, but shutdown expected to continue,\" published Jan. 3, 2019.", "Fact sheet distributed by the White House, \"President Donald J. Trump Calls on Congress to Secure our Borders and Protect the American People,\" published Jan. 8, 2019.", "Story by the Cato Institute, \"Why the wall won’t work,\" published in May 2017.", "Story by Taxpayers for Common Sense, \"Building a wall of waste,\" published Jan. 26, 2017.", "Story by FactCheck.org, \"RNC Misleads on ‘Immoral’ Democratic Bill,\" published Jan. 7, 2019.", "Story by the Washington Post, \"Fact-checking Trump’s freewheeling Cabinet session,\" published Jan. 4, 2019.\nPress release by the U.S. House of Representatives Committee on Appropriations, \"Appropriations Committee Approves Fiscal Year 2019 State and Foreign Operations Bill,\" published June 20, 2018.", "Press release by the U.S. Senate Committee on Appropriations, \"FY2019 State & Foreign Operations Appropriations Bill Cleared by Senate Committee,\" published June 21, 2018.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]