["On the occasion of Mahashivratri, BJP IT cell head Amit Malviya tweeted (archive link) an image of a temple decorated with colourful lights and wrote, “After decades of darkness, Shankaracharya Temple in Srinagar lit up for #MahaShivaratri…” Since February 21, this has been retweeted over 2,400 times and liked more than 10,000 times.", "BJP member Kapil Mishra tweeted (archive link) the viral image and made the same claim in Hindi. Mishra’s tweet was retweeted close to 6,000 times and liked by over 25,000 users. Similarly, IAS officer Sanjay Dixit also tweeted (archive link) the viral image. The tweet was retweeted over 2,000 times. In the past, Alt News has reported on misinformation circulated by Dixit.", "The viral image and the claim that Maha Shivratri is being celebrated in Srinagar after decades was also tweeted by News Nation consulting editor Deepak Chaurasia (archive link). BJP member and former Member of Parliament Hari Manjhi (archive link) and BJP media panellist O P Mishra (archive link). Similarly, BJP member and former Jharkhand CM Raghubar Das (archive link) quote-tweeted ANI’s video and alleged the same.", "Similarly, several users posted the viral image on Twitter.", "Shankaracharya Temple is lit every year on Maha Shivratri", "Alt News spoke with Dr Karan Singh, chairman of the Dharmarth Trust. This trust manages all the major Hindu shrines in Jammu and Kashmir. Singh said, “The Shankaracharya Temple has invariably been lit up for Maha Shivratri and not a single year has ever been missed. Perhaps this year the illumination received special attention from the media due to the restructuring of the J&K State.”", "Karan Singh’s son, Vikramaditya, also a former member of J&K legislative council, quote-tweeted Mishra and said, “A disclaimer for all: J&K Dharmarth Trust has been celebrating Maha Shivratri for several decades at Shankaracharya Mandir, Srinagar. The lighting & decorations are done by the Trust every year and all claims of 30 years of darkness at this historic Temple are False.”", "A disclaimer for all: J&K Dharmarth Trust has been celebrating Maha Shivratri for several decades at Shankaracharya Mandir, Srinagar. The lighting & decorations are done by the Trust every year and all claims of 30 years of darkness at this historic Temple are False. https://t.co/kyecfvKCec", "— Vikramaditya Singh (@vikramaditya_JK) February 22, 2020", "Alt News spoke with Srinagar-based Sanjay Tickoo, president of the Kashmiri Pandit Sangarash Samiti (KPSS). According to him, this was neither the first time Maha Shivratri was celebrated in decades nor was it the only instance when Shankaracharya Temple was decorated with lights. Tickoo said, “It seems like certain political leaders are trying to create a perception in the nation that Maha Shivratri hasn’t been celebrated in Srinagar and it’s because of them these changes are taking place. This is simply not true.”", "“Indeed this year the temple had more lights but to suggest that Shankaracharya Temple was not lit-up for decades during Maha Shivaratri is false. Another festival which is celebrated with enthusiasm is Raksha Bandhan,” said Tickoo. Alt News found another picture of Shankaracharya Temple on Getty Images from 2012 Raksha Bandhan. In the picture below, the lights on the temple are clearly visible.", "Tickoo also pointed out that typically around Maha Shivaratri, visibility of the temple is affected due to cloud cover and rain. “Even this year there was a slight drizzle on the eve of Maha Shivratri,” he said.", "Alt News performed a keyword search on Reuters Pictures and found an image of Shankaracharya Temple from 2005 Maha Shivratri. The picture was clicked in daylight, however, the light strips are clearly visible after 2x digital zoom – as pointed out by the red arrows in the screenshot attached below.", "Visuals of Shankaracharya Temple from 2020 Maha Shivratri", "Alt News performed a keyword search on YouTube and found a video by Daily Excelsior, a Jammu-based media outlet. In the video, uploaded on February 21, lights on the Shankaracharya Temple can be seen.", "Alt News reached out to Imran Nissar, a Srinagar-based freelance photo-journalist. He covered this year’s Maha Shivratri. The photo attached below shows a close up of the light decorations. “I have been in Srinagar for the past ten years. Since the past 15 years, the Shankaracharya Temple is lit up during Maha Shivratri and other festivals. It wasn’t something new for me,” said Nissar.", "Analysing the EXIF data of the photo clicked by Nissar, Alt News can confirm it was clicked on February 21 at 8:47 am.", "Why aren’t there more pictures of Shankaracharya Temple?", "Shankaracharya Temple, also known as Jyesteshwara temple, stands at height of 1,000 feet (300 m) on the Zabarwan Range in Srinagar. Born and brought up in Srinagar, Sagar Kaul, founder of fact-checking website Metafact, said, “This is one of the high vantage points within the city. As a result, it is a high-security zone with permanent security camp based there throughout the year.” According to Kaul, visitors are not allowed to carry a smartphone or camera to the temple. Photography is strictly prohibited at the temple premises.", "The picture of Shankaracharya Temple on Wikipedia was uploaded by Divya Gupta, a freelance photographer, in 2013. Alt News spoke with Gupta who said, “I clicked this picture after getting permission from the authorities.”", "A 2005 picture (below) of the temple available on Reuters Pictures is described as – “Indian soldier holds a rifle as Kashmiri Hindus wait in line to pray on the occasion of Hindu festival Maha Shivratri in Srinagar.”", "After comparing several images of Shankaracharya Temple shot across the years, it is evident that more lights were used this year to decorate the temple on Maha Shivratri. However, the claim made by BJP office-bearers that the temple was lit after decades is misleading and false. As per Dharmarth Trust, the organisation that manages all the major Hindu shrines in Jammu and Kashmir, and several other individuals in Srinagar, Maha Shivratri is celebrated each year at Shankaracharya Temple.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]