["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Feb. 20, 2017 traditional Russian wooden dolls depicting U.S. President Donald Trump and Russian President Vladimir Putin are displayed for sale at a souvenir shop in St.Petersburg, Russia. (AP Photo/Dmitri Lovetsky)", "Sen. Richard Burr, a North Carolina Republican, is leading a congressional investigation into the Russian intervention to help Donald Trump win the 2016 presidential election.", "And he says this scandal isn’t unique to Trump.", "\"This is not the first time they’ve been involved in our elections,\" Burr said earlier this month.", "Burr is chairman of the Senate Intelligence Committee, which recently has hosted public, under-oath testimony of some of the Trump administration’s top officials regarding Russian election meddling.", "Trump, for his part, has repeatedly called allegations of Russian meddling a fictional \"witch-hunt\" against him, and Russian President Vladimir Putin also denies any interference.", "Yet the U.S. intelligence community says the Russian government did try to interfere in the 2016 presidential election. Independent observers agree, as do members of Congress including Burr.", "In a claim we fact-checked previously, Burr said his committee’s investigation into the Trump campaign and Russia has led to more transparency than usual. We rated that True.", "Now, we turn our attention to this claim that last year’s meddling wasn’t anything new.", "Here’s the full context. A reporter asked Burr what his reaction was to Putin's denial of Russian election meddling. Burr responded:", "\"That there is no truth to Vladimir Putin’s words. That by every judgment to this point, they were aggressively involved in the U.S. elections, Montenegro, France, they are involved in the German upcoming elections. And that this is not the first time they’ve been involved in our elections, and that America needs to have a much more definitive response to them.\"", "Most of what Burr mentioned has been widely covered already. But not the last part. So we started digging.", "Close but no cigar", "Historians agree that what Burr said probably isn’t literally true.", "This is the first time (at least as far as the public knows) that Russia attempted to influence a U.S. election in favor of a particular candidate. However, it is a throwback of sorts to the Cold War.", "\"If by ‘they,’ he meant the Russians, he's incorrect,\" said Mark Kramer, an expert on foreign relations at Harvard University. \"But if he meant the Soviet Union, then it is certainly true.\"", "And of course, there might be more out there that’s still classified or hasn’t yet been discovered.", "\"Now who knows if Russia didn’t somehow fund one candidate or another,\" said Frank Costigliola, a history professor at the University of Connecticut. \"But it’s unknown.\"", "We asked six historians and foreign relations scholars to consider Burr’s claim. Two said they had no idea what he was talking about. The others pointed to a handful of documented (yet relatively unknown) meddling efforts by Soviet leaders. None could identify any Russian meddling attempts.", "We also asked Burr what he meant. His office pointed us to an intelligence report, published in January, that concluded the Kremlin tried to help Trump and hurt his opponent, Democrat Hillary Clinton.", "Spy games", "That report is \"a declassified version of a highly classified assessment\" made using CIA, FBI and NSA intelligence. It said the 2016 Russian meddling was the \"boldest yet\" in a U.S. election.", "It said with \"high confidence\" that Russia was behind the hack and publication of embarrassing emails from the Democratic National Committee, that it hacked into U.S. voting software, and that the Kremlin funded a large pro-Trump, anti-Clinton campaign in the United States using paid social media \"trolls\" as well as more traditional propaganda outlets.", "The report didn’t completely back up Burr’s claim. It said the Russians have spied on U.S. presidential candidates before, and have used state-owned propaganda outlets like RT and RT America to cast doubts on the U.S. democratic process. But it listed no previous attempts to actually influence the outcome of an election.", "In fact, the report said the 2016 meddling \"demonstrated a significant escalation in directness, level of activity, and scope of effort compared to previous operations.\"", "And while this report made only vague references to Soviet meddling, our interviews uncovered a few instances of Cold War-era attempts to either boost one candidate or harm another.", "Over the course of 11 presidential elections between the end of World War II and the fall of the Soviet Union, we identified three secret attempts to influence an election.", "• 1960: Through his ambassador to the United States, Mikhail Menshikov, Soviet Premier Nikita Khrushchev offered Adlai Stevenson help from a secret propaganda campaign. However, Stevenson declined the offer. He lost in the Democratic primary to John F. Kennedy.", "• 1968: The Soviet Union’s ambassador to the U.S., Anatoly Dobrynin, offered to secretly fund Hubert Humphrey’s campaign against Richard Nixon. Humphrey declined the bribe.", "• 1976: Fearing that anti-communist Democrat Henry \"Scoop\" Jackson stood a good chance at winning in the wake of Nixon’s resignation, the KGB began a smear campaign. Soviet spies forged FBI paperwork to make it appear Jackson was secretly gay and sent the fake reports to newspapers around the United States during the election and for years after.", "Notably, the past attempts to help a candidate were arranged through the ambassador. And much of the investigation into last year has focused on meetings the current Russian ambassador to the U.S., Sergey Kislyak, had with key officials on Trump’s team before Trump became president.", "Some of those meetings allegedly involved former National Security Advisor Michael Flynn (who in 2015 took $45,000 from RT), Attorney General Jeff Sessions (who was a top Trump advisor during the campaign) and Jared Kushner, Trump’s senior advisor and son-in-law.", "Our ruling", "Burr said that when it comes to Russian spies, \"this is not the first time they’ve been involved in our elections.\"", "There’s no public evidence the post-Cold War Russian government has ever meddled at anywhere near the levels of 2016, when U.S. officials say the Kremlin tried to help Trump’s campaign.", "However, during the Cold War there were a few Soviet attempts to hurt or help specific candidates. Yet 2016 was the first time in 40 years the United States is known to have seen this type of interference.", "Since Burr’s claim has some truth to it but gives an impression that’s slightly misleading, we rate this claim Half True.", "Office of the Director of National Intelligence, Jan. 6, 2017 report, \"Background to 'Assessing Russian Activities and Intentions in Recent US Elections': The Analytic Process and Cyber Incident Attribution\"", "PolitiFact, Feb. 22, 2017, \"The possible ties between Trump and Russia, explained\"", "Email interview with Frank Costigliola, University of Connecticut professor, expert on 20th century U.S. foreign relations", "Email interview with Mark Kramer, Director of the Project on Cold War Studies at the  Davis Center for Russian and Eurasian Studies at Harvard University", "Email interview with William Hitchcock, University of Virginia history professor and Pulitzer Prize finalist", "Email interview with Nicole Hemmer, expert on the history of American politics at the Presidential Recordings program at the University of Virginia, and co-host of the podcast Past Present", "Smithsonian Magazine, Jan. 4, 2017, \"How Adlai Stevenson Stopped Russian Interference in the 1960 Election\"", "WBUR, Jan. 10, 2017, \"The Deep Soviet Roots Of The Russian Election-Hacking Campaign\"", "The New York Times, \"Secrets From the Lubyanka,\" book review of The Sword And The Shield, Oct. 31, 1999", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]