["About this rating", "When he lived in the French town of Ussy-sur-Marne in the 1950s, Beckett was one of several adults who sometimes drove local children to school, including André and his siblings.", "Beckett did not exclusively give rides to André,  private rides were not necessary for André because he had grown too big for the local school bus, and Beckett did not form a special bond with André.", "It's a story that is impossible not to love. A young man living in a French farming village in the 1950s undergoes an extraordinary growth spurt and becomes too ungainly to ride the bus to school. A neighbor with a convertible automobile steps in to help. The adult and the young man strike up an unlikely friendship on their morning car journeys, discussing the game of cricket and other subjects as they form a special bond with each other.", "The older man with the car? He was Samuel Beckett, the Irish playwright and author of Waiting for Godot, who would go on to win the Nobel Prize for Literature in 1969. The boy? André Roussimoff, who would eventually grow to a height of more than seven feet and become famous as André the Giant, a global superstar and icon in the world professional wrestling.", "It's one of pop culture's most bizarre and cherished \"chance encounter\" tales. But is it true?", "The story, in its rudiments, has been around for years, but it has most prominently been told by Cary Elwes, the English actor who played Westley in the 1987 film The Princess Bride and became close with André (who played Fezzik) during the production of that movie.", "In his voiceover commentary to accompany behind-the-scenes footage of The Princess Bride released as a DVD extra in 2000, Elwes told the Samuel Beckett story as follows:", "I'll tell you an interesting story about André. You know that he couldn't fit on the school bus on the way to school. He told me this. So he had to be driven, in a car, to school every morning. And his parents couldn't afford one, but his neighbor had a big car and his neighbor used to drive him to school every day.", "I said \"Oh really?\" He said \"Oh yes, he was a very nice man ... you may have heard of him, I don't know.\" I said \"Really? What's his name.\" He goes, \"Samuel Becket.\" Samuel Beckett used to drive him to school every day! I mean, \"Waiting for André.\"", "﻿", "Elwes recounted the story in greater detail in his 2014 memoir As You Wish: Inconceivable Tales From the Making of the Princess Bride:", "As the shoot continued I began to spend more and more time with [André]. And slowly he began to open up to me about his life. He told me he had two brothers and two sisters and that he was the middle child. That he grew up on a farm built by his father, Boris, in the small village of Molien, which was about forty miles from Paris.", "He told me that by the time he was twelve he had already grown to a height of six feet two and 240 pounds and that he was so big that he could no longer ride on the local bus that transported the other children to school.", "Sometime after that, the great Irish playwright, Samuel Beckett, bought some land in Molien and decided to move there (there is still a street named after him.) Being a handyman as well as a farmer, Roussimoff Sr. offered to help Beckett build his country cottage and eventually the two struck up a friendship. When the playwright learned of young André's issues with the school bus, he offered to drive the boy to school, explaining that he had a convertible -- the only one in town -- and thus, the only vehicle that could possibly accommodate André's size.", "And so, for a time at least, the Nobel Prize-winning author of Waiting for Godot chauffeured the young man who would eventually become the most famous wrestler in history to and from school ... I asked André what he and the famous author talked about when they were together. \"Mostly cricket,\" André recalled.", "The odd friendship between the two has captured the imagination for years and has inspired fictionalized portrayals in works such as a graphic novel, short film and two plays.", "The story is plausible on its face. Beckett did live near the Roussimoffs in Molien, a tiny hamlet in the town of Ussy-sur-Marne near Paris, from 1953 to 1960, when André was between the ages of seven and 14.", "According to an essay by the leading Beckett expert James Knowlson, at that time the Irishman did drive a Citröen 2CV, which was a convertible. Beckett was also a great fan of cricket, once a serious player himself.", "However, the April 2018 release of a documentary feature film about the wrestler, who died in 1993, brought the legend under renewed scrutiny.", "Jason Hehir, the director of André the Giant, was asked about the Beckett story in interviews surrounding the release of the film on HBO, telling Business Insider that the tale as commonly related was somewhat exaggerated:", "Beckett's house is a few hundred yards down the road from Andre's childhood home, that is true. The reality is there was no bus to school in that town. There was a 2-kilometer walk from Andre's house into the center of town, where the schoolhouse was, and all the kids in the village took that walk to and from school every day. Andre's father had no hand in helping to build Samuel Beckett's house.", "Beckett had a truck, and if he passed the kids, he would stop and let them hop into the flatbed of his truck and he would drive them to or from school. But it wasn't singular to Andre, and he had no special relationship with Andre any more than he did with any other child in that area. Andre's brother laughed at us when we told him what the legend is.", "We got in touch with Hehir, who sent us an excerpt from the transcript of his interview with Antoine Roussimoff, a brother of André. Roussimoff said Beckett, along with other local adults, sometimes gave car rides to schoolchildren, but not exclusively to André, and not because he had outgrown the school bus. \"There was no bus,\" Antoine told the filmmakers:", "For us to go to school, we had to travel two and a half kilometers by foot in the morning and back in the evening.  Every day. And sometimes there’d be a gentleman or a lady who drove by who knew us ... who had us get in the car, and then brought us either to school, or in the opposite direction, to take us back at home.", "Mr. Beckett, he did that with everybody, with me as well as with my sisters.  There were also other people, other farmers.", "Roussimoff also put paid to the legend that his father had helped build Beckett's house for him, saying: \"We had nothing to do with Mr. Beckett. Absolutely nothing. My parents, they knew him when they would run into each other, that’s all.\"", "Similarly, Roussimoff dismissed a separate story that André was forced to leave school later in his teenage years because he could no longer be accommodated in the schoolhouse, such was his size:", "My brother didn’t leave school because he was too big. He left school because he was fourteen years old.  He had reached the age when you could leave school. I don’t understand why people tell stories like that, that André left school because he was too big. That’s not true.", "It’s like Mr. Beckett, or like the bus that didn’t want to take him to school because he was too tall, that he couldn’t fit in the bus. It’s false. There was no bus. So, that’s not true ... Mr. Beckett would take André to school every day? That’s false. That’s not true.", "In an email, Hehir told us that André's other brother and one of André's childhood friends had both corroborated the version of events provided by Antoine Roussimoff, adding:", "One of the interesting aspects of the mythology surrounding André is that he himself perpetuated so much of it. This Beckett story is a good example. According to Cary Elwes, André himself told the story of his friendship with Beckett. He would also tell interviewers that he was from Grenoble and that his grandfather was nearly eight feet tall. Again, both false. It's a testament to the extraordinary life André lived that we have difficulty deciphering truth from fiction.", "Elwes, Cary and Joe Layden.   As You Wish: Inconceivable Tales from the Making of the Princess Bride.\r\n    Simon and Schuster, 2014.   ISBN 1-476-76402-6.", "Knowlson, James.   \"A Writer's Homes — A Writer's Life.\"\r\n  in A Companion to Samuel Beckett\r\n    Wiley-Blackwell, 2010.   ISBN 1-405-15869-7.", "Knowlson, James.   \"Samuel Beckett the Sportsman -- From Cricket to Krapp's Last Tape.\"\r\n    The Guardian.   21 August 2012.", "Guerrasio, Jason.   \"The Director of HBO's André the Giant Documentary Explains How He Debunked Some Major Myths and Got Vince McMahon to Cry.\"\r\n    Business Insider.   11 April 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]