["The one-minute 31-second video was posted here on Twitter on January 21, 2021. It has been viewed more than 14,000 times.", "The video purports to show the view from a Singapore Airlines flight. At the video's 30-second mark, a man with an American accent can be heard telling the plane's passengers to adopt the brace position. The sounds of passengers appearing to scream can subsequently be heard. At the clip's one-minute mark, a white object appears to pass quickly under the aircraft's right wing.", "The post's caption reads: “A passenger captured a UFO on video while on board the Singapore Airlines plane heading to Zurich Airport.", "“The passenger was about to record the landing but after minutes he witnessed a near collision with a UFO.”", "Comments from some Twitter users suggested they were misled by the video.", "“Looking at some still shots of it, it’s not a bird,” reads one Twitter user's comment.", "Another Twitter user responded: “100% ufo its disc shaped with well defined upper and lower potions via shadows.”", "An identical video was also shared alongside a similar claim on Facebook here and here; on Twitter here and here; on Reddit here and here; on YouTube here and here; and on the Chinese video sharing website Bilibili here.", "The video was also embedded in reports by multiple news organisations, including Rumble, The Independent, India Times, LADbible, and Times Now, in reports about the purported near-collision.", "The claim, however, is false: the video has been manipulated.", "A reverse image search of the video’s keyframes, extracted using digital verification tool InVID-WeVerify, followed by keyword searches on Google, found this longer and unmanipulated version of the video.", "It was posted on YouTube on May 22, 2015.", "The two-minute 55-second video is titled: “Hard Banking Take Off - Lufthansa A320 departs Zurich.\"", "The caption reads: “Impressive U-Turn shortly after taking off from Zurich as the Lufthansa A320-200SL is heading north towards Frankfurt. This fairly new bird is sporting the beautiful Sharklets that we will see on the next A320NEO generation as well.”", "The video in the misleading posts has been mirrored from the 2015 video's 56-second mark.", "In the manipulated clip, the white moving object has been added, as well as the plane tannoy announcement and the sounds of passengers purportedly screaming.", "A Lufthansa logo has also been digitally altered in the manipulated video and replaced with a Singapore Airlines logo.", "Below is a screenshot comparison of the doctored video (L) and the 2015 video (R) with the airline logos circled by AFP:", "In the 2015 video, a different man can also be heard making flight announcements in German and then in English.", "In response to the misleading posts, Singapore Airlines said its pilots did not make the announcements in the manipulated clip.", "“No flying object was sighted during the aircraft landing of SQ346 into Zurich,” a spokesperson for the company told AFP in an email on January 25, 2021.", "“We can confirm that the pilots of SQ346 did not make the announcements that were claimed to have happened in the video.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]