["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "It's never easy being a member of the minority party. Ask the Republicans in the Rhode Island General Assembly or in the U.S. Senate. Ask the Democrats in the U.S. House.", "Ian Prior, of the National Republican Congressional Committee, raised that point in a Jan. 14, 2014, Providence Journal commentary, saying that voters in Rhode Island can’t afford to have an all-Democrat delegation to the U.S. Congress.", "If the Republicans retain control of the House and win the Senate in the next election, he wrote, \"Rhode Island could well find itself with a complete loss of influence at the federal level.\"", "To make his point, he focused on the accomplishments of U.S. Rep. David Cicilline, a Democrat. (Prior was campaign manager for Cicilline's 2012 Republican opponent, Brendan Doherty.)", "\"To see what a lack of influence looks like, one need look no further than Representative Cicilline’s record in Congress. Of the 20 bills Cicilline has sponsored in his three years in office, not a single one has advanced past the embryonic committee stage. This is a testament to the lack of effectiveness a backbencher in the minority party has in Congress.\"", "We decided to see whether Prior was accurately describing the number and fate of Cicilline's proposals.", "When we contacted him, he said he was not counting legislation Cicilline has co-sponsored because it's easy to add your name to a bill someone else has drafted.", "Prior sent us to the website GovTrack.US, which showed Cicilline has sponsored 21 pieces of legislation, not 20. However, his count was accurate at the time he submitted his commentary.", "But that same website says not all of the legislation has remained stuck in committee. One bill, H.R. 2027, was reported out of the House Committee on Natural Resources on Nov. 17, 2011. It never received a vote by the House, according to the website.", "(That bill involved the boundaries of four coastal areas, in Newport and Middletown. It was resubmitted as H.R. 277 in the current Congress and sent back to committee on Jan. 15, 2013, where it remains.)", "When we asked Prior about that legislation, he said, \"I did not say that he hadn't gotten a bill out of committee, but rather that it had not gotten past the 'committee phase' which includes the [House] Rules Committee.\" By his definition, if it doesn't get past the Rules Committee, it doesn't count as going past the \"embryonic committee phase.\"", "But the database Prior used to prove his point -- and others we checked -- don't use that standard.", "And here's nothing \"embryonic\" about a bill that makes it through a committee, which is usually where most of the hard work on a bill is done.", "Cicilline's chief of staff, Peter Karafotas, said that if Prior \"did understand the legislative process, he would know that the vast majority of bills that reach the House floor for a vote never go through the Rules Committee\" and in the current Congress, \"57 percent of the bills the House voted on never went through the Rules Committee. \"", "Karafotas also argued that just looking at the number of sponsored bills reported out of committee can be misleading and oversimplifies a Congressman's influence.", "Karafotas said Cicilline had also sponsored 10 amendments to bills on the floor of the House, 4 of which passed. In addition, he cited 11 Cicilline amendments that were incorporated into legislation when it was in committee. He said those are just examples.", "Prior's larger point is that a Democrat in a Republican-controlled House or Senate will have trouble passing legislation.", "Darrell M. West of the Brookings Institution said there is little evidence that states with both Republicans and Democrats in their congressional delegations fare better. And he said nobody should be surprised that a Democrat can't get bills out of committee in a Republican Congress.", "\"The Speaker (of the House) only moves bills from his own party, and that's true whether there's Republican or Democratic control,\" a fact that even more likely to be true \"because of the extreme polarization and hyperpartisanship. Republicans never want to see a Democratic initiative see the light of day,\" he said.", "Our ruling", "Ian Prior said, \"of the 20 bills [Rep. David] Cicilline has sponsored in his three years in office, not a single one has advanced past the embryonic committee stage.\"", "In fact, one did. In addition, 4 of the 10 amendments Cicilline offered passed.", "Prior’s point is that legislators in a minority party have no influence. That's true to some degree. But he is ignoring other evidence of influence that a member of Congress can wield, including amendments to Republican bills.", "Because his statement is partially accurate but leaves out important details, we rate it Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "ProvidenceJournal.com, \"Ian Prior: R.I.'s weakening influence in Washington,\" Jan. 14, 2014", "Emails, Ian Prior, regional press secretary, National Republican Congressional Committee, Jan. 15-28, 2014", "Emails, Peter Karafotas, chief of staff, U.S. Rep. David Cicilline, Jan. 17-28, 2014", "GovTrack.US, \"Advanced Search for Legislation\" all bills and resolutions sponsored by David Cicilline, and \"H.R. 2027 (112th): To revise the boundaries of John H. Chafee Coastal Barrier Resources System Sachuest Point Unit . . . ,\" accessed Jan. 16, 2014", "Wikipedia.org, \"Coastal Barrier Resources Act,\" accessed Jan. 23, 2014", "Congress.gov, \"Current Legislation - Cicilline,\" \"Congressional Record; May 18, 2012\" (pages (H3131 to 3136 for Cicilline amendments to HR 4310); \"Congressional Record; July 23, 2013\" (pages H4936-4937), \"H.R.6504 - Small Business Investment Company Modernization Act of 2012,\"  accessed Jan. 23-24, 2014", "House.gov, \"7/20/11 Foreign Affairs Committee Markup Summary (on) H.R.2583,\" (Cicilline amendments passed in committee), accessed Jan. 23-24, 2014", "Interview, Darrell West, vice president and director of governance studies, The Brookings Institution, Jan. 22, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]