["“Bayern Munich Players Mock FC Barcelona In Training Picture,” reads a Facebook post from August 19, 2020. It includes an aerial image of people standing in a figure eight formation.", "The post goes on to say that “Bayern Munich players recently trolled FC Barcelona players by forming at 8 shape during their training session of the 18th of August in Germany (sic).”", "This referred to the 8-2 thrashing Bayern Munich inflicted on Barcelona in their UEFA Champions League quarter-final in Lisbon, which also led to the dismissal of Quique Setien as coach of the Catalan team. Bayern went on to win Europe’s premier competition.", "The claim, shared more than 5,400 times in Spanish Facebook posts and debunked here by AFP Fact Check in Colombia, is false.", "A reverse image search on Google led to a tweet from Bayern Munich’s official English Twitter account where the image can be found.", "Published on July 4, 2020, the tweet says: “Tonight we go for the Double” with an emoji of a trophy and the hashtag “#MEI8TER”. The letter “S” in Meister -- German for champion -- had been replaced with the number 8.", "#MEI8TER ✅\n\n\t\tTonight we go for the Double ? #DFBPokal #B04FCB #PACKMAS pic.twitter.com/qaS11RDOCU", "Bayern had, on that day, played in the final of the German Cup against Bayer Leverkusen, who they beat 4-2. The victory represented “a double” in the 2019-2020 season after they were crowned champions in the Bundesliga, Germany’s top league division.", "The figure eight referred to the club’s eighth consecutive Bundesliga title. A news report on Bayern's website on July 4, 2020 also explained the meaning of the gesture -- which happened more than a month before their crushing win over Barcelona.", "“To get in the mood for Saturday’s DFB Cup final against Bayer Leverkusen, the Bayern players showed their team unity by gathering together on the training pitch at Säbener Straße for a special team photo,” read the report.", "“The squad formed a giant 8 as a symbol of the eight straight Bundesliga titles they have now won.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]