["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Pete Snyder is focusing his gubernatorial campaign on building a movement to reopen Virginia schools that have been closed during the coronavirus pandemic.", "\"All of the science and data say it’s perfectly safe to have teachers and students in the classroom,\" Snyder, a Charlottesville entrepreneur, said during a Feb. 22 radio interview on WRVA in Richmond.", "We fact-checked Snyder’s claim, which he also makes on his website, and found it to be wrong. All major studies do not say it’s \"perfectly safe\" to open schools. Most say that if K-12 schools adhere to mitigation measures — masking, physical distancing and frequent hand-washing — then there appears to be minimal risk of COVID-19 transmission from schools.", "Calls to reopen schools have become increasingly urgent in Virginia. The General Assembly on Feb. 25 passed a bill that would require school districts to offer students full time, in-person instruction by July 1. If a school has a high level of COVID-19 infection, then local officials can temporarily return to distance learning or a hybrid plan in which a school is partially open. The bill is being reviewed by Gov. Ralph Northam.", "According to March 1 data from the state Department of Education, 26 Virginia school districts were offering at least four days of weekly in-person teaching, 91 were operating under various hybrid plans of in-person and remote instruction, and 15 had fully remote teaching.", "Northam, a Democrat who has been criticized by the GOP as having an overly restrictive approach to COVID-19, has directed all school districts to offer in-person learning options by March 15.", "President Joe Biden has set a national goal of getting most K-8 schools \"safely open\" by the end of April. A Feb. 1 survey of 13,597 U.S. school districts by MCH Strategic Data, a research and marketing corporation, found 18% were fully open for in-person instruction, 51% were in a hybrid plan and 23% were offering only online learning.", "During a Feb. 3 White House press briefing, Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention said  \"there is increasing data to suggest that schools can safely reopen.\"", "The CDC on Feb. 11 released guidance on how schools should approach reopening and repeatedly said there are varying degrees of risk that local education officials have to assess, and steps they can take to lower - but not remove - those risks.", "\"While fewer children than adults have had COVID-19 in the United States, the number of school-aged children with COVID-19 has been increasing,\" the CDC said. \"...Resuming and maintaining in-person learning may pose risks to children, teachers, school administrators, and other staff in the school environment, and their families and household members.\"", "In addition to standard risk-mitigation steps, the CDC recommends inspections and possible improvements to ventilation systems, COVID testing for students and teachers who don’t feel well, contact tracing, dividing classrooms into student learning pods and monitoring community transmission of the virus.", "Several studies in late 2020 say opening schools may pose little or no added risk to students and teachers if mitigation standards are strongly enforced. Some of the research was cited by Republican state Sen. Siobhan Dunnavant - an Henrico County OB-GYN and sponsor of the bill to open Virginia schools - during floor debate. Let’s take a look:", "Only seven COVID-19 cases out of 191 were traced to in-school spread in 17 rural K-12 Wisconsin schools that had high mask-wearing compliance and were monitored over the 2020 fall semester. \"These findings suggest that attending school where recommended mitigation strategies are implemented might not place children in a higher risk environment than exists in the community,\" the report said.", "Mississippi researchers found most COVID-19 cases in children and teenagers were associated with gatherings outside of households and a lack of consistent mask use in schools, but not associated with merely attending school or child care.", "Thirty-two cases were associated with attending school out of more than 90,000 students and staff members in 11 North Carolina school districts, where students were required to wear masks, practice physical distancing and wash hands frequently.", "As PolitiFact has previously noted, there are some limitations to these studies, which often rely on contact tracing, a process that can’t always pinpoint where cases originate. Some of the studies also rely on self-reporting of mask-wearing by individuals, which could be inaccurate.", "We should note that communities are being urged to open schools with mitigation policies by American Academy of Pediatrics, which says staying home can hurt childrens’ mental health and learning. \"The AAP continues to strongly advocate that all policy considerations for school COVID-19 plans should start with a goal of having students physically present in school,\" the organization says in its guidance plan.", "Snyder, on his website, says \"the CDC and President Biden’s own Coronavirus Task Force both say it’s perfectly safe for schools to be open.\" We asked his campaign to back up the claim and were sent a Jan. 21 article in healthline.com that said, \"Experts say that while there is uncertainty about how children in a classroom environment could impact the spread of disease, new data finds the actual risk to be low.\"", "Our ruling", "Snyder inaccurately says, \"All of the science and data say it’s perfectly safe to have teachers and students in the classroom.\"", "A number of studies suggest there may be very little - if any - added risk of COVID spread if children and teachers return to schools. But the low risk depends on strictly enforcing mitigation strategies. We haven’t seen a single study that says opening schools is, in Snyder’s words, \"perfectly safe.\"", "So, we rate Snyder’s statement False.", "CORRECTION, March 3, 2021: An earlier version of this fact check incorrectly reported that Pete Snyder’s campaign did not respond to PolitiFact’s request for information. This updated version includes the response, which does not change our rating.", "Sources", "Pete Snyder, WRVA radio interview, Feb. 22, 2021.", "Pete Snyder for Governor, \"Pete Snyder Commits Funding to Open Schools Movement and Launches #OpenOurSc,  March 1, 2021.", "Legislative Information System, SB 1303, 2021 Special Session I.", "MCH Strategic Data, \"COVID-19 Impact: School District Status,\" Feb. 1, 2021.", "Gov. Ralph Northam, News release, Feb. 5, 2021.", "President Joe Biden, \"National Strategy for the COVID-19 response and Pandemic Preparedness,\" Jan. 21, 2021.", "PolitiFact, \"Conservative talk show host falsely claims ‘science’ supports a return to normal now,\" Feb. 19, 2021.", "Rochelle Wallensky, Comments at White House briefing, Feb. 3, 2021.", "Centers for Disease Control and Prevention, \"Operating schools during COVID-19: CDC's Considerations,\" Feb. 11, 2021.", "CDC, \"COVID-19 Cases and Transmission in 17 K–12 Schools — Wood County, Wisconsin, August 31–November 29, 2020,\" published Jan. 29, 2021.", "CDC, \"Factors Associated with Positive SARS-CoV-2 Test Results in Outpatient Health Facilities and Emergency Departments Among Children and Adolescents Aged <18 Years — Mississippi, September–November 2020,\" published Dec. 15, 2020.", "American Academy of Pediatrics, \"Incidence and Secondary Transmission of SARS-CoV-2 Infections in Schools,\" January 2021.", "Sen. Siobhan Dunnavant, Floor speech, Feb. 22, 2020  (1:57:16 mark).", "Associated Press, \"Virginia lawmakers pass bill requiring in-person learning,\" Feb. 25, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]