["About this rating", "Photographs purportedly showing the skeletons of fairies, dragons, werewolves and other mythical creatures at the \"Merrylin Cryptid Museum\" were appeared in May 2016, featured on web sites such as Ufunk.net and Metro:", "Creepy skeletons of winged humans, bodies of mythical creatures and even aliens have been unearthed in a London home.", "The ghastly relics were the collection of Thomas Merrylin, an 18th century aristocrat with a taste for the unusual.", "They were apparently found sealed in the basement of a London house in 2006, and the macabre findings might just change science as we know it.", "Now they’re being kept at the Merrylin Cryptid Museum, a bizarre collection of the artefacts that is almost guaranteed to creep you out.", "The \"Merrylin Cryptid Museum\" claims that its specimens were collected by famed \"Crypto-naturalist\" Thomas Merrylin in the 1800s. \"Curator\" Alex CF writes on the museum's web site that not only did Merrylin have a knack for uncovering imaginary creatures, but that he also resisted aging:", "A bizarre quality of Merrylin was his apparent permanent youthfulness. Even in his 80′s, he still resembled a 40 year old, albeit of odd complexion, and his few bizarre forays into the eyes of the media only furthered his infamy. He was accused of practicing dark arts to prolong his life. Yet, eminent scholars secretly allied themselves with him, encouraging him to share his collection with the world. In 1899, he took a small portion of his specimens on tour across America. Conservative attitudes of the time condemned these creatures, calling them blasphemous. His reaction was severe and the tour was canceled before it reached California.", "A video that appeared to show the museum was published on Vimeo in 2014, deepening the mystery:", "Despite the claims made in this video, we found no record of an ageless cryptologist named \"Professor Thomas Theodore Merrylin\" that wasn't associated with this museum. Furthermore, in addition to his duties as \"curator\" at the \"Merrylin Cryptid Museum,\" Alex CF is also an illustrator, artist, and sculptor who specializes in dark folklore and animal mythology:", "Alex is a London based illustrator, writer and sculptor. His work is visceral and whimsical, creating elaborate detailed depictions of earthen ritual, dark folklore and forgotten horrors. His frenetic lines and beautiful depictions can be seen on band artwork, record labels and book covers alongside his own personal projects.", "His personal artwork is inspired by animal mythology, the concepts of imbuing non humans with cultural, religious and ritualistic practices, creating fantastical naturalist scenes, with much of his personal illustrations connected by stories within a single narrative. He writes and draws to create little worlds so that the drawings have a substance beyond the aesthetic, by incorporating ideology and symbology to encourage the viewer to consider the connections between humans and non humans. He has just finished writing his first novel, 'Seek the throat from which we sing.'", "The ageless cryptologist Thomas Merrylin is an intriguing, but fictional, character. The specimens he supposedly found do not showcase the skeletal structures of fairies, dragons, and other mythical creatures; the entire creation — from the museum, to the backstory, to the video, to the skeletons themselves — is the work of a particularly imaginative artist.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]