["A claim stating that illegal weapons and arms were found in a madrasa in Bijnor, Uttar Pradesh is being shared on social media with three pictures. A facebook page I Support Arnab Goswami posted the photographs with the message, “Police raided Madrassa in Bijnor Uttar Pradesh and recovered arms & ammunitions from peaceful community for their peaceful activities. Sanitization of such similar places across the country is must.”", "Police raided Madrassa in Bijnor Uttar Pradesh and recovered arms & ammunitions from peaceful community for their peaceful activities.", "Sanitization of such similar places across the country is must.", "Posted by I Support Arnab Goswami on Friday, 12 July 2019", "Another user shared the same pictures with a message in Kannada which said, “ಕಾನೂನು ವಿರೋಧಿಯಾಗಿ ಉತ್ತರ ಪ್ರದೇಶದ ಕೆಲವು ಮಸೀದಿಗಳಲ್ಲಿ ಕಾನೂನುಬಾಹಿರವಾಗಿ ಬಂದೂಕು ಹಾಗೂ ನಾಡ ಪಿಸ್ತೂಲುಗಳು ಹಾಗು ಚಾಕು-ಚೂರಿ ಗಳು ಅಕ್ರಮವಾಗಿ ಔಷಧಿಗಳು ಮದರಸಗಳಲ್ಲಿ ಸಿಕ್ಕಿಬಿದ್ದ ಹರಾಮ್ ಕೋರರು ನೋಡಿ ಹಿಂದೂ ಬಾಂಧವರೇ ಅರ್ಥಮಾಡಿಕೊಳ್ಳೋಣ ಎಲ್ಲಾ ಹಿಂದೂಗಳಿಗೆ ತಲುಪುವವರೆಗೂ ಶೇರ್ ಮಾಡಿ (The illegal weapons & arms were stored in medicine boxes inside the Madrasa in Uttar Pradesh. The Madrasa superintendent named Sajid was arrested along with five others and was sent to jail, Police confirmed.)”", "The pictures are also being shared on Twitter with the same claim.", "The illegal weapons & arms were stored in medicine boxes inside the Madrasa in Uttar Pradesh.The Madrasa superintendent named Sajid was arrested along with five others and was sent to jail, Police confirmed. pic.twitter.com/BLlgUtJyIT", "— Kuldeep Somayaji P. (@kuldeepcet) July 13, 2019", "Several people have messaged Alt News asking if the incident is true.", "We also received verification requests on the Alt News app.", "Alt News found that according to Bijnor police, illegal arms were smuggled and six people were arrested in this case. The official Twitter handle of Bijnor Police tweeted two out of the three images circulating on social media. The police statement said – “थाना शेरकोट @bijnorpolice द्वारा मदरसे में अवैध शस्त्रों की तस्करी करते 06 अभियुक्तगण 01 पिस्टल, 04 तमंचे व भारी मात्रा में कारतूसों सहित गिरफ्तार। (Serkot police station @bijnorpolice have arrested 6 people accused in the smuggling of illegal arms in a madrasa where they were found with 1 pistol 4 tamanche and a large number of cartridges )“", "थाना शेरकोट @bijnorpolice द्वारा मदरसे में अवैध शस्त्रों की तस्करी करते 06 अभियुक्तगण 01 पिस्टल, 04 तमंचे व भारी मात्रा में कारतूसों सहित गिरफ्तार। #uppolice @Uppolice @adgzonebareilly @digmoradabad @News18India pic.twitter.com/WDj3kkBfIu", "— Bijnor Police (@bijnorpolice) July 11, 2019", "The tweet carried further details – on July 10, 2019, Sherkot police raided Darul Quran Hamidia Madarsa on Kandhla road in Sherkot for the smuggling of illegal weapons. Details of the arms, including guns and cartridges, found are given. The arrested include Md Sajid (the director of the Madrasa), Faheem Ahmad, Azizurmahma, Zafar Islam, Sikandar Ali, and Sabir. Two accused Arif and Asif are absconding. It also mentioned the prosecutions registered.", "The case was also reported in the media.", "Bijnor: 6 accused who were detained after illegal weapons were recovered from a ‘madarsa’ in Sherkot, are being interrogated at Anti-Terrorism Squad police station. pic.twitter.com/8uj2dQjWn8", "— ANI UP (@ANINewsUP) July 11, 2019", "However, the third picture circulated with the viral claim was found in a March 2019 Tumblr post which means that it cannot be representative of a July 2019 incident.", "In conclusion, the incident reportedly occurred in Bijnor, however, one of the pictures circulating with the claim is unrelated to the case.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]