["A group of men, some of whom are wearing clerical collars, appear in the image holding a banner that purports to say, in capital letters: “Impeach Leni Robredo for vice president”.", "Robredo has been vice president of the Philippines since 2016. Here is her verified Twitter account.", "The misleading image is contained in this Facebook post published May 23, 2019, and shared more than 700 times since.", "Below is a screenshot of the Facebook post:", "The image has been doctored; a Google reverse image search led to a similar photo in this article on the website of United Methodist News service, the news agency of the United Methodist Church.", "The article is dated September 22, 2017 – a day after marches were held to mark the anniversary of the 1972 proclamation of martial law in the Philippines. Here is an AFP article about those 2017 rallies.", "Below is a screenshot comparison of the misleading Facebook post (L) and the United Methodist News article (R):", "The text on the banner in the photo says, in capital letters: “Stand up for justice, human rights and just peace! Ecumenical Bishops Forum”.", "The photo in the United Methodist News article is credited to Ofelia A. Cantor, who posted the same image to Facebook here on September 21, 2017. Cantor’s Facebook page states that she once worked at the Ecumenical Bishops Forum.", "The same banner can be seen in other photos online, for example here on the website of the National Council of Churches in the Philippines in an article dated October 13, 2017.", "Below is a screenshot of that article:", "The same photo can also be seen in a different image in this Facebook post dated September 21, 2017.", "That post is embedded below:", "In the Philippines, the president and vice president are elected independently of one another, as detailed on this government website.", "Robredo has publicly criticised Philippine President Rodrigo Duterte for his deadly war on drugs.", "Here is a YouTube video showing her message to the UN Commission on Narcotic Drugs convention in 2017, where she raised the subject.", "The misleading Facebook post has been shared in groups which support President Duterte, according to CrowdTangle data.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]