["The photo was published here on Twitter on June 1, 2020.", "The photo shows a man holding a “CHINA HELP ME BREATHE” sign as he stands in front of a burning building and road blockades, which has a Chinese flag attached to it. Graffiti on the roadblocks read: “Justice for Floyd”.", "Protests erupted across the US following the death of George Floyd, an unarmed black man who was filmed pleading for his life as a police officer kneeled on his neck during his arrest in the city of Minneapolis. As thousands took to the streets in peaceful and violent protests calling for an end to racism, the Trump administration responded with further shows of force, such as the deployment of National Guard troops and a night-time curfew. Here is an AFP report on the demonstrations.", "The tweet’s Chinese-language caption translates to English as: “Netizens say: US people are very candid, and they never hide their feelings.”", "The photo has also been shared here on Twitter, here on Facebook and on various forums here, here, here and here, alongside a similar claim.", "The claim is false; the photo has been doctored.", "A reverse image search found the original photo published in this May 29, 2020 report by Portuguese TV channel SAPO 24.", "The article’s Portuguese headline translates to English as: “Protests over George Floyd's death continue. Trump threatens gunshots, Twitter hides message for ‘glorifying violence’”.", "The photo can be seen in this photo gallery published alongside the report.", "The photo, credited to Graig Lassig from international photo agency EPA, is captioned: “Protests against police violence after the death of George Floyd / Minneapolis, Minnesota USA, May 28, 2020.”", "The placard in this photo reads: “Liberty or justice / till i can’t breath!!!!”. There is no Chinese flag in the original photo.", "Below is a screenshot comparison of the photo in the misleading post (L) and the photo in the SAPO 24 article (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]