["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An old, miscaptioned photo about wild wolves and their behavior continues to resurface on social media.", "The image, shared in a Facebook post, shows a pack of wolves trudging single file through the snow. The photo itself is real –– it’s from the BBC’s Frozen Planet series –– but the caption that is attached to it is problematic:", "\"The 3 wolves in the front are either old or sick. They walk in front to lead the way so as to set the pace. The 5 wolves behind them are the strongest. They protect the front in case of an attack. The middle group consists of newborns, pregnant females, and young wolves. They are fully protected from front as well as from back. The 5 wolves, behind the middle group are also among the strongest, they protect the back side. The last and the lone wolf in the back is the leader. He ensures no one is left behind. He keeps the pack tight and cohesive. Also in case of an ambush he remains active to run in any direction to protect his pack.\"", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This caption is not accurate. The pack is being led by one animal, with the rest following in a single-file line to save energy.", "The image was taken by Chadden Hunter in 2011 for the BBC series and features a pack of timberwolves hunting bison in Canada’s Wood Buffalo National Park. The original caption reads:", "\"A massive pack of 25 timberwolves hunting bison on the Arctic circle in northern Canada. In mid-winter in Wood Buffalo National Park temperatures hover around -40C. The wolf pack, led by the alpha female, travel single-file through the deep snow to save energy. The size of the pack is a sign of how rich their prey base is during winter when the bison are more restricted by poor feeding and deep snow. The wolf packs in this National Park are the only wolves in the world that specialise in hunting bison ten times their size. They have grown to be the largest and most powerful wolves on earth.\"", "However, despite the popular understanding of how wolf packs work, some scientists dispute the term \"alpha.\"", "In the 1999 paper, \"Alpha Status, Dominance, and Division of Labor in Wolf Packs,\" wolf expert L. David Mech wrote that, in natural wolf packs, the alpha male or female are \"merely the parents of the packs.\" Mech said that after years of observation he saw no dominance contests among wild wolves.", "\"Calling a wolf an alpha is usually no more appropriate than referring to a human parent or a doe deer as an alpha,\" Mech wrote. \"Any parent is dominant to its young offspring, so ‘alpha’ adds no information. Why not refer to an alpha female as the female parent, the breeding female, the matriarch, or simply the mother? Such a designation emphasizes not the animal’s dominant status, which is trivial information, but its role as pack progenitor, which is critical information.\"", "The photograph in the post is real and unaltered, but its caption is incorrect. The pack is not being led by the older, sick wolves and the \"alpha\" or leader wolf is not bringing up the rear. In reality, a strong wolf leads the pack single-file in order to save energy to get through the deep snow.", "This post is False.", "Facebook post, Nov. 19, 2019", "The Guardian, BBC’s Frozen Planet in pictures, Oct. 19, 2011", "TruthorFiction, Photograph of a Wolf Pack Explains ‘Alpha’ Behavior?, Dec. 23, 2015", "Gizmodo, Why everything you know about wolf packs is wrong, May 12, 2013", "Wolf.org, Alpha Status, Dominance, and Division of Labor in Wolf Packs by L. David Mech, 1999", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]