["This blog post published on December 16, 2020 claims Lanka Premier League (LPL) was ranked the “biggest global sporting event of 2020”. It features a screenshot of an article that was published on a website named Washington Morning.", "The post’s Sinhala-language caption translates to English as: “Eventually the victory is for our little Sri Lanka”.", "The post has been shared more than 700 times.", "A similar claim was circulated on Facebook here, here, here and here. Identical text was seen in this blog post.", "The claim is misleading.", "AFP located the article that was shown in the misleading post here on a site called Washington Times. The dateline is December 15, 2020.", "Although the headline of the article is the same as in the misleading posts, the article’s body makes no mention of the LPL being ranked as “the biggest global sporting event of the year”.", "Below is a screenshot of the article:", "A keyword search of the claim on Google did not yield any results except for the featured article on Washington Morning, which is not an official news outlet.", "The site lists an address in New Jersey as its registered address, which is the same address as a New Jersey hotel.", "There is no official ranking system for the world’s biggest sporting events.", "The majority of major sporting events, including the Tokyo Olympics and Paralympics, were cancelled or postponed in 2020 due to the Covid-19 pandemic. Here is a Yahoo News article about some of the most high-profile events that were cancelled or postponed.", "Any major sporting events that were held have generally required crowds to maintain social distancing. Some events, such as cricket's Indian Premier League (IPL), have attracted huge viewer numbers on television, as reported here by Indian magazine Sportstar.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]