["“62 girls found locked in a Delaware Port shipping container going to Europe: RESCUED!” reads a September 24, 2020 post.", "More examples of the post are available on Facebook here and here and on Twitter here and here.", "But the claim is false.", "“Customs and Border Protection thoroughly investigated the claim and found zero evidence to substantiate this false rumor of a human smuggling event through the Port of Wilmington, Del.,” spokesman Steve Bansbach told AFP in an email.", "And Delaware Department of Justice’s Mat Marshall said via email that the claim “doesn’t ring a bell.”", "Some posts spread the claim using the hashtag #SaveOurChildren. Supporters of the QAnon conspiracy theory -- which alleges that powerful Democrats and Hollywood figures engage in child sex trafficking and abuse -- have hijacked both it and the #SaveTheChildren hashtags to stoke fears on social media about sexual predators.", "Others mention “Pizzagate” -- a 2016 conspiracy theory driven by Donald Trump supporters who alleged that his rival Hillary Clinton and other Democrats were part of a child kidnapping ring operating from the basement of a Washington pizzeria.", "AFP Fact Check has debunked other false claims about sex trafficking here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]