["When former senators Evan Bayh, D-Ind.,and Judd Gregg, R-N.H., made a swing through the state this month promoting their First Budget initiative, they threw around facts and figures like rice at a wedding.", "The two emphasized the nation’s ever-increasing debt (now at $18.2 trillion) and ongoing deficits ($485 billion for 2014). But amid their calls for voters to hold presidential candidates accountable for the country’s finances, a few nuggets stood out.", "Both at an appearance at the Rudman Center at the University of New Hampshire School of Law and at an editorial board meeting at the Monitor, Bayh talked about a specific challenge of reining in military spending.", "\"The fastest-growing part of the Pentagon’s budget are health care expenses,\" said Bayh, a former Senate Armed Services committee member.", "It’s growing faster than spending on tanks and planes and salaries? Could this be true? We decided to look into the matter.", "According to Todd Harrison, a senior fellow in defense budget studies at the independent Center for Strategic and Budgetary Assessments, Bayh is on the mark. While Bayh’s statement is broad, and one can divide the defense budget into different wedges, health care spending has soared.", "\"Among the main areas of the defense budget (like procurement, R&D, construction, pay, etc.) military healthcare has grown the fastest,\" Harrison wrote in an email.", "The nonpartisan Congressional Budget Office has found the same trend. According to a report it released last year: \"The cost of providing health care to service members, retirees, and their families increased by 130 percent\" from 2000 to 2012.", "But what are the specific numbers?", "For fiscal year 2016, Harrison said, the military’s projected health care costs are expected to total $48 billion dollars. That sum covers the 9.2 million beneficiaries of Tricare, the Pentagon’s benefits program.", "Most of that money doesn’t help out frontline troops, either. It pays for benefits to their dependents, or to retirees.", "The CBO report found total spending of $52 billion in 2012, which is lower than the 2016 projection. But Harrison said any decline is illusory. The Defense Department has included reforms to health care system in its budget request, but Congress \"will likely deny many if not all of the reforms,\" he said. The actual cost would then be higher.", "Overall, Harrison wrote, military health care costs have \"grown from being just 4 percent of the DoD budget in 1990 to 10 percent today.\"", "If anything, this undercounts the actual fiscal impact. The Tricare system of military health care coverage is an entirely separate entity from veterans’ health care, which is part of the Department of Veterans Affairs’ budget. And VA coverage isn’t cheap: It’s likely to cost $62 billion in fiscal year 2016, Harrison said.", "By the standards of health insurance, Tricare coverage is generous. According to reporting by the Military Times, \"active-duty family members . . . pay no annual enrollment fees and no cost-shares to see a physician. Retirees pay $555.84 a year to enroll themselves and their families in Tricare Prime and pay fees ranging from $12 to 20 percent of a bill depending on the care received.\"", "The addition of retirees and their families under the so-called Tricare for Life program has been a major driver of the increased costs, the Military Times wrote.", "In fact, former defense secretary Chuck Hagel warned that the health care expenses were hurting the military’s overall mission. The Pentagon’s greatest fiscal challenge, he said in 2013, was \"the growing imbalance in where that money is being spent internally.\" That is, toward doctors’ bills, not boots on the ground.", "Competition for the fastest-growing part of the budget is spending to fight terrorism and extremism (called overseas contingency operations).", "Steve Ellis, the vice president of Taxpayers for Common Sense, a nonpartisan budget watchdog group, said resources devoted to those operations spiked far higher on a percentage basis.", "But that depends on how one slices the Pentagon budget and the time frame used to measure growth.", "According to the Defense Department’s 2016 budget request, overseas contingency operation spending was $22.9 billion in fiscal year 2001, and peaked at $186.9 billion in fiscal year 2008. It’s projected to come back down to $50.9 billion for 2016. In other words, while that spending increased a staggering amount, it has dropped markedly in recent years.", "In their New Hampshire appearances, Bayh and Gregg said military spending is not the main driver of the United States’ debt and deficits. Entitlement programs such as Social Security, Medicare and Medicaid pose the biggest long-term challenges.", "Discretionary spending -- which includes spending on the military -- \"is not our problem,\" Gregg said at the Rudman Center.", "Our ruling", "Bayh said that \"the fastest-growing part of the Pentagon’s budget are health care expenses.\"", "There’s little debate that generous military health care benefits are taking up an ever-increasing share of the Pentagon’s budget. While other parts of the budget have spiked, that’s in the past. We rate the statement True.", "Judd Gregg, Evan Bayh urge N.H. voters to make debt, deficit a priority in primary, Concord Monitor, April 2, 2015", "The Debt to the Penny and Who Holds It, Treasury Direct, April 14, 2015", "Budget Data and Projections, Congressional Budget Office, March 11, 2015", "Todd Harrison biography, Center for Strategic and Budgetary Assessments", "Email correspondence with Todd Harrison, April 15-16, 2015", "Approaches to Reducing Federal Spending on Military Health Care, Congressional Budget Office, Jan. 16, 2014.", "Budget experts: Move Tricare beneficiaries to Obamacare, Military Times, Dec. 21, 2014", "Tricare for Life website, Department of Defense", "Pentagon struggles with high cost of health care, Associated Press, April 8, 2013", "Steve Ellis biography, Taxpayers for Common Sense", "Email correspondence with Steve Ellis, April 14, 2015", "'Global War On Terror' Is Given New Name, Washington Post, March 25, 2009", "United States Department of Defense Fiscal Year 2016 Budget Request, February 2015", "Debt Matters with Senators Bayh and Gregg, University of New Hampshire School of Law, April 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]