["“Just seen this on Twitter!! This Caravan is headed to DC from California RIGHT NOW!!!! #patriots,” says a January 3, 2021 Facebook post shared more than 2,300 times.", "More examples of the post are available on Facebook here and here and on Twitter here and here.", "Demonstrators traveled to Washington to protest the certification of Joe Biden’s victory in the Electoral College, which he won by a vote of 306 to 232.", "Certification is usually just a formality, but more than 100 Republican members of the House of Representatives and at least a dozen Republican Senators have said they plan to lodge objections.", "The initiative, which appears certain to fail, comes despite rulings in dozens of courts and findings by officials that there were no widespread voting problems.", "Some Trump supporters breached security and broke into the US Capitol building, interrupting the proceedings.", "A reverse image search for the photo in the posts shows that the same image was shared on Twitter on October 18, 2020, calling the caravan a “#LongIslandLOUDMajority Trump Parade from Seaford to Montauk” in New York.", "The profile of the user who posted the images, Shawn Farash, says he is the founder of the  “Long Island Loud Majority,” self-described as a “grass roots conservative movement.”", "News articles confirm Farash was one of the organizers of the pre-election Long Island caravan, which drew thousands of participants.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]