["About this rating", "A controversial call at the end of the first game of the 2018 NBA Finals between the Cleveland Cavaliers and the Golden State Warriors had some fans wondering if something more nefarious with the referees was going on.", "According to the Facebook page \"Cleveland Cavaliers Universe,\" NFL star Tom Brady was one of the so-called Cavspiracy theorists:", "If the NBA isn't rigging the finals, they should at least investigate these refs for taking bribes or gambling. How many favorable calls are going to \"coincidentally\" go the Warriors way in crucial games? Trust me I've been investigated for less.", "This meme does not contain a genuine quote; it was created by @Grrindtime, an Instagram page that specializes in sports satire, and whose handle is displayed just above the quote:", "Official Grrindtime® \"We just tell it like it is\" Satire comedy meets sports talk! Voted best sports page by the National Association of Memes.", "If this were a genuine quote it would be splashed across the front pages sports-focused news sources. After all, Brady and the New England Patriots have faced their own accusations of rigging games in their favor, most notably in 2015, when the NFL quarterback was suspended and fined after his team was caught using deflated footballs.", "Sharp, Andrew.   \"An Inexplicable Call Stains a Legendary NBA Finals Thriller.\"\r\n    Sports Illustrated.   1 June 2018.", "Maske, Mark.   \"Tom Brady Suspended Four Games, Patriots Fined $1 Million and Docked Two Draft Choices as ‘DeflateGate’ Punishment.\"\r\n    The Washington Post.   11 May 2015.", "Associated Press.   \"Officiating Likely More Scrutinized in Game 2 of NBA Finals.\"\r\n    3 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]