["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Calves are seen in the young calf stall on a dairy farm in Union Grove, Wis., on Nov. 9, 2018. (Angela Peterson/Milwaukee Journal Sentinel).)", "The plight of Wisconsin’s dairy farms has been well documented, with farmers struggling to hang on in the face of low milk prices and high costs. Some are losing thousands of dollars a month.", "Farmers were boosted by the news in December that Congress approved a $867 billion farm bill, spurred in part by pressure from farmers battered by President Donald Trump’s trade battles with China. After the bill was signed, the U.S. Department of Agriculture announced a second round of direct payments to the hardest hit farmers.", "That good news was short-lived, however, as parts of the government shut down Dec. 22, 2018 amid the dispute over funding for Trump’s planned border wall.", "For instance, farmers say applications are on hold for a $12 billion emergency aid package. The deadline to apply for that program was supposed to be Jan. 15, 2019 but may have to be extended.", "U.S Sen. Tammy Baldwin, whose website touts her legislative efforts on behalf of dairy farmers, weighed in Jan. 2, 2019 with this tweet:", "\"Wisconsin lost over 600 farms last year & our farmers can't afford the #TrumpShutdown.\"", "Did Wisconsin lose over 600 farms last year?", "And is the shutdown hurting those that remain?", "The evidence", "Baldwin’s office pointed PolitiFact Wisconsin to state Department of Agriculture, Trade and Consumer Protection data showing that in December 2018, Wisconsin had 8,163 dairy herds. A year earlier, in December 2017, there were 8,839, a loss of 676 dairy farms.", "That's a 7.6 percent decline in the number of registered dairy herds — the biggest drop since record keeping started in 2004.", "So, the tweet is on point if you only look at dairy farms.", "But, as the agriculture department website notes: \"Wisconsin is America’s Dairyland but there is more produced and processed in our state than just milk and cheese.\"", "According to the department’s \"Wisconsin Agricultural Statistics\" 2017 fact sheet (the most recent available):", "* The state is home to 68,500 farms on 14.3 million acres. The average farm size in Wisconsin is 209 acres.", "* The state ranks third in the nation in potato production, harvesting potatoes on some 67,000 acres in 2017.", "* Wisconsin cranberry production for 2017 totaled 5.37 million barrels. Growers harvested 20,600 acres. Wisconsin produces 64 percent of the nation's crop, making it the top cranberry producing state in the country.", "*The state also produces a large tart cherry crop, producing 11.3 million pounds in 2017.", "*Wisconsin produced 49.0​ million pounds of apples in 2017.", "*Wisconsin is home to about 8,000 dairy farms, more than any other state, and 1.28 million cows.​", "So, how are those farms faring? Baldwin’s tweet did not specify dairy farms. Is it possible when non-dairy farms are included that the overall total is growing?", "Not likely. The final numbers for 2018 are not yet available, but for there to be an increase, it would have to buck a steady trend in the opposite direction. Here is a look at recent years:", "2014: 69,000 farms", "2015, 68,900 farms", "2016: 68,700 farms", "2017: 68,500 farms", "Impact of the shutdown", "Let’s return to the second part of Baldwin’s claim, that the shutdown is negatively affecting Wisconsin’s farmers.", "In a Dec. 28, 2018, news release updating the government shutdown, the USDA", "assured farmers receiving trade-war assistance that checks would continue to go out during the first week of the shutdown.", "But direct payments for farmers who haven’t certified production, as well as farm loans and disaster assistance programs, will be put on hold, and won’t start up again until the government fully reopens. USDA Farm Service Agency offices, which process farm loans and gathers data farmers need to make decisions, are closed.", "About $10 million in payments were headed to Wisconsin farmers through the federal farm bailout program, with 11 farms getting more than $50,000 each, 237 less than $100, and a few thousand farms somewhere in between.", "According to a Nov. 28, 2018 Milwaukee Journal Sentinel story, federal data obtained by the Washington, D.C.,-based Environmental Working Group shows the average payment for Wisconsin farmers was $2,145.", "The Journal Sentinel article explained that the Wisconsin Farmers Union, based on a survey of its members, says a 55-cow dairy farm would receive a one-time payment of $725 from the Trump bailout program, but it will lose between $36,000 and $48,000 over the year due to low milk prices.", "An 80-cow dairy would get $889, barely enough to cover its electric bill for a month. Meanwhile, it will lose $35,000. A 290-cow dairy would get $4,905 but stands to lose up to $400,000.", "The Wisconsin Farmers Union, based in Chippewa Falls, represents mostly small and average-size farms.", "Our rating", "Baldwin tweeted: \"Wisconsin lost over 600 farms last year & our farmers can't afford the #TrumpShutdown.\"", "The numbers show the 600 is in the ballpark among dairy farms. While dairy farms make up a small percentage of the state’s overall farm total, recent years show a downward trend there as well And we know dairy farms were especially battered in 2018.", "Additionally, it is clear at least some state farms -- particularly those involved in dairy -- are being negatively affected by the shutdown.", "We rate Baldwin’s claim Mostly True.", "Email and phone call, Rick Hummell, communications specialist, Wisconsin Department of Agriculture, Trade and Consumer Protection, Jan. 7, 2019.", "Milwaukee Journal Sentinel, \"Wisconsin dairy farmers barely hanging on as crisis deepens with no end in sight,\" Nov. 26, 2018.", "https://www.baldwin.senate.gov/press-releases/dairy-pride-act", "Wisconsin Department of Agriculture, Trade and Consumer Protection,", "Associated Press \"Congress just passed an $867 billion farm bill. Here’s what’s in it,\"December 12, 2018.", "Associated Press \"Farmers risk loss of federal payments, loans, from shutdown,\" Dec. 28, 2018.", "Wisconsin Department of Agriculture, Trade and Consumer Protection \"Wisconsin Agricultural Statistics\" updated November 14, 2018.", "U.S. Department of Agriculture, \"USDA Updates available functions during lapse in funding,\" Dec. 28, 2018.", "Milwaukee Journal Sentinel \"Trump farm bailout checks coming to Wisconsin farms vary from thousands to a few dollars,\" Nov. 28, 2018.", "Milwaukee Journal Sentinel  \"Government shutdown looms over farmers as they face tough decisions,\"Jan. 4, 2019.", "Wisconsin Department of Agriculture, Trade and Consumer Protection \"Wisconsin 2017 Agricultural Statistics\"", "Wisconsin 2015 Agricultural Statistics", "Wisconsin 2018 Agricultural Statistics", "Wisconsin 2016 Agricultural Statistics", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]