["By Lori Robertson", "Posted on April 4, 2019", "In fiscal year 2018, Mexico apprehended 110,000 migrants from Honduras, Guatemala and El Salvador, and over the previous four fiscal years the total was more than 500,000. Yet, President Donald Trump said that for the “first time” in “decades” Mexico “has been starting to apprehend a lot of people at their southern border coming in” from those countries.", "The Mexico apprehension figures were compiled by the Migration Policy Institute from Mexican government reports. This chart, published by MPI in March, compares apprehensions by the U.S. and Mexico of migrants from the three so-called Northern Triangle countries.", "Ariel G. Ruiz Soto, an associate policy analyst at the Migration Policy Institute, told us MPI looked at apprehension and deportation statistics to see if there had been a noticeable change in Mexico under President Andrés Manuel López Obrador, who took office on Dec. 1.", "So far, according to statistics through February, there has been a slight decrease in those figures compared with the same time periods in the last two years of the previous administration, but, Ruiz Soto said, “the trends looked similar overall.” Apprehensions at Mexico’s southern border would be included in the Mexican government’s overall figures.", "Trump, however, claimed in remarks before a meeting with NATO Secretary General Jens Stoltenberg that this week marked “the first time, really, in decades” that Mexico “has been starting to apprehend a lot of people at their southern border.”", "The president made his remarks when asked about his calls to close the U.S.-Mexico border.", "Trump, April 2: And I’m ready to close it, if I have to close it. Mexico, as you know, as of yesterday, has been starting to apprehend a lot of people at their southern border coming in from Honduras and Guatemala and El Salvador. And they’ve — they’re really apprehending thousands of people. And it’s the first time, really, in decades that this has taken place. And it should have taken place a long time ago. …", "But Mexico is now stopping people coming — very easy for them to do — stopping people coming in through Mexico. Let’s see if they keep it done, if — if they keep doing that.", "“Mexico has consistently been apprehending and deporting people in large numbers since the implementation of the Southern Border Program in 2014,” Rachel Schmidtke, program associate for migration at the Mexico Institute of the Woodrow Wilson International Center for Scholars, told us.", "Then-Mexican President Enrique Peña Nieto implemented the Southern Border Program on July 7, 2014, with the goals of improving border security and migration flows, such as through temporary visitor and worker permits, and protecting migrants, including by providing medical care.", "A 2017 analysis of the program by Luis Alfredo Arriola Vega, a visiting scholar at the Baker Institute for Public Policy’s Mexico Center at Rice University, found there were many criticisms of the program, particularly regarding its goal of protecting migrants. Deportations “considerably increased,” the report noted, but the containment efforts “made routes more dangerous for people heading north.”", "“Diverse sources … agree in pointing out that PFS [Programa Frontera Sur, or Southern Border Program] effectively hardened Mexican migration policy because of the consequences associated with increased control at or near the southern border,” Arriola Vega wrote.", "We asked the White House press office for an explanation of Trump’s remarks, but we didn’t get a response. Ruiz Soto told us Trump might be referring to two arrest operations in Mexico on April 1. The Mexican newspaper El Universo reported that Mexican immigration authorities detained 338 migrants traveling in buses and 150 people on foot in the Mexican state of Chiapas, which borders Guatemala. Most of those detained were from Central American countries.", "But, again, Trump’s claim “that this is the first time in decades that Mexico is apprehending people in these numbers is false,” Schmidtke told us.", "“What has changed recently,” she said, “is that the number of Central American migrants entering Mexico through its southern border has increased, and in January and February of 2019 the National Migration Institute of Mexico began offering members of caravans a ‘fast-track’ humanitarian visa which allowed migrants to enter and travel freely in Mexico and afforded them certain protections.”", "But the Mexican government stopped issuing those humanitarian visas in February. On March 28, the Associated Press reported that Mexico’s interior secretary said the country would launch a “containment” plan for migrants at the Isthmus of Tehuantepec, the narrowest part of southern Mexico.", "Associated Press, March 28: Interior Secretary Olga Sanchez Cordero said the situation is complicated by a caravan of roughly 2,500 migrants heading north and fears of a much larger “mother caravan” possibly forming in Honduras.", "“We are going to locate our migration installations, of Federal Police and civil protection, harmoniously and with collaboration among all the federal government agencies in such a way that we have containment in the Isthmus of Tehuantepec,” she said in comments a day after meeting with U.S. Secretary of Homeland Security Kirstjen Nielsen. “It’s going to be a big change.”", "Schmidtke told us: “It’s unclear what they mean yet by ‘containment,’ but it’s clear Mexico is beginning to succumb to some pressure for the United States to increase their enforcement strategies.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]