["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "New Jersey Gov. Chris Christie speaks during the Republican Presidential Debate sponsored by Fox Business and the Wall Street Journal Nov. 10, 2015. (Getty Images)", "New Jersey Gov. Chris Christie may have gotten bumped to undercard debate, but that didn’t deter him from aiming above the GOP field and targeting the other side instead.", "Don’t worry about his fellow Republican rivals, Christie said, worry about the Democrats and Hillary Clinton, who is \"coming for your wallet.\"", "\"If anybody believes the stuff they heard from that Democratic debate a few weeks ago, there’s nothing for free,\" Christie said. \"What they forgot to tell was that they’re going to raise your tax rates to 70 or 80 percent in order to provide all of that stuff.\"", "Several of you asked us to look into whether Clinton, Bernie Sanders and Martin O’Malley want to hike up taxes to 70 or 80 percent.", "The Christie camp told us that it’s been widely reported that Sanders \"doesn’t flinch\" over returning to a 90 percent top marginal tax rate. But that’s not the same thing as a tax increase of 70 or 80 percent for the average taxpayer (Christie earned a Pants on Fire for his statement last debate that Sanders wants a 90 percent rate for ordinary Americans). Nor does that prove that Clinton and O’Malley also want a tax rate, top marginal or otherwise, of 70, 80 or 90 percent.", "None of the three Democrats have released formal tax plans, but spokespeople for Clinton and Sanders said Christie’s statement is \"ridiculous\" and \"completely false.\" Tax analysts also told us that there’s nothing in what Clinton, Sanders and O’Malley have said so far that suggest rates that high.", "The tax plans", "Here’s what each candidate has proposed so far, according to analysis by the free market-oriented Tax Foundation and the nonpartisan Tax Policy Center, as well as our own research:", "Clinton’s tax plan", "Sanders’ tax plan", "O’Malley’s tax plan", "• Makes the higher education tax credit permanent and creates a credit for out-of-pocket health care costs", "• Repeals the Cadillac tax in the Affordable Care Act", "• Creates medium-term capital gains rates between 24 and 39.6 percent (current short-term rate is 39.6 percent and long-term rate is 20 percent)", "• Creates a 15 percent tax credit for companies that share profits with workers", "• Creates a high-frequency trading tax", "• Eliminates carried interest loopholes", "• Raises the top marginal income tax rate from 39.6 percent to above 50 percent", "• Creates a net investment income surtax of 10 percent", "• Raises capital gains and dividends tax rates to the level of income taxes", "• Raises the top estate tax rate from 40 percent to 65 percent (estates under $3.5 million would be exempt)", "• Repeals the Cadillac tax in the Affordable Care Act", "• Raises the payroll tax of 12.4 percent to 12.8 percent", "• Eliminates deferral on foreign income", "• Creates a $20 per ton carbon tax", "• Creates a financial transaction tax", "• Creates a Wall Street speculation tax", "• Eliminates the cap on Social Security taxes", "• Repeals the Cadillac tax in the Affordable Care Act", "• Creates a financial transaction tax", "Compared to the Republicans’ tax plans, the Democrats’ proposals are less detailed and make minor changes to the current system, said the Tax Policy Center’s Roberton Williams. He and other experts emphasized that no Democrat has offered a detailed tax plan with specific rates, let alone rates as high as Christie says.", "\"It does not seem likely that the Democratic candidates intend to levy very high rates on the median American household,\" said Scott Greenberg, an analyst with the Tax Foundation.", "\"Christie’s claim is more of a statement of ‘there’s no such thing as free lunch,’ \" observed Bill Smith, the managing director of the tax consulting firm CBIZ MHM, adding, \"But I don’t think any of one of (the Democrats) in their wildest dreams would raise taxes to 70 or 80 percent across the board.\"", "Not exactly ‘your tax rates’", "Both Greenberg and the Williams pointed out that it’s plausible that the Democratic candidates would increase the rate on top earners. But that’s not the same thing as raising \"your tax rates to 70 or 80 percent.\"", "\"It may be necessary to raise top individual tax rates to levels such as 70 or 80 percent to fund Democratic candidates’ spending proposals without increasing the deficit or taxing middle- and low-income Americans,\" he said, referring us to a Wall Street Journal analysis of the price tag of Sanders’ proposals.", "As we’ve previously noted, Sanders has said he doesn’t think a top marginal tax rate of 90 percent would be too high. And he’s specifically proposed to raise the top rate from its current rate of 39.6 percent to above 50 percent. In other words, for individuals making more than $400,000 a year (roughly the threshold for the top 1 percent of incomes), any amount they make above $400,000 would be taxed at 50 percent. The income earned below $400,000 is taxed at lower rates.", "Sanders has also proposed to raise the top estate tax to 65 percent, which would affect estates worth more than $1 billion (there are 537 individuals with that much wealth in the United States today).", "Again, both of those top rates would affect just a tiny fraction of Americans. Sanders’ proposal to increase the federal payroll tax from 12.4 to 12.8 percent would hit everyone — but that’s nowhere near 70 or 80 percent.", "Clinton and O’Malley, for their parts, haven’t said anything specific about raising income or estate tax rates. But like Sanders, their proposals would mostly affect the wealthy and still not at the levels Christie is suggesting.", "Take for example, Clinton’s proposal to raise taxes on capital gains, the profits that come from selling an asset like a stock or property. In 2014, 42 percent of these investments, about $305 billion out of $722 billion, came from the top 0.1 percent, reported PolitiFact Virginia.", "Currently, the short-term rate is 39.6 percent (the same as income), but it decreases to 20 percent once you’ve held on to that stock for longer than a year. Clinton’s plans adds four additional brackets for investments held between one and six years. The highest rate proposed by Clinton, 39.6 percent, still doesn’t come close to Christie’s purported 70 or 80 percent.", "Our ruling", "Christie said the Democrats plan \"to raise your tax rates to 70 to 80 percent.\"", "We understand the spirit of Christie’s statement, but that doesn’t make it accurate. None of the three Democrats running have proposed raising rates to 70 or 80 percent for the average taxpayer or is it likely that they will. Christie is exaggerating the rate hikes proposed by the Democrats, the amount of people they’ll affect or both.", "We rate Christie’s claim False.", "Time, \"Transcript: Read the Full Text of the Fourth Republican Undercard Debate,\" Nov. 10, 2015", "Email interview with Samantha Smith, spokesperson for Chris Christie, Nov. 11, 2015", "Email interview with Warren Gunnels, policy director for Bernie Sanders, Nov. 11, 2015", "Email interview with Josh Schwerin, spokesperson for Hillary Clinton, Nov. 11, 2015", "Email interview with Roberton Williams, Sol Price Fellow at the Tax Policy Center, Nov. 11, 2015", "Email interview with Scott Greenberg, analyst at the Tax Foundation, Nov. 11, 2015", "Interview with Bill Smith, managing director of CBIZ MHM, Nov. 11, 2015", "PolitiFact, \"Chris Christie says Bernie Sanders’s plan is 'to raise your taxes to 90 percent',\" Oct. 28, 2015", "PolitiFact Virginia, \"Trump: Bernie Sanders wants to tax 'you people' at 90 percent,\" Oct. 20, 2015", "Tax Foundation, Comparing the 2015 Presidential Tax Reform Proposals, accessed Nov. 11, 2015", "Tax Policy Center, Major candidate tax proposals, accessed Nov. 11, 2015", "PolitiFact Virginia, \"Bernie Sanders says top 0.1% in U.S. have almost as much wealth as bottom 90%,\" Sept. 21, 2015", "Wall Street Journal, \"Here Are Hillary Clinton’s Proposed Capital-Gains Tax Rates,\" July 24, 2015", "Hillary Clinton, \"Hillary Clinton: Wall Street Should Work for Main Street, Oct. 8, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]