["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Hillary Clinton speaks during the New Hampshire Democratic Party Convention Sept. 19, 2015 in Manchester, N.H. (Photo by Scott Eisen/Getty Images)", "Recently, Hillary Clinton has been making the ultimate pocketbook argument for her candidacy: When there’s a Democrat in the White House, she says, the economy does better.", "Earlier in this campaign season, she said the stock market does better under Democrats. In a speech to the New Hampshire Democratic Party Convention on Sept. 19, Clinton went even further.", "\"I know it’s inconvenient for our Republican friends, but the facts do speak for themselves,\" the former secretary of state said. \"Economic growth is stronger under Democratic presidents. Unemployment is lower. The stock market rises faster. Businesses do better, and deficits are smaller. And one of my favorite inconvenient facts is under Republicans, recessions happen four times as frequently as under Democrats.\"", "In this fact-check, we decided to focus the claim that recessions are four times as likely under Republicans as they are under Democrats.", "A look at the numbers", "The primary research on this question -- and the source cited by the Clinton campaign when we asked -- comes from a paper written by two Princeton University economists, Alan Blinder and Mark Watson.", "The paper, published in July 2014, found that the economy tends to do better under Democratic presidents by numerous measures. The authors looked at quarterly economic data from 1947 through mid 2013 and the National Bureau of Economic Research’s official list of recessions and found that Clinton’s claim is pretty much on point.", "Since 1947, there have been 11 official recessions, totaling 49 recessionary quarters. Of those 49 quarters, just eight occurred under Democratic presidents, compared to 41 under Republicans. So, over the past 65 years, quarters in recession were about five times more common under a Republican president than under a Democratic president.", "\"Sec. Clinton is correct in her claim,\" Watson, one of the paper’s authors, told PolitiFact.", "Looking at how many recessions started under Republicans, the difference is even more stark, noted Blinder, the co-author. Of the 11 recessions since 1947, nine under Republicans, compared to just two under Democrats.", "The paper also looked further back in history to 1875 and found that the trend held, though it was less pronounced.", "But what does this mean?", "Economists emphasize, however, that Clinton’s claim needs some additional context.", "Clinton presumably wants listeners to believe that Republican policies don’t work for the economy. But the research doesn’t necessarily support this contention. There are far too many factors that contribute to the country’s economic health.", "\"Democrats would no doubt like to attribute the large (Democratic/Republican) growth gap to macroeconomic policy choices, but the data do not support such a claim,\" the Blinder-Watson paper says.", "In short, the paper found that half of the Democrats’ economic advantage is a result of factors outside the control of the White House, Congress or the Federal Reserve. The other half \"remains a mystery,\" Watson said.", "\"It seems we must look instead to several variables that are mostly ‘good luck,’ with perhaps a touch of ‘good policy,’\" the report says.", "One section of the paper (it’s on page 14) gives an overview of booms and busts since World War II. It concludes that it’s difficult to draw a direct line from a president’s fiscal policy positions to economic cycles.", "For example, defense spending led to prosperity during the Korean War under Democratic President Harry Truman. His successor, Republican Dwight D. Eisenhower, ended the war, and thus the prosperity turned into recession.", "Energy price shocks are another important factor, since they can produce economic downturns. Unfortunately for the Republicans, shocks hit during the presidencies of Richard Nixon, Gerald Ford and George W. Bush, compared to just once under a Democrat, Jimmy Carter.", "The authors add that Democratic presidents have benefited from higher \"total factor productivity,\" which is essentially a measure of technological growth and dynamism. A clear example is the technology boom under Bill Clinton, which produced significant productivity gains. The authors acknowledge that it’s unclear why this has been the case under Democratic presidents.", "And sometimes the fiscal policy of a previous administration bleeds into the next one -- so just because a recession happened when one president was in office, the prior administration might bear some of the responsibility. While Democratic President Lyndon Johnson saw no recessions, for instance, his administration had to implement anti-inflation policies near the end of his tenure. Those policies contributed to a recession early on in Nixon’s term.", "Because of all the factors at play, assigning credit for economic results is tricky, said Tara Sinclair, a George Washington University professor and chief economist for the job site Indeed.com. In fact, it’s possible that causation actually runs the other way.", "\"It's possible that the public votes in response to economic conditions,\" she added, \"meaning political cycles can follow economic cycles.\"", "Our ruling", "Clinton said that \"under Republicans, recessions happen four times as frequently as under Democrats.\"", "The numbers back up Clinton’s claim since World War II: Of the 49 quarters in recession since 1947, eight occurred under Democrats, while 41 occurred under Republicans.", "It’s important to note, however, that many factors contribute to general well-being of the economy, so one shouldn’t treat Clinton’s implication -- that Democratic presidencies are better for the economy -- with irrational exuberance.", "Clinton is right on the numbers, but her claim needs additional information to put its implication into the proper context. We rate her claim Mostly True.", "C-SPAN, 2015 New Hampshire Democratic Party State Convention, Sept. 19, 2015", "National Bureau of Economic Research, \"U.S. Business Cycle Expansions and Contractions,\" accessed Sept. 22, 2015", "Princeton University, \"Presidents and the U.S. Economy: An Econometric Exploration,\" July 2014", "PolitiFact, \"Hillary Clinton says the stock market has done better under Democratic presidents,\" Aug. 4, 2015", "Email interview, Mark Watson, Princeton University economist, Sept. 21, 2015", "Email interview, Alan Blinder, Princeton University economist, Sept. 22, 2015", "Email interview, Tara Sinclair, economist with George Washington University and Indeed.com, Sept. 21, 2015", "Email interview, Clinton spokesman Josh Schwerin, Sept. 22, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]