["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Images on the Internet of Parkland school shooting survivor Emma Gonzalez ripping up the U.S. Constitution gained lots of traction on social media, but the pictures were manipulated.", "Gonzalez 18, has been the target of many conspiracy theories since the Feb. 14 shooting at Marjory Stoneman Douglas High School that left 17 people dead.", "The latest example came as hundreds of thousands of people rallied at March for Our Lives events March 24 in Washington and other cities around the country. Facebook groups such as Gun Owners of Merica and Twitter accounts circulated images and GIFs of Gonzalez tearing down the middle of the U.S. Constitution.", "#Vorwärts! pic.twitter.com/ffbcm6xjX3", "Twitter users, including Don Moynihan, a professor of government at University of Wisconsin-Madison, quickly pointed out that the images and GIFs were doctored.", "Justy a sample of what NRA supporters are doing to teenagers who survived a massacre (real picture on the right). pic.twitter.com/czX7IHD8ur", "The original image was taken from a video by Teen Vogue that appeared alongside an op-ed written by Gonzalez entitled \"Why This Generation Needs Gun Control.\"", "In the real video, Gonzalez is ripping up a gun-range target poster.", "The fact that we even have to clarify this is proof of how democracy continues to be fractured by people who manipulate and fabricate the truth. pic.twitter.com/cpSXnvLxdA", "One of the accounts sharing the fake images — \"Linda the NRA Supporter\" — was suspended sometime after the posts.", "But multiple other Twitter accounts (including Adam Baldwin from the tweet above) have shared the posts in the name of political satire.", "Gab, \"A free speech social network,\" tweeted the doctored GIF of Gonzalez ripping what looks like the Constitution, and then declared it was clearly \"satire\" shortly after.", "Despite this admission, the original post from Gab was retweeted more than 1,500 times and liked over 3,000 times.", "These fake images of Gonzalez ripping up the U.S. Constitution are doctored. We rate this Pants on Fire!", "Washington Post, A fake photo of Emma González went viral on the far right, where Parkland teens are villains, March 26", "Mashable, No, Emma Gonzalez did not rip up the U.S. Constitution, March 26", "Tweets, Don Moynihan, March 24", "Teen Vogue, Emma Gonzalez on Why This Generation Needs Gun Control, March 23", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]