["This Facebook post, published on November 9, 2019, includes a composite image of an electronic air-ticket and Gotabaya Rajapaksa,  the Sri Lanka Podujana Party presidential poll candidate, who won the country’s recent poll and was sworn in to office November 17.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language text superimposed on the image translates to English as: “Gota accepts defeat\n\t\"Basil stops spending on the election\n\t\"Couple decides to leave the country before court cases begin\n\tAir tickets reserved to flee to America via Dubai\n\tFuture of the flower bud uncertain”.", "“Gota” is in reference to Gotabaya Rajapaksa.", "“Basil” is in reference to Basil Rajapaksa -- the brother of Gotabaya Rajapaksa and former Minister of Economic Affairs in Sri Lanka. A flower bud is the party symbol of SLPP as seen here.", "The image also features a news item header from a local news website ColomboXNews story, which translates into English as:", "“All ready for Gota to flee to America...Here are the details”", "The post's Sinhala translates to English as:", "“All the flower bud fans are a lost cause”", "The same image and similar claims have been made shared on Facebook, for example here, here and here.", "The claim is false. The details in the air ticket do not correspond to a real flight booking in Rajapaksa’s name.", "Below is a screenshot of the electronic air-ticket being circulated in the misleading Facebook posts, AFP has highlighted the passenger name and booking reference:", "Using the passenger name and booking reference highlighted in red above, AFP attempted to verify the authenticity of the air-ticket using the Emirates airline mobile app.", "An error message appeared, indicating no booking linked to the information that appears on the purported e-ticket in the misleading post. Below is a screenshot of the error message:", "The passenger name on the purported e-ticket is given as: RAJAPAKSA/NANDASENAMR", "But Rajapaksa’s full name as it appears in the passport, as seen here in a tweet published by his nephew Namal Rajapaksa on November 9, 2019, is actually: RAJAPAKSA / NANDASENA GOTABAYA.", "pic.twitter.com/J8L1rJXHia", "Below is a screenshot comparison of the name as it appears in the ticket (L) and the name as it appears on the passport. AFP has highlighted the name in both images for comparison:", "AFP also scanned the barcode that appears in the top right corner of the e-ticket alongside the ticket number on QR & Barcode reader app, but found no results.", "Below is a screenshot of the barcode, highlighted in red by AFP:", "Rajapaksa’s attorney, President's Counsel Ali Sabry,  told a press conference that the image of a purported air ticket circulating on social media was not real.", "Here is the full-video of the press conference held by a team of lawyers representing candidate Rajapaksa on November 10, 2019, during which President’s Counsel Ali Sabry dismissed the authenticity of the air-ticket circulating on social media.", "From mark 1:00:56 - 1:1:04 of the video, PC Sabry says: “...even the air ticket is total false, the air ticket that is being circulated…”", "Gotabaya Rajapaksa was sworn in after winning a landslide in Sri Lanka’s presidential election on November 15. Here is an AFP report on the polls.", "Gotabaya Rajapaksa has been the subject of repeated attacks over his US citizenship -- which he says he has renounced -- as Sri Lanka bars duel-nationals from holding office. Here is an AFP report on the issue.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]