["The images were published here on Facebook on July 28, 2020. The post has been shared more than 3,300 times.", "The post’s Burmese-language caption translates to English as: “Good news: 43 countries signed the recognition of Mother Suu as the mother of the world”.", "“Delightfully sharing the good news that the title of ‘Mother of the World’ is signed by 43 countries.  #When the love is true from the giver's side, the taker can feel it in their heart. Daw Aung Sann Suu Kyi.”", "The post includes a photo of Aung San Suu Kyi alongside two images of a coin. One coin contains an image of her alongside an engraving in English that reads: “Mother of peace. Aung San Suu Kyi”. Suu Kyi's name can also be seen written in Burmese in purple ink.", "The photos of the coin were posted on Facebook here and here and on blogs here and here alongside a similar claim.", "The claim, however, is false.", "A reverse image search on Google found the photos show a coin created by a Burmese artist. They were previously posted on this Facebook page for artist Aung Min on June 22, 2020.", "The post’s caption states in part: “When the love is true from the giver's side, the taker can feel it in their heart. - Daw Aung San Suu Kyi”.", "The artist also wrote in English:\n\t“UNIQUE\n\t75\n\tMOTHER OF PEACE\n\tHAPPY BIRTHDAY\n\t19 JUNE 2020”.", "Suu Kyi celebrated her 75th birthday on June 19, 2020, according to reports published by Burmese media outlets The Myanmar Times here and The Irrawaddy here.", "Peacock, a popular iconography in Myanmar, is also used as a symbol of Suu Kyi’s party, the National League for Democracy.", "Below are two sets of screenshot comparison of the images in the misleading post (L) and the pictures in Aung Min’s post (R):", "The artworks were also published here July 29, 2019.", "As of August 2020, there was no international award for “mother of the world”. A keyword search in both Burmese and English found no credible sources for the purported award.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]