["About this rating", "On Jan. 15, 2021, the website Mediaite published an article positing that CNN anchor Don Lemon’s remarks that voters of incumbent U.S. President Donald Trump were on the same side as Nazis, the Klan, and the violent mob that stormed the Capitol, was an indictment of more than 74 million Americans.", "In that article, the writer Tommy Christopher described Lemon as “openly Black.”", "Don Lemon’s Remarks About Trump Voters and The Klan and Nazis Are a Slap in the Face to 74 Million Americans", "CNN anchor Don Lemon sparked intense reaction this week with remarks about people who voted for President Donald Trump in which he indicted them as “on the same side” as Nazis, the Klan, and violent insurrectionists. Those remarks are a slap in the face to the 74 million Americans who voted for Trump.", "I don’t want to sugarcoat this, what Don Lemon said is extremely disturbing. Colleague Chris Cuomo was trying to argue — devil’s advocate-style — that not all Trump voters should be lumped in with the racist insurrectionists who attacked the Capitol last week.", "“Now what you hear is, well, you can’t say that everybody who voted for Trump is like the people who went into the capitol. Response,” Cuomo said.", "Lemon — who is openly Black — responded by telling Cuomo that “if you are on that side you need to think about the side you’re on. I’m never on the side of the Klan. I am never — principled people, conservative or liberal never on the Klan side, principled people, conservative or liberal, never on the Nazi side.”", "The writer continued later in the article:", "But that’s not the most important question in determining whether Lemon should apologize. Something can be true and still be messed up to say.", "That’s the reason I mentioned that Don Lemon is openly Black because that fact adds to the sting of an already painful statement — pain that was evident not just in the response from these two prominent Republicans, but also in Cuomo’s devil’s advocacy, and in his attempt the following night to separate Trump voters from the Capitol insurrectionists.", "An editor’s note below the article stated, “The author’s use of the phrase 'openly Black' was satirical. You can read a full explanation of the reference here.”", "Lemon and Chris Cuomo reacted to the story on-air, cracking up at the use of the phrase, with Lemon calling it “brilliant.”", "In a follow-up article the author expanded on his use of the phrase “openly black”:", "The first part of the column was written in the satirical voice of someone criticizing Lemon for his remarks, only to later flip around in support of Lemon. And in that column, I referred to Mr. Lemon as “openly Black,” a joke that I’ve used many times before as a way to mock white reactionaries who treat other people’s immutable identities as though they were deliberate attempts to offend, and to cut through the thin subtexts they often use.", "Ironically, I was inspired to use the bit by a conservative website that would incessantly I.D. media figures like Don Lemon as “openly gay” in a derogatory manner, but I can’t claim credit for the premise. Stephen Colbert also used it as part of his Colbert Report character’s absurd lexicon of phrases, and as I was reminded when the joke blew up on social media yesterday, the legendary George Carlin riffed on the phrase as well.", "For background, here is why we sometimes write about satire/humor.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]