["Last week, right-wing writer Renee Lynn tweeted a video and claimed a Hindu woman was deceived into marrying a Muslim man. Lynn has been found spreading misinformation on several occasions. “Another Hindu Daughter deceived in Islam Marriage. Father puts his Turban on his Daughter’s feet begging her not to marry but she did not accept. Just wait & watch, she will regret it because right after marriage she will be killed,” she wrote.", "Another Hindu Daughter deceived in Islam Marriage. Father puts his Turban on his Daughter’s feet begging her not to marry but she did not accept. Just wait & watch, she will regret it because right after marriage she will be killed. If lucky she might manage to escape, Guarantee! pic.twitter.com/0XR88W4WSn", "— Renee Lynn (@Voice_For_India) October 3, 2020", "Several users posted the clip on social media platforms, terming it a case of ‘love jihad’. Some took this as an opportunity to suggest that it’s better to not have any children than one who marries a Muslim. Rajesh Jindal, Jitendra Pratap Singh, Deepak Kandwal and Ishwar Vashist were some of the prominent names that made these statements. A user named Karunesh Shukla wrote, “This stupid girl does not know, forget an apology, she will be forced to seek halala from many &*%$ old men.”", "This slideshow requires JavaScript.", "The video is also viral on Facebook as a case of ‘love jihad’.", "We found that a Facebook page called ‘Royal Raika’ had spoken about the video in a Facebook live on October 3 and another post shared on October 4. The page said that the incident was being misreported with a false ‘love jihad’ spin to malign a particular community. Alt News contacted the admin of the page who informed that both the parties getting married belong to the Rabari community and the claims being made on social media are completely false. Rabaris are a pastoral nomadic community from Rajasthan.", "Based on this information, we reached out to Brajesh Soni, ASP of Rajasthan’s Pali district. “This is all fake news. A missing persons report had been filed after the disappearance of a woman named Sita. Following the investigation, the police were able to make contact with the woman. It turned out that she had eloped with her lover, a man named Lakharam. Both are from the same community and went on to get married as well.”", "The ASP also sent us a copy of Sita’s written statement. According to the statement, her parents got her married to Gulab Dewasi when she was two years old. However, she was not in love with Gulab. It was around a year ago that met and befriended Lakharam and they stayed in touch via phone calls. The pair decided to get married two months ago. On August 28, Sita eloped with Lakharam without informing her family members. They subsequently met a lawyer and got married in court. She has mentioned in her statement that she is an adult and wants to live with Lakharam.", "Alt News then spoke to the Rajasthan Cyber ​​Cell and was able to confirm that the marriage was not interfaith. Sita and Lakharam are currently residing in Pune. Someone shot a clip during their marriage ceremony, which has now gone viral with a false communal spin.", "We also tried to reach out to the couple and heard back from Lakharam. “We belong to the same caste and everything had been agreed amongst our community as well. We have been married for a month now. This video has gone viral with a completely false claim. When we were getting married in court, Sita’s father was just joking around with her not to get married. And someone made this clip viral in a different context. People are also saying that the woman’s father committed suicide. This is wrong. Everything is fine. The people of our society also agreed. There is no such thing,” he said. Lakharam also showed us a screenshot of the message being shared on WhatsApp, claiming that Sita’s father committed suicide.", "We noticed that social media users were also claiming that a Hindu woman is bringing humiliation to herself and her father through this marriage, due to which her father committed suicide. One such post has been shared about 5,000 times.", "A clip of consensual court marriage is being shared with a false ‘love jihad’ angle. Both the woman and her husband hail from the Rabari (Hindu) community of Rajasthan, and there is no communal or inter-caste angle to their relationship. In a similar incident from a few days ago, pictures of a domestic violence victim in Bangladesh were falsely shared as a case of love-jihad in Kerala.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]