["About this rating", "In late January 2019, amidst a continuing impasse between Democrats and Republicans over what steps should be taken to secure the U.S.-Mexico border, an editorial titled \"Police Are Now Seeking the Removal of Nancy Pelosi\" was published on the website Law Enforcement Today.", "As speaker of the House, Pelosi (D-California) is the leader of the Democrats' opposition to President Donald Trump's proposal to erect a border wall to stop illegal immigration into the U.S. from Mexico and Central America.", "Law Enforcement Today is a news and opinion website for and about law enforcement officers. Its editor is Jim McNeff, a former police lieutenant with the Fountain Valley Police Department in Orange County, California. The 26 January 2019 editorial, penned by Marjorie Greene (who regularly contributes articles to right-leaning partisan websites), argued that Pelosi is guilty of \"treasonous behavior\" for supporting \"sanctuary cities\" (metropolitan areas whose ordinances limit cooperation between local law enforcement and federal immigration authorities).", "Greene expressed particular concern for the impact of Pelosi's immigration policies on \"LEOs\" (law enforcement officers), whose lives she said are endangered by those policies.", "\"Nancy Pelosi’s Sanctuary Policies that provide aid, comfort, and protection to illegal aliens make it extremely difficult for LEO’s to preform [sic] their jobs, which they took an oath and swore to uphold and enforce the laws of this land,\" Greene wrote.", "\"Nancy Pelosi clearly chooses illegals over ICE agents. Her support of sanctuary and protection for illegal criminals is truly unreal for an elected representative of the American people, and treasonous behavior puts ICE agents in danger and makes their ability to do their jobs extremely difficult.\"", "Greene's commentary focused on the case of Newman, California, police officer Cpl. Ronil Singh, who was murdered during a traffic stop on 26 December 2018. The man charged with the killing, Gustavo Perez Arriaga, has been identified as an undocumented immigrant.", "\"Do you know what Nancy Pelosi’s response to the murder of Corporal Singh was?\" Greene wrote.\n\"Nothing. Not a peep. No response to the murder of a legal immigrant who was serving the people of California as a police officer. Zero.\"", "Greene continued: \"At this point, can we just say that Nancy Pelosi seems to care less about LEO’s lives? To her Blue Lives don’t matter. Only Illegal Lives do ... or should we say illegal votes. I will go further. Nancy Pelosi needs to be arrested for treason!\"", "For the record, Pelosi did offer a public response to Singh's murder during a 10 January press conference, calling it \"tragic,\" though in doing so she placed it in the broader context of what she termed \"the tragic situation at the border\":", "Q: Democrats are calling this a manufactured crisis as far as the border is concerned.", "SPEAKER PELOSI. Yes.", "Q: Would you say that this is a manufactured crisis ... to Corporal Ronil Singh's family, who has ended up losing him to an illegal immigrant who ended up shooting him over in your state? Would you say this to families who have lost relatives to heroin overdoses, because, obviously, the drug, 90 percent of the time, came from Mexico? What would you say to families like that?", "SPEAKER PELOSI. Well, what I would say to families like that is what I say to the President regularly: These are tragic situations. There's a tragic situation at the border. Two little children died in the custody of the Border Patrol.", "But the plural of anecdote is not data. And as painful and horrible one death is, more than we should be able to bear, whether it's the corporal or whether it's the children.", "But the fact is, we have to have public policy that secures our border, and what the President is proposing will not eliminate those possibilities.", "We won't dwell on Greene's argument that Pelosi ought to be arrested and impeached for treason (which is defined in the Constitution as \"levying war against [the United States], or in adhering to [its] enemies, giving them aid and comfort\") other than to observe that it's based on dubious assertions such as the following:", "Nancy Pelosi is a criminal, guilty of treason by refusing to lead her political party to fund the wall and border security measures that would protect our national security.", "Nancy Pelosi is a criminal guilty of treason by being a key member of a tyrannical government that has enslaved the American people into $21 trillion dollars in debt, which China owns most of our debt.", "Nancy Pelosi is a traitor to the American people who pay her paycheck and expenses for her service, security, staff, and travel, while she takes our hard earned tax dollars to send billions of our hard earned tax dollars to foreign governments, yet refuses to fund our border wall of $5.7 billion for our national security. Particularly she wants to send $10 billion to Mexico this year, yet refuses to meet with our president for lunch to work out a deal for our safety and government budget.", "It is Greene's right to state her opinions, and Law Enforcement Today's right to publish them. It is also their right to launch a WhiteHouse.gov petition calling for Pelosi's removal \"for crimes of treason,\" which has garnered more than 100,000 signatures.", "What our readers have called into question, however, is the validity of the headline of Greene's editorial, which has been widely disseminated via social media. One reader wrote to ask: \"I saw on a Facebook post [that] police are looking to impeach Nancy Pelosi. Is this true?\"", "It should be noted that nowhere in the body of the article does the author cite any police organizations who have taken the position that Pelosi should be impeached. And while we can be reasonably sure that at least some law enforcement personnel agree with Greene's argument and/or have signed the White House petition, we further note that neither Greene nor Law Enforcement Today can claim to speak for the nation's police officers collectively. Some major law enforcement groups, including the National Association of Police Organizations (NAPO), have consistently lobbied against the sanctuary cities movement, but we weren't able to find statements from any of those groups calling for Pelosi's removal from office.", "NAPO didn't respond to our request for comment in time for publication, but we did receive the following statement from Peace Officers Research Association of California (PORAC) President Brian Marvel:", "We are heartbroken over the loss of Corporal Singh – as we are with the other brave law enforcement officers here in California and across the nation who have lost their lives in line of duty.", "Attacks on the police and other first responders have gotten out of hand and need to be stopped. Removing Speaker Pelosi or any other Member of Congress is not the answer. Rather focusing their and other lawmakers’ attention on this crisis is.", "We reached out to Marjorie Greene and Law Enforcement Today for comment, but neither responded to our requests.", "Greene, Marjorie.   \"Police Are Now Seeking the Removal of Nancy Pelosi.\"\r\n    Law Enforcement Today.   26 January 2019.", "Jacobo, Julia.   \"Man Suspected of Killing California Police Officer Ronil Singh Charged with Murder.\"\r\n    ABC News.   2 January 2019.", "National Association of Police Organizations.   \"The Washington Report: NAPO Supports Sanctuary Cities Amendment.\"\r\n    21 February 2018.", "Pelosi.House.gov.   \"Transcript of Pelosi Weekly Press Conference Today.\"\r\n    10 January 2019.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]