["The misleading article was published here on November 7, 2018.", "Its Sinhala-language headline translates to English as: “The mermaid found from the Hawaii and Egypt shores”.", "Below is a screenshot of the misleading article:", "The Sinhala-language report translates in part to English as: “According to folklore a mermaid is a creature with a female head, a female torso and a fish tail. There are many tales about this, around the world in many cultures. There are also many stories about the accuracy of these folklores heard from many parts of the world. Although there are varying opinions about the stories, we have brought you today some photographs that are circulating widely on the internet.”", "The article further notes that they are “unable to verify if she is still alive or not, although she looks alive in the pictures.”", "The article was shared here by a public Facebook page with more than 308,000 followers on January 1, 2020. The post has been shared more than 2,900 times.", "This claim in the article is false; the photos show props created by the award-winning American special effects make-up artist Joel Harlow for the movie “Pirates of the Caribbean: On Stranger Tides”.", "A reverse image search on Google found this article titled ‘Mermaid bodies by Joel harlow for Pirates of the Caribbean On Stranger Tides’, published by Entertainment news website Beyond the Marquee on June 3, 2019.", "Below is a screenshot of the report:", "A keyword search found this video published on Harlow's official YouTube page “Joel Harlow Designs - morphology fx inc.”. It shows Harlow and his team creating the silicone mermaid figure.", "The completed sculpture seen at the four-minute ten-second mark in the video corresponds with the second photo in the misleading article.", "Below is a screenshot comparison of the second photos in the misleading post (L) and the video on Harlow’s YouTube channel (R):", "Similar photos of the silicone model have been published under “Mermaids” in the “Pirates of the Caribbean: On Stranger Tides” section of Harlow’s website Morphology FX.", "Below is a screenshot of his website:", "A further keyword search on Google found this discussion on Mernetwork, an online forum on mermaid costume designs.", "In December 2012, user Aquatarian posted a series of photos he describes as “stills from the movie or different parts of the special features from the movie” which features several images in the misleading Facebook post.", "Below is a screenshot of the photos shared on the forum:", "Below are screenshot comparisons of the first and third images in the misleading article (L) and images shared in the forum (R):", "The article also features a fifth image that appears to show a mermaid skeleton.", "A reverse image search on Google found this blog run by the design company DesignCrowd.", "The skeleton is a “manipulated model” submitted by US-based graphic designer The1Calleddano for a competition run by DesignCrowd, that asked contestants to submit a doctored image of a hoax archaeological discovery.", "Below is a screenshot of the DesignCrowd website describing the image as “artwork” titled “Mermaid remains”, credited to The1Calleddano.", "Below is a screenshot comparison of the image in the misleading Facebook post (L) and the doctored image (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]