["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Lt. Gov. Rebecca Kleefisch says the state's per-inmate costs are among the cheapest in the nation.", "How much it costs to detain an inmate in each state prison system for a year sounds like a relatively easy question to answer.", "It isn’t.", "Appearing on the Jerry Bader Show in April, Lt. Gov. Rebecca Kleefisch responded to criticism Bader said he had received from listeners after he read on the air an opinion piece that ran in the Milwaukee Journal Sentinel. The piece discussed machining classes offered to inmates.", "Bader told Kleefisch that he had received a number of emails from listeners who felt that her opinion piece on former inmates’ reentry to society gave deference to people who got into trouble rather than people who stayed out of prison.", "Kleefisch responded that the vast majority of people who go to prison will return to their communities.", "\"Right now, our corrections department charges taxpayers between $30,000 and $40,000 a year per person we lock up,\" she said. \"That’s actually cheap when you compare us to the rest of the country.\"", "She followed that statement by asking rhetorically whether it’s better for taxpayers to return people to the community \"ready to succeed and become a taxpayer themselves\" or let them depend on government programs or commit another crime and go back to prison at a cost to taxpayers.", "We wondered if she was right on the numbers and how Wisconsin compares to other states.", "Kleefisch’s statement can be divided into two parts:", "That the Wisconsin DOC charges taxpayers between $30,000 and $40,000 per year per inmate.", "That Wisconsin is \"cheap\" compared to the rest of the country.", "On Wisconsin’s cost per inmate per year", "We asked Kleefisch’s office for evidence of this claim.", "First, they cited a fact sheet from the Wisconsin Department of Corrections that lists the cost for adult male inmates at $32,394.71 and the cost for adult female inmates at $39,724.00 in the year from July 1, 2014 to June 30, 2015.", "The Department of Corrections told us they calculate this number by adding the direct facility costs, including staff salary and benefits; food; utilities; clothing; repair and maintenance costs; other infrastructure costs, and \"allocated central office costs.\"", "On a basic level, the numbers from the DOC fall within the range Kleefisch cited.", "How Wisconsin compares", "Things get more complex when you try to compare prison costs between states.", "This is primarily because budgeting practices are not uniform and, as far as we found, there are few organizations that do an apples-to-apples comparison. Finally, the one study we were repeatedly directed to uses data from 2010.", "Kleefisch’s office and other sources we contacted pointed us to a 2012 study from the Vera Institute of Justice, a nonprofit group that says it seeks to build and improve justice systems.", "The study looks at corrections department data from 40 states, including Wisconsin, that responded to the organization’s surveys.", "The Vera Institute included in its analysis the costs associated with corrections systems that fall outside the corrections budget in each state. Those additional costs can include underfunded contributions to retiree health care for corrections employees, state contributions to retiree health care on behalf of their corrections department workers, employee benefits and more.", "Including those, Vera researchers found that \"the total price to taxpayers was $39 billion, $5.4 billion more than the $33.5 billion reflected in corrections budgets alone.\"", "Wisconsin had relatively few costs that fell outside the DOC budget in 2010 but that wasn’t true of all states.", "Kleefisch's office argued Wisconsin fares better than other states, since the department fully funds its employee retirement while other states do not. Vera says estimates of underfunded retiree pension and health care benefits are included in the total per-inmate costs.", "If you rank the states from highest average annual per-inmate cost to lowest using the Vera Institute’s numbers, Wisconsin comes in 14th from the top at $37,994. Wisconsin comes in higher than 26 of the 40 states in the study but lower than some of the top-spending states, including New York, which came in first at $60,076.", "Kleefisch Chief of Staff Daniel Suhr noted in an email that his boss meant \"cheap compared to other states, not cheap compared to a particular mean or median\" and noted that Wisconsin comes in lower than New York, California and Illinois.", "Kleefisch’s statement, however, compared Wisconsin to \"the rest of the country.\"", "That said, the study itself, one of its authors and others, cautioned against comparing the states.", "First, the fact that 10 states are not represented in the study is a \"big limitation,\" Chris Henrichson, research director for the Center on Sentencing and Corrections at the Vera Institute, said in an email.", "In addition, the information is a bit dated. Experts disagreed on whether it could accurately be applied to today.", "Henrichson said he expected \"rankings\" to shift somewhat, most likely in states where the inmate populations have changed the most. That said, he did not expect a state at the bottom of the chart to move to the top.", "Experts also questioned generally whether it is possible to account for all the differences between state corrections systems and their budgeting practices.", "Our rating", "Kleefisch said that the state Department of Corrections \"charges taxpayers between $30,000 and $40,000 a year per person we lock up. That's actually cheap, when you compare us to the rest of the country.\"", "The annual per-inmate cost from DOC does fall within the range she cited.", "While Kleefisch labeled Wisconsin as cheap compared to other states, the best available numbers suggest the state, at best, is more in the middle of the pack than close to the bottom.", "For a statement that is partially accurate but leaves out important details or takes things out of context, our rating is Half True.", "WTAQ, The Jerry Bader Show, April 20, 2016", "Vera Institute of Justice, The Price of Prisons: What Incarceration Costs Taxpayers, January 2012, updated July 2012", "Milwaukee Journal Sentinel, The power of second chances, April 7, 2016", "Wisconsin Department of Corrections Division of Adult Institutions, Corrections at a Glance, May 2016", "Interview, Chris Henrichson, research director for the Center on Sentencing and Corrections at the Vera Institute, June 14, 2016", "Emails, Chris Henrichson, research director for the Center on Sentencing and Corrections at the Vera Institute, June 2016", "Interview, John Hicks, National Association of State Budget Officers, June 2016", "Interview, Walter Dickey, University of Wisconsin Law School, June 24, 2016", "Emails, Daniel Suhr, chief of staff to Lt. Gov. Rebecca Kleefisch, May and June 2016", "Emails, Tristan D. Cook, Wisconsin Department of Corrections director of public affairs, June 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]