["About this rating", "In 2013, an entertainment website published a fictitious article that claimed Fox News had been reclassified as \"satire\" by the Federal Communications Commission (FCC), and that the network would start displaying a disclaimer reading: \"This is not a valid news source.\" While that fictitious article was clearly not genuine news, the general idea that Fox News was not an \"accredited news station\" has often been repeated.", "In January 2019, we were notified about a meme claiming that Fox News changed its accreditation from \"news\" to \"entertainment,\" and that it had no legal obligation to report the facts:", "This may not make you happy;", "Fox News it not an accredited news station. They have changed their accreditation to \"entertainment.\" They legally don't have to provide any facts in their reporting. Fox News is in the same category as Saturday Night Live, Laugh-In, and Swamp People.", "You don't have to believe me, look it up yourself.", "While the term \"accredited news station\" may sound official, no regulatory body even exists that would accredit Fox News (or CNN, MSNBC, etc.) as a \"news\" station. In addition, a spokesperson for Fox News said the meme's claims were false.", "Among other issues, the meme is a bit nonsensical because it conflates over-the-air broadcasts and cable broadcasts, as well as Fox Broadcasting Company and Fox News Channel.", "The Fox Broadcasting Company is an over-the-air television network licensed by the FCC. This is the station where you find programming such as \"The Simpsons. The Fox News Network is a cable news channel. The latter is where you'd find programming such as \"Fox & Friends\" and \"Hannity.\" While the FCC licenses and regulates over-the-air broadcasts, it has no authority over cable news channels.", "A spokesperson for the FCC told us that, \"We do not have any rules or licensing requirements in which a cable channel might categorize itself as news vs. entertainment.\"", "John Bergmayer, senior counsel at Public Knowledge, an intellectual property group based in Washington, D.C., talked to the New York Daily News in 2017 after the FCC received hundreds of complaints about another cable news channel, CNN. Bergmayer explained that because cable news channels are run by private providers, the FCC has no authority to control the programming:", "The FCC regulates broadcast networks, since the airwaves are free and public. But cable channels, which rely on subscribers, viewers and advertisers, are beyond government control. Since cable runs through private providers, the FCC plays no role in issuing or revoking licenses, and it has no say on what the channels can air.", "\"The hook for (broadcast) content regulation ... is the fact that broadcasters have government-issued licenses that allow them to use the airwaves, and that it's freely available to anyone with a receiver,\" said John Bergmayer, senior counsel at Public Knowledge, an intellectual property group based in Washington, D.C.", "\"This doesn't apply to cable networks.\"", "The FCC does have regulations regarding the distribution of false information, but again, this only applies to over-the-air programs on networks such as ABC, CBS, NBC, or Fox Broadcasting (but not the Fox News Channel). Furthermore, the offense would have to be pretty egregious and well-documented in order for the FCC to step in.", "The FCC explains on its website that it has a \"very narrow scope\" to police news programs because it is prohibited by law from \"engaging in censorship or infringing on First Amendment rights of the press.\"", "The FCC's authority to respond to these complaints is narrow in scope, and the agency is prohibited by law from engaging in censorship or infringing on First Amendment rights of the press. Moreover, the FCC cannot interfere with a broadcaster's selection and presentation of news or commentary.", "[...]", "The FCC is prohibited by law from engaging in censorship or infringing on First Amendment rights of the press. It is, however, illegal for broadcasters to intentionally distort the news, and the FCC may act on complaints if there is documented evidence of such behavior from persons with direct personal knowledge. For more information, please see our consumer guide, Complaints About Broadcast Journalism.", "Fox News (as well as CNN and MSNBC) is not an accredited news station because no regulatory body exists in the United States that has the authority to make such a classification.", "But while the meme is false, it is reminiscent of a genuine news story from 2017, when Ofcom, the United Kingdom's communications regulator, ruled that the shows \"Hannity\" and \"Tucker Carlson Tonight\" had breached their impartiality rules while reporting on the Manchester Arena bombing and President Donald Trump's travel ban:", "Ofcom's ruling concluded there was \"no reflection of the views of the UK government or any of the authorities or people criticised\" and the presenter \"did not challenge the views of his contributors; instead, he reinforced their views.\"", "Ofcom found the programme breached rules 5.9, 5.11 and 5.12 of the British broadcasting code. These relate to adequate representation of alternative views on discussions programmes, due impartiality on matters of major political or industrial controversy, and including a wide range of significant views when dealing with major political or industrial controversy.", "We should note this ruling only pertained to specific reporting on two Fox News shows and not to the network as a whole. The ruling was also made after Sky had already pulled Fox News from the airwaves and therefore did not result in fines or in official changes to the classification of the network.", "In sum, cable news networks aren't accredited as \"news\" by any official regulatory body in the United States, and the above meme is false on its face.", "Ruddick, Graham.   \"Fox News Shows Broke UK TV Impartiality Rules, Ofcom Finds.\"             The Guardian.   6 November 2017.", "Silverstein, Jason.   \"TV Viewers Keep Asking the FCC to Punish CNN for Trump Coverage Even Though it Can't.\"     New York Daily News.   13 September 2017.", "FCC.   \"Complaints About Broadcast Journalism.\"     27 December 2019.", "Joyella, Mark.   \"Sorry, Mr. President, You Can't Challenge NBC's 'License' Over 'Fake News.'\"     Forbes.   11 October 2017.", "Nelson, Jacob.   \"What is Fox News? Researchers Want to Know.\"     Columbia Journalism Review.   23 January 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]