["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When the topic turned to immigration in the Oct. 19, 2016, presidential debate, Donald Trump suggested that Hillary Clinton supported his signature proposal: a massive wall on the U.S-Mexico border.", "\"Hillary Clinton wanted the wall. Hillary Clinton fought for the wall, in 2006 or thereabouts,\" he said. \"Now, she never gets anything done, so naturally the wall wasn’t built. But Hillary Clinton wanted the wall.\"", "Clinton, alluding to her time as a U.S. senator from New York, responded by saying she voted for border security, which she said included a wall in \"some limited\" places but also measures such as new technology.", "So, did Clinton support the type of wall Trump wants?", "Wall to wall", "PolitiFact National has examined how Trump plans to build, and pay for, the wall.", "Trump has said the wall could cost $8 billion to $12 billion, be made of precast concrete, and rise 35 to 40 feet, or 50 feet, or higher. He’s said the wall doesn’t need to run the nearly 2,000 miles of the border, but about 1,000 miles because of natural barriers.", "As Trump suggested in the debate, Clinton did vote for a barrier. But it was not to the extent he supports.", "As we previously reported, the Trump campaign cited Clinton’s vote for the Secure Fence Act of 2006, signed into law by President George W. Bush, which authorized about 700 miles of fencing to be installed along the country’s southern border, along with other security measures. It was the beginning of an attempt to pass comprehensive immigration reform.\n\nSo it’s fair to say Clinton supported a barrier. For our purposes, the differences between a wall and a fence in this claim are not significant — both block people.\n\nBut the fence Clinton backed is not as extensive as the wall Trump is promoting. And in his phrasing, Trump equated the two.", "The Associated Press has reported that the fencing, placed largely in urban areas, is not the type of solid wall that Trump has pledged to construct at Mexico’s expense. The fence has miles-long gaps and gates built in to allow landowners access to their property on the south side of the fencing. Immigrants have been known to go over and around the fence.", "Indeed, Trump himself has said the fencing \"was such a little wall, it was such a nothing wall.\"", "Our rating", "Trump said, Clinton \"wanted the wall.\"", "Clinton voted in 2006 for 700 miles of fencing along the U.S.-Mexico border, but not for the taller, longer concrete wall that he vows to build.", "The statement is partially accurate but takes things out of context. We rate his statement Half True.", "https://www.sharethefacts.co/share/95d8bd7c-eee9-4f37-a7c9-e003d18a8316", "Fox News, video clip of presidential debate, Oct. 19, 2016", "Email, Donald Trump campaign spokesman Steven Treung, Oct. 19, 2016", "PolitiFact Wisconsin, \"Is Donald Trump right that Hillary Clinton once \"wanted a wall\" on the Mexican border?\" Aug. 15, 2016", "Email, University of Washington professor of public policy and governance Jacob Vigdor, Oct. 19, 2016", "Email, Cornell University professor of immigration law practice Stephen W. Yale-Loehr, Oct. 19, 2016", "Email, Center for Immigration Studies executive director Mark Krikorian, Oct. 19, 2016", "PolitiFact National, \"How Trump plans to build, and pay for, a wall along U.S.-Mexico border,\" July 26, 2016", "PolitiFact National, \"Trump says they were going to build a wall in '06, but environmental rules got in the way,\" Aug. 29, 2016", "Associated Press, \"AP Fact Check: Trump says Clinton favors a border wall,\" Oct. 19, 2016", "Email, University of Virginia professor of international law emeritus David Martin, Oct. 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]