["About this rating", "Newly inaugurated U.S. President Donald Trump and his staff began moving into the White House on 20 January 2017, trailed by reporters and photographers documenting Trump's first day in office. One of those reporters, Zeke Miller of Time magazine, remarked upon entering the Oval Office that a Bush-era bust of Winston Churchill that had been replaced with one of Martin Luther King, Jr. by President Obama was once again on prominent display:", "It appeared to Miller that the bust of MLK was now gone, an observation he also tweeted, though it proved to be erroneous. A short while after first mentioning the apparent bust exchange, Miller corrected himself:", "Meanwhile, word had gotten around to incoming White House Press Secretary Sean Spicer that the whereabouts of the MLK bust were in question. In response, he tweeted photographic proof that it was still there:", "Spicer also cited Miller's mistake as an example of the danger of not checking one's facts:", "President Trump had the last word on the incident, citing it as an example of \"media dishonesty\" during a 21 January speech at the Central Intelligence Agency in Langley, Virginia:", "So Zeke, from Time magazine, writes a story about, I took down — I would never do that, because I have great respect for Dr. Martin Luther King. But this is how dishonest the media is. Now, big story. The retraction was like, where?", "For the record, the MLK bust dust-up never attained the status of a \"big story\" in the media. Zeke Miller corrected his error — via Twitter — within an hour of making it — via Twitter. There was never any published story to retract.", "Pfeiffer, Dan.    \"Fact Check: The Bust of Winston Churchill.\"\r\nObama White House Archives.    27 July 2012.", "Phelps, Jordyn.    \"President Obama Explains Why Winston Churchill's Bust Was Removed from the Oval Office.\"\r\n    ABC News.    22 April 2016.", "Politi, Daniel.    \"Trump Accuses Media of Lying About Inauguration Crowd Size During Bughouse CIA Speech.\"\r\n    Slate.    21 January 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]