["Like many congressional freshmen, Republican Rep. Tom Graves of Georgia is worried about the nation’s spiraling debt and how much of it is owned by China.\n\nGraves, whose district consists of 15 northwest Georgia counties, including Forsyth, talked about the problem of deficit spending at a recent town hall meeting.\n\n\"Two days of interest we pay to China is enough to buy one joint strike fighter [jet],\" Graves told the largely receptive crowd, according to the Cumming Patch website.\n\nThose aircraft usually cost astronomical sums of money, so we wondered whether the congressman’s math was correct. On average, does the United States really pay that much money in debt to China? Or did Graves use hyperbole to scare his town hall audience about the rapidly growing economic influence of China?\n\nOur friends at PolitiFact Virginia did some of our homework for us. In April, they fact-checked a claim by U.S. Rep. J. Randy Forbes, R-Va., that the federal government pays China nearly $74 million a day in debt interest.\n\nPolitiFact Virginia found U.S. Treasury Department reports that show China holds about $1.165 trillion of the national debt. In the most recent 12-month period available, the U.S. spent about $197 billion in interest payments on its debt. Since China owns about 12.8 percent of the U.S. debt, PolitiFact Virginia assumed that country received a similar percentage of the debt interest payments, which for fiscal year 2010 would total nearly $69 million a day. But since the debt increased in the current fiscal year, which ends Sept. 30, PolitiFact Virginia did some more math and determined the interest payments to China would be $74.4 million a day, which earned Forbes a True rating on its Truth-O-Meter. Two days of interest payments would total nearly $150 million.\n\nSo, the next question: How much do these jets cost?\n\nThe cost to produce a joint strike fighter jet, also known as the F-35, has caused a stir in Washington in recent months. They’re being made by Lockheed Martin, which has a plant in Marietta, and are said to be the most technologically advanced jets ever developed. The jets are being made for the Air Force, Marines and Navy. For the Marines and Navy, it will be the first time they have stealth jets, said Joe DellaVedova, a spokesman for the F-35 Joint Program Office.\n\nThey’re also very expensive, and some members of Congress are angry about the rising costs. Defense Department officials recently told the U.S. Senate’s Armed Services Committee that the cost for some of the initial planes ordered was 11 percent to 15 percent higher than expected.\n\n\"Disgraceful,\" tweeted U.S. Sen. John McCain, R-Az., who has been critical of F-35 cost overruns.\n\nCost estimates are all over the place in news accounts. The most accurate estimate came from a Defense Department report that officials say was leaked to the news media a few months ago. The price to build and operate 2,443 of the jets was recently estimated to be about $93 million to $112 million apiece, according to a 2010 Pentagon report. DellaVedova did not dispute the cost estimate.\n\nSo if we take two days of interest payments, which we believe adds up to about $150 million, that total does eclipse the highest estimate for a F-35 jet, $112 million. Graves’ office estimates the total cost per jet at about $132 million, using a July report from the Congressional Research Service. It used the PolitiFact Virginia report to determine the average daily debt payment to China.\n\nWe believe Graves has a good argument to base his claim.\n\nWe rate it as True.", "Cumming Patch, \"Congressman Tom Graves a Hit at Town Hall Meeting,\" Sept. 1, 2011\n\nPolitiFact Virginia, \"Randy Forbes says the U.S. pays China $73.9 million per day in debt interest,\" April 26, 2011\n\nABC News, \"F-35 Fighter: Price Goes Up $771 Million on Most Expensive Defense Program,\" July 14, 2011\n\nCongressional Research Service report, \"F-35 Joint Strike Fighter Program,\" July 5, 2011\n\nDefense Industry Daily, The Pentagon’s April 2010 SAR Report\n\nU.S. Treasury Department, Major Foreign Holders Of Treasury Securities, June 2011\n\nEmail from John Donnelly, spokesman for U.S. Rep. Tom Graves, Sept. 7, 2011\n\nTelephone interview with Joe DellaVedova, F-35 Joint Program Office spokesman, Sept. 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]