["About this rating", "Internet trolls have produced a number of memes and baseless rumors attacking the freshman U.S. Rep. Alexandria Ocasio-Cortez ever since she became the youngest woman elected to Congress. In February 2019, we came across yet another photograph that supposedly showed a young Ocasio-Cortez being held up in the air by an unidentified man:", "This is not a genuine photograph of the congresswoman: Her face was simply digitally placed onto the body of another woman.", "Although the image has been widely shared on social media, it doesn't appear to be attached to one central claim about Rep. Ocasio-Cortez. Rather, those who have shared this image online seem to be insinuating that the behavior demonstrated by the person in this photograph -- who is not actually Ocasio-Cortez -- somehow makes Ocasio-Cortez unqualified for her current position.", "Facebook user Beth Wallace, for instance, shared this photograph with the following text:", "Don’t like to give Rep Ocasio-Cortez too much attention but this deserves to be seen (Plus, #MSM seems to be burying this one)", "I wonder what little Miss Sweetheart Socialist was thinking here...wasn't the Green New Deal, but maybe how to bed her way to the top like #Kamala Harris??", "Not one of AOC’s finer NY D14 moments that’s for sure", "#PictureOfTheDay\n#NoWordsNecessary", "Again, this is not a genuine picture of Rep. Alexandria Ocasio-Cortez. The original photograph dates to at least 2008 and most likely shows a young woman named Amanda Wenk.", "Here's a comparison of the original photograph (left) and the doctored image (right):", "Update: Corrected \"held up by her legs\" to \"held in the air.\"", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]