["Two-hundred and four days after it left Earth, NASA's Perseverance rover touched down on Mars on Feb. 18. The rover will continue the legacy of its predecessors — Sojourner, Spirit, Opportunity and Curiosity — to explore every red nook and cranny and collect and analyze data that will be used to advance the eventual mission: human life on Mars.", "But did Perseverance actually land on the Red Planet? That's a question one viral Facebook post asks and refutes.", "\"2 simple truth (sic) to destroys (sic) your illusion in under a minute once and for all\" claims the March 2 post shared on a community page called Flat Earth.", "These \"two simple truths\" are laid out in a double paneled meme accompanying the post.", "The first involves the Mars helicopter, or Ingenuity, and alleged poor Martian atmospheric conditions that would prevent it from flying.", "\"Helicopter gets its lifting force by pushing air downward. Mars has an atmospheric volume less than 1% of Earth's atmosphere. So, a helicopter flying the Martian atmosphere is simply a FAIRY TALE.\"", "The second panel, featuring an image of the Perseverance landing on the planet's surface, offers a similar argument: Combustion, the propelling force used by rockets, \"cannot exist without at least 16% of oxygen content to burn, and according to NASA the Mars atmosphere only contains 0'16% of molecular oxygen.\"", "The meme's images appear to be artistic renderings of both the Ingenuity and the rover, not actual footage.", "The March 2 post has received nearly 3,000 comments and likes since it appeared on Facebook.", "USA TODAY has reached out to the Flat Earth Facebook page for further comment.", "More:Fact check: Viral photo of Earth, Venus and Jupiter from Mars isn't real", "Perseverance may be by itself as it journeys across canyons, craters and dry lake beds carved into the Martian surface, but it's not alone. Ingenuity, NASA's first aircraft to attempt controlled flight on Mars, is keeping the over 2,000-pound rover company – tucked away beneath its \"belly\" – until it attempts its first flight test scheduled for this spring.", "Soaring through the Mars sky won't be easy for the little drone, but contrary to the Facebook post, atmospheric volume is not exactly the opponent it's up against.", "To better understand, let's take a quick detour into physics.", "Objects in motion always have a force, or several, compelling or repelling their movement. For objects in flight, there are four: Lift, the force that holds the flying object aloft; drag, or air resistance; thrust, the force used to overcome air resistance; and weight, the force generated by the gravitational attraction a planet has for an object.", "When considering how much lift is created, how much drag is to be overcome, how much thrust is needed or how heavy a flying object should be, it's typically atmospheric density that is taken into account.", "\"The primary numbers that we look at for flying the (Ingenuity) is the density at the surface of Mars,\" Jaakko Karras, robotics electrical engineer with the Ingenuity team at NASA, told USA TODAY.", "Density tells us how much stuff an object is interacting with in a given space, said Dr. Ian Clark, NASA systems engineer with the Perseverance team. It is much like something suspended in a soup – the thickness or thinness depending on the ratio of mass to volume, not simply volume alone.", "Mars' atmospheric density is thin — about 1% of Earth's at sea level — according to Karras (the Facebook post appears to have misattributed this figure). This means there's essentially \"less stuff to move\" in the atmosphere to produce the forces necessary for the helicopter's flight, Clark said to USA TODAY.", "Mars' thin density has been worked into Ingenuity's design.", "For one, in order to generate enough lift, the helicopter's two blades are long — a little over a meter, or roughly half the length of an average twin-sized mattress.", "These blades also move very fast, about five times faster compared to helicopters on Earth, said Karras. This is to compensate for the lower density on Mars, because by increasing the velocity, the helicopter can maintain what is called dynamic pressure — the product of both density and velocity.", "Fact check: Viral video doesn't reveal sights, sounds of Mars from Perseverance rover", "Lastly, Ingenuity is a lightweight at roughly 2 kilograms, or about 4 pounds.", "\"I don't have to generate as much lift at Mars as I do on Earth because I'm a smaller mass vehicle,\" Clark explained. \"But also the gravity at Mars is three-eighths that of Earth so the force with which you're reacting and needing to generate lift is already less at Mars than it is on Earth.\"", "But even with all these design bases covered, there are still threats to Ingenuity's maiden Martian flight.", "\"One thing that you see on Mars is that the thin atmosphere is nonetheless enough atmosphere to generate some hazards that we see on Earth like winds. So we actually pay very close attention to the winds at the time we fly because, just like an aircraft on Earth, we can't fly into super gusty conditions,\" said Karras.", "Because of the communication time delay between Earth and Mars, NASA engineers can't joystick the helicopter themselves to offset a blustery Martian wind. But they can make adjustments to the flight plan by looking at weather reports predicting atmospheric density and windspeed, and feed that data to the autonomous Ingenuity.", "\"We just tell (Ingenuity) when to fly and we give it away points of where to fly to. The actual flying, taking off, reacting to disturbances and ultimately landing, it's doing by itself,\" said Karras, mentioning as well Ingenuity's many on-board sensors, software and processing.", "Fact check: Viral photo of Earth, Venus and Jupiter from Mars isn't real", "Clark said that while \"combustion cannot exist using the Martian atmosphere\" is generally a true statement, and there is about 0.1% oxygen present, Perseverance isn't using combustion to land.", "Safely reaching the Red Planet's surface takes many steps because of how fast Perseverance is hurtling and how little atmosphere there is to buffer its speed. The challenging ordeal is something experienced by past rovers like Curiosity and what NASA scientists have dubbed the \"seven minutes of terror.\"", "It begins with atmospheric entry: About 10 minutes before entering Mars' upper atmosphere, the spacecraft carrying Perseverance separates from its cruise stage, which supported and powered the spacecraft during its long space voyage.", "The rover, traveling at 12,500 mph, is then left with its aeroshell consisting of a heat shield — slowing and protecting Perseverance against blazing temperatures, reaching as high as 2,370 degrees Fahrenheit — and a backshell with its thrusters guiding the entry, descent and landing.", "At around 37,000 feet above ground, the wide supersonic parachute, hidden within a canister inside the backshell, is released. Perseverance's speed is reduced from about 2,000 mph to 200 mph, Clark said.", "The final stage happens at 66 feet above ground: The rocket-powered \"Skycrane\" lowers the rover to the Martian surface using roughly 8-meter-long nylon cables. At this point, Perseverance descends at a little less than 2 mph.", "The Skycrane's eight rockets don't use combustion to power their downward thrust. They instead use the decomposition of a highly toxic, colorless and flammable liquid called hydrazine.", "Clark explained how this works: Hydrazine in liquid form is passed over an agent called a catalyst, which breaks apart the chemical bonds holding the nitrogen-rich inorganic compound together. A treasure trove of heat is released as a result.", "\"All that heat is expelled out the nozzle – accelerated and expelled – and provides the thrust the rocket engines need,\" said Clark. \"Still chemical reactions, but it's not combustion.\"", "We rate the claim that the Mars Perseverance mission did not happen because of unfavorable Martian atmospheric conditions as FALSE, based on our research. Atmospheric density, not volume alone, is what determines the aerodynamic forces influencing air flight. Mars' atmospheric density is 1% of Earth's atmospheric density at sea level but NASA has designed its helicopter Ingenuity to compensate for that. There may be 0.1% oxygen present on Mars but decomposition of hydrazine is what the rockets landing the rover used for power, not combustion.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]