["A video of a person casting their vote on an electronic voting machine (EVM) is being circulated with the claim that votes cast for any party were getting registered in favour of the BJP.", "अपनी आंखों से देखे देशवासियों””कैसे #मोदी #वोटिंग #मशीन कही भी बटन दबाओ वोट भाजपा को ही पड़ेगा”ट्रंप गलती कर दिया अगर ये मशीन से चुनाव कराता तो कभी नहीं हारता””पुरा बेईमानी हुआ है बिहार में @shubhada1234 @rohanrgupta @SarcasticRofl @babulalkhan786 @geetv79 pic.twitter.com/PZQMfd01jH", "— s.s.zama Alis Munna (@s_szama) November 10, 2020", "People have also shared the video while questioning the Election Commission against the RJD’s allegations of counting foul play on eight seats in Bihar elections.", "U r also Incompetent like ur Bosses.", "Sold-out. @ECISVEEP#Shame_on_Election_Commissionpic.twitter.com/hWGQFDrzIr", "— Daksh Raj (@dakshra69258549) November 11, 2020", "The same video was shared before the conclusion of assembly elections in the state. “In the first phase of voting itself, the games have started… voted for elephant (Bahujan Samaj Party) but it was directed to BJP watch this and RT,” read the viral message. Several Twitter and Facebook users have posted this video.", "(Translated from पहले ही चरण की वोटिंग में खेल शुरू हो गया है… हाथी को वोट डालो तो भाजपा को जाता है आप सभी देख ले और RT करे)", "An imposter account in the name of folk singer Neha Singh Rathore tweeted the video. (archived link)", "पहले ही चरण की वोटिंग में खेल शुरू हो गया है… हाथी को वोट डालो तो भाजपा को जाता है आप सभी देख ले और RT करे@yadavakhilesh@priyankagandhi pic.twitter.com/0OJjTSObYV", "— Neha Singh Rathore (@NehaFolksingers) October 30, 2020", "Twitter user @dimpleydv_ also posted the video. It has been viewed close to 10,000 times. The handle describes itself as a parody account. (archived link)", "पहले ही चरण की वोटिंग में खेल शुरू हो गया है… हाथी को वोट डालो तो भाजपा को जाता है आप सभी देख ले और RT करे@ranvijaylive @_garrywalia @HansrajMeena", "pic.twitter.com/QyJSYL5cC5", "— dimple yadav (@dimpleydv_) October 30, 2020", "Similarly, several Facebook users shared the clip.", "Alt News watched the video on a loop and noticed that the person has their hand placed over both the BJP and BSP symbols thus it cannot be said with certainty that the EVM was faulty.", "Next, we analysed the video using InVID. After rummaging various search results, we found that a Facebook user had shared the clip with Punbaji text in May 2019 during Lok Sabha elections.", "The screenshots below are stills from the Facebook video uploaded in 2019. That the person has placed their fingers on both BJP and BSP symbols is evident. Moreover, the light corresponding to BJP’s symbol lights up hinting that she may have in reality pressed the button.", "This slideshow requires JavaScript.", "Last year, BSP leader Mayawati blamed ‘EVM tampering’ for her poll defeat in Uttar Pradesh even as manipulation of the machines was denied by a parliamentary panel comprising members of several parties including BSP.", "A one-year-old unverified video has been revived during the ongoing Bihar assembly elections to suggest EVM manipulation directly registered votes for the BJP.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]