["The misleading post has been shared over 7,000 times since being posted here and here on May 7.", "The photo shows Cynthia Patag, known in the Philippines for her comedic roles, holding a sign that says “ZERO VOTE” written across the faces of eight opposition candidates.", "Below is a screenshot of the post:", "In a combination of Tagalog and English, the caption in the post reads: “ZERO VOTE, NEVER AGAIN! LET US NOT ALLOW THE Lpigs TO RULE OUR LAND AGAIN!”", "“Lpigs” is a reference to the Liberal Party, the main opposition in the Philippines. Here is a link to their website.", "The sign also lists the names of eight opposition candidates and highlights certain letters from each name in yellow to spell out “OCHO GAGO”, which when translated to English, means “EIGHT FOOLS”.", "The statement at the bottom of the poster, when translated to English, says: “Easy to remember: EIGHT FOOLS”.", "“Eight fools” is a play on the name of an opposition alliance called “Otso diretso” (Straight eight). Here is the official website of Otso Diretso.", "The Philippines held midterm elections on May 13, 2019. Here is an AFP report on the voting.", "AFP searched Patag's official Facebook page and found this photo from April 29, 2019.", "In the post, Patag is in the same pose, against the same background and wearing the same clothes, but the sign she is holding is in support of candidates from the Otso Diretso alliance.", "Below is a screenshot of the post:", "The text on the poster translates to English as: “VOTE STRAIGHT OTSODiRETSO (MATH GRAD). Makalintal. Alejano. Tanada. Hilbay. Gutoc. Roxas. Aquino. Diokno. Let’s bring Straight Eight to the Senate. FIGHT!”", "“Math grad” refers to the phrase which is composed from putting together the first letter of the names of the candidates listed on the sign.", "The same group of candidates are listed in the same order on the Otso Diretso website here.", "Below is a screenshot of the eight candidates from the Otso Diretso website:", "AFP has previously debunked a similar claim that Patag had attacked opposition candidates.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]