["About this rating", "On 16 December 2018, the web site NBCNews6.com posted an article reporting that a routine traffic stop in South Carolina had resulted in the discovery of a bag of human penises in a man's car:", "Highway patrol officers in Florence, South Carolina have made an unusual discovery during a routine traffic stop: A 53-year old man was pulled over and a bag full of whale penises was found inside his car.", "“He was sweating profusely and grinding his teeth together,” said one of the officers who made the discovery. “I asked him to step out of the vehicle and place his hands on the roof. He did that, but he kept glancing in the direction of the trunk.”", "This was not a genuine news story, and NBCNews6.com is not a legitimate news outlet.", "We couldn't find a disclaimer labeling this web site's content as \"satire,\" but we did find a number of red flags indicating this story was nothing more than a ruse. For one, the website provides no contact information, which would be unusual for a legitimate news organization, and some of their news categories, such as \"Tech,\" are devoid of content.", "The site also employs a common tactic of other fake news purveyors such as \"NBC-News.net\" and \"CBSNews.us\" of using a URL that is reminiscent of a genuine news organization's, in this case NBCNews.com. By this method the purveyors of fake news can trick readers into believing they are reading credible news reports, even though NBCNews6.com is not affiliated in any way with NBC News.", "Also, the mug shot used in the featured photograph does not show a person who was arrested for allegedly carrying a bag of penises in his car. That picture is available on the website mugshots.com and reportedly shows a man named Tomon Lee Johnson, who was arrested in 2011 on larceny charges.", "Another obvious hint that this report was merely a work of fiction was that the author of the article stated in the title that \"human penises\" were found in the suspect's car, yet the body of the article claimed the bag was full of \"whale penises.\" This phallic faux pas is especially laughable as some whale penises, such as the blue whale's, can grow to nearly 10 feet in length, a size unlikely to be seen on a human.", "WhaleFacts.com.   \"Blue Whale Penis.\"\r\n    Retrieved 18 December 2018.", "Dwyer, Dean.   \"Florence, SC: Routine Traffic Stop Ends with Officers Discovering Bag of Human Penises in Man’s Car.\"\r\n    NBCNews6.com.   16 December 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]