["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Majority Leader Sen. Mitch McConnell, R-Ky., says that just because President Barack Obama says his Supreme Court nominations are moderate doesn’t mean they are.", "McConnell, who appeared on MSNBC’s Morning Joe, discussed Merrick Garland, Obama’s nomination for the vacant Supreme Court seat May 31. Co-host Mika Brzezinski characterized Garland as a middle of the road nomination, but McConnell quickly clarified that this was not the case, adding that just because Obama calls someone a moderate doesn’t make it true.  McConnell has joined other Senate Republicans in pledging not to consider Garland’s nomination in an election year.", "Obama said the same things about previous nominees Elena Kagan and Sonia Sotomayor, McConnell told Brzezinski.", "Obama \"called Kagan a moderate. He called Sotomayor a moderate,\" McConnell said.", "Is that true?", "Yes, and no. Obama never used those words to describe his two previous Supreme Court nominees. But he has talked up their bipartisan credentials.", "McConnell spokesman Don Stewart referenced Obama’s nomination speeches for Sotomayor and Kagan as evidence.", "Stewart said that Obama described Sotomayor as having bipartisan support during his remarks following the announcement of her nomination in 2009.", "\"It's a measure of her qualities and her qualifications that Judge Sotomayor was nominated to the U.S. District Court by a Republican President, George H.W. Bush, and promoted to the Federal Court of Appeals by a Democrat, Bill Clinton,\" Obama said.", "Stewart also pointed to Obama’s remarks from Elena Kagan’s nomination speech that characterized her as a \"consensus builder\" and which made clear her openness to viewpoints of all kinds.", "Each instance, Obama characterizes the Supreme Court appointees as open minded. But he never used the word moderate.", "What’s the difference?", "Ilya Shapiro, a senior fellow in constitutional studies at the libertarian Cato Institute, said that just because Obama didn’t use the word moderate doesn’t make McConnell wrong.", "\"The point is that Obama was selling his nominees as in the legal mainstream, of good temperament, and generally suitable for high judicial office,\" Shapiro said. \"That’s not uncommon. Indeed, it’s good PR.\"", "Shapiro also said that there are some common themes among the characterization of the presidents’ nominations for Supreme Court.", "\"Consensus building and respect by all sides seems to be, on this unscientific canvas, a fairly common characteristic,\" Shapiro said.", "For example, President George W. Bush described nominees Samuel Alito and Harriet Miers in a similar way.", "\"(Alito) is scholarly, fair-minded and principled. ... In the performance of his duties, Judge Alito has gained the respect of his colleagues and attorneys for his brilliance and decency. He's won admirers across the political spectrum,\" Bush said of Alito.", "\"Harriet has built a reputation for fairness and integrity,\" Bush said.", "President Bill Clinton did the same.", "Speaking of nominee Stephen Breyer, Clinton said, \"He has proven that he can build an effective consensus and get people of diverse views to work together for justice's sake.\"", "On Ruth Bader Ginsburg, Clinton said: \"I believe that in the years ahead she will be able to be a force for consensus-building on the Supreme Court . . . Judge Ginsburg has also proven herself to be a healer, what attorneys call a moderate.\"", "Russell Wheeler, a judicial expert with the Brookings Institution said moderate is a \"comparative term,\" so its validity depends on who you're comparing the person too.", "\"When Sotomayor was on the court of appeals, there were other court of appeals judges across the country who were more liberal than she was, and by the same token, law professors and deans more liberal than Kagan when Obama nominated her,\" Wheeler said. \"I presume that’s the context of what Obama was supposed to have said, according to McConnell.\"", "Our ruling", "McConnell said Obama has called his last two Supreme Court appointments \"moderate.\" The president didn’t use that word, but he did use language that characterizes them as liked by both sides.", "We rate this claim Mostly True.", "https://www.sharethefacts.co/share/f9fcd97f-26c7-4121-8f9d-e58f3c78d3d2", "Email interview, McConnell spokesman Don Stewart, May 31, 2016", "Email interview, White House spokesperson Eric Schultz, May 31, 2016", "Email interview, Ilya Shapiro, senior fellow in constitutional studies at the libertarian Cato Institute, June 3, 2016", "Phone and email interview, Russell Wheeler judicial expert at Brookings Institute, June 2, 2016", "Video, \"McConnell says Merrick Garland is no moderate,\" MSNBC’s Morning Joe, May 31, 2016", "Speech, President Obama, \"Remarks by the President in Nominating Judge Sonia Sotomayor to the United States Supreme Court,\" May 26, 2009", "Speech, President Obama, \"Elena Kagan At The Nomination Of Solicitor General Elena Kagan To The Supreme Court,\" May 10, 2010", "Speech, George W. Bush, \"Transcript: President Bush Announces Alito Nomination,\" Oct. 31, 2005", "Speech, George W. Bush, \"Bush Nominates Longtime Friend and Attorney Harriet Miers for Supreme Court,\" Oct. 3, 2005", "Speech, Bill Clinton, \"Remarks Announcing the Nomination of Ruth Bader Ginsburg To Be a Supreme Court Associate Justice,\" June 14, 1993", "Speech, Bill Clinton, \"Remarks Announcing the Nomination of Stephen G. Breyer To Be a Supreme Court Associate Justice and an Exchange With Reporters,\" May 13, 1994", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]