["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Friday, we rated as Pants on Fire a misleading headline on a blog about a statement made by a woman who accused Roy Moore of sexual misconduct.", "The headline on The Gateway Pundit read, \"WE CALLED IT! Gloria Allred Accuser **ADMITS** She Tampered With Roy Moore’s Yearbook ‘Signature’ (VIDEO).\"", "But Beverly Young Nelson, who accused Roy Moore of groping her when she was 16, never said she tampered with his signature or forged the inscription in her high school yearbook.", "\"He wrote the note and signed his name,\" Nelson told ABC News. \"I had wrote under it where it happened at.\"", "Allred, Nelson’s lawyer, clarified Nelson had added the \"D.A. 12 -22-77 Olde Hickory House\" to the note that read, \"To a sweeter more beautiful girl I could not say Merry Christmas. Christmas 1977. Love, Roy Moore.\"", "The most recent Gateway Pundit headline on the Nelson story was equally misleading.", "\"Facebook Picks Sides in Alabama Senate Race=> Shuts Down Gateway Pundit and Breitbart Reports on Discredited Allred Accuser,\" the Gateway Pundit wrote in their headline.", "\"The far left website Politifact said our story was not accurate and Facebook (then) shut it down,\" the post said. \"No one will be able to see our story on Facebook.\"", "After we rated the story as Pants on Fire, Facebook ​flagged our report for its users as part of its effort to combat fake news. But both the Breitbart and Gateway Pundit articles are still searchable.", "We found them by scrolling down the Breitbart and Gateway Pundit Facebook pages. The claim that no one will be able to see the story on Facebook is flat-out wrong.", "Unless an article violates Facebook’s community standards, it’s not removed.", "Facebook does, however, downrank disputed articles. That means they are pushed lower down on users’ newsfeeds, although the severity of downranking varies.", "When a user tries to share the original Gateway Pundit story through Facebook, a pop-up appears saying \"Before you share this content, you might want to know that there is additional reporting on this from PolitiFact.\" A hyperlink that says \"Visit PolitiFact\" redirects the sharer to our report. But if the user clicks Continue, they are able to share the story as usual.", "If a person reading the story through the Gateway Pundit website tries to share the content to Facebook, the pop-up window never appears. The same applies for Breitbart.", "Facebook does this for every story flagged as false.", "\"Our take on facts is that objective facts are objective facts, and their political provenance is irrelevant,\" Facebook spokesman Todd Breasseale said. \"It doesn’t matter if an objective fact was discovered or made apparent by a politically conservative organization or a politically liberal or an apolitical organization.\"", "(PolitiFact is a nonpartisan fact-checking organization.)", "Facebook relies on organizations like PolitiFact, Snopes, FactCheck.org and other fact-checkers to flag fake news.", "A Gateway Pundit headline said, \"Facebook picks sides in Alabama Senate race ... shuts down Gateway Pundit and Breitbart reports on discredited Allred accuser.\"", "Neither the Gateway Pundit nor the Breitbart stories were taken down from Facebook, as the headline suggests. Instead, the Facebook algorithm made the stories less prevalent, as occurs with every story flagged as fake. Those who sought to share the posts were informed of our report, but they could share them anyway.", "We rate this statement False.", "The Gateway Pundit, Facebook Picks Sides in Alabama Senate Race=> Shuts Down Gateway Pundit and Breitbart Reports on Discredited Allred Accuser, Dec. 8, 2017", "Email interview with Jim Hoft, Gateway Pundit editor, Dec. 11, 2017", "Phone interview with Todd Breasseale, Facebook spokesman, Dec. 11, 2017", "PolitiFact, No, Roy Moore accuser didn't admit she forged his signature in her yearbook, Dec. 8, 2017", "The Gateway Pundit, WE CALLED IT! Gloria Allred Accuser **ADMITS** She Tampered With Roy Moore’s Yearbook ‘Signature’ (VIDEO), Dec. 8, 2017", "ABC News, Roy Moore accuser Beverly Young Nelson 'scared to go anywhere' since her sexual assault allegation, Dec. 8, 2017", "CBS News, Gloria Allred holds news conference on Roy Moore accuser's yearbook, Dec. 8, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]