["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A new ad from the Democratic Senatorial Campaign Committee wants to paint GOP Senate hopeful David Perdue as an extremist when it comes to education.", "Education has already been a hot issue in the tight governor’s race. The ad, \"Help,\" sounds the alarm for the topic in the closely watched Senate battle between Perdue and Democrat Michelle Nunn.", "The main claim: Perdue wants to abolish the federal Department of Education, which would jeopardize $1 billion for Georgia public schools already struggling with tight budgets.", "\"That would devastate Georgia schools,\" the ad narrator says. \"A billion dollars cut from K through 12. Eliminate all federal student loans.\"", "Republicans have called for eliminating the federal department since Ronald Reagan first pledged to do so in his 1980 presidential campaign.", "The issue has lived on in some conservative circles, even amid stiff Congressional opposition for decades. Reagan himself switched positions in 1983, after a federal report warned of a \"rising tide of mediocrity\" in American schools.", "The son of two teachers, Perdue has talked at length about the need for more local control. But does that translate into eliminating the federal department? And would the cut mean such a dramatic loss to school funding in Georgia?", "PolitiFact Georgia decided to check it out.", "First, we looked at Perdue’s stance.  When asked about Common Core in a July interview with the Marietta Daily Journal, Perdue called for the academic standards to be abandoned and \"went on to say the federal Department of Education should be abolished.\"", "The July story does not include a direct quote. But a July story in the Covington News quotes Perdue as saying the department should be \"defunded\" and fixed.", "In October, the Political Insider blog referred to the MDJ story calling for the department to be abolished and quoted a campaign spokeswoman as saying Perdue’s plan called for shifting money from the federal to the local level.", "Perdue did not respond to repeated requests to clarify those comments. However, when asked by Channel 2 Action News to address the specific charge at a press conference at the National Federation of Independent Business on Oct. 2, he did not deny the claim.", "\"My position all along on this has been that big government is not producing results,\" Perdue said. \"So what I would look at doing is moving a lot of those dollars that go into the federal government back in the local school systems where the best decision can be made.\"", "States handle nearly all education policy and issues. At the federal level, the Education Department conducts research, enforces federal anti-discrimination laws and, as the ad says, handles federal financial aid in loans and grants.", "But as the ad suggests, there is also plenty of money at hand.", "The ad says eliminating the department would cut $1 billion in K-12 funding every year and eliminate student loans.", "That’s a slightly conservative estimate, given that Georgia will receive nearly $1.1 billion in elementary and secondary school funding for the fiscal year that ended on Sept. 30, and another $1.1 billion for the current year, according to federal figures.", "There is even more money in the two federal loan programs set up by the Higher Education Act of 1965 – with Georgians receiving about $2.9 billion in federal direct student loans, records show.", "In addition, more than 297,000 Georgia students received federal Pell Grants in 2012-2013, totaling nearly $991million, according to federal numbers.", "The U.S. Education Department has administered all of those programs since 2010, when the government eliminated the Federal Family Education Loans program and began making loans directly to students and parents.", "That is to say, the loan programs’ operation has been shifted already. And Congress could again shift them to another agency if it voted to eliminate the federal education department. Reagan had called for such a transition years ago.", "Rick Hess, director of education policy studies at the conservative American Enterprise Institute for Public Policy Research, said he doesn’t believe the next Congress will have the majority votes needed to abolish the U.S. Department of Education or the funding it provides for student loans and other programs.", "Even with talk of abolishing the department in the past, discussions have called for those programs to move to the Department of Health and Human Services, he said.", "\"I don’t think you could find 15 votes for doing away with the funding,\" Hess said.", "Andrew J. Coulson, director of the Libertarian-leaning Cato Institute’s Center for Educational Freedom, agreed that abolishing the agency is \"not equivalent to ending all the programs/funding streams that currently are gathered there.\"", "Coulson said there were federal education programs before the cabinet-level education department was established under President Carter, and other agencies continue to run some programs. The Head Start pre-K program, for example, is still run by DHHS, he said.", "That brings us back to the ad, which claims David Perdue supports eliminating the U.S. Department of Education, a position that could cripple Georgia schools, students and loan recipients.", "Our research finds there is reason to believe Perdue does support abolishing the department and transferring funding to the local level.", "But it is alarmist to suggest the end of the department would be the end of all K-12 money. And suggestions that it would mean the end of student loan programs ignores the history that has already shuffled their administration.", "For that reason, we rate the claim Half True.", "Democratic Senatorial Campaign Committee ad, \"Help,\" Oct. 14, 2014", "The Washington Post, \"Ronald Reagan's impact on education today,\" Feb. 6, 2011", "Los Angeles Times, \"Education Dept. Won't Be Abolished,\" Jan. 29, 1985", "The Atlanta Journal-Constitution Political Insider blog, \"Michelle Nunn’s new line of attack: education,\" Oct. 2, 2014", "The Marietta Daily Journal, \"Former CEO aims to ‘push back’ on economic barriers,\" July 6, 2014", "The Marietta Daily Journal, \"Senate hopeful Perdue weighs in on hot-button issues,\" Feb. 16, 2014", "Covington News, \"The fight is on: Perdue vs Kingston,\" July 5, 2014", "David Perdue, National Federation of Independent Business press conference, Oct. 2, 2014", "U.S. Education Department, \"An Overview of the U.S. Department of Education,\" accessed Oct. 20, 2014", "U.S. Education Department, Fiscal Year 2015 Budget Request State Tables", "U.S. Education Department, \"2012-2013 Federal Pell Grant End of Year Report (Table 21),\" accessed Oct. 21, 2014", "The Hill, \"End the student loan tax,\" Oct. 20, 2014", "Interview with Derrick Dickey, spokesman for Republican U.S. Senate candidate David Perdue, Oct. 13, 2014", "Interview with Rick Hess, director of education policy studies at the conservative American Enterprise Institute for Public Policy Research, Oct. 21, 2014.", "Email interview with Andrew J. Coulson, director of the Cato Institute’s Center for Educational Freedom on Oct. 21, 2014.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]