["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Beth Hegarty, who was inside Sandy Hook Elementary School the day of the shooting, marches over the Brooklyn bridge during the third annual Brooklyn bridge march and rally to end gun violence on May 9, 2015, in New York City. (AP/Mary Altaffer)", "When Texas lawmakers agreed to allow people to carry concealed handguns in college and university buildings, the law included wiggle room for school presidents and boards to determine rules and regulations for their campuses.", "Texas Gov. Greg Abbott signed Senate Bill 11 - the \"campus carry\" measure - into law on June 1, 2015, but the rancorous debate over whether the law willl prevent mass shootings continues.", "Some groups are using risque tactics to draw attention to their opposition, like the student-organized \"Campus Dildo Carry\" day, scheduled to take place next summer at the University of Texas in Austin.", "Gun Free UT, which opposes the law, is taking a more serious approach in its opposition, in part through a website that drew our attention thanks to this claim posted Oct. 28, 2015: \"29 mass shootings have been committed by concealed carriers since 2007, while during this period only one (1) licensed civilian meaningfully intervened in a mass shooting.\"", "The same day, we took a screenshot of the blog post containing the claim, headlined \"Guns in Classrooms: Report from the trenches and tasks.\" After we asked for some clarification on the relationship between the two sources cited in the claim, the post was taken down.", "Joan Neuberger, UT professor of history and a co-chair of the Gun Free UT steering committee, said the claim made on the site in a bullet point left no room for nuance. \"We can see that our statement needs more context.\"", "Still, is the claim -- suggesting mass shooters won’t be stopped even if more students carry weapons -- accurate?", "We looked first at whether 29 mass shootings have been committed by licensed concealed carriers since 2007. Then we turned to whether only one licensed civilian \"meaningfully\" intervened in a mass shooting in the period.", "Counting mass shootings", "In an Oct. 28, 2015 post, The Washington Post’s Wonkblog cited an Oct. 14, 2015 report from the Violence Policy Center, a research and advocacy group that promotes gun control, stating that since 2007, there had been 29 mass shootings by people with concealed weapons in the U.S.", "The National Rifle Association, which backed SB 11, has taken issue with the center’s breakdown. NRA Institute for Legislative Action spokesman Lars Dalseide directed us to a criticism of the center’s methodology on Bearing Arms, a Second Amendment rights advocacy blog. The Oct. 26, 2015 Bearing Arms post looks at each of the shootings compiled by the center and concludes that only six instances were actually mass shootings committed by concealed carry permit holders using concealed weapons.", "That’s a whopping difference.", "So what gives? For one thing, the Violence Policy Center and Bearing Arms define \"mass shootings\" differently.", "In its analysis, the center defined a mass shooting as the killing of three people or more. According to VPC Communications Director Avery Palmer, this definition is \"consistent with the federal definition contained in the Investigative Assistance for Violent Crimes Act of 2012.\" This is also the definition used in \"A Study of Active Shooter Incidents in the United States Between 2000 and 2013,\" the FBI report from which Gun Free UT pulls its statistic on civilian interventions.", "On the other hand, the Bearing Arms post author, Bob Owens, defines a mass killing as the killing of four people or more, thus disregarding incidents in which three people were killed. His definition is actually consistent with the FBI definition of a mass murder (as opposed to a mass shooting). In a 2005 report on serial murder, the FBI defined mass murder as \"a number of murders (four or more) occurring during the same incident.\"", "Only one civilian intervened?", "We come to the second part of the claim, that \"during this period (since 2007), only one licensed civilian meaningfully intervened in a mass shooting.\"", "Gun Free UT pulls this figure from the aforementioned FBI study on active-shooter incidents. It’s worth noting that while Gun Free UT implies the FBI report contains data on interventions from 2007 through the present, it actually only examines incidents through 2013.", "According to the report, there were five instances in which \"the shooting ended after armed individuals who were not law enforcement personnel exchanged gunfire with the shooters.\" Gun Free UT did not count four of these incidents because the intervening civilians were security guards armed for their jobs.", "When we took a closer look at the one case where an armed civilian stopped the shooting, we found something interesting.", "The FBI report didn’t just look at mass shootings -- it focused on all \"active shooter incidents\" (in which \"an individual actively engaged in killing or attempting to kill people in a confined and populated area\") during a 13-year period. As it turns out, the situation cited by Gun Free UT was not what either the center or the FBI would define as a mass shooting in that two people died, rather than three.", "In that case, Ernesto Villagomez, 30,  killed two people and wounded two more inside Player’s Bar and Grill in Winnemucca, Nevada. He was then shot and killed by another patron at the bar.", "Other analyses", "Unlike the FBI report, the center’s analysis considered only mass shootings committed by concealed carry permit holders.", "A third tally of mass shootings,  published Dec. 15, 2012 by the left-leaning Mother Jones magazine, found there had been 62 mass shootings over 30 years, with not a single case in which the killing was stopped by a civilian with a gun. The Mother Jones investigation used the more restrictive \"mass murder definition\"-- four or more killed at once  in its count of shootings.", "Meantime, the  Wonkblog post that cited the center’s shooting count reached its own -- higher -- tally of eight instances that someone with a concealed-carry license intervened in a mass shooting situation. That count was attributed to an Oct. 3, 2015, Washington Post blog post, by UCLA law professor Eugene Volokh; two more incidents were added later to his list.", "In his post, Volokh acknowledged that the effect of more widespread gun possession on the outcome of mass shootings remains unknown. Of his examples, he conceded \"at least some examples are ambiguous, because it might be unclear… whether the shooter had been planning to kill more people when he was stopped.\"", "By either FBI definition, the death toll only climbed high enough to count as a mass shooting in one of the 10 incidents identified by Volokh. In all the others, it is unsure whether the shooter would have continued shooting had he not been shot himself, making it difficult to do an authoritative count of interventions.", "For instance, in a 2014 incident at Mercy Fitzgerald Hospital near Philadelphia, a psychiatric patient shot his caseworker in the face and wounded his psychiatrist before the psychiatrist shot him. He was then wrestled to the ground. The shooter, Richard S. Plott, had more than 30 additional rounds of ammunition on him when he was stopped.", "There are drawbacks to any attempt to compile and compare statistics from different sources; there’s also a good reason comprehensive data on gun violence is hard to come by.", "Since 1996, Congress has restricted research into gun violence with a budget that states: \"None of the funds made available for injury prevention and control at the Centers for Disease Control and Prevention may be used to advocate or promote gun control.\" The CDC read the restriction broadly and radically reduced research on gun violence as a result; Obama reversed the funding rule by executive order in 2013.", "Our Ruling", "When we looked, the Gun Free UT blog included this claim:  \"29 mass shootings have been committed by concealed carriers since 2007, while during this period only one (1) licensed civilian meaningfully intervened in a mass shooting.\"", "The first Gun Free UT claim is accurate in that in that 29 mass shootings, according to a definition provided by the FBI, were carried out by people with concealed weapons.", "An attempt by Bearing Arms to refute the claim calls the incidents mass killings, but uses the FBI definition for mass murder.", "The claims leaves out information that could clarify the tangle of definitions used.  By Gun Free UT's own admission, the website claim lacks context.", "The second claim that only one licensed civilian intervened in a mass shooting is false by the FBI definition of a mass shooting, but bolsters Gun Free UT’s cause because no armed civilian has intervened in a mass shooting.", "We rate this claim Half True.", "Blog post, \"Guns in Classrooms: Report from the trenches and tasks.\" Blog, Gun Free UT, Oct. 28, 2015.", "Email, Dr. Joan Neuberger, UT professor of history and co-chair, Gun Free UT Steering Committee, Nov. 17, 2015.", "Report, \"Guns on Campus: Overview.\" National Conference of State Legislatures, updated Oct. 5, 2015.", "Bill text, \"S.B. No. 11.\" Texas State Capitol, May 31, 2015.", "Article, \"University of Texas students to wield sex toys in protest against guns.\" Lisa Maria Garza, Reuters, Oct. 13, 2015.", "News blog post, \"People with concealed carry permits have committed at least 29 shootings since 2007.\" Christopher Ingraham, Washington Post, Oct. 28, 2015.", "Report, \"Mass shootings committed by concealed carry killers,\" Violence Policy Institute, Oct. 14, 2015", "News blog post, \"Do civilians (not police officers) with guns ever stop mass shootings?\" Eugene Volokh, Washington Post, Oct. 3, 2015.", "Email, Avery Palmer, Communications Director, Violence Policy Center, Nov. 18, 2015.", "Report, \"Serial Murder: Multiple Inter-Disciplinary Perspectives for Investigators.\" Ed. Robert J Morton, Behavioral Analysis Unit, FBI. Aug. 29, 2005.", "Phone interview and email, Lars Dalseide, Public Affairs Media Liason, NRA Institute for Legislative Action, Nov. 13, 2015.", "Blog post, \"Washington Post claims 29 mass murders by concealed carriers...but they LIED.\" Bob Owens, Bearing Arms blog, Oct. 26, 2015.", "Article, \"Suspect in officers shooting was into conspiracy theories.\" Dennis B. Roddy, Pittsburgh Post-Gazette, April 5, 2009.", "Blog post, \"Alleged cop-killer in Pittsburgh linked to white supremacist beliefs.\" Mark Potok, Southern Poverty Law Center, April 5, 2009.", "Article, \"Shooter linked to Aryans.\" Amy Cannata, The Spokesman-Review, May 23, 2007.", "Report, \"A Study of Active Shooter Incidents in the United States Between 2000 and 2013.\" Texas State University and the FBI, Sept. 2014.", "Article, \"Three dead in shooting at Winnemucca bar,\" Las Vegas Review-Journal, May 26, 2008.", "Article, \"Colorado Gunman Killed Himself.\" Kirk Johnson, The New York Times, Dec. 12, 2007.", "Article, \"Uber driver, licensed to carry gun, shoots gunman in Logan Square.\" Chicago Tribune, April 20, 2015.", "Article, \"Richard Plotts says he is ready to plead guilty to Delaware County hospital shooting.\" Times Herald, Jan. 13, 2015.", "Article, \"Official: suspect in deadly hospital shooting had lengthy history of gun arrests, violence,\" AP, Fox, July 26, 2014.", "Report, \"Concealed Handgun Licensing: Active License/Certified Instructor Counts As of December 31, 2014,\" Regulatory Services Division, Texas Department of Public Safety, Dec. 31, 2014.", "Article, \"Gun violence research: History of the federal funding freeze.\" Christine Jamieson, American Psychological Association, Feb. 2013", "Article, \"Why the CDC still isn’t researching gun violence, despite the ban being lifted two years ago.\" Todd C. Frankel, Washington Post, Jan. 14, 2015", "Article, \"More guns, more mass shootings--coincidence?\" Mark Follman, Mother Jones, Dec. 15, 2012.", "Article, \"What exactly is a mass shooting?\" Mark Follman, Mother Jones, Aug. 24, 2012.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]