["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Sherri Tenpenny, an anti-vaccine activist and doctor of osteopathic medicine who believes Bill Gates is behind various chemtrail, 5G, and vaccine microchip-related, world-domination plans, has been making waves in pseudoscientific circles with a claim that mRNA vaccines against COVID-19 will cause a potentially fatal immune reaction in four to 14 months.", "Tenpenny, who has described the COVID-19 pandemic as a \"scamdemic,\" alleged in both interviews and blog posts that the SARS-CoV-2 spike protein created by mRNA vaccines will cause delayed but deadly immune reactions. \"The problem is that the antibodies that [mRNA COVID-19 vaccines] generate are going to be deadly,\" she said in an interview with activist Reinette Senum. \"And it's going to take somewhere between four months and maybe fourteen months before we see the whole ravage of what's going to happen to people who are vaccinated with this vaccine.\"", "The most effective medical misinformation — and this claim certainly fits the bill — often blends real scientific concepts with baseless assertions in service of a larger distortion. The factual reality Tenpenny is exploiting stems from real concerns researchers had raised about the plausibility of creating a safe vaccine for previous coronavirus-caused diseases such as SARS and MERS. For several complex immunologic reasons discussed below, pre-COVID efforts to create a vaccine for these diseases raised several legitimate vaccine safety concerns.", "The larger distortion Tenpenny is attempting to push with pre-2020 studies about those efforts is that they were \"ignored\" by the scientists designing vaccines for SARS-CoV-2 (COVID-19), and that their findings hold direct relevance to the safety of COVID-19 vaccines. Robert Atmar, a professor of infectious disease at the Baylor College of Medicine who was a co-author on one of two studies Tenpenny relies on extensively to make her faulty argument, told us by email that their \"findings do not apply to SARS CoV-2 viruses.\" Below, we explain why that is the case.", "(Snopes sent a detailed list of questions to Tenpenny on Feb. 22, 2021. We received no response. After our deadline for response had passed, an assistant told us Tenpenny was too busy to speak with us, but would be willing to speak at a later date.)", "Since the emergence of coronaviruses, there had been several unsuccessful efforts to develop vaccines against the viruses responsible for Severe Acute Respiratory Syndrome (SARS) and Middle East Respiratory Syndrome (MERS). Tenpenny relies almost exclusively on two papers discussing those efforts to make her case against the COVID-19 vaccine: a 2019 study on SARS and MERS vaccination efforts, and a 2012 study on immunopathology caused by SARS vaccines in laboratory animals. An immunopathology is an immune system reaction that damages tissue.", "Both studies described scary results from various animal tests on SARS and MERS candidate vaccines. The basic issue was this: The vaccine candidates appeared to work at first in terms of controlling early infections and creating an immune response. However, when animals who had been vaccinated were exposed to either SARS or MERS following vaccination, their immune systems went into overdrive, causing massive and sometimes fatal damage to the lungs.", "The reason for these reactions, researchers have come to understand, stem at least in part from the peculiarities of coronaviruses themselves, SARS-CoV and MERS-CoV (which cause SARS and MERS) and SARS-CoV-2 (which causes COVID-19). Interactions between coronavirus spike proteins and the immune system can, research suggests, block the anti-inflammatory half of the immune system and send the immune system into overdrive, leading to immunopathology in the lungs. Severe cases of COVID-19 often present elements of immune-system-mediated damage to lung tissue.", "Another proposed mechanism for this damage to the lungs is antibody-dependent enhancement (ADE). In basic terms, the idea is that some antibodies created to fight these coronaviruses bind only weakly to the virus. As a result, instead of serving to tag or destroy the viral particles, these antibodies actually end up providing further access for a virus to infect cells, and serve to make the infection more severe. Tenpenny refers to this as the \"trojan horse\" mechanism. There are at least two proposed causes for this phenomenon, but both \"occur when non-neutralizing antibodies or antibodies at sub-neutralizing levels bind to viral antigens without blocking or clearing infection.\"", "Not only could these antibodies enhance infection through ADE, Tenpenny alleges, but their presence — in the absence of the immune system's anti-inflammatory cells — could directly harm lung tissue through inflammation and indirectly by creating an unchecked army of pro-inflammatory immune system cells. For these reasons, Tenpenny implies, a vaccine that creates COVID-19 spike proteins will generate massive immunopathologic damage to the lungs after someone vaccinated to COVID-19 is exposed to the virus.", "Perhaps the most malicious distortion presented by Tenpenny is that the research on SARS and MERS vaccination was \"ignored\" by scientists developing COVID-19 vaccines. In fact, the work she highlights very explicitly informed the development of safe COVID-19 mRNA vaccines.", "When the COVID-19 pandemic was first declared and health officials concluded that a massive vaccination program would be required to return global life to a semblance of pre-pandemic normalcy, immunologists and vaccine scientists very explicitly used the research highlighted by Tenpenny to explain the significant existing challenges inherent to creating a coronavirus vaccine.", "A September 2020 paper in Nature Microbiology that evaluated \"the risks and opportunities for antibody-based protection against SARS-CoV-2,\" for example, cited the same work, explaining that \"safety concerns for SARS-CoV-2 vaccines were initially fueled by mouse studies that showed enhanced immunopathology … in animals vaccinated with SARS-CoV.\"", "Further work on this immunopathology led researchers to conclude that it is caused in cases where the tested vaccine creates what is known as a Th-2-cell-biased immune response. An immune response biased toward the production of Th-2 cells results in many of the conditions described in the scenarios presented by Tenpenny, including blocking or inhibiting anti-inflammatory immune functions and creating a storm of infection-fighting cytokines that actively attack the lung.", "For this reason, researchers knew any vaccine they designed for COVID-19 should avoid a Th-2 response. A paper in International Archives of Allergy and Immunology, for example, concluded back in June 2020  that \"COVID-19 vaccines should ... polarize the T-cell response towards type 1 immunity and avoid the stimulation of cytokines which induce T-helper 2 immunity.\"", "In terms of ADE, the same research highlighted by Tenpenny is referenced in myriad papers concerning the development of a safe COVID-19 vaccine as well. Citing the same 2019 study as Tenpenny, the Nature Microbiology review discussed above concluded that evidence for ADE in SARS and MERS is conflicting, but that any potential vaccine-induced ADE could be mitigated by creating a vaccine that generates high numbers of neutralizing — as opposed to non-neutralizing — antibodies.", "Thanks in part to the work of the researchers highlighted by Tenpenny, then, vaccine developers were aware that any COVID-19 vaccine they developed required two things to be safe from the suite of immunologic responses at issue: the production of high levels of neutralizing antibodies and a Th-1 biased immune response with little to no Th-2 response. A vaccine created that includes these two features, a massive body of evidence ignored by Tenpenny suggests, would overcome the challenges presented in early coronavirus vaccine trials.", "In her interview with Senum, Tenpenny argued, \"If I can learn this sitting in my living room, reading a 19-page paper and several others, so can they\" she said referring to doctors who support COVID-19 vaccination. \"There's nothing special about me. I just take the time to do it.\"", "It is unclear how much time Tenpenny actually took to come up with her claims, as she appears to have been uninterested in any paper published since the emergence of the disease for which her claims apply. Tenpenny, in that interview, makes several assertions that belie her ignorance of post-2019 coronavirus vaccine science. She asserts, for example, that COVID-19 vaccines create non-neutralizing antibodies that lead to ADE:", "What we're doing with this new virus is we're taking a little piece of that virus' genetics specifically associated with what's called the spike protein. We're injecting that into the body, creating something called a non-neutralizing antibody. ... This non neutralizing antibody creates something called antibody dependent enhancement.", "This is aggressively false. Both the Moderna and Pfizer mRNA vaccines create highly neutralizing antibodies. Had Tenpenny followed the development of the vaccine instead of promoting the pseudo-documentary \"Plandemic,\" she perhaps might not have missed the studies conducted on the Moderna vaccine indicating that it produces \"high levels of binding and neutralizing antibodies.\" She might have seen studies conducted on the Pfizer/BioNTech vaccine indicating that it produces high levels of neutralizing antibodies, as well. This reality is a protection against the ADE Tenpenny falsely alleged to be caused by COVID-19 vaccines.", "Tenpenny's argument that COVID-19 vaccines could cause immunopathology stems from her false claim that SARS-CoV-2 spike proteins created by vaccines will block the functions of an anti-inflammatory type 2 macrophages:", "When you get pneumonia or some sort of serious infection, the type 1 macrophages are pro-inflammatory. And they show up at the infection and start creating cytokines and blowing whistles and bringing in all the things to try to kill off the infection. ... The type 2 macrophages are anti-inflammatory. So as you start to recover the type two macrophages, come in, tell the other guys to shut up. We're here to clean up the mess. … When you've got this antibody to the spike protein, which is the full intention and purpose of these [COVID-19 mRNA] vaccines, that antibody kills your type 2 macrophages.", "The inactivation of type two macrophages is one of several outcomes that occur from vaccines that produce a large Th-2 biased response, Baylor's Atmar told us. As discussed earlier, the defense against this outcome is a vaccine that does not produce a Th-2 response and instead creates a strong Th-1 response. Had Tenpenny researched the actual vaccines she maligns —  instead of sharing articles from Infowars —  she would have learned that both mRNA vaccines produce strong Th-1 biased responses with little to no Th-2 response.", "In an October 2020 report in the New England Journal of Medicine, researchers reported that, \"The mRNA-1273 vaccine [i.e Moderna] induced [Th1] biased … responses and low or undetectable Th2 … responses.\" As reported in Nature this month, data from the Pfizer/BioNTech vaccine indicate a \"TH1-biased response.\" In other words, the biochemical requirements for the scary reactions Tenpenny alleges to be looming in a few months are simply not created by the mRNA COVID-19 vaccines. This is by design.", "Zhiwei Chen, one of the authors on the other study Tenpenny primarily relied on to make her faulty argument, told us by email that \"we should not copy and paste the knowledge learnt from SARS\" into COVID-19 research. While Tenpenny is certainly guilty of that logical fallacy, the larger distortion she has been creating comes by way of omission. By actively ignoring any vaccine research that has been conducted since the start of the pandemic, she presents outdated theoretical concerns as real while ignoring a scientific reality that refutes them.", "Because mRNA vaccines induce strongly neutralizing antibodies and a Th-1 biased response, and because the theoretical mechanisms Tenpenny invokes require non-neutralizing antibodies and a Th-2 biased response, her concerns are without merit. The claim that massive lung damage from COVID-19 mRNA vaccination is months away is, therefore, \"False.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]