["Several claims on social media -- including by the musician Ted Nugent here and by others here, here, here, here, here and here -- say that Dr. Seuss and Mr. Potato Head have been canceled, while some posts add they were “taken down” by Biden.", "Critics of  “cancel culture” -- a movement that seeks to call out offensive behavior -- denounce it as excessive and say it is contributing to increased political polarization.", "However, the claims in the posts are false on several accounts.", "Six books, out of a collection of 50 Dr. Seuss titles that were independently reviewed, are being pulled because of imagery now considered racist. The publisher of the bestselling children's books made the announcement on March 2, 2021 which would have been the author's birthday.", "Dr. Seuss Enterprises said it made the decision last year -- before Biden became president -- to take six titles out of print: “And to Think That I Saw It on Mulberry Street,” “If I Ran the Zoo,” “McElligot’s Pool,” “On Beyond Zebra!,” “Scrambled Eggs Super!,” and “The Cat’s Quizzer.”", "The six are currently unavailable for sale on the official Dr. Seuss’ website.", "“These books portray people in ways that are hurtful and wrong,” the company said in its statement, making no mention of governmental involvement in the decision.", "Seuss' books have sold more than 650 million copies and have been translated into dozens of languages.", "Contrary to what some Facebook posts claim -- linking the decision to the current administration -- the reevaluation over the portrayal of Black, Arabic and Asian people in the Dr. Seuss catalog, that led to the decision, has been long in the making.", "A February 2019 study published in the \"Research on Diversity in Youth Literature\" journal examined 50 of Seuss’ books. The report concluded that 43 of the 45 characters of color had \"characteristics aligning with the definition of Orientalism.\"", "Posts stating that “The Cat in The Hat” has been “canceled” are misleading. The 1957 children's book is not part of the six discontinued Dr. Seuss Enterprises titles. However, “The Cat’s Quizzer” displays the main character from that book.", "In February 2021, toy manufacturer Hasbro said it was dropping the honorific from the “Mr. Potato Head” logo and packaging \"to promote gender equality and inclusion.\"", "But the product’s rebranding does not mean “Mr. Potato Head” will cease to exist. The iconic action figure, known for starring in the Pixar franchise “Toy Story,” will continue to be sold in stores but known simply as \"Potato Head.\"", "A non-gender-specific version of the toy, in which children add facial characteristics and clothes to the body of plastic spuds, will hit shelves in the fall. Their new product is a kit “that includes enough potatoes and accessories for kids to create all types of families,\" Hasbro told AFP in an email.", "The company tweeted that Mr. and Mrs. Potato Head characters “aren’t going anywhere,” and would still be available for purchase. Hasbro also included a visual of what could be the new packaging and branding.", "Hasbro did not associate the rebranding of the toy with a governmental decision or to Biden himself.", "Moves by classic brands for more inclusive toys and books are not new this year. Barbie creator Mattel released a line of \"gender-inclusive” dolls in 2019, after a series with more inclusive body types released in 2016.", "For years , retailers have also embraced a more gender-neutral approach to marketing and selling their children’s toys. In 2015, for example, Target announced it would stop labeling toys for boys or girls in its stores.", "The part of the claim which says Donald Trump “took down” ISIS is misleading.", "The former president was in office when the Islamic State group, often referred to as ISIS, was defeated. However, it was not the US but local forces in Iraq and Syria that played the decisive role in victories over the jihadists, with America focusing on providing them with air support, equipment and training.", "And while Trump was president at the time the jihadists' last major strongholds were retaken, the strategy of having local forces lead the fight was put in place by his predecessor Barack Obama.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]