["Medicare for All is a pillar of Bernie Sanders’ presidential campaign. In his kick-off interview with CBS News, the Vermont senator was asked if his plan was too big for the country to handle. Sanders shot back that making sure everyone has health care didn’t seem beyond the reach of other developed nations. He pointed to America’s northern neighbor.", "\"Somehow or another in Canada, for a number of decades, they have provided quality care to all people without out-of-pocket expenses,\" Sanders said Feb. 19. \"You go in for cancer therapy, you don't take out your wallet. And they do it for about 50 percent per capita of the cost that we spend.\"", "Let’s focus on those out-of-pocket costs.", "In Canada, if you actually go into a hospital and get treated there, it is free. Across the country, hospital visits and care at the doctor's office are covered 100 percent. But prescription drugs and some outpatient care are a different matter entirely.", "Out-of-pocket costs exist in Canada, and while they are lower than in the United States, they can be substantial.", "Anyone who has lived legally in Canada long enough, whether a citizen or not, qualifies for coverage. For the most part, Canada’s provinces and territories are in charge. The national program they call Medicare came together about 60 years ago and basically established today’s rules under which the federal government helps cover the costs and sets a floor for the core services the provinces and territories must cover.", "The history is important. Six decades ago, health care largely meant going to the hospital and seeing a doctor. Outpatient prescription drugs were not a big part of the health care people received. The architects made sure hospital and physician care were free, but today, prescription drugs — plus dental, vision, rehabilitation and other services — fall outside of the core package.", "For those other services, with the provinces and territories in the driver’s seat, what’s covered and what’s not varies from place to place.", "Medicare for All: What it is, what it isn't", "While a large chunk of health care spending comes through the government, a significant portion remains private. The public sector covers about 70 percent of the total, and private sources, including private insurance, account for the remaining 30 percent. Some of the latter is out-of-pocket. The Canadian government reported that in 2018, about 36 billion Canadian dollars, or 15 percent, of all health care spending was out-of-pocket.", "Sanders’ campaign said he was talking about covered care, not necessarily all care, and his proposal is different from the Canadian system.", "On Sanders’ specific example of getting treatment for cancer, the variation from place to place makes things unpredictable. Diagnoses and operations are clearly covered, and chemotherapy would be as well, so long as it takes place inside a hospital.", "Some drug regimens might take place as inpatient care at one hospital. But others could be handled outside the hospital in another jurisdiction, said Raisa Deber, public health professor at the University of Toronto. If that happens, the patient might rely either on a separate insurance policy if they had one, or pay themselves.", "A 2011 study in three provinces found that for the most common cancers — breast, colon, lung and prostate — the typical patient had about $200 in monthly out-of-pocket costs. The range however was large. For example, some breast cancer patients reported zero costs and others more than $5,200.", "Cancer drugs, along with all other prescription drugs, are a point of contention in Canada today.", "Canadians debate what to do about prescription drug coverage about as much as we do in the United States.", "\"Some people say it’s really dumb not to pay for prescription drugs,\" Deber said. \"Others agree, but argue we shouldn't do things that aren’t medically necessary. There’s tension between helping people pay their bills and giving a windfall to the drug companies.\"", "Hard data on the pressures people face is limited. A recent survey found that 2.5 percent, an estimated 731,000 Canadians, said they had to borrow money to cover their drug costs.", "One challenge in coming up with a full picture is that each province and territory sets its own rules for coverage.", "\"In Quebec and Ontario, the cost to people is nearly zero\" for prescription drugs, said Ted Marmor, a professor of public policy and management at Yale University. \"But other provinces, such as Manitoba and Saskatchewan, focus on certain groups, mainly the poor and the elderly.\"", "In 2017, spending on drugs far outpaced any change in hospital and physician costs as a share of total health care spending. Although many Canadians get supplemental insurance through their jobs, plenty do not. Some people fall through the cracks.", "\"The working poor have been left out of the fold,\" family physician and associate professor at the University of Toronto Andrew Boozary said. \"It looks like 10 to 20 percent of Canadians are without drug coverage.\"", "Canada has had some success using price controls to limit the rise in drug costs. Overall, Deber said, \"it’s not likely to bankrupt you, particularly since physicians retain the option to admit patients to hospital, where their drugs would be fully covered.\"", "For health care generally, Canadians have lower out-of-pocket costs than Americans. In an apples-to-apples comparison for 2016, the per capita cost in Canada was $690, while in the United States, it was $1,103.", "Sanders said, \"In Canada, for a number of decades they have provided quality care to all people without out-of-pocket expenses. You go in for cancer therapy, you don't take out your wallet.\"", "So long as the care comes from a doctor or at a hospital, the Canadian system covers the full cost. But the country’s public insurance doesn’t automatically pay for all services, most significantly, prescription drugs, including drugs needed to fight cancer.", "Out-of-pocket spending is about 15 percent of all Canadian health care expenditures, and researchers said prescription drugs likely represented the largest share of that.", "The financial burden on people is not nearly as widespread or as severe as in the United States, but Sanders made it sound as though out-of-pocket costs were a non-issue in Canada.", "We rate this claim Half True.", "CBS News, Bernie Sanders announces 2020 run, Feb. 19, 2019", "Government of Canada, Canada's Health Care System, Feb. 26, 2018", "Canada Institute for Health Information, National Health Expenditure Trends, 1975 to 2018, 2018", "Canadian Medical Association Journal, Estimated cost of universal public coverage of prescription drugs in Canada, April 21, 2015", "Canadian Medical Association CMAJOpen, Patterns of borrowing to finance out-of-pocket prescription drug costs in Canada: a descriptive analysis, Nov. 19, 2018", "Current Oncology, A comparative analysis of monthly out-of-pocket costs for patients with breast cancer as compared with other common cancers in Ontario, Canada, February 2011", "Peterson-Kaiser Health System Tracker, Out-of-pocket spending, accessed Feb. 21, 2019", "Kaiser Health News, Canada’s Single-Payer Health System: What Is True? What Is False?, Dec. 18, 2018", "Interview, Ted Marmor, professor of Public Policy and Management, Yale University, Feb. 19, 2019", "Interview, Raisa Deber, professor, University of Toronto School of Public Health, Feb. 19, 2019", "Interview, Andrew Boozary, family physician and assistant professor, University of Toronto, Feb. 20, 2019", "Email interview, Josh Orton, adviser, Sanders for President, Feb. 20, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]