["About this rating", "On 8 March 2018, the liberal Facebook page \"The Other 98%\" posted a meme reporting that 100,000 jobs at aerospace and airplane manufacturing giant Boeing will be lost — because President Donald Trump has reneged on the 2015 Joint Comprehensive Plan of Action, better known as the Iran nuclear deal:", "The claim that 100,000 American manufacturing jobs would be lost likely came from a Marketwatch report, which states:", "Boeing announced the largest of its deals with Iranian airlines in December 2016: 80 jets for Iran Air – including 50 of the 737 MAX 8 model. In April 2017, Iran Aseman Airlines signed an agreement to purchase 30 Boeing 737 MAX planes, with an option to buy 30 more. Boeing at the time said the Iran Air deal would support 100,000 U.S. jobs.", "Dan Curran, a spokesman for Boeing, told us in a statement that the company expects the effect on jobs from the policy reversal to be \"minimal,\" if there's any at all:", "The production plan that we have put in place was not and is not dependent on the Iranian orders. Boeing has a robust sales backlog of more than 5,800 airplanes, which represents about 7 years of production. Iranian airlines were not included in our order backlog. And there has been no change to our backlog or production rates as a result of the Administration’s announcement.", "At an event in Washington, D.C., Boeing CEO Dennis Muilenburg said the company had planned for the possibility that the U.S. could back out of the agreement by not committing production slots for planes slated for Iran.", "It's too early to know how blowback from the policy reversal will impact Boeing and the economy as a whole, as financial publication TheStreet.com points out:", "Bernstein's analysts said there may be as much of a chance for Boeing to profit on an Iran fallout as not.", "\"For defense contractors with significant Middle Eastern exposure, heightened regional tensions could drive increased demand for missile defense, in particular, but potentially also aircraft, ships, missiles, and vehicles,\" Harned and company wrote.", "[...]", "Various analysts, including Seaport's Sullivan and Bernstein's Harned, Laughlin and Sheey, were not overly concerned with Boeing falling behind on that production rate. The company has said it did not model the Iranian order into its production rate forecast for the 777 and the order was not part of its firm backlog of those jets as of April, which totaled 94. Any loss to 737 deliveries due to the Iranian deal would also be immaterial given the company had a backlog of 4,622 of those jets as of April.", "French aircraft dealer Airbus will also lose roughly $20 billion in business as a result of Trump's decision, because although the company is based in Europe, parts used to manufacture the planes are made in the United States. Among other large companies that stand to lose as a result of the decision are General Electric, Volkswagen, and Total, as CNN Money reports:", "Total (TOT), the French oil and gas company, signed a $2 billion agreement to help develop Iran's giant South Pars gas field, together with Chinese state oil company CNPC. Now the company is worried the agreement could collapse in the face of new sanctions.", "General Electric (GE) received millions of dollars in orders from Iran in 2017, according to company filings, for its oil and gas business. This includes orders for machine parts and equipment used in gas plants.", "[...]", "And in 2017, Germany's Volkswagen (VLKAF) announced that it would sell cars in Iran for the first time in 17 years.", "Koning Beals, Rachel. \"Boeing Will Lose Out on $20 Billion in Iran Deals as Airbus, GE Impacted.\"\r\n  Marketwatch. 8 May 2018.", "Terrarosa, Tom. \"Boeing's Gains From Rising War Fears Could Offset Lost Iran Jet Deal.\"\r\n  TheStreet.com. 9 May 2018.", "Riley, Charles, and Horowitz, Julia. \"Iran Deal: Who Loses as US Sanctions Return.\"\r\n  CNN Money. 9 May 2018.", "DiChristopher, Tom. \"Trump's Iran Nuclear Deal Exit May Spark a Sanctions Battle With Europe That Uncle Sam Already Lost Once.\"\r\n  CNBC. 9 May 2018.", "Tankersley, Jim, and Kitroeff, Natalie. \"Boeing C.E.O. Downplays Loss of $20 Billion Contract With Iran.\"\r\n  The New York Times. 9 May 2018.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]