["The article has been shared more than 1,000 times on Facebook since it was published on a website called MySchoolNews.com.ng on June 3, 2020, according to data provided by social media monitoring tool CrowdTangle.", "The article claims that the Secretary to the Government of the Federation of Nigeria, who doubles as the Chairman of the Presidential Task Force on COVID-19, Boss Mustapha, made the disclosure while briefing journalists in the capital Abuja. However, it does not quote him directly.", "Similar versions of the claim surfaced online hours after MySchoolNews’ publication, including here and here, as well as on Jamyco, a website previously the subject of a debunk by AFP Fact Check.", "MySchoolNews published another article on June 4, 2020, reporting on a statement purportedly released by the education ministry saying that universities and polytechnics would reopen on July 20, 2020 -- a week later than schools.", "Both claims are false. No major Nigerian media reported on the purported resumption because Mustapha did not make such a statement, and neither was there any evidence to support the claim.", "Shortly after MySchoolNews published the second article, it added a disclaimer, describing the press release it based the follow-up story on as “fake news”.", "“We wish to inform students and the general public to discard it (the education ministry press release, editor’s note), it is fake news emanating from a group of individuals try to cause panic on schools resumption date in Nigeria (sic),” it reads. “We urge you all to exercise patience while the Federal government is doing the needful to ensure a good learning environment for students across the country.”", "MySchoolNews clarified that Mustapha said the federal government would reopen schools “following the easing of the lockdown and reopening of worship centres, markets and business” and “when the safety of the school children could be guaranteed”.", "Nigerian education authorities denied the claims and said no decision had been made to reopen schools. The education ministry warned against “unconfirmed news” in statements posted to its official social media accounts.", "“Kindly disregard all unconfirmed news not originating from the Ministry's Official Media Handles,” the ministry said on Facebook and Twitter on June 4, 2020. “The Official date for Resumption of Schools Nationwide is yet to be confirmed.”", "Schools in Nigeria have been closed since March 2020, with Health Minister Osagie Ehanire saying the government was still working to “judge when it is safe” to resume classes.", "However, Africa’s most populous country eased restrictions on religious gathering on June 1, 2020, for an initial period of four weeks in line with many of its west African neighbours.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]