["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump tied the heroin epidemic gripping suburban white communities to the issue central to the campaign: border security and illegal immigration.", "The rate of heroin-related overdoses has nearly quadrupled between 2002 and 2013, with more than 8,200 deaths that year, according to the Centers for Disease Control and Prevention. Appearing on CNBC, Trump argued that this too is tied to weak borders.", "\"Our youth is being poisoned. You go to places like New Hampshire, where it’s the No. 1 thing, heroin, and it comes from the southern border. And you go to Ohio, as an example, I was there two days ago, and the biggest complaint they have is what’s pouring into there,\" Trump said, before repeating his False claim that Hillary Clinton \"is for open borders.\"", "We’ve all heard of poppy fields blooming in Afghanistan, but is Trump right that heroin is entering the United States largely through the southern border?", "Yes. Even though Southwest Asia supplies heroin to most of the rest of the world, nearly all of the heroin available in the United States comes from Mexico and South America.", "\"Mexico, and to a lesser extent, Colombia, dominate the U.S. heroin market, because of their proximity, established transportation and distribution infrastructure, and ability to satisfy US heroin demand,\" the U.S. Drug Enforcement Administration wrote in its National Drug Threat Assessment of 2015.", "\"Mexico continues as the primary supplier of heroin to the United States,\" the White House’s page on the international heroin market reads. \"Estimated cultivation of opium poppy reached 10,500 hectares in 2012, with an estimated pure potential production of 26 metric tons.\"", "Here’s a chart from the DEA report demonstrating the prevalence of heroin from the southern border:", "As you can see, South America and Mexico have been the sources for much of the heroin in U.S. markets for the past two decades.", "In recent years, Mexican traffickers have expanded by simultaneously wedging black tar heroin into Northeastern markets dominated by Colombian white powder heroin and increasing production and distribution of white powder heroin themselves.", "Mexican heroin accounted for 45 percent of the total weight of heroin the DEA seized and analyzed in 2012 (South American heroin accounted for 51 percent). By 2014, the proportion of Mexican heroin had grown to 79 percent (South American heroin made up about 17 percent), DEA spokesman Russell Baer told PolitiFact.", "This market share is also reflected in the amount of heroin seized at the border and the amount grown in Mexico.", "From 2013 to 2015, the amount of poppy fields cultivated in Mexico increased by 169 percent from 11,000 hectares to 28,000 hectares, according to Baer.", "In 2008, the total amount of heroin seized at the U.S.-Mexico border (about 560 kilograms) surpassed the amount seized from commercial airlines for the first time (about 400 kilograms). Border seizures nearly quadrupled from 2008 to 2015 (2,210 kilograms), according to data provided to us by Baer.", "\"The majority of the drugs in the U.S. market are trafficked across the Southwest Border from Mexico into the US. Southwest Border seizures conducted by U.S. Customs and Border Protection, while not the complete picture, provide insight into trafficking trends,\" he said.", "Traffickers typically smuggle the drugs in through secret compartments in vehicles across the border (illegally and legally), transport them to stash houses in hub cities like Dallas, Los Angeles and Phoenix, and then distribute to the Midwest and East Coast.", "Here’s a map from the Justice Department that shows how heroin moves through the United States:", "Our ruling", "Trump said heroin \"comes from the southern border.\"", "The vast majority of heroin in the United States comes from Mexico and South America.", "We rate Trump’s claim True.", "https://www.sharethefacts.co/share/a9932f9a-2c9e-400e-a421-6aab55f53ff3", "PolitiFact Ohio, Most heroin in U.S. now comes across Mexican border, Rob Portman says, March 14, 2016", "U.S. Drug Enforcement Administration, 2015 National Drug Threat Assessment, Oct. 2015", "U.S. Drug Enforcement Administration, 2014 National Drug Threat Assessment, Nov. 2014", "U.S. Drug Enforcement Administration, 2013 National Drug Threat Assessment, Nov. 2013", "U.S. Drug Enforcement Administration, 2011 National Drug Threat Assessment, Aug. 2011", "Centers for Disease Control and Prevention, Today’s Heroin Epidemic, July 7, 2015", "Office of National Drug Control Policy, \"Drug Trafficking Across the Southwest Border and Oversight of U.S. Counterdrug Assistance to Mexico,\" Nov. 17, 2015", "Email interview with Russ Baer, DEA Media Affairs special agent, Sept. 12, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]