["About this rating", "Arizona Senate candidate Bobby Wilson brought up an extraordinary personal take on the issue of gun violence during a public meeting in July 2018, describing the time, 55 years earlier, when he had used a gun to defend himself against a crazed attacker:", "The only way to stop a crazy madman from killing innocent people is you better have a good guy there with a gun. And I'm here to tell you I'm living proof of that ... When I was 18 years old, somebody was hell-bent on killing me in my sleep one night. At three o'clock in the morning, I woke up to find a rifle in my face — a semi-automatic rifle, at that — and the bullets start[ed] flying, and I started diving for cover. I dodged six bullets before I managed to crawl under my bed where I kept a loaded, single-shot .22 [rifle]. And except for that single-shot .22, I would be dead. I would've been dead in 1963.", "Here's how an Arizona Daily Star reporter tweeted about the account Wilson gave at that meeting:", "Wilson, who is repeatedly booed by the audience for various reasons (including saying everyone is good Christians) describes how he was nearly killed in his bed by a man who broke into his home, wanted to kill him. Wilson was able to shoot with a loaded gun he kept under his bed. pic.twitter.com/b0djHCXYLb", "— Joe Ferguson (@joeferguson) July 10, 2018", "What Wilson didn't convey during that meeting was that the person who allegedly tried to kill him as he slept was his own mother, whom Wilson shot dead. Nor did he mention the fact that his teenaged sister was beaten to death in the same incident. However, his extraordinary anecdote prompted an investigation by the Arizona Republic newspaper, which brought to light some disturbing details from the episode, prompted shocked reactions on social media, and garnered the attention of the national news media.", "The deaths", "In June 1963, Wilson was arrested and charged with the murder of his mother, Lavonne Wilson (52), and his sister, Judy Wilson (17), at the family's home in Hugo, Oklahoma. According to local news reports from the time, as well as Choctaw County court records which we obtained, the 18-year-old Wilson gave shifting accounts of his involvement (although Wilson now denies this).", "On 23 June 1963, police told the Lawton Constitution newspaper that Wilson (whose legal name was John Robert Wiste) at first claimed he was awakened by an explosion occurring in the early morning hours of 20 June and fled the family home before it went up in flames. He reportedly told police that he returned to the house later that day, found his mother and sister dead, and put them in bed.", "But according to later news reports, by that time autopsies of his mother and sister had confirmed that they had died before the fire started, and Wilson subsequently led police to the location of a rifle. Two days later, the Lawton Constitution reported that Wilson had confessed to killing both women and then setting fire to the house. (In an email to us, Wilson denied ever confessing to the murders.)", "The trials", "After attending his mother's and sister's funerals, Wilson was arrested and charged with two counts of murder. His lawyers, Vester Songer and Hal Welch, argued that Wilson had suffered amnesia, could not remember key events from the night of 19-20 June, and therefore was not fit to stand trial or offer a \"rational defense.\"", "Choctaw County District Court Judge Howard Phillips ordered that Wilson be admitted to Eastern State Hospital for three months for medical and psychiatric evaluation. In September 1963, Dr. Ruth Annadown, Acting Medical Superintendent at the hospital, wrote to Judge Phillips to say that \"It is the opinion of the staff that the patient has a complete amnesia for the allegations.\"", "Having interviewed Wilson, Dr. Walter E. Blevins, Staff Physician at the hospital, relayed the young man's own description of the night his mother and sister died. It is worth quoting extensively, because it constitutes an account of Wilson's memories of that night, offered just five weeks afterwards:", "On interview the patient states that he had gotten along fairly well with his mother until the last two or three years then they began to argue about practically everything, but mostly about the girls he would go with and using the family automobile. The arguments had gotten particularly heated over the past six months. He states that his mother would fly into a rage about the girl he was going with and had told him repeatedly that he would have to quit going with her.", "On the night that his mother and sister died he states that he had gone to bed and was asleep when his mother came in; she awakened him and started to argue with him about his girl friend and told him that he could not use the family car again. She also told him he would have to leave and proceeded to pack his clothes and put them in the car. He told her he was not going to leave, whereupon she picked up a loaded automatic, .22 rifle at the foot of the patient's bed and pointed it at him.", "The patient states that she clicked off the safety on the rifle and he became frightened. He says in his own mind he had to get the rifle because he knew that in her frame of mind she might shoot him. At this point he states that he cannot remember what happened, but when he came to himself his mother and sister were lying on the floor and blood was everywhere. He says that he did not know whether they were dead or not, but that they did not seem to [be] breathing.", "He says he laid them on the bed and took the gun to the car and thought about running, but decided against this and went back inside the house. He then thought about killing himself, but was afraid someone else might be blamed for it. He then took some gasoline and poured it around in the bedroom, kitchen, and bathroom and then struck a match. He states that there was an explosion and he either jumped or was blown through a window on to the ground. He states that the explosion burned his hands and face. A neighbor hearing the explosion came over and took him to the hospital.", "In an email, Wilson told us that Dr. Blevins was \"mistaken\" in his report about the interview, saying that \"He actually [was] referring to the allegations of law enforcement at the time, which was [sic] proven wrong at the trial.\"", "According to court records and news reports, Wilson's first prosecution for murder ended in a mistrial in 1965, but the case was set for a retrial in 1966. Wilson and his lawyers maintained that he still suffered from complete amnesia about the crucial events of 20 June 1963, and Dr. Moorman Prosser, a psychiatrist, gave expert testimony to that effect, writing:", "He still has a very real and complete amnesia for that period of time when his mother and sister were allegedly shot with a gun held by him. It is my studied opinion that this man cannot recall or recount this period and could not possibly assist you in explaining or accounting for his action in this interval of time.", "In March 1966, Judge Phillips ordered that a jury decide whether Wilson's amnesia meant he was incapable of mounting a proper defense. The jury sided with Wilson, but the case was not dismissed outright. As the Arizona Republic reported in 2018, the case was \"suspended\" on the basis that Wilson might someday recover his memories from that night and be in a position to present a proper defense.", "In December 1973, with the murder charges still pending and Wilson then 29 years old, his lawyers petitioned Choctaw County District Court to dismiss the case, arguing that the seven-year delay had been unreasonable and denied him his constitutional right to a speedy trial:", "The aforementioned delay, none of which was occasioned by defendant in any respect, has resulted in substantial prejudice to defendant's right to a speedy trial herein, due to the fact that relevant testimony from witnesses favorable to the defendant is no longer available due to the death of such witnesses, and it now appears and [sic] difficult and unlikely that testimony relevant to defendant's mental condition at the time of the occurrence of the incident which gave rise to the filing of this information will now be available to defendant.", "The court agreed and dismissed all charges against Wilson.", "Later life", "In a 2017 interview with Arizona's Green Valley News, Wilson averred that he obtained a degree in political science from the University of Texas at Arlington in 1968 and a law degree from Texas Tech University in 1973.", "Wilson practiced law in Burleson, Texas, before moving to Phoenix, Arizona, in 1995, taking a position as law lecturer in Maricopa County Community Colleges and starting a private investigation firm. He told the Green Valley News that \"I didn't take the Arizona bar. I'd already done the law thing in spades, and I just wanted to move straight into something else completely different.\" However, Wilson told us in an email that he tried to take the Arizona bar exam in 2012 but his efforts to practice law there were thwarted by an old controversy.", "That old controversy was that Wilson had stopped practicing law in the state of Texas under a cloud of misconduct allegations in the early 1990s. He had been convicted of defrauding a client by committing forgery in Johnson County and was suspended from the practice of law in June 1990, but in the ensuing years Wilson persisted in advertising his services as an attorney and billing and collecting legal fees from client, according to the State Bar of Texas. While disciplinary action was pending against Wilson for alleged professional misconduct in July 1994, the Supreme Court of Texas received a letter written by a \"Robert J. Wilson\" announcing his resignation from the state bar, and the court thereafter ordered that Wilson's \"law license be cancelled and revoked and his name be ... dropped and deleted from the list of persons licensed to practice law in the State of Texas.\"", "The resignation letter read (in part):", "I have been a member [of the bar] since 1973, and I must report that I no longer desire to be a member of an organization that engages (at least in my case) in a policy of persecution, rather than to protect the interests of the general public. Your office's handling of the case is not something The State Bar should be proud of. I have dismissed my Counter Claim against The State Bar, but since I no longer am a resident of Texas, I may refile the matter in Federal Court. My decision is not yet firm on this.", "I no longer intend to return to the practice of law, since I've decided life is too short to be engaged in continuing litigation with The State Bar of Texas simply because I stood up for my rights which is obviously not the thing to do when dealing with The State Bar of Texas.", "The Texas Supreme Court revoked and cancelled Wilson's state law license the following month. Wilson told us in an email that he had never resigned from the bar; that the resignation letter had been sent by \"some unknown person\" who had forged his signature. Wilson told us that he had written to the State Bar of Texas in 2012 asking to be reinstated so that he could practice law in Arizona, but his requests were denied. As of July 2018, the State Bar of Texas web site lists Wilson as having been \"not eligible to practice law in Texas\" since August 1994.", "Recovered memories", "In 2010, Wilson published his memoirs in book form as Bobby's Trials, in which he asserted that he had never confessed to killing either his mother or sister, and that corrupt and abusive police had lied to the local press about the case.", "In the book Wilson gave a detailed account of the events of that fateful night, claiming that early in his legal career (about ten years after the deaths), he visited a crime scene at a gas station in Texas while representing a client, and the odors of blood and gasoline brought back a full, conscious recollection of what had happened in the early morning hours of 20 June 1963.", "Since then, Wilson has averred he remembers that his sister was killed when his mother, aiming for him, struck her with the butt of a rifle. He has admitted that he shot his mother dead, but he denies setting the house on fire, claiming instead that his mother's wild shooting caused jars of gasoline stored in his bedroom to smash and spill, and the house subsequently exploded when a light switch shorted. In Bobby's Trials he described the event in a markedly different fashion than was recorded by Dr. Blevins back in 1963:", "I had been in a deep sleep that morning, when suddenly I was startled by my mother shaking me violently and shouting, \"Get up!\" \"I don't have any pants on,\" I said. \"Get up now!\" The barrel of my .22 caliber Mossberg fully loaded semi-automatic was pointed at me. I slid my feet out from under the bed covers, turned my back on my mother, and pulled up my jeans, when she screamed again. \"Don't turn your back on me, you sorry bastard. Think you can leave me for some worthless bitch like your father did? I'll show you.\"", "I turned around to face the rifle barrel and the crazed look of a woman out of her mind. She was going to shoot me. I had no doubt. I reached up and pulled the ceiling light string, and the only light source in my room was gone. The room was immediately totally black. I fell to the floor and crawled on my hands and knees behind my steel frame bed, trying to hide and looking for cover.", "Blam blam blam blam blam blam. She started shooting, six times. Muzzle flashes and bullets flew all across my room. Bullets and empty shells struck the walls, the floor, and the steel bed frame of my bed and ricocheted all around. I heard glass breaking and things falling from the walls. A shadow moved through the open door of our adjoining bedrooms, and Mother thought it was me. She was startled, and her shadow swung that Mossberg rifle by its barrel like a baseball bat. There was a sickening thud and moan as a body crashed into the steel headboard of my bed frame and fell to the floor.", "I had always kept my small single-shot .22 caliber rifle under my bed ... I looked over the top of my bed and could see Mother's shadow under that single ceiling light bulb. She held the rifle in one hand and was trying to find that string with the other hand as she turned in slow circles while trying to turn on that light bulb.", "I knew I was a dead man if she managed to turn on that light. There was no question in my mind now that she had gone completely crazy and would kill me and anyone else who got in her way. I only had one chance to survive this encounter, and I took it. I raised and pointed the short rifle toward where her head should be, and I fired. She collapsed near my bed without a sound.", "I pulled myself up with one hand on my bed, reached for that still swinging light string, and pulled it. I was greeted by the most horrible sight a boy could possibly encounter. Lying in a bloody heap on the floor was my mother, on top of my sister. Both were bleeding profusely from head wounds. Both were still breathing heavily and slowly. One of my mother's eyes was gone; just a bloody eye socket remained. Sister's long brown hair was heavily matted in blood. Blood was everywhere. Mother still had her work clothes on. Sister was in her pajamas, now soaked in blood.", "In an email, Wilson told us that \"I stand by the wording and information in my book, 'Bobby’s Trials,' it is the most accurate description of what occurred.\"", "As of July 2018, Wilson is running as a Republican in Arizona's 2nd State Senate District. The Republican primary election is scheduled to take place on 28 August 2018.", "Steinbach, Alison.   \"Arizona Senate Candidate Who Killed His Mother Supports 'Good Guys' with Guns.\"\r\n    The Arizona Republic.   16 July 2018.", "Amatulli, Jenna.   \"Pro-Gun Arizona State Senate Candidate Talks About Killing His Mother.\"\r\n    Huffington Post.   18 July 2018.", "Schallhorn, Kaitlyn.   \"Arizona Senate Candidate Who Fatally Shot His Mom Decades Ago Argues for Gun Rights for Self-Defense.\"\r\n    Fox News.   18 July 2018.", "United Press International.   \"Youth Queried About Murders of Mom, Sister.\"\r\n    The Lawton Constitution and Morning Press.   23 June 1963.", "United Press International.   \"Youth Admits Two Murders, Setting Fire.\"\r\n    The Lawton Constitution and Morning Press.   25 June 1963.", "Wiste, Robert.   \"State of Oklahoma vs. Robert Wiste — Motion.\"\r\n    Choctaw County District Court.   28 December 1973.", "Wiste, Robert   \"State of Oklahoma vs. Robert Wiste — Petition for Adjudication of Mental Incapacity of Defendant to Conduct a Rational Defense.\"\r\n    Choctaw County District Court.   7 March 1966.", "Annadown, Dr. Ruth V.   \"Letter to Judge Howard Phillips RE: Wiste, John Robert.\"\r\n    Choctaw County District Court.   5 September 1963.", "Blevins, Dr. Walter E.   \"Report RE: Wiste, Robert John.\"\r\n    Choctaw County District Court.   1 August 1963.", "Songer, Vester and Hal Welch.   \"State of Oklahoma vs. Robert Wiste — Affidavit of Attorneys.\"\r\n    Choctaw County District Court.   7 March 1966.", "United Press International.   \"Re-Trial Slated in Murder Case.\"\r\n    The Lawton Constitution and Morning Press.   8 March 1965.", "Wicks, Sammie Ann.   \"Trial by Fire: The Winding, Complicated Life of Bobby Wilson.\"\r\n    Green Valley News.   16 August 2017.", "Peterson, Steven D. and Linda A. Acevedo.   \"The State Bar of Texas v. Robert J. Wilson -- Disciplinary Petition.\"\r\n    Johnson County District Court, 18th Judicial District.   15 June 1990.", "Phillips, Chief Justice Thomas R. et al.   \"In the Matter of Robert J. Wilson, an Attorney -- Order.\"\r\n    Supreme Court of Texas.   18 August 1994.", "Office of the General Counsel, State Bar of Texas.   \"In the Matter of Robert J. Wilson, an Attorney -- Response of the Chief Disciplinary Counsel to the Resignation of Robert J. Wilson, an Attorney.\"\r\n    Supreme Court of Texas.   26 July 1994.", "Wilson, Bobby.   Bobby's Trials.\r\n    Apache Publishing Company, 2010.   ISBN 978-1439261187.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]