["House Speaker Nancy Pelosi, D-Calif., and the Democratic Caucus address reporters on H.R. 1, the For the People Act of 2021, at the Capitol in Washington on March 3, 2021. (AP/Applewhite)", "If enacted into law, H.R. 1 would restore federal voting rights for felons only once they’ve completed their sentence and been released from incarceration. The Boston Marathon bomber is serving a life sentence and would not be allowed to vote from prison.", "In Massachusetts and several other states, voting rights for felons are already restored when they’re released from their correctional facility. H.R. 1 would not affect that.", "A spokesperson for Charlie Kirk acknowledged the error and said Kirk misread a show note sent from one of his producers during the broadcast.", "Turning Point USA founder Charlie Kirk falsely claimed that the sweeping voting and elections bill House Democrats passed would put a ballot in the Boston Marathon bomber’s hands.", "\"They should really rename this bill to the ‘Boston bomber bill,’\" Kirk said March 4 on his radio show. \"Because this bill would allow the Boston bomber to have a right to vote.\"", "That’s inaccurate. The For the People Act, or H.R. 1, combines proposals for voter registration, absentee voting, in-person voting, campaign finance and ethics related to federal elections.", "The bill passed the House on March 3, and it is expected to face Republican opposition in the Senate. It comes as GOP-led statehouses across the country are pushing voting restrictions based in part on false claims of voter fraud in the 2020 election.", "The proposed legislation would restore federal voting rights for felons only once they’ve been released from incarceration. The text of the bill specifically says a citizen who has been convicted of a crime should be allowed to vote \"unless such individual is serving a felony sentence in a correctional institution or facility at the time of the election.\"", "Kirk’s claim refers to Dzhokhar Tsarnaev, who with his brother set off two pressure cooker bombs near the finish line of the Boston Marathon in 2013, killing three people and injuring hundreds.", "Visitors pause at a makeshift memorial in Boston's Copley Square for victims of the Boston Marathon bombings, April 27, 2013. (AP)", "Tsarnaev is serving a life sentence at a maximum-security facility in Colorado, after a federal appeals court threw out the death penalty in a decision that has since been appealed to the U.S. Supreme Court. As long as he’s in prison on the felony conviction, he would not be allowed to vote.", "\"Under H.R. 1, rights restoration is effective upon leaving prison,\" said Danielle Lang, co-director of voting rights and redistricting at the Campaign Legal Center, which supports the bill.", "A spokesperson for Kirk acknowledged the error and told PolitiFact that Kirk misread a show note sent from one of his producers during the broadcast.", "\"While H.R. 1 does vastly expand the voting rights for convicted felons who have been released from prison, if passed, it would not provide current inmates the right to vote,\" the spokesperson said in a statement, adding that some progressives, such as Sen. Bernie Sanders of Vermont, have advocated for allowing inmates to vote.", "In 18 states, including Massachusetts and Colorado, felons lose their voting rights while they are incarcerated but have them automatically restored upon release, according to the National Conference of State Legislatures. In 19 more states, felons regain voting rights after completing parole or probation, and sometimes after paying outstanding fines or fees.", "In Maine, Vermont and Washington, D.C, felons never lose the right to vote.", "\"Massachusetts citizens who are incarcerated for a felony conviction are not able to register to vote or vote,\" said Debra O’Malley, a spokesperson for Massachusetts Secretary of the Commonwealth William Francis Galvin. \"Upon release from incarceration in a correctional facility, these citizens may register to vote again and vote as any other citizen would.\"", "The text of H.R. 1 appears to align with the Massachusetts Constitution, so there would be no changes to felon voting rights in the state if it became law, O’Malley said.", "Kirk said H.R. 1 \"would allow the Boston bomber to have a right to vote.\"", "That’s wrong. The proposed legislation would restore federal voting rights for felons only once they’ve completed their sentence and been released from incarceration. Tsarnaev, the convicted bomber, is serving a life sentence in prison.", "In Massachusetts and several other states, voting rights for felons are already restored when they’re released.", "We rate this claim False.", "Charlie Kirk on YouTube, \"Democrats' Bold Moves to End Policing & Subvert Our Elections | The Charlie Kirk Show LIVE 03.04.21,\" March 4, 2021", "Media Matters for America, \"Charlie Kirk lies about H.R. 1 and restoration of voting rights,\" March 4, 2021", "Brennan Center for Justice, \"Annotated Guide to the For the People Act of 2021,\" March 4, 2021", "National Conference of State Legislatures, \"Felon Voting Rights,\" Jan. 8, 2021", "The Associated Press, \"Boston Marathon bomber sues over ballcap, showers in prison,\" Jan. 7, 2021", "Congress.gov, \"H.R.1 - For the People Act of 2021,\" Jan. 4, 2021", "PolitiFact, \"Would Congress’ New Voting-Rights Act H.R. 1 Allow ‘Violent Felons’ To Cast A Ballot?\" March 4, 2021", "PolitiFact, \"Kamala Harris is open to letting Boston bomber vote, but didn’t advocate for it,\" Aug. 14, 2020", "Email interview with Andrew Kolvet, spokesperson for Charlie Kirk, March 5, 2021", "Email interview with Debra O’Malley, spokesperson for William Francis Galvin, secretary of the Commonwealth of Massachusetts, March 5, 2021", "Email interview with Danielle Lang, co-director of voting rights and redistricting at the Campaign Legal Center, March 5, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]