["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Republican election challenger, right, watches over election inspectors examining ballots as votes are counted into the early morning hours Wednesday, Nov. 4, 2020, at the central counting site in Detroit. (AP)", "At one point, more than 500 Republican, Democratic and nonpartisan challengers were inside Detroit’s ballot counting center to observe, including over 200 Republican challengers.", "Others were not allowed in because the number of challengers in the room had reached the limit allowed under state law.", "On Nov. 4, chaos erupted at Detroit’s TCF Center, the convention hall where election workers processed and counted the city’s absentee ballots, as dozens of partisan poll monitors clamored to get into the counting area. They banged on the doors and windows, demanding that election workers stop the count until they could enter.", "Some Facebook posts aired claims that Republican challengers were improperly barred from observing the process. One post claimed, \"The Democrats are locking us out and not letting us in to supervise the ballot counting at the TCF Center in downtown Detroit!\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "President Donald Trump, whose campaign filed an unsuccessful lawsuit to stop the counting, repeated that claim in a speech Nov. 5, saying, \"Our campaign has been denied access to observe any counting in Detroit.\"", "That’s not true, and many news networks halted their broadcasts of the president’s speech because he was spreading misinformation.", "The Facebook claim isn’t true either. A certain number of challengers, Democratic and Republican, were prohibited from entering TCF, but that’s because the number of challengers already observing the process had reached the limit allowed under state law, Detroit election officials said.", "Over 100 Republican challengers remained inside the room where absentee ballots were being counted.", "Detroit election workers gathered at TCF on Election Day to begin counting the absentee ballots. Chris Thomas, special adviser to Detroit City Clerk Janice Winfrey this election, said then that the process was going smoothly. Thomas noted that there was not \"wide scale challenging\" of ballots by the Republican and Democratic challengers.", "Michigan allows election challengers appointed by political parties and interest groups, as well as poll watchers, to observe the election process, including the counting. While credentialed election challengers at a polling place can question a voter’s eligibility to vote, poll watchers cannot.", "Detroit established 134 absent-voter counting boards to process and count ballots for the city’s 503 precincts at a central location. Under state law, one challenger per political party or sponsoring organization can observe each absent voter counting board.", "But on Wednesday, the number of challengers observing the count exceeded the allowed limit. At one point, there were more than 570 challengers in the counting room, the Detroit Free Press reported, including 227 Republican challengers.", "In a statement shared Wednesday, Lawrence Garcia, Detroit’s lead attorney, explained what happened next. \"We were well over the 134 maximum. In the haste of doing business, nobody noticed that until it was over 200 for each party, and at that point, we said, we better stop admitting people until some people leave, and we’re under the 134 number.\"", "When additional challengers tried to enter, they were denied access. Election officials at TCF told those challengers that they couldn’t enter the counting area because the room was at capacity.", "An uproar followed. The challengers gathered outside began pounding on the doors and windows, demanding that they be let back in and that election workers stop counting ballots. Republican challengers claimed they were being unfairly kept out, but election officials barred both Republican and Democratic challengers from reentering.", "\"Those are the rules,\" Garcia said in his Wednesday statement, referring to the limits on challengers. \"We have to play by them.\"", "Election workers counting ballots asked security to place paper over the windows because they felt intimidated by Republican challengers banging on the doors and windows.", "Facebook users claimed that Republican challengers were unfairly barred from monitoring the counting of absentee ballots in Detroit.", "Hundreds of Democratic and Republican challengers were present in the counting area. At one point on Nov. 5, the number exceeded the legal limit, so election officials barred some challengers, both Republican and Democratic, from reentering TCF after they left.", "Other challengers were allowed to stay and observe the process.", "We rate the claim False.", "Tresa Baldas, Kristen Jordan Shamus, Niraj Warikoo and Evan Petzold contributed to this report.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more.", "Michigan Bureau of Elections, Election Officials’ Manual, \"Absent Voter Ballot Election Day Processing\"", "The Detroit Free Press, Mikhayla Dunaj, \"Election challengers: Common challenges, their basis and why the process takes a while,\" November 4, 2020", "The Detroit Free Press, Tresa Baldas, Kristen Jordan Shamus, Niraj Warikoo and Evan Petzold, \"Chaos erupts at TCF Center as Republican vote challengers cry foul in Detroit,\" November 4, 2020", "The Detroit Free Press, Dave Boucher, \"Trump campaign files lawsuit to temporarily stop vote count in Michigan,\" November 4, 2020", "PolitiFact, Daniel Funke, Clara Hendrickson, Louis Jacobson, Noah Kim and Ilana Strauss, \"Fact-checking Trump’s election fraud falsehoods in White House remarks,\" November 5, 2020", "The Detroit Free Press, Dave Boucher, Clara Hendrickson and Tresa Baldas, \"Trump lies repeatedly about election efforts in Michigan, Detroit during national speech,\" November 5, 2020", "Facebook post, November 4, 2020", "The Detroit Free Press, Mikhayla Dunaj, \"Here are the rules Michigan poll watchers, election challengers must follow,\" November 2, 2020", "John Roach, Detroit media relations director, text message, November 5, 2020", "Matt Friedman, Detroit Votes 2020 spokesperson, email, November 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]