["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A screen grab of President Dwight Eisenhower saluting a Medal of Honor winner.", "You likely heard this already, but some conservatives and members of the military are upset that President Barack Obama saluted to Marines on Tuesday while holding a cup. Others are coming to Obama’s defense.", "We can summarize the incident in three short snippets. (And don’t worry, there’s a fact-check coming.)", "First, here’s video of the incident, which was released on the White House Instagram page:", "And here’s a slice of the reaction, this one from Fox News commentator and former President George W. Bush adviser Karl Rove.", "\"Look, he knows there are going to be two Marines at the bottom of Marine One when he gets off, and the idea that I’m going to just jaunt out there with my chai tea, and give them the old … you know it’s not a latte salute, it’s a chai salute, because he drinks chai tea, but I mean please, how disrespectful was that?\" Rove asked.", "Lastly, we found this defense of Obama on the website, Taskandpurpose.com.", "\"There’s no regulation that stipulates presidents must salute the troops. In fact, for the first 192 years of our republic, it didn’t happen. None of the first 38 commanders in chief did it,\" wrote Brian Adam Jones.", "To prove it, Jones quotes from MSNBC host Rachel Maddow’s 2012 book Drift. Maddow says saluting was a thing started by Ronald Reagan.", "\"Soldiers were supposed to salute their president; the president was not supposed to salute the soldiers. No modern president, not even old Gen. Eisenhower, had saluted military personnel. It might even be, well, sort of, improper.\" (The passage starts on Page 36.)", "We wouldn’t normally dig up a claim a few years old, but the current fascination with the presidential salute and Jones' post had us wondering about Maddow’s claim that \"not even old Gen. Eisenhower, had saluted military personnel.\"", "YouTube and archival video proves this claim wrong.", "As President-elect, Eisenhower visited Korea during the Korean War. In this video, Eisenhower clearly salutes American and United Nations troops. The salute is about 2 minutes, 30 seconds in.", "If you need proof of Eisenhower saluting the troops after taking the Oath of Office and in civilian clothes, he did so on Nov. 10, 1954, while attending the dedication of the U.S. Marine Corps War Memorial.", "Footage of the dedication clearly shows Eisenhower saluting military personnel, first when he exits a car and later as he is walking past Marines.", "Or here’s a clip from 1953, where Eisenhower is awarding the Medal of Honor to Korean War soldiers. He salutes at the 1:15 mark and again around 2:57.", "This 1959 video shows Eisenhower saluting what appear to be Italian troops, about 40 seconds in, and again at about 1 minute, 15 seconds.", "So clearly Eisenhower did salute military personnel as president, contrary to Maddow's claim.", "We suspect Maddow’s basis for her description may have roots in a 2007 New York Times opinion piece by Garry Wills, a professor emeritus of history at Northwestern University, as well as a 2004 op-ed by then-Reagan military aide and now-Minnesota U.S. Rep. John Kline.", "Wills was writing about presidents saluting soldiers when they board and exit Marine One (just like Obama on Tuesday).", "\"We are reminded, for instance, of the expanded commander in chief status every time a modern president gets off the White House helicopter and returns the salute of marines.", "\"That is an innovation that was begun by Ronald Reagan. Dwight Eisenhower, a real general, knew that the salute is for the uniform, and as president he was not wearing one. An exchange of salutes was out of order.\"", "We couldn’t locate a copy of Kline’s op-ed, which ran in The Hill, but a 2008 Reuters account of the op-ed describes Reagan taking up the saluting issue with Gen. Robert Barrow, who was the commandant of the Marine Corps.", "Reagan explained as much in a 1986 speech to service members and their families.", "\"I can't resist telling you a little story that I've just told the marine guard at the Embassy. The story has to do with saluting. I was a second lieutenant of horse cavalry back in the World War II days. As I told the admiral, I wound up flying a desk for the Army Air Force. And so, I know all the rules about not saluting in civilian clothes and so forth, and when you should or shouldn't. But then when I got this job -- (laughter) -- and I would be approaching Air Force One or Marine One and those Marines would come to a salute and I -- knowing that I am in civilian clothes -- I would nod and say ‘Hello’ and think they could drop their hand, and they wouldn't. They just stood there. So, one night over at the commandant's quarters, Marine Commandant's quarters in Washington, and I was getting a couple of highballs, and I didn't -- (laughter) -- know what to do with them. So, I said to the commandant -- I said, ‘Look, I know all the rules about saluting in civilian clothes and all, but if I am the Commander in Chief, there ought to be a regulation that would permit me to return a salute.’ And I heard some words of wisdom. He said, ‘I think if you did, no one would say anything.’", "\"So, if you see me on television and I'm saluting, you know that I've got authority for it now -- (laughter) -- and I do it happily.\"", "For the record, Army regulations simply say soldiers are not required to salute when they are in civilian clothes.", "What to make of all of this?", "Reagan does appear to be the first president who made the presidential salute commonplace, especially when exiting or boarding Air Force One or Marine One. But Eisenhower did return salute of military members while he served as president, including when he was in civilian attire.", "In an emailed response to PunditFact, Maddow said Reagan started the presidential salute as a regular, daily feature.", "\"He started it -- other presidents have continued the practice since then,\" Maddow said. \"That’s the truth.", "\"Acknowledging that truth is not the same thing as saying that no president ever threw a salute, on occasion, before then,\" she said.", "Our ruling", "Maddow wrote, \"Not even old Gen. Eisenhower … saluted military personnel\" as president.", "For the record, no president is required to salute military personnel. And presidential salutes did not become commonplace until Reagan became president.", "But Eisenhower, a five-star U.S. Army general, did salute \"military personnel\" as president, at least occasionally. We searched archived videos for about 90 minutes and found video evidence of seven salutes. Does that mean he did it all the time? No.", "Reagan perhaps made the practice routine, but Eisenhower did salute military personnel. We rate Maddow's claim Mostly False.", "Drift, Rachel Maddow, accessed Sept. 24, 2011", "Taskandpurpose.com, Sorry, The Presidential Salute Isn’t A Real Thing, Sept. 24, 2014", "Email interview with Brian Adam Jones, Sept. 24, 2014", "Email interview with Rachel Maddow, Sept. 24, 2014", "White House Instagram page, accessed Sept. 24, 2014", "Fox News, \"WATCH: Obama Gives Marines a ‘Latte Salute’,\" Sept. 23, 2014", "Critical Past, \"U.S. President-elect Dwight Eisenhower inspects UN troops and speaks at a press conference in Korea during the Korean War,\" Dec. 7, 1952", "YouTube, President Eisenhower attends the dedication ceremony of the Marine Corps War Memorial", "Critical Past, \"President Dwight D Eisenhower awards Medals of Honor for heroism in the Korean War at a ceremony in front of the White House,\" Oct. 27, 1953", "BritishPathe, \"Eisenhower Arrives In Rome 1959\"", "Ronald Reagan, \"Remarks to American Military Personnel and Their Families in Keflavik, Iceland,\" Oct. 12, 1986", "Army regulations, \"Salutes,Honors, and Visits of Courtesy\"", "New York Times, \"At Ease, Mr. President,\" Jan. 27, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]