["About this rating", "Readers sent us this inquiry:", "Levitating Car is made by VW in Chengdu, China.", "The car is able to levitate due to the abundance of minerals in Chengdu that act as electromagnetic roads.", "In May of 2011, automobile manufacturer Volkswagen announced the commencement of a \"People's Car Project\" in China which solicited Internet users in that country to submit ideas online for a \"Volkswagen model of the future\":", "Volkswagen is taking an entirely new approach to customer dialogue in China. From today, Chinese internet users can post their ideas about the car of the future on the \"People's Car Project\" (PCP) platform at www.zaoche.cn.", "\"Volkswagen has set out to create the most innovative dialogue platform ever with the 'People's Car Project'. The platform is debuting in China, because that is Volkswagen's largest and most important market. However, we also see potential for launching the project in other markets as well,\" Luca de Meo, Director of Marketing, Volkswagen Group and the Volkswagen Passenger Cars brand, explained. PCP is initially scheduled to run for a one-year period.", "Over 450 million people have access to the internet in China. These users are particularly interested in interactive content. The project reflects this demand. \"We hope to involve people via the internet and inspire them for Volkswagen,\" de Meo commented. Internet users accessing the PCP page can click their way to co-developing their Volkswagen model of the future as well as posting ideas which are then discussed and developed further by other users. They can also upload images or films.", "\"With PCP we are listening very carefully to what our customers have to say and are building cars not only for, but also with people,\" Luca de Meo explains, adding that this gives Volkswagen a valuable insight into the wishes, needs and demands of Chinese customers.", "A year later, Volkswagen announced it had selected three entries from the more than 119,000 ideas submitted to develop further as concepts for display at Auto China 2012: a Music Car, a Hover Car, and a Smart Key:", "With 33 million visitors to the website and more than 119,000 ideas submitted, the 'People's Car Project' (PCP) launched in China 11 months ago has far exceeded all expectations. Three of the vehicle and technology concepts created by users of an online platform and further developed by Volkswagen are currently on show at Auto China 2012: These concepts are the Hover Car, the Music Car and the Smart Key.", "With the Hover Car, an environmentally-friendly two-seater city car which hovers just above the ground, Volkswagen is presenting the study of a zero-emissions vehicle that could in future travel along electromagnetic road networks. 'The creative ideas from the 'People's Car Project' give us a valuable insight into the wishes of Chinese drivers,' Simon Loasby, Head of Design at Volkswagen Group China, said. 'The trend is towards safe cars that can easily navigate overcrowded roads and have a personal, emotional and exciting design.'", "The 'Music Car' expresses the wish of many Chinese for individual automotive design. Equipped with organic light emitting diodes, the exterior colour of the vehicle changes with the driver's choice of music. More than ever, the car thus becomes a means of self-expression and a fashion statement for young drivers.", "The 'Smart Key', also developed under the PCP and currently on show in Beijing, takes up the trend towards the stronger integration of online technologies in vehicles: the slim nine millimetre key has a high-resolution touchscreen which keeps the driver up to date on the fuel situation, climate conditions and the car's security via the 3G network. The driver can also monitor the vehicle from a bird's eye perspective through realtime satellite transmission.", "The levitating car shown in the video clip displayed above currently exists only as a concept that was given form for display at an automobile show in China; a working model of the vehicle as shown in the video does not exist.  A second clip makes it clear that the original video was the product of the filmmaker's art (and some digital trickery) created to surprise the originator of the concept by seemingly bringing her idea to life:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]