["Social media companies quickly acted to limit the spread of the slickly-produced film, which was released on August 18, 2020 after being heavily promoted, but did not achieve the same impact as the original “Plandemic” video from May 2020.", "The film is part of a trend of inaccurate information about the novel coronavirus that has spread on the internet for months, sowing fear and falsehoods about a virus that has killed more than 790,000 people since it emerged in China in late 2019.", "In one section of the film, Dr Meryl Nass says she believes the coronavirus is not of natural origin -- a claim that experts have said is inaccurate.", "“Early in this pandemic, I did not think the coronavirus was a natural occurrence from bats. I felt quite convinced that this was a laboratory-designed organism,” Nass says.", "In February 2020, more than two dozen public health scientists issued a statement in medical journal The Lancet saying: “We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin.”", "“Scientists from multiple countries have published and analyzed genomes of the causative agent, severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), and they overwhelmingly conclude that this coronavirus originated in wildlife,” they said.", "A team of scientists led by Shan-Lu Liu of The Ohio State University also concluded that there is no “credible evidence” that the virus -- officially known as SARS-CoV-2 -- was engineered in a laboratory, in research published on February 26.", "And Dr Julian Leibowitz, an expert in coronaviruses who is a professor of microbial pathogenesis and immunology at Texas A&M’s College of Medicine, has said of the claim: “This is wrong on so many levels.”", "“There is NO evidence that SARS-CoV-2 is a laboratory created virus,” he said.", "Suggestions that the virus emanated from a laboratory gained renewed attention in 2021. Such claims remain unproven, but US President Joe Biden on May 26 ordered intelligence agencies to report to him within 90 days on the origin of Covid-19.", "At another point, the film seeks to paint similarities between “Event 201” -- an October 2019 exercise simulating a pandemic -- and the subsequent coronavirus crisis as evidence that global health leaders knew in advance that it would happen.", "“Event 201 took place five months before COVID-19 was declared a pandemic. Participants in the event were some of the same people who are now deeply involved in the real pandemic -- and profiting from it as well,” says Mikki Willis, the film’s director.", "David E Martin, who is featured throughout the film, later says “the scenario we’re supposed to accept” is “this is that wonderful universe of improbabilities where events just co-emerge and then nature conveniently backs itself into our architecture.”", "But Dr Tara Kirk Sell, who co-led the Event 201 exercise and helped write the script, told AFP by phone: “We didn't predict anything. This is basically modeling and thinking through what kind of challenges we would face.”", "“We had identified many of those challenges ahead of time,” which “just means that we're good at our jobs,” she said.", "“It’s just so strange to me that they would think, ‘Well, how could they have possibly guessed what would be a challenge?’ Well, we use the experience of what has happened in the past, and based on current trends and what the issues are now, it's not hard to see what the expected challenges could be.”", "The exercise was part of a series, including one the previous year, hosted by the Johns Hopkins University’s Center for Health Security to illustrate “high-level strategic decisions and policies stakeholders will need to pursue to diminish the consequences of a severe pandemic.”", "The film also quotes Dr Anthony Fauci, the director of the US National Institute of Allergy and Infectious Diseases (NIAID), as warning of “a surprise outbreak.”", "He “knew as early as January 2017 that we would see an outbreak before the end of 2020,” Willis says, implying that Fauci had specific prior knowledge.", "But Fauci’s full remarks make clear that it was a general warning that did not include a specific year.", "“The history of the last 32 years that I’ve been the director of NIAID will tell the next administration that there’s no doubt in anyone’s mind that they will be faced with the challenges that their predecessors were faced with,” Fauci said near the beginning of his remarks.", "The film also seeks to raise fears about vaccines that could help address the coronavirus crisis.", "It includes a clip from CBS News in which Norah O’Donnell asks Bill Gates about the side effects from the Moderna COVID-19 vaccine candidate, which is currently in clinical trials, with the anchor saying that 80 percent of participants experienced a systemic side effect.", "However, a systemic effect is any adverse impact that is not at the injection site.", "According to the National Institutes of Health, “None of the participants experienced serious side effects from the vaccine. However, more than half reported fatigue, headache, chills, or pain at the injection site. These symptoms were most common following the second vaccination and in those who received the highest vaccine dose.”", "AFP Fact Check previously debunked false claims about vaccine safety amid the accelerated timeline for development of a COVID-19 immunization.", "The film also includes a clip of Arthur Caplan saying: “The shortest time anybody’s ever found a vaccine against any disease that I’m familiar with is about seven years. The average time is 20. To be talking about a magic bullet coming in months, it borders on the absurd.”", "It then goes to clips of Microsoft co-founder Bill Gates and Fauci talking about shorter time frames.", "Caplan, the director of the division of medical ethics at the New York University School of Medicine, said by phone that he was unaware he was in the film, though the quote “seems correct.”", "“I am not worrying quite as much about dangerous vaccines being released, what I am worried about is that we don't find an efficacious vaccine that will let us get back to work and school,” he said.", "There are, however, some reasons for optimism.", "“There are over 160 vaccines being examined for this one virus. That has never happened. We never had that many companies and science groups all working to find something at the same time,” Caplan said.", "“And also, we have never spent so much money so fast to find a vaccine that works. So those are reasons to be hopeful.”", "But he did caution that “the first vaccine is not gonna be the end of COVID,” saying that vaccines are likely to be only partially effective, and some people may not take them.", "Gates is a leading advocate for a COVID-19 vaccine, a stance that has made him a target of anti-vaccine campaigners and other groups who have implicated him in various conspiracy theories about the crisis.", "The Bill & Melinda Gates Foundation has committed hundreds of millions of dollars to coronavirus response efforts, but in an effort to discredit its work on vaccination, the film focuses on two very different immunization efforts in India.", "The Program for Appropriate Technology in Health (PATH), a non-profit that received funding from the Gates Foundation, was investigated by the Indian government over a trial for the Human Papilloma Virus (HPV) vaccine. The government report found: “The interest, safety and well being of subjects were completely jeopardized by PATH.”", "Mary Holland of the non-profit anti-vaccine advocacy organization Children’s Health Defense, claims in the film that seven girls died as a result of adverse effects from the PATH vaccine trial.", "But reporting from India in Science found that five of the deaths were unrelated to the vaccine. “One girl drowned in a quarry; another died from a snake bite; two committed suicide by ingesting pesticides; and one died from complications of malaria.”", "The film goes on to claim that more than 490,000 children in India “developed paralysis as a result of the Gates-supported oral polio vaccine.”", "AFP Fact Check previously investigated this topic, finding the claim misleading. India was officially declared polio-free in 2014 and there is no evidence that almost half a million Indian children suffered from paralysis due to vaccine-derived polioviruses.", "The film spotlights a 2018 study that found a correlation between non-polio acute flaccid paralysis (NPAFP) and polio vaccination rounds conducted from 2000-2017.", "Acute flaccid paralysis (AFP) resembles the floppy limb paralysis caused by polio, but has many infectious and non-infectious causes. Guillain-Barre Syndrome is a leading cause of AFP.", "The study received criticism for its methodology, partly for including symptoms shown by children between ages five to 15, when the oral polio vaccine campaign focused on children under age five. The authors responded that they believed including the older children was merited.", "The film’s claim that the Gates Foundation was kicked out of India is also false.", "In 2017, the Indian government said: “Some media reports have suggested that all health related collaboration with the Gates Foundation with National Health Mission (NHM) has been stopped. This is inaccurate and misleading. BMGF continues to collaborate and support the Ministry of Health and Family Welfare.”", "The film -- which runs around one hour and 24 minutes -- is the sequel to a shorter video released in May 2020 that featured a discredited researcher who made a series of false and misleading claims about the virus. AFP Fact Check debunked it here.", "Unlike the previous video, this film’s release was announced, and it has been split into 16 parts to make it easier to spread on social media sites.", "The film premiered on the “Digital Freedom Platform” of London Real, which was founded by Brian Rose, who introduced it.", "London Real’s “About” page describes Rose as a former banker who started a podcast and ultimately built a media company featuring hundreds of interviews “as an antidote to the numbing effects of mainstream media.”", "Rose heavily promoted the film on Twitter prior to the start of streaming, and also claimed that there was a “MAJOR Brute Force Denial of Service Attacks” aimed at hampering its premiere.", "The “Digital Freedom Platform” features the original “Plandemic” video, and also includes segments falsely claiming that social distancing and vaccines will make the coronavirus pandemic worse, and that face masks are ineffective and are being used to control the population.", "Both masks and social distancing are recommended by US health authorities as a means of curbing the spread of COVID-19.", "Social media companies are seeking to limit the film’s spread.", "“Given the previous Plandemic video violated our COVID misinformation policies, we blocked access to that domain from our services,” a Facebook company spokesperson said by email.", "“This latest video contains COVID-19 claims that our fact-checking partners have repeatedly rated false so we have reduced its distribution and added a warning label showing their findings to anyone who sees it,” the spokesperson said.", "According to Twitter, the URL linking to the full video is being marked as unsafe, and parts of the video may violate the site’s rules.", "And according to YouTube, the site has seen little activity, but it is removing full versions of the video because it violates its policies on COVID-19 misinformation.", "Zarine Kharazian of the Atlantic Council's Digital Forensic Research Lab, which focuses on identifying and exposing disinformation, said that “Facebook, Twitter, and YouTube all appeared to take much more of a proactive approach to limit the spread of the video this time than they did with Plandemic 1.”", "It appears “to have worked -- by all measures, Plandemic 2 was a total flop compared to its predecessor, still collecting tens of thousands of engagements, but nowhere near the scale of Plandemic 1,” she said by email.", "AFP Fact Check has debunked more than 600 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Marisha Goldhamer, Manon Jacob and Claire Savage contributed to this article.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]