["During his victory speech after the New Hampshire primary, Donald Trump repeated a claim he’d made several times before.", "\"Don't believe those phony numbers when you hear 4.9 and 5 percent unemployment,\" Trump said. \"The number's probably 28, 29, as high as 35. In fact, I even heard recently 42 percent.\"", "Actually, Trump’s the one who shouldn’t be believed. Numbers that high are not even close to accurate.", "To understand why, let’s start by discussing how the official unemployment rate is calculated.", "The Bureau of Labor Statistics, a federal agency, uses surveys and statistical sampling to calculate how many Americans do or don’t work. To calculate the unemployment rate, the agency divides the number of people who are out of work (counting only those who have recently looked for work) by the sum of the job-seeking and job-holding population.", "During the most recent month -- January 2016 -- the unemployment rate was 4.9 percent, its lowest level since February 2008.", "Not factored into this calculation, however, are people who are not currently looking for work. This is a longstanding concern for economists, because at least some of those people who aren’t looking for work right now might prefer to be looking for work but don’t feel they have a shot in the current job market.", "To ease such concerns, the bureau also produces a statistic with a more expansive definition of what it calls \"labor underutilization.\" This statistic is known by the wonky shorthand \"U-6.\"", "The U-6 rate includes both those who are officially \"unemployed\" and those who are working part time for economic reasons and those who are \"marginally attached\" to the work force, meaning they want to work but have not looked for work recently enough to count as being actively in the labor force.", "Currently the U-6 rate is 9.9 percent, about double the official unemployment rate. But that’s also its lowest level since May 2008.", "It’s possible to argue that the U-6 rate offers a fairer way of encapsulating the unemployment picture; some mainstream economists are sympathetic to that argument.", "But where Trump goes off the rails is in suggesting that the \"real\" unemployment rate is somewhere between 28 percent and 42 percent.", "Why? He’s including a ton of Americans not expected to be working. Let’s explore this point further.", "The source of Trump’s 42 percent figure appears to be a column by David Stockman, who served as President Ronald Reagan’s budget director.", "Stockman calculated that there are currently 210 million Americans between the ages of 16 and 68 -- what he calls a \"plausible measure of the potential workforce.\" If you assume that each of those people is able to hold down a full-time job, he wrote, they would offer a total of 420 billion potential working hours. However, during 2014, Stockman noted, only 240 billion working hours were actually recorded by the Bureau of Labor Statistics.", "If you run the numbers, \"the real unemployment rate was 42.9 percent,\" Stockman wrote.", "Economists say Stockman’s way of looking at the question -- using actual hours worked divided by a theoretical maximum that could have been worked, rather than determining whether individual people are employed or unemployed -- is provocative. But they say this raw measurement has serious flaws.", "Indeed, in his column, Stockman acknowledges that this figure is imperfect, even though his tone is flip when he does so.", "\"Yes, we have to allow for non-working wives, students, the disabled, early retirees and coupon clippers,\" he wrote. \"We also have drifters, grifters, welfare cheats, bums and people between jobs, enrolled in training programs, on sabbaticals and much else.\"", "Snark aside, economists say this caveat is crucial.", "Stockman’s calculation \"treats people voluntarily working part-time hours as partly unemployed, even if they have excellent reasons for wanting to hold only a part-time job, such as rearing children, attending school or college, being disabled, or transitioning into retirement,\" said Gary Burtless, an economist at the Brookings Institution. \"A lot of the shortfall between full-time and part-time employment is perfectly reasonable, as is a potential worker’s decision not to work or look for paid work at all.\"", "In other words, Trump’s faith in the accuracy of the 42 percent figure is misplaced.", "So is there a plausible calculation that can get us to 42 percent? The short answer is no.", "To see why, let’s start with the number of Americans age 16 and up who are not either (1) employed, (2) unemployed, (3) in the military or (4) institutionalized. That gives us 94 million \"non-working\" Americans.", "We then subtracted the number of people who have good reasons not to be working or looking for work.", "• People age 16 to 19 who are not in the labor force: Subtract 10.8 million", "• People age 65 and up who are not in the labor force: Subtract 38.4 million", "• Students, age 20-24: Subtract 8.7 million", "• Students, age 25-29: Subtract 2.9 million", "• Students, age 30-34: Subtract 1.4 million", "• Stay-at-home moms: Subtract 10.4 million", "• Stay at-home dads: Subtract 2 million", "• Those receiving disability checks: Subtract 8.9 million", "So what remains? By this calculation, there are 10.5 million Americans who do not have obvious reasons for not working.", "If you were to use these numbers to create a new type of \"unemployment\" rate -- call it \"U-7\" if you like -- it would come out to 15.6 percent. That’s higher than the U-6 rate of 9.9 percent, but it’s only a fraction of the 42 percent Trump claimed.", "This isn’t a perfect calculation. There’s probably some double-counting, and there could be good reasons why some of those 10.5 million Americans aren’t working, such as being a full-time student between the ages of 34 and 65, undergoing job training, or being affluent enough to be able to forgo work or retire early. Some might argue that students shouldn’t get off so easy because they should be able to handle a job along with their studies, or that we should set a higher retirement-age cutoff than 65.", "Quibble with the numbers if you like, but this is a solid enough back-of-the envelope calculation to show how wildly inaccurate Trump’s claim is. And remember, we are deliberately stretching the numbers here as an intellectual exercise; we are not saying that 15.6 percent is a more accurate unemployment rate than the official one of 4.9 percent.", "There’s even a silver lining to the current state of affairs, Burtless said. Most of those suffering from being \"out of work\" by Trump's definition can actually be seen as benefiting from their membership in an affluent, technologically advanced society.", "The fact that millions of adults are what Trump would term \"jobless,\" he said, \"is not a marker of economic failure -- it is an indicator of a very prosperous society that can afford to permit the old and disabled to retire, that can invest in young adults so they can improve their skills, and that can keep some adults in the home where they can care for children or attend to other non-paying pursuits.\"", "Our ruling", "Trump said, \"Don't believe those phony numbers when you hear 4.9 and 5 percent unemployment. The number's probably 28, 29, as high as 35. In fact, I even heard recently 42 percent.\"", "While economists say that there are other, more expansive calculations of unemployment or under-employment, none of the official ones are currently higher than 9.9 percent, and the highest credible number we could calculate was 15.6 percent. That’s far, far lower than 42 percent -- or even 28 percent. We rate the claim Pants on Fire.", "Donald Trump, victory speech in New Hampshire, Feb. 9, 2016", "David Stockman, \"The Warren Buffett Economy——Why Its Days Are Numbered (Part 4),\" June 15, 2015", "Bureau of Labor Statistics, \"Labor Force Statistics from the Current Population Survey\" (main index page), accessed Sept. 29, 2015", "U.S. Census Bureau, \"Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties, and Puerto Rico Commonwealth and Municipios: April 1, 2010 to July 1, 2014,\" accessed Sept. 29, 2015", "Social Security Administration, \"Selected Data from Social Security's Disability Program,\" accessed Sept. 29, 2015", "National Center for Education Statistics, \"Table 103.20: Percentage of the population 3 to 34 years old enrolled in school, by age group: Selected years, 1940 through 2013,\" accessed Sept. 29, 2015", "Washington Post Fact Checker, \"Trump’s absurd claim that the ‘real’ unemployment rate is 42 percent,\" Aug. 21, 2015", "Email interview with Tara Sinclair, George Washington University economist and chief economist for Indeed, Feb, 11, 2016", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, Sept. 29, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]