["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In July 2020, a message started circulating on Facebook that claimed the Federal Emergency Management Agency (FEMA) was providing $4,800 in hazard pay to those who have been working during the COVID-19 pandemic. These posts typically included a brief piece of text followed by a hyperlink as shown below:", "While reading this message may give the impression that FEMA is offering hazard pay to workers due to the COVID-19 pandemic, those who clicked on the link were quickly made aware that this post was just a joke.", "The link in the above-displayed message, for instance, does not direct readers to a page on the official FEMA website about hazard pay. Rather, this link directs readers to an image of a gorilla who appears to be holding up its middle finger:", "While the above-displayed message was circulated as a pointed joke (the point being, it seems, that FEMA should be providing hazard pay to workers), the COVID-19 pandemic has provided ample opportunities for misinformation to spread online. FEMA has added a \"rumor control\" page to its website in order to address some of this misinformation. This page begins by informing readers that they can do \"three easy things\" to stop the spread of false information:", "FEMA helps the public distinguish between rumors and facts regarding the response to coronavirus (COVID-19) pandemic.", "Do your part to the stop the spread of rumors by doing three easy things:", "Find trusted sources of information.\nShare information from trusted sources.\nDiscourage others from sharing information from unverified sources.", "To find trusted sources, look for information from official public health and safety authorities. You can find many official sources at coronavirus.gov. Check your state and local government or emergency management websites and social media accounts for trusted information specific to your area.", "FEMA.gov/Em>.   \"Coronavirus Rumor Control.\"\r\n    Retrieved 30 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]