["“Zinc stops viral replication inside lung cells,” reads a screenshot circulating on Facebook. “Vitamin D builds the immune system. All freely available over the counter.”", "The text -- which also recommends taking vitamin C and tonic water -- surfaced after news on November 9 that a vaccine jointly developed by US drug giant Pfizer and German firm BioNTech was 90 percent effective at preventing Covid-19, the disease caused by the virus.", "The companies have since confirmed they would seek approval for an early roll-out of the vaccine, shown in final trial results to be 95 percent effective.", "While the Facebook posts do not explicitly refer to the pandemic, they attracted comments criticising “Big Pharma” and asking for advice on taking easily available products.", "Anti-vaccine groups have spread misinformation throughout the coronavirus crisis, a factor that public health experts warn could culminate in large populations not taking up a vaccine when it becomes available.", "“What are the proper levels of some of this stuff to take?? I’m not sure how much and what frequency...just asking for a friend..!!” one Facebook user commented.", "However, scientists said that none of the measures described in the posts had been found effective in treating Covid-19.", "Contacted by AFP, Ian Jones, professor of virology at Britain’s Reading University said taking zinc could not prevent or treat Covid-19.", "“Zinc is a toxic metal and although it does indeed inhibit some virus enzymes, the level required would not be tolerated in the body,” he said.", "A human’s zinc levels are “carefully regulated” and any excess is excreted, so there is “no way an inhibitory level could reach virus infected cells”.", "The US National Institutes of Health (NIH) warns against taking high doses of zinc to prevent Covid-19, pointing to a lack of evidence and potential side effects, including irreversible neurological conditions from long-term use of supplements.", "“For people on a good diet and in generally good health, excess zinc is a waste of time and money,” Jones said.", "The text also recommends drinking “quinine tonic water”, which “transports zinc into the cell”.", "Quinine is a malaria drug that is added in small doses to tonic water brands such as Schweppes for flavoring. The US Food and Drug Administration (FDA) restricts the amount of quinine in commercial beverages to 83 parts per million, roughly equivalent to 83 milligrams per liter, whereas a capsule of prescribed quinine contains 324 milligrams of the drug.", "Online rumours recommending tonic water to fight Covid-19 cure appear to originate from hydroxychloroquine, a synthetic relative of quinine touted by controversial French professor Didier Raoult as a treatment for the disease.", "No clinical trials have yet been found in favor of using hydroxychloroquine against Covid-19, and critics say that due to potential serious side effects, treating coronavirus patients with hydroxychloroquine is worse than no treatment at all.", "Brandon Brown, a professor at the University of California’s Riverside School of Medicine Center for Health Communities told AFP in April that quinine in tonic water could not work as a cure for Covid-19.", "“You would have to drink over 10 times more tonic than humans drink water per day to approach a similar effect of the drug. It’s just not possible,” he told AFP in an email, noting that humans drink about two liters of water a day on average.", "While vitamin C is an essential nutrient that helps keep cells healthy, there isn’t yet enough evidence to recommend using it to prevent or treat Covid-19.", "Research carried out before the pandemic (2017, 2019) looked at giving high doses of vitamin C to patients suffering from respiratory failure and sepsis -- conditions which can occur in severe Covid-19 cases. Various studies are now investigating if this treatment can help coronavirus patients.", "Regarding prevention, there is no evidence that taking vitamin C can ward off the novel coronavirus, according to Harvard Medical School’s ‘Treatments for Covid-19’ information page. It warns against high doses of vitamin C, which can cause nausea, cramps and an increased risk of kidney stones.", "Scientists have recommended taking vitamin D -- which the body creates from exposure to sunlight -- to promote healthy bones and muscles as people spend more time indoors during the pandemic.", "However, like vitamin C, there isn’t yet enough evidence to recommend using vitamin D to prevent or treat Covid-19, and clinical trials are ongoing.", "Vitamin D deficiency is more common in Black and Latino people, groups disproportionately hit by Covid-19 in the US. The Centers for Disease Control and Prevention (CDC) said factors such as poverty and poor healthcare contributed to the increased risk in these groups.", "“The problem in all the augments for these vitamins is conflation. You take a bit of information, like ‘these are essential nutrients’ and (in vitamin D’s case) some of the population are deficient, and you catapult that into a Covid treatment,” Jones said.", "“It is true that if you are deficient in basic nutrition then your immune system may not be in tip-top form, but that is nothing to do with a specific Covid treatment and taking it is not going to stop infection.”", "AFP has debunked multiple claims of purported cures for Covid-19, available here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]