["An incident from Pakistan that made headlines in Indian media was the death of five members of a Hindu family. Times Now claimed that the family’s murder was another instance of crimes against the minority Hindu community in Pakistan.", "#Breaking | 5 Hindus killed using knife, axe in Pakistan’s Punjab province.", "Details by Pradeep Dutta. pic.twitter.com/eatXvwI6lq", "— TIMES NOW (@TimesNow) March 8, 2021", "“Atrocities against Hindus continue in Pakistan…This is a story of five members of a Hindu family brutally murdered in Pakistani Punjab…What is unfortunate is that no one has investigated in this regard…One thing we keep on seeing is Imran Khan giving lessons and sermons on the human rights violation in India but what exactly is happening in his backyard, he tries to hardly do anything,” said Times Now reporter Pradeep Dutta.", "The channel subsequently reported that the BJP has demanded that the United Nations Human Rights Commission (UNHRC) takes note of crimes against Hindus in Pakistan.", "ANI credited Pakistan-based The News International in its report. “Social activist Birbal Das in Rahim Yar Khan told The News International that Ram Chand was a Meghwal Hindu and he was 35-36 years old. He was running a tailoring shop for a long time. He was a peaceful man and living a happy life, and the incident was quite shocking for everyone,” read ANI’s story republished by Hindustan Times, India Today, Yahoo News, India.com, Zee5 and Hindi news outlet Hindustan. WION and Zee News English published a similar report with inputs from ANI. India.com’s report was quote tweeted by BJP member Surendra Poonia who wrote, “That’s why CAA is needed!”", "The incident was also reported by One India and Newstrack", "Among the mainstream Hindi media outlets that carried reports was ABP News. The channel claimed during its broadcast that the murder of five members of a family has sparked fear among the Hindu community in Pakistan.", "#BreakingNews: पाकिस्तान में हिंदुओं पर हमला, 5 लोगों की गला काटकर हत्या@AadarshJha01#Pakistan #Hindu #India #ABPNewshttps://t.co/ftwApTaMqX pic.twitter.com/jgTU96g0DV", "— ABP News (@ABPNews) March 7, 2021", "Amar Ujala reported, “According to Pakistani newspaper The News International, throats of every member of Meghwal family were slit. Police recovered a knife and an axe from the house. It is believed that these were used by the attackers. Ram Chand Meghwal’s age is said to be 35-36. He was living peacefully with his family but this was intolerable for the attackers. Who were the attackers and why was the family murdered? This is yet to be found.” A similar report was carried by Navbharat Times.", "Pro-BJP propaganda website OpIndia too claimed this was a crime against minorities in Pakistan.", "Most reports are based on a story by Pakistan-based The News International. However, ANI and several others have selectively quoted the outlet.", "While The News International said that Ram Chand Meghwal and his family were found dead in their house, it also stated that “the police claimed the killer was the family head, Ram Chand, who slit throats of his wife (Lakshmi Mai), three children over suspicion that his wife had illicit relations”. The report further said, “The complainant, Terath Ram, a brother of Lakshmi Mai, lodged his complaint stating that his brother-in-law, Ram Chand, slit throats of his family members over suspicions.”", "The Dawn reported that Ram Chand killed his wife and three children before killing himself over unemployment.", "The Express Tribune also stated that this was a murder cum suicide case. “A man reportedly committed suicide after killing his wife and three children due to poverty on Friday night. Police said Ram Chand, a resident of Chak 135, committed suicide by cutting his vein after killing his wife and three children with a sharp instrument due to domestic disputes over poverty,” said its report.", "Regional news channel Rohi from Pakistan’s South Punjab area spoke to Ram Chand’s sister who said that he hadn’t been working for the past two years and his wife repeatedly asked him to get a job. Her statement can be heard 2:30 minutes onward in the broadcast below. The reporter also said that the dead bodies of the family members were recovered after breaking into the house.", "Alt News contacted Pakistani journalist Shiraz Hassan who shared the FIR filed by Ram Chand’s brother-in-law Tirath Ram. The FIR is in Urdu and it says, “My brother-in-law Ram Chand murdered his wife Lakshmi Mai and kids Prem Kumar, Anjali Mai and Aniqa Mai with an axe and dagger on 5-3-2021 because they used to complain…He has injured himself too. Upon receiving this information I went on the spot with Jeena Ram, Barad Ram and Chitra Ram and saw that my sister Lakshmi Mai, his son Prem Kumar and her daughters Anjali Mai and Aneeqa Mai were dead. There were knife marks on their necks. Ram Chand was shifted to the hospital by his brother. Ram Chand used to suspect my sister. He murdered his wife and kids with an axe and knife at night and later tried to commit suicide as well with the knife. I was later informed that Ram Chand also passed away in the hospital.”", "A Hindu man allegedly killed his wife and children after killing himself in Pakistan. The incident was communalised by Indian media, claiming that the incident depicts atrocities against minorities in Pakistan.", "Donate Now", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]