["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(Getty Images)", "The Department of Homeland Security announced that beginning on Feb. 19, 2021 phase one of a program to “restore safe and orderly processing at the southwest border” would begin.", "The plan is to admit about 300 people per day — from among an estimated 25,000 people with \"active cases\" in the former Migrant Protection Protocol (MPP) program.", "Since being sworn in as president, Democrat Joe Biden has signed a series of executive actions and orders, about half of which are aimed at reversing policies put in place under Donald Trump, his Republican predecessor.", "About 22 of more than 50 executive orders issued as of Feb. 25, 2021, have involved immigration issues, including changes to a Trump-era policy known as MPP -- Migrant Protection Protocols -- that required those seeking asylum at the southern border to wait in Mexico for their cases to move through U.S. immigration courts.", "Biden’s action prompted this tweeted response on Feb. 12. 2021 from U.S. Sen. Ron Johnson, R-Wisconsin: \"Biden’s plan will immediately let in 25,000 asylum-seekers who’d been waiting in Mexico as their cases were judged.\"", "Is Johnson correct?", "When asked to provide backup for the claim, Johnson spokesman Ben Voelkel pointed to a Feb. 11, 2021 news release from the Department of Homeland Security that announced the program, then simply reasserted his boss’ claim.", "Of the 25,000 people who Johnson said could be let in, Voelkel added: \"We have been told this could happen within a few weeks.\"", "Fair enough. But it’s unclear just who told Johnson or his office this. Voelkel has not responded to followup questions about this from PolitiFact Wisconsin.", "Voelkel’s original response also asserted: \"These people will be let into the U.S. while they wait for their asylum claims to be adjudicated even though we know a vast majority of them do not have valid asylum claims and will likely stay even when their claims are denied.\"", "But the news release from the Department of Homeland Security, which Voelkel cited as evidence, actually undermines Johnson’s claim.", "The news release, which noted the first phase of a new program would begin on Feb. 19, 2021, quoted Secretary of Homeland Security Alejandro Mayorkas saying the Biden administration \"is committed to rebuilding a safe, orderly, and humane immigration system.\"", "The release warned that \"changes will take time\" and \"individuals who are not eligible under this initial phase should wait for further instructions and not travel to the border.\"", "Meanwhile, according to a Feb. 12, 2021, Associated Press report, DHS officials said the department would begin slowly, by allowing in a fraction of asylum-seekers — about 300 people per day — from among an estimated 25,000 people with \"active cases\" in the former MPP program.", "In practice, however, that 300 per day was significantly lower when the program launched on Feb. 19, 2021, with just  25 MPP asylum-seekers admitted at a port of entry in San Ysidro, California, and taken to a hotel for quarantine. The group included six families and five individuals from Honduras, Peru, Nicaragua, Guatemala and Cuba.", "According to the department, a similar number were admitted each day in San Ysidro during the week of Feb. 21, 2021.", "On Feb. 24, 2021, DHS announced it would begin processing people currently at the Matamoros camp in Mexico, located across the Rio Grande from Brownsville, Texas.", "According to the department, while still in Mexico, asylum-seekers must register virtually on a website. They are then contacted for an appointment during which they are screened for eligibility to enter the United States. They are also tested for COVID-19. If they pass the screening process they are transported to a United States port of entry, where they are processed.", "\"We will work in partnership with the Government of Mexico, and partners on the ground, to facilitate the safe processing of current camp residents who qualify for this program,\" DHS said in a news release. \"New arrivals to the Matamoros camp will not gain entry into the United States through this limited process.\"", "In addition to the San Ysidro port of entry, DHS said on Feb. 25, 2021, another 25 people were processed at a port of entry in Brownsville, Texas, and the department expected to process a similar number in El Paso, Texas.", "So, after more than a week of the program, it’s clear the influx of 25,000 asylum seekers has not been \"immediate\" as Johnson claimed it would be. Instead it has been more of a trickle than a flood.", "Johnson said \"Biden’s plan will immediately let in 25,000 asylum-seekers who’d been waiting in Mexico as their cases were judged.\"", "While the Biden plan changes the Trump approach, and returns to a system that allows asylum seekers into the country while their cases are being considered, Johnson’s tweet leaves the impression there would be a wave of 25,000 people admitted instantly.", "That’s far from the case, at least as things stand more than a week into the new program. Even if the number does hit the projected 300 a day, that alone would mean it would take some 83 days to reach 25,000.", "For a statement that contains an element of truth but ignores critical facts that would give a different impression, our rating is Mostly False.", "Sen. Ron Johnson, Twitter, Feb 12, 2021", "Associated Press, \"Biden to Slowly Allow 25,000 people seeking asylum into the U.S.\" Feb. 12, 2021", "CNN, \"Here are the executive actions Biden has signed so far,\" Feb. 19, 2021.", "Email, Ben Voelkel, Sen. Ron Johnson’s spokesman, Feb. 18, 2021", "Department of Homeland Security \"DHS announces process to address individuals in Mexico with Active MPP cases,\" Feb. 11, 2021.", "Email, phone call, Department of Homeland Security, Feb. 26, 2021", "Reuters \"Two dozen asylum-seekers enter U.S. as Biden unwinds Trump program,\" Feb. 19, 2021.", "Email, \"DHS statement on processing current residents of the Matamoros Camp into the U.S.\", Department of Homeland Security, Feb. 23, 2021.", "Reuters, \"U.S. to admit asylum seekers from hard-hit camp at Texas border,\" Feb. 24, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]