["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Internet post claiming that high-ranking Chinese officials had called the American moon landing a \"complete hoax\" is a fake news story that has been in circulation for years:", "A new scandal has happened after high ranking officials from the Chinese space program called the American moon landing \"a complete hoax\", the Beijing Daily Express reports.", "The claims came after the Chinese moon rover allegedly couldn’t find any proof of American landings on the Moon.", "The rover took thousands of photos and after analyzing them the Chinese discovered that there’s no trace of these moon landings.", "The post attributes the quote to the Beijing Daily Express, a publication we found no record of. It also points to thousands of photos taken by the Chinese Yutu moon rover, which launched in December 2013 and ceased to operate in July 2016, stating these \"showed no trace\" of the Apollo moon landing.", "While the rover did take many photos, Andrew Jones, a journalist following China’s space program, points out that Yutu landed far from the Apollo landing site, so there wouldn’t be evidence one way or another.", "\"It had traveled tens of meters in total, when it would have needed to travel thousands of kilometers over varying and hazardous terrain to visit all the Apollo landing sites,\" Jones said. \"Yutu, with designed minimum lifetime of three (Earth) months and a range of up to 10 kilometers, lasted 31 months on the Moon, but was stationary for the vast majority of this.\"", "The Lunar Reconnaissance Spacecraft has captured ample evidence of the Apollo landing, though, which can be seen in this database. This is the same spacecraft that the Chinese space agency used to determine Yutu’s landing site.", "In addition to photographs, the Apollo mission brought back rock samples that have fueled decades of scientific research, and are available upon request from NASA.", "\"So far, no one has seen those samples and declared them to be fake,\" director of space policy at Planetary Society Casey Dreier said.", "The story also claims the Chinese space program launched a petition demanding the United States declassify NASA information regarding the U.S. moon landing, signed by 200 of its highest-ranking officials.", "But the petition is nowhere to be found and alleged signee and \"world renowned nuclear engineer\" Yury Ignatyevich Mukhin is actually renowned in fake news circles as a Russian conspiracy theorist denying all moon landings. The only information available about him online, though, has been produced by Mukhin himself, leading Wikipedia to cast serious doubt on his profile.", "The story can be traced back to a 2014 post on WorldNewsDailyReport.com, a known peddler of fake news that assumes \"all responsibility for the satirical nature of its articles and for the fictional nature of their content.\"", "We rate this statement Pants on Fire!", "AntiNewsNetwork.in, \"Chinese lunar rover finds no evidence of American moon landings!\" May 21, 2017.", "WorldNewsDailyReport.com, \"Chinese lunar rover finds no evidence of American moon landings,\" Sept. 25, 2014.", "Phone interview with Casey Dreier, director of space policy at the Planetary Society, June 21, 2017.", "Email interview with Andrew Jones, a journalist covering China’s space program for gbtimes.com and contributor to Planetary.org, June 21, 2017.", "NASA, \"Apollo landing sites revisited,\" Sept. 30, 2013.", "Popular Science, \"After 40 years, new results from the moon’s surface,\" Dec. 22, 2015.", "Planetary.org, \"Chang’e 3 data: Rover Panoramic Camera (PCAM),\" Jan. 28, 2016.", "Nature Communications, \"Correlated compositional and mineralogical investigations at the Chang’e 3 landing site,\" Dec. 22, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]