["Wisconsin is indeed the only one of the 50 states where all Republicans voted no.", "But it’s a bit of an exaggeration to describe that vote as “against protecting its citizens.”", "In just over 24 hours, some 12,000 people shared a post from the Kenosha County Democratic party slamming the coronavirus vote by Wisconsin’s Republican congressional delegation.", "The emergency measure — which includes free testing for COVID-19, paid emergency leave and other emergency appropriations — easily passed both houses of Congress and was signed into law by President Donald Trump on March 18, 2020.", "But it passed without much help from Wisconsin.", "The Kenosha Democrats seized on that fact in a March 19, 2020, Facebook post. The post explained the bill, commented on gerrymandering and noted the GOP no votes from purple Wisconsin went beyond the breakdown from even the deepest red of the red states.", "It was accompanied by a graphic with pictures of U.S. Sen. Ron Johnson and U.S. Reps. Mike Gallagher, Glenn Grothman, Jim Sensenbrenner and Bryan Steil that said this: \"WI is the ONLY state where all Republicans voted against protecting its citizens.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Let’s check it out.", "The bill passed 363-40 in the U.S. House and 90-8 in the U.S. Senate.", "Indeed, all five Republicans in the Wisconsin delegation cast a no vote, according to roll calls published by ProPublica. All four state Democrats voted for the bill.", "And, yes, that clean sweep of Republican votes was unique around the country.", "In Oklahoma both Republican senators voted against the bill, but two of three Republican representatives supported it. Iowa’s lone Republican representative voted no, but both Republican senators there supported the bill.", "That leaves us to look at the characterization that Wisconsin Republicans \"voted against protecting (the state’s) citizens\"?", "Like anything in politics, it’s more complicated than that. In various statements issued after the votes, the state’s Republican lawmakers didn’t object to the concept of providing help amid the pandemic, but they took issue with numerous specifics in the bill and how the process was handled.", "Sensenbrenner objected to spending money on a bill that he said stretched 100 pages and was presented with less than 30 minutes to review.", "\"We do not know the full cost of this legislation,\" he said in a statement. \"I am not a fan of passing bills to find out what is in them.\"", "Steil told the Milwaukee Journal Sentinel he voted against the bill because it \"places a heavy government mandate on Wisconsin small businesses that are already suffering negative consequences from coronavirus.\"", "Gallagher echoed those comments in a statement, saying he feared the bill would hurt small businesses.", "\"This bill, while well-intentioned, contains a number of unclear provisions that could force small businesses in Northeast Wisconsin to lay off workers or cause them to close their doors altogether,\" Gallagher said. \"Let me be clear: H.R. 6201 contained a number of good provisions like free testing that we’ve already successfully fought for. But I have serious questions as to whether the best way to support those needing paid and sick leave is through tax credits to small businesses instead of direct payments to those affected.\"", "Lori Hawkins, chair of the Kenosha County Democratic Party, defended the description in the Facebook post. She said the bill guided both testing and treatment to help control the spread of the disease.", "\"A 'no' vote by our elected officials was a vote against protecting their constituents from this highly contagious disease which has already been deadly to residents in Wisconsin,\" she said in an email.", "A viral Facebook post said Wisconsin \"is the only state where all Republicans voted against protecting its citizens.\"", "It is indeed the only state where all Republicans opposed the bill, which has now become law.", "But it’s a bit of an exaggeration to summarize their decisions as a vote \"against protecting (Wisconsin) citizens.\" And of course this is expected to be just the first of many bills addressing the coronavirus fallout.", "We rate this claim Mostly True.", "Kenosha County Democratic Party, Facebook post, March 19, 2020", "ProPublica, House Vote 102 - Passes Emergency Coronavirus Response Bill, March 13, 2020", "ProPublica, Senate Vote 76 - Passes Coronavirus Emergency Spending Bill, March 18, 2020", "CNN, Trump signs coronavirus relief legislation into law, March 19, 2020", "Urban Milwaukee, Wisconsin Now the Reddest State?, March 18, 2020", "Jim Sensenbrenner, news release, March 14, 2020", "Mike Gallagher, news release, March 14, 2020", "Milwaukee Journal Sentinel, Wisconsin Republicans voted against House coronavirus relief package, despite President Trump's support, March 14, 2020", "Email exchange with Lori Hawkins, chair, Kenosha County Democratic Party, March 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]