["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Thursday, Oct. 13, 2016, photo, a Delta Air Lines jet sits at a gate at Hartsfield-Jackson Atlanta International Airport in Atlanta. (AP Photo/David Goldman)", "Georgia state Sen. Michael Williams received some on-air fact-checking from CNN when he criticized Delta Air Lines for ending a discount partnership with the National Rifle Association while favoring \"liberal-leaning organizations\" such as Planned Parenthood.", "Delta ended a discount agreement with the NRA in order to remain \"neutral\" in the national debate over gun control, which resurfaced after a Feb. 14 mass shooting in Florida.", "\"If they're going to pull the discount for NRA members, why not pull it for Planned Parenthood or some of the left organizations out there?\" Williams, R-Cumming, claimed during a Feb. 27 interview with CNN’s Brianna Keilar.", "Keilar asked for his source of information to back up Delta discounts for Planned Parenthood. Williams said he and other state senators \"looked it up on Google.\"", "\"Just to be clear, no, we looked it up as well. And it doesn't appear, after some digging, that we have been able to determine that that is actually factual, because you're indicating something that may not be true there,\" Keilar responded.", "Williams, who’s running to become Georgia’s governor, said he \"very firmly\" believed that Delta \"is out there giving discounts to left-leaning organizations as well.\"", "\"But if you're making that argument,\" Keilar said, \"shouldn't you have your facts straight?\"", "Like CNN, PolitiFact Georgia found no evidence to support Williams’ claim. Williams’ campaign did not provide evidence to prove it, and Planned Parenthood told us there are no perks, discounts or deals that come with being a Planned Parenthood supporter or member — whether with Delta or any other company.", "\"There are no corporate perks that come with being a Planned Parenthood supporter or member,\" said Erica Sackin, director of political communications for the Planned Parenthood Federation of America and Planned Parenthood Action Fund.", "Delta did not respond to our query.", "Williams and Keilar’s debate continued off-air on Twitter: Keilar asked for backup on the Planned Parenthood claim. Williams tweeted back that his team had responded. Keilar said his statement still did not back up his \"bogus claim.\" Williams ultimately tweeted a statement saying Keilar was pushing a \"false narrative.\"", "Williams’ statement mentioned \"Delta's history of supporting left-wing organizations that donate to abortion provider Planned Parenthood.\"", "That’s a few steps removed from what he said in the interview about Planned Parenthood receiving the discount itself.", "Williams started to backtrack from that in the Keilar interview. Here’s a transcript of the original exchange on CNN:", "Williams: \"You're telling me that Delta … is not giving away discounts to left-leaning organizations? Is that what you're telling me?\"", "Keilar: \"No, you told me that it was Planned Parenthood. I'm just talking to you about what you said to me.\"", "Williams: \"I know, but is that not a left-wing organization? ... It is a very left-leaning organization.\"", "Keilar: \"There's no indication they are giving discounts to that organization, is my point.\"", "Williams: \"Again, let's, I guess, agree to disagree, because, again, we cannot -- bring me back on and I will have the information for you about where they're giving away these discounts to (a) left-leaning organization that support(s) Planned Parenthood.\"", "So in addition to Williams saying Delta gives discounts to Planned Parenthood, he backs it up to say Delta has ties with left-leaning groups that in turn support Planned Parenthood, which provides abortions. That doesn’t check out either.", "Williams’ spin that Delta has ties to the Susan. G. Komen Foundation, which supports Planned Parenthood, is also wrong.", "\"A quick Google search reveals Planned Parenthood receives hundreds of thousands of dollars from Delta partner Susan G. Komen,\" Williams said in his printed statement. \"It's as simple as that. Has Delta cut their ties with the Susan G. Komen Foundation like they did the NRA?\"", "Andrea Rader, spokeswoman for the breast cancer research organization Susan G. Komen, told PolitiFact Georgia, \"Komen does not and has not had a partnership with Delta at either the state or national level.\"", "Komen does have seven grants in local markets to Planned Parenthood, totaling $277,000, for breast exam services, Rader said.", "Williams may have conflated Susan G. Komen with the Breast Cancer Research Foundation, an actual Delta partner. The Breast Cancer Research Foundation told PolitiFact Georgia it does not give money to Planned Parenthood.", "Greg Bluestein, a political reporter for the Atlanta Journal-Constitution, tweeted to Williams that Komen said his claim about a Delta partnership is incorrect. Williams tweeted back, \"They may want to issue a new statement\" and included a link to a website for Flashpoint Agency, billed as a marketing agency.", "Flashpoint Agency’ page has photos of a white and pink plane with a pink ribbon that appears to be Breast Cancer Research Foundation’s logo. \"As part of Delta’s work with the Susan G Komen Foundation Flashpoint was brought in to help launch the ‘Pink Plane’ for Breast Cancer Awareness,\" the website said, incorrectly identifying the partnership.", "We found a Reddit post where a user wrote \"Delta ends NRA discounts. Keeps relationship with Planned Parenthood.\" The user included a screenshot of a Twitter exchange asking Delta, \"Did you end your discount for Planned Parenthood?\"", "The Delta Twitter account responded, \"Hey Stuart. We don't handle this over Twitter however I will send you the link below where you could find further information. http://bit.ly/2CRW68T  Have a fabulous day. *TLJ\"", "(Delta sent the user a broken link, which the user noted in a reply.)", "We asked Delta if it offered discounts to Planned Parenthood but the airline did not respond to that specific question.", "Delta shared a memo from CEO Ed Bastian to Delta employees regarding the company’s NRA decision and subsequent action by Georgia lawmakers to remove a jet fuel tax exemption from a tax bill that could have saved Delta millions of dollars a year.", "\"While Delta’s intent was to remain neutral, some elected officials in Georgia tied our decision to a pending jet fuel tax exemption, threatening to eliminate it unless we reversed course,\" Bastian said. \"Our decision was not made for economic gain and our values are not for sale. We are in the process of a review to end group discounts for any group of a politically divisive nature.\"", "Williams said Delta offers a discount to Planned Parenthood.", "We found no evidence that supports Williams’ claim. Planned Parenthood said its donors and members do not receive any corporate perks from Delta, and Williams failed to show that one exists. Williams’ campaign said that a Planned Parenthood supporter is a Delta partner, but that’s also not true.", "We rate Williams’ claim False.", "PolitiFact Georgia, Casey Cagle's tweet on Delta, the NRA and tax breaks. Is it legal?, March 1, 2018", "The Daily Beast, CNN’s Brianna Keilar Embarrasses NRA-Supporting Lawmaker Over Delta Discounts, Feb. 27, 2018", "CNN, Transcripts - CNN Newsroom, Feb. 27, 2018", "Georgia State Senate, List of senators, accessed March 2, 2018", "Email interview, Erica Sackin, director of political communications for Planned Parenthood Federation of America and Planned Parenthood Action Fund, March 1, 2018", "Email interview, Andrea Rader, spokeswoman for Susan G. Komen, March 1, 2018", "Email interview, Delta press office, March 1-2, 2018", "Twitter, @brikeilarcnn tweet, Feb. 27, 2018, tweet, Feb. 28, 2018", "Twitter, @williamsforga tweet, tweet, Feb. 28, 2018, tweet, March 1, 2018", "Twitter, @bluestein tweet, March 1, 2018", "Twitter, @badgerfan82 tweet, Feb. 24, 2018", "Twitter, @delta tweet, Feb. 24, 2018", "Breast Cancer Research Foundation, Delta Air Lines, accessed March 2, 2018", "Delta.com, Give now - Information on partnership with Breast Cancer Research Foundation, accessed March 2, 2018", "Flashpointagency.com, Delta Airlines Pink Plane, accessed March 2, 2018", "Reddit.com, post on Delta, NRA, Planned Parenthood, accessed March 1, 2018", "The Atlanta Journal-Constitution, Delta CEO Ed Bastian on NRA flap: ‘Our values are not for sale’, March 2, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]