["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Students from St. Anthony, a voucher school in Milwaukee, perform. Would an expansion of the voucher program cost nearly $2 billion per year?", "As Republican Wisconsin lawmakers crafted the 2013-15 state budget, outraged Assembly Minority Leader Peter Barca sent out a fund-raising plea.", "Seeking contributions to the Assembly Democratic Campaign Committee, which works to elect Democrats to the Assembly, Barca blasted the work of the GOP-controlled Joint Finance Committee on the two-year tax-and-spending plan.", "In a June 5, 2013 email, the Kenosha Democrat decried the proposed creation of a private bail bond system and a $651 million income tax cut. Then he turned to a proposed expansion of the private school voucher program.", "Citing a figure from the state Department of Public Instruction, Barca said the budget included:", "\"An expansion of taxpayer-funded, unaccountable private school vouchers across the state, which DPI estimated could cost nearly $2 billion annually.\"", "That’s a lot of money.", "The figure caught our attention because Barca’s email was on the 2013-15 budget; the $651 million income tax cut, for example, refers to how much income taxes will be reduced over the two-year period.", "On the school voucher expansion Barca criticized, the budget awaiting Gov. Scott Walker’s signature limits to 1,500 the number of students who could be added to the program during the two-year cycle.", "Could that expansion really cost taxpayers nearly $2 billion per year?", "Not even close.", "Barca’s evidence", "Long a subject of controversy, the voucher program, also known as school choice, was launched in 1990 in Milwaukee and was extended to the Racine area in 2011. It is intended to improve results for poor city children in public schools by allowing them to attend private or religious schools with publicly funded vouchers.", "Barca spokeswoman Melanie Conklin told us her boss based his nearly $2 billion claim on an email that state Superintendent of Public Instruction Tony Evers sent to school district superintendents and other educators six days before Barca's fund-raising email.", "Evers, who opposes the voucher expansion, wrote:", "\"While the current proposal includes an initial enrollment cap, past history clearly demonstrates those are temporary at best. We estimate that vouchers on a statewide scale could ultimately cost up to $1.9 billion annually,further diverting scarce resources away from public schools and increasing local property taxes.\"", "To be clear, the $1.9 billion-per-year estimate applies to the total cost of the voucher program, not the limited expansion that would take place over the next two years with the new budget.", "Moreover, Evers' use of ultimately dooms Barca’s claim. While Barca's fund-raising email was about the 2013-15 budget, the $1.9 billion cost estimate is for some time in the future.", "Barca's spokeswoman also forwarded us another Evers email, which referenced a detailed DPI estimate. It says the voucher expansion cost could reach $1.9 billion per year if 20 percent of students statewide -- nearly 193,000 students -- enrolled in the voucher program.", "That's far more than the 25,000 voucher students currently in the program and the 1,500 that would be added in the next two years.", "DPI spokesman John Johnson told us that with the expansion provided for in the 2013-15 budget, the voucher program will cost about $385 million over the two years.", "That's an average of about $192.5 million per year.", "A far cry from what Barca led the recipients of his email to believe.", "A footnote before we close: A little noticed provision in the budget could potentially allow for expansion beyond the 1,500 students. But even if that expansion occurs, the additional cost is estimated at only $4 million in the 2013-15 budget, Johnson said. Moreover, the disclosure didn’t come until two weeks after Barca’s email.", "Our rating", "Criticizing a Republican-backed expansion of the school voucher program in the 2013-15 state budget, Barca said the state Department of Public Instruction estimated that the expansion \"could cost nearly $2 billion annually.\"", "But the cost of the entire voucher program -- not just the expansion -- averages $192.5 million per year for the 2013-15 budget cycle.", "DPI's $1.9 billion-per-year estimate is not based on the 2013-15 expansion; it would only apply if the voucher program expands dramatically years down the road.", "The money exaggeration may make for good copy when it comes to raising money. But when it comes to math, it’s a major failure.", "We rate Barca's statement Pants on Fire.", "Rep. Peter Barca, fund-raising email on behalf of Assembly Democrats, June 5, 2013", "Milwaukee Journal Sentinel, \"GOP lawmakers in late-night session could adopt tax cut, voucher changes,\" June 4, 2013", "Milwaukee Journal Sentinel, \"Wisconsin schools chief blasts voucher expansion,\" June 13, 2013", "Superintendent Tony Evers, email to educators, May 30, 2013", "Wisconsin Department of Public Instruction, memo opposing proposed voucher expansion in 2013-15 budget", "Wisconsin Legislative Fiscal Bureau, analysis of the public instruction part of the 2013-15 budget", "Wisconsin Legislative Fiscal Bureau, paper #515, May 29, 2013", "Interview, Wisconsin Department of Public Instruction director of communications John Johnson, June 19, 2013", "Email interview, Rep. Peter Barca spokeswoman Melanie Conklin, June 14, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]