["About this rating", "On June 12, 2020, the Babylon Bee published an article positing that online and bricks-and-mortar booksellers such as Barnes & Noble (B&N) were pulling the Bible from their shelves because it contained the outdated idea that all humans were of one race created in the image of God:", "Online and brick and mortar booksellers across the country will no longer be selling the Bible due to its \"outdated depictions of humanity all being of one race and made in the image of God.\"", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "The Babylon Bee is the world’s best satire site, totally inerrant in all its truth claims. We write satire about Christian stuff, political stuff, and everyday life.", "While the Babylon Bee is a well-known satire site, this article was later reproduced on other websites such as truth4freedom. The Blogspot blog bosonmassachusetts also spun this idea into its own original piece of fiction, and an image supposedly showing a \"No Bibles\" sign at a Barnes & Noble became the focal point of a petition on change.org.", "The fake Barnes & Noble sign was created by cropping a Shutterstock image of a B&N store in Chicago and inserting a generic sign with fictitious verbiage:", "The rumor that Barnes & Noble pulled Bibles from shelves, however, is false. This claim originated on a satire website. Bibles can still be purchased at the chain.", "For background, here is why we sometimes write about satire/humor.", "Babylon Bee.   \"Bibles Pulled From Shelves For Outdated Idea That All Humans Are Of One Race And Made In The Image Of God.\"\r\n    12 June 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]