["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Homemade face masks for sale blow in the wind outside of a business, Tuesday, May 12, 2020, in San Antonio. San Antonio continues to encourage face masks or coverings as well as social distancing in an an effort to fight the coronavirus pandemic. (AP)", "N95 masks offer the most protection from viral particles, health officials say, but they should be reserved for health care workers who are in direct contact with infected patients.", "Mask effectiveness varies, but claims that cloth masks provide 0% protection aren’t accurate.", "More studies need to be done to examine variables such as the material and fit of the mask, the wearer, and the environment.", "Health officials largely agree that wearing any kind of face mask, coupled with social distancing and frequent hand-washing, is more protective than going unmasked.", "This story reflects medical expert advice in May of 2020, when the coronavirus first emerged. Scientists have tweaked and updated their recommendations as the pandemic has progressed and as variants have emerged. Here is the latest on mask-wearing (January 2022) >>", "Face masks have become a controversial symbol of the fight against COVID-19.", "Varying state rules and shifting guidance from leading health officials has caused confusion over who should be wearing masks and whether some types are effective at slowing disease transmission.", "UPDATE: Is my cloth mask good enough? The 2022 edition", "Take this Facebook post, for example. It displays an image of four different masks: An N95, a surgical mask, a sponge and a cloth mask.", "It claims that N95 and surgical masks both provide 95% protection, while sponge and cloth masks offer none.", "Let’s just get to the point: This isn’t true.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Medical masks, like the N95, offer the most protection, but experts widely agree that several types of facial coverings, including ones made of fabric, are effective at slowing virus spread.", "The Centers for Disease Control and Prevention initially deterred people from wearing face masks unless they had COVID-19 and were showing symptoms. But that guidance changed on April 3, after studies found that the virus can be spread by asymptomatic individuals, or before symptoms start to show. Now, the CDC recommends that nearly everyone wear a facial covering in public and in areas where social distancing isn’t possible.", "Officials say the most effective homemade masks should fit snugly and be made of thick cloth.", "RELATED: To fight COVID-19, CDC now says wear masks in public", "A comparison between masks is flawed for a couple of reasons.", "First, the N95, and other medical masks, are in high demand and officials say they should be reserved for health care workers who are in direct contact with infected patients.", "Second, multiple studies that look at the efficacy of lower-grade fabric masks have shown that they, too, help block particles.", "\"The protection from cloth masks isn’t 0, and it’s definitely not 100, but the way to think about any of the masks and our overall approach is how do you put together all the pieces of the puzzle to give you a complete picture of minimizing the risk of transmission of COVID-19?\" said Dr. Thomas Tsai, a surgeon and health policy researcher at Harvard’s school of public health. \"Hand washing, wearing masks, and social distancing is part of it, but none of them alone. It’s how you put together these different tools to meet the task at hand. Wearing any mask is a very, very small price to pay to be safe and return to society.\"", "Linsey Marr, an expert in airborne disease transmission at Virginia Tech, told PolitiFact that masks provide some protection but the amount can vary widely depending on the type and how it's worn. Masks reduce the amount of virus spread and also the amount one might inhale, she said.", "It’s not true, she said, that cloth masks provide 0% protection.", "\"There have been measurements showing that homemade mask materials offer up to 80% protection,\" Marr said, \"which is much better than 0%, although not as good as an N95. Still, reducing the amount of virus that we inhale by 80% is better than nothing.\"", "A smattering of studies have looked at the efficacy of different masks in different ways.", "One experiment from researchers at the National Institutes of Health used lasers to illuminate and measure how many droplets of saliva were released into the air by a person talking with and without a cloth facial covering.", "As can be seen in a video of the experiment, a cluster of droplets appear in the air when the researcher speaks without a mask, but nearly all the particles are blocked when he does the same with a mask. The study didn’t capture micro-droplets, and more research needs to be done on how many viral particles these smaller droplets can contain, but it demonstrated that a cloth mask is better than no mask.", "Scientists from the University of Hong Kong’s School of Public Health conducted a study in patients with seasonal coronaviruses. The report found that surgical face masks significantly reduced detection of viral RNA in aerosols and shows a trend in reducing viral RNA in respiratory droplets.", "Arizona State University mathematicians recently developed a model for assessing the community impact of mask use by the general, asymptomatic public.", "That study found that a broad adoption of even relatively ineffective face masks \"may meaningfully reduce community transmission of COVID-19 and decrease peak hospitalizations and deaths,\" and said masks are useful to both prevent illness in healthy persons and prevent asymptomatic transmission.", "\"Typical protection (of fabric masks) is probably at least 50%, high quality masks could be 80–95% protective, and even low quality masks made of very thin materials could still be 10–20% protective,\" said Steffen Eikenberry, a postdoctoral scholar in the school of mathematical and statistical sciences and one of the main authors of the study.", "\"While evidence is still very limited, several laboratory studies indicate that the majority of homemade mask materials, including cotton fabric, cotton T-shirts, tea cloth, flannel, silk, linen, scarves, and chiffon offer at least 50% protection. Higher quality, more tightly woven fabrics are better, and multiple layers improves protection.\"", "Jeremy Howard, a data scientist at the University of San Francisco, wrote an article in the Conversation in favor of universal mask wearing.", "Howard says that researchers were looking at the wrong question at first – how well a mask protects the wearer from infection – and not how well a mask prevents an infected person from spreading the virus. He said masks function very differently as personal protective equipment versus \"source control.\"", "\"Masks are very good at blocking larger droplets and not nearly as good at blocking tiny particles,\" he wrote. \"When a person expels droplets into the air, they quickly evaporate and shrink to become tiny airborne particles called droplet nuclei. These are extremely hard to remove from the air. However, in the moist atmosphere between a person’s mouth and their mask, it takes nearly a hundred times as long for a droplet to evaporate and shrink into a droplet nuclei.\"", "He continued: \"This means that nearly any kind of simple cloth mask is great for source control. The mask creates humidity, this humidity prevents virus-containing droplets from turning into droplet nuclei, and this allows the fabric of the mask to block the droplets.\"", "Social media posts claim that certain face masks are ineffective and provide \"0% protection.\"", "More research needs to be done but we found that medical experts widely refute the claim. Higher medical-grade masks offer the most protection, but homemade masks are also effective, particularly when they fit snuggly and are made of multiple layers.", "No mask is 100% effective, but health care officials stress that face masks increase their effectiveness when combined with other measures, such as social distancing and regular hand washing.", "We rate this False.", "Facebook post, April, 2, 2020", "New York Times, Coronavirus: Which Mask Should You Wear?, April 17, 2020", "US News and World Report, Do Face Masks Work? Types and Effectiveness, April 3, 2020", "Centers for Disease Control and Prevention, Recommendation Regarding the Use of Cloth Face Coverings, Especially in Areas of Significant Community-Based Transmission, April 3, 2020", "Centers for Disease Control and Prevention, Cloth Face Coverings: Questions and Answers, April 4, 2020", "Centers for Disease Control and Prevention, Use of Cloth Face Coverings to Help Slow the Spread of COVID-19, April 13, 2020", "Food and Drug Administration, N95 Respirators and Surgical Masks (Face Masks), April 5, 2020", "National Library of Medicine, A RAPID SYSTEMATIC REVIEW OF THE EFFICACY OF FACE MASKS AND RESPIRATORS AGAINST CORONAVIRUSES AND OTHER RESPIRATORY TRANSMISSIBLE VIRUSES FOR THE COMMUNITY, HEALTHCARE WORKERS AND SICK PATIENTS, April 30, 2020", "National Library of Medicine, To mask or not to mask: Modeling the potential for face mask use by the general public to curtail the COVID-19 pandemic, April 6, 2020", "Wiley Online Library, Rationale for universal face masks in public against COVID‐19, April 30, 2020", "The New England Journal of Medicine, Visualizing Speech-Generated Oral Fluid Droplets with Laser Light Scattering, April 15, 2020", "Nature.com, Respiratory virus shedding in exhaled breath and efficacy of face masks, April 3, 2020", "The Conversation, Masks help stop the spread of coronavirus – the science is simple and I’m one of 100 experts urging governors to require public mask-wearing, May 14, 2020", "Email interview, Linsey Marr professor in airborne disease transmission at Virginia Tech, May 14, 2020", "Phone interview, Dr. Thomas Tsai surgeon and health policy researcher at Harvard’s school of public health, May 15, 2020", "Email interview, Steffen Eikenberry, postdoctoral scholar at Arizona State University’s School of Mathematical and Statistical Sciences, May 15, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]