["Following the insurrection at the U.S. Capitol on Jan. 6, law enforcement and elected officials have been working to determine those responsible for inciting the violence.", "Some have blamed former President Donald Trump, and the House of Representatives has voted to impeach him — making him the only president in history to have been impeached twice.", "Trump is not the only politician facing scrutiny. Sen. Josh Hawley, R-Mo., has also been at the center of the accusations, with calls forhis resignation. Hawley was among six Republican senators  who objected to the election results from several swing states in a failed bid to overturn  Joe Biden’s win.", "After the riot at the Capitol, some social media companies — including Twitter and Facebook — removed Trump and some of his allies from their platforms, moves that were met with cries of censorship from the right.", "Hawley, on the other hand, lost a book deal withpublisher Simon & Schuster. The company released a statement saying \"we take seriously our larger public responsibility as citizens, and cannot support Senator Hawley after his role in what became a dangerous threat to our democracy and freedom.\"", "His book, \"The Tyranny of Big Tech\" has since been picked up by the conservative publisher Regnery.", "Members of the public have taken to social media to share their thoughts on Hawley's involvement in the insurrection, as well as the controversy surrounding the publishing of his book.", "Fact check:Story of Marine Corps leader rebuking Pelosi is fabricated", "One group posted a photo of their version of Hawley's book on Instagram. The fake book is titled, \"Spineless Traitor\" withthe subhead, \"How My Lies Helped Incite The Capitol Riots.\" The book also contains a \"foreword by co-conspirator Ted Cruz.\"", "The bottom of the fabricated cover includes social media handles for the Good Liars of NYC.", "The post's caption says, \"We felt bad that Josh Hawley’s book won’t get published so we made one for him.\"", "The Good Liars of NYC is a comedy account that has pulled off \"high-stakes pranks on public figures for years.\" The photo is its satirical version of Hawley's book, implying that he is guilty of inciting the insurrection.", "USA TODAY has reached out to the account for comment.", "Hawley's real book, now that it has been picked up by another publisher, is slated to arrive in the spring. The book is critical of big tech companies like Google and Facebook.", "Thomas Spence, president and publisher of Regnery, said in a statement that \"Regnery is proud to stand in the breach with (Hawley). And the warning in his book about censorship obviously couldn't be more urgent.\"", "Fact check:Dave Chappelle COVID-19 news is true, but Fox News report image is altered", "The claim in the post has been rated SATIRE. The cover of of what claims to be Josh Hawley's forthcoming book is satirical. The account that posted the photo is Good Liars of NYC, a comedy duo that pranks prominent public officials. Hawley's real book — dropped by its original publisher and later picked up by another — is slated to publish in the spring.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]