["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "History quiz:", "After Pearl Harbor, did the Japanese refrain from invading the mainland United States because they feared there were gun-savvy Americans in nearly every home?", "That’s the claim of a 20-paragraph post on Facebook that has been shared more than 21,000 times.", "The post argues that America is safe from invasion because of gun-owning hunters. It starts its historical claim by stating:", "\"After the Japanese decimated our fleet in Pearl Harbor Dec 7, 1941, they could have sent their troop ships and carriers directly to California to finish what they started. The prediction from our Chief of Staff was we would not be able to stop a massive invasion until they reached the Mississippi River. Remember, we had a 2 million man army and war ships in other localities, so why did they not invade? After the war, the remaining Japanese generals and admirals were asked that question. Their answer....they know that almost every home had guns and the Americans knew how to use them.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It’s not a new claim. In a video posted in 2012, Ed Emery, a Repubican state senator from Missouri, claimed that it is known that Japan was deterred not by America’s armed services but because \"every American was armed.\"", "The surprise aerial attack on the U.S. naval base at Pearl Harbor on Oahu Island, Hawaii, climaxed a decade of worsening relations between the United States and Japan, and precipitated the entry of the United States into World War II, as Encyclopedia Britannica puts it.", "But the success didn’t mean Japan was poised to march into California.", "\"The Japanese didn't plan to invade the U.S., never considered it seriously and knew they couldn't succeed,\" said Jonathan Dresner, a history professor at Pittsburg State University in Kansas whose specialties include Japanese history.", "When Japan lost its main aircraft carriers in the Battle of Midway seven months after Pearl Harbor, any thought of a mainland invasion \"was doomed and abandoned,\" Fred Notehelfer told us.", "\"Certainly the Japanese were not constrained by the notion that some Americans had guns in their homes — no one had AK-47s and other assault weapons at the time,\" added Notehelfer, an emeritus professor of history at UCLA who specializes in the history of Japan.", "Professor James Holmes, chair of maritime strategy and at the U.S. Naval War College in Rhode Island, told us it’s plausible that private gun ownership was part of Japan’s calculus, but not the dominant factor.", "\"I seriously doubt anyone in Tokyo countenanced an invasion of the continental United States apart, perhaps, from raids on the West Coast. There is only so much a small island state in Asia can do, no matter how skilled its armed forces,\" he said.", "\"Geographic space, logistics, other commitments—these considerations would have outweighed any concerns about an armed American populace.\"", "Ian Toll, author of \"The Conquering Tide: War in the Pacific Islands, 1942-1944\" and \"Pacific Crucible: War at Sea in the Pacific, 1941-1942,\" told us that regarding an invasion, the Japanese \"had plans on a shelf, but never seriously considered putting them into action,\" and that \"I’ve never come across anything to suggest that gun ownership was a factor in Japan’s decision.\"", "\"In June 1942, some Americans were concerned the Japanese would advance into Alaska and then through Canada to the northwest,\" he said. \"But the scale of the operation was simply beyond their national capabilities, measured by troop numbers, naval power, or shipping.\"", "Promoters of the guns deterring an invasion theory also point to this quote attributed to Japanese Admiral Isoroku Yamamoto:", "\"You cannot invade mainland United States. There would be a rifle behind each blade of grass.\"", "But the quote is \"unsubstantiated and almost certainly bogus, even though it has been repeated thousands of times in various Internet postings,\" FactCheck.org reported.", "Toll told us: \"It is true that Yamamoto told others in the Japanese government and military that invading North America was unrealistic, but I know of no source that has him citing gun ownership as a factor.\"", "A Facebook post says the Japanese military did not invade the mainland United States after Pearl Harbor because \"they know that almost every home had guns and the Americans knew how to use them.\"", "Four experts told us there is no evidence that Japan ever seriously considered such an invasion and that military limitations, not Americans armed with hunting weapons, were the reasons why.", "We rate the statement False.", "Facebook, post, Aug. 9, 2019", "Factcheck.org, \"Misquoting Yamamoto,\" May 11, 2009", "Email, Fred Notehelfer, emeritus professor of history at UCLA who specializes in the history of Japan, Jan. 10, 2020", "Email, Jonathan Dresner, a history professor at Pittsburg State University in Kansas whose specialties include Japanese history, Jan. 10, 2020", "Email, James Holmes, professor and chair of maritime strategy at the Naval War College, Jan. 11, 2020", "History News Network, \"Missouri GOP Representative: Japan Didn't Invade U.S. in World War II Because of Armed Populace,\" Jan. 22, 2013", "Email, Ian Toll, author of \"The Conquering Tide: War in the Pacific Islands, 1942-1944\" and \"Pacific Crucible: War at Sea in the Pacific, 1941-1942,\" Jan. 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]