["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker took a new approach when asked about his jobs record during the first GOP presidential debate on Aug. 6, 2015.", "Fox News anchor Chris Wallace reminded viewers that Walker promised in 2010 that state employers would create 250,000 jobs in his first four-year term.", "\"In fact, Wisconsin added barely half that and ranked 35th in the country in job growth,\" Wallace said, addressing Walker.", "\"Now you're running for president, and you're promising an economic plan in which everyone will earn a piece of the American dream,\" he said. \"Given your record in Wisconsin, why should voters believe you?\"", "Walker responded that the state’s unemployment rate has declined from more than 8 percent in the depths of the Great Recession to 4.6 percent, and that the state had \"more than made up for the jobs that were lost during the recession.\"", "Then he turned to the claim we want to check:  \"And the rate in which people are working is almost five points higher than it is nationally.\"", "Is he right?", "And is that something new under Walker?", "About the statistic", "Walker’s campaign said he was referring to the Labor Force Participation Rate, a measuring stick created by the federal Bureau of Labor Statistics.", "The participation rate includes \"the number of people who are either employed or are actively looking for work,\" according to Investopedia.com. It does not include those who are no longer actively searching for work.", "It’s a different vantage point than the more typically used unemployment rate.", "As of June 2015, the state’s rate was 67.9 percent. That compares with the national rate of 62.6 percent. Thus, Wisconsin’s rate is about 5.3 percentage points higher than the national one. So, Walker is correct on the number.", "(A note: the national figures come from a different set of data, the Current Population Survey, while the state figures are from the Local Area Unemployment Statistics.)", "The history behind the numbers", "But, a deeper look shows that the state’s performance predates his time in office. That is, Wisconsin’s labor force participation has exceeded the nation’s for years.", "For instance, in 2010 -- the year before Walker took office -- the state’s participation rate was 63.4 percent, compared with 58.5 percent nationally. That was a difference of 4.9 points, at a time when the economy was just beginning to emerge from the recession.", "Wisconsin’s high water mark was 71.8 percent in 1997, compared with 63.8 percent nationally, a difference of 8 points.", "Nationally, the number reached a high in 2000, at 64.4 percent. Wisconsin has topped that figure in 24 of the past 38 years.", "Our rating", "In the debate, Walker said \"the rate in which people are working (in Wisconsin) is almost five points higher than it is nationally.\"", "He’s right on the numbers, but the same statement could have been true had it been made by any of his seven immediate predecessors, Republican and Democrat. That important bit of context was missing from his claim.", "We rate it Mostly True.", "Republican Presidential Debate, Fox News, Aug. 6, 2015", "U.S. Bureau of Labor Statistics Current Population Survey", "U.S. Bureau of Labor Statistics Local Area Unemployment Statistics", "Wisconsin Department of Workforce Development monthly jobs report, July 16, 2015", "Email, Laurel Patrick, spokeswoman, Gov. Scott Walker, Aug. 11 2015", "Email, Stacy Day, spokeswoman, Gov. Scott Walker presidential campaign", "Investopedia.com, participation rate definition, accessed Aug. 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]