["About this rating", "In Steven Spielberg's classic horror film Jaws there is a character named Quint, a shark hunter by profession, who endeavors to school his fellow townspeople on the dangers of trying to capture and kill a great white shark. This is how he puts it:", "You all know me. Know how I earn a livin'. I'll catch this bird for you, but it ain't gonna be easy. Bad fish! Not like going down to the pond and chasing bluegills and tommy cod. This shark, swallow ya whole.", "See what he did there? He contrasted the deadliest shark there is to two of the most harmless game fish he could think of, bluegills and tommy cod.", "Imagine Quint's surprise (had he not been swallowed whole by a great white shark, we mean) if he were to check his Facebook feed in 2018 and encounter this widespread meme:", "We're inclined to side with Quint on the question of bluegills. For starters, when we looked up the putative source of this scary report, Ohio Fish News, we found no record of its existence (and even if it did exist, we would have severe doubts about the reliability of a publication about fish wherein \"piranha\" is misspelled).", "Secondly, none of the information we found in reference books even remotely confirms the startling claims above. For instance, despite being freshwater fish of a similar size and shape, bluegills (scientific name: Lepomis macrochirus) aren't related to piranhas in any way, fish experts say (and, while we're on the subject, piranha attacks on humans are actually fairly rare; they certainly do not kill 20,000 people a year). Nor are bluegills' teeth, unlike those of the piranha, made for ripping the flesh off of larger prey. According to Ken Schultz's Field Guide to Freshwater Fish (John Wiley & Sons, 2010) bluegills are omnivores whose diet consists almost entirely of aquatic creatures tinier than themselves:", "A variety of small organisms serves as food for bluegills, including insects, crayfish, fish eggs, small minnows, snails, worms, and sometimes even plan material. The young feed mostly on crustaceans, insects, and worms.", "It should come as no surprise, then, that the bluegill doesn't appear on anyone's list of the most dangerous fish in North America, or anywhere else in the world. There is no record of bluegill fish killing a human being — ever — much less being responsible for the deaths of 500 people every summer.", "In point of fact, it's the other way around — human beings are voracious killers and eaters of bluegills. \"They're the perfect size to fit in a frying pan,\" writes Nature Conservancy blogger Matthew L. Miller. Bluegills are considered the most common \"panfish\" in North America.", "And that, of course, is the joke. It's hard to imagine a more innocuous (or tasty!) denizen of the deep.", "Miller, Matthew L.  \"Why Everything You Know About Bluegill Management Is Wrong.\"\r\n  Nature Conservancy.  15 October 2015.", "Schultz, Ken.  Ken Schultz's Field Guide to Freshwater Fish.\r\n  Hoboken: John Wiley & Sons, 2010.  ISBN 9781118039878.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]