["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The feud over a proposed border wall has fueled retorts on Facebook that Congress approved a much more expensive barrier more than a decade ago.", "The versions we saw on Facebook and Twitter suggest the money mysteriously vanished.", "One post, shared more than 6,000 times on Facebook, said: \"The question of the decade: where is the $50 billion approved in ‘06 for the Secure Fence Act that Obama was supposed to build?\"", "Another post said: \"Where is the $50 billion set aside for the 2006 Secure Fence Act? Bush signed it and Obama was supposed to oversee its construction. Where is the money?\"", "These posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Here’s the problem with the missing money claims: Congress did not approve $50 billion for a fence in 2006. (Snopes previously debunked these social media posts.)", "Just over half of Democrats in the U.S. Senate voted for the Secure Fence Act of 2006, including Barack Obama, Chuck Schumer and Hillary Clinton. Most Democrats in the House voted against it, including California Rep. Nancy Pelosi. President George W. Bush signed it into law in October 2006.", "The law authorized a fence along about 700 miles of the border between the U.S.-Mexico border. By 2015, 654 miles were completed.", "We read several news stories about the act’s passage in 2006. None pegged the cost anywhere near $50 billion.", "The Secure Fence Act didn’t mention money to be spent on fencing.", "Congress separately approved a $33.7 billion spending bill for the Department of Homeland Security, which included  $1.2 billion for fencing, infrastructure and technology on the border.", "The $1.2 billion was described in news articles as a down payment, but there was disagreement about how much the full fence would cost. Newspapers and politicians cited estimates between $2 billion and $12 billion.", "So where did this idea of $50 billion come from? It’s not very straightforward.", "In January 2007, multiple news reports and an article by the Migration Policy Institute started to mention a pot of about $50 billion for fencing.", "These reports reference the work of the nonpartisan Congressional Research Service.", "About a week before the final September Senate vote, the researchers issued a report that explored costs and benefits of southwest border fencing, a \"relatively new and limited phenomenon.\"", "They placed the initial cost of building a double-layer fence at $1.2 million to $1.3 million per mile, citing the U.S. Army Corps of Engineers. Over 25 years, the costs per mile could increase anywhere from $16 million to $70 million per mile depending on the degree of wear and tear.", "But neither the report nor a December 2006 update calculate the total cost. The latter document references the $1.2 billion that was appropriated to Homeland Security.", "The Migration Policy Institute did include $50 billion total by taking the highest figures in the CRS report — $1.3 million per mile for construction and $70 million per mile for maintenance — and then multiply $71.3 million by 700 miles to get about $49.9 billion.", "Once it hit the newspapers, the $50 billion figure sparked some pushback.", "US Rep. Steve King, R-Iowa, said, \"These numbers are grossly inflated.\"", "California Republican U.S. Rep. Duncan Hunter criticized the nonpartisan Congressional Research Service: \"I call them the 'Mission Impossible' crowd,\" he said.", "The talking point that the Congressional Research Service said the fence would cost $50 billion was repeated for years, reappearing in Mother Jones in 2011, Newsweek in 2015 and the Boston Globe in 2017.", "The figure has resurfaced during the current debate over Trump’s wall.", "U.S. Rep. Steve Scalise, R-La., said in a Jan. 2 Fox News op-ed that 26 Senate Democrats \"voted for The Secure Fence Act, which allocated $50 billion over 25 years for 700 miles of fencing along the border.\"", "Fox News’ Sean Hannity said on Jan. 9, \"The Secure Fence Act allowed over $50 billion over the next two decades to construct and maintain hundreds of miles of new barriers.\"", "The Government Accountability Office said that Border Patrol spent about $2.3 billion to deploy fencing between fiscal years 2007 through 2015 and constructed 654 miles of fencing by 2015. Border Patrol officials did not track funding for acquisition and sustainment for border fencing prior to the implementation of the Secure Fence Act of 2006. In 2009, Border Patrol estimated that maintaining fencing would cost more than $1 billion over 20 years.", "Social media posts asked, \"Where is the $50 billion approved in ‘06 for the Secure Fence Act that Obama was supposed to build?\"", "These posts falsely suggest that Congress approved $50 billion as part of the Secure Fence Act. Actually the Homeland Security appropriations bill  included $1.2 billion for the fence, described as a down payment at the time.", "The claim that $50 billion was approved seems to come from estimates for the total wall that circulated among researchers and journalists.", "These social media posts try to suggest that Congress did something nefarious by approving the money and not spending it, but there is no evidence that Congress ever approved $50 billion for a wall.", "We rate this statement False.", "Facebook, Post about Secure Fence Act, Jan. 11, 2019", "Facebook, Post about Secure Fence Act, Jan. 11, 2019", "Diamond and Silk, Tweet, Jan. 15, 2019", "GovTrack, H.R. 6061 (109th): Secure Fence Act of 2006, September 2006", "Congress.gov, H.R.6061 - Secure Fence Act of 2006, Signed into law Oct. 26, 2006", "Congressional Research Service, Border Security: Barriers Along the U.S. International Border, Sept. 21, 2006", "Congressional Research Service, Border Security: Barriers Along the U.S. International Border (updated version), Dec. 12, 2006", "Fox News, \"Rep. Steve Scalise: Democrats need to stop playing games with America's safety and fund border security now,\" Jan. 2, 2019", "Los Angeles Times, \"Border Barrier Approved,\" Sept. 30, 2006", "Boston Globe, \"US Senate passes bill to build Mexican border fence,\" Sept. 30, 2006", "Chicago Tribune, \"Wars get $70 billion in defense bill,\" Sept. 30, 2006", "Washington Post, \"With Senate Vote, Congress Passes Border Fence Bill,\" Sept. 30, 2006", "Washington Times, \"Fence funding in budget just the start,\" Oct. 11, 2006", "Arizona Republic, \"Well-aged bill to fence border is sent to Bush,\" Oct. 24, 2006", "San Francisco Chronicle, \"Study: Price for border fence up to $49 billion,\" Jan. 8, 2007", "Contra Costa Times, \"Border fence plan infuriates group of Texas mayors,\" Jan. 10, 2007", "Migration Policy Institute, \"New Congress Takes First Steps toward Immigration Reform,\" Jan. 15, 2007", "Washington Times, \"Fence advocate calls estimates exaggerated,\" Jan. 17, 2007", "Mother Jones, \"How to Build a Deadly Electric Border Fence,\" Oct. 24, 2011", "Newsweek, \"Illegal Immigration: Myths, Half-Truths and a Hole in Trump's Wall,\" Oct. 23, 2015", "Fox News, Sean Hannity, Jan. 9, 2019", "Snopes, \"Did Congress ‘Set Aside’ $50 Billion in 2006 for the Construction of Border Fencing?\" Jan. 16, 2019", "Government Accountability Office, Border Security, March 15, 2018", "Government Accountability Office, Southwest Border Security, February 2017", "Interview, Michelle Mittelstadt, Migration Policy Institute spokeswoman, Jan. 17, 2019", "Interview, Steven Camarota, Center for Immigration Studies director of research, Jan. 18, 2019", "PolitiFact, \"Did Democrats reverse border wall position after Donald Trump was elected?\" Jan. 9, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]