["The videos were published in a Facebook post here on June 18, 2020. The post has been viewed more than 75,000 times.", "The Facebook post features three clips, which show a standoff between troops in a mountainous area; soldiers jostling and pushing each other; and an apparently injured soldier being shielded from rocks hurling at them.", "The Burmese caption of the post translates to English as: “India and China, current situation”.", "The videos were also shared here on Facebook on June 18 with a similar caption, which states, in part: “Situations over China-India border. It is a desert warfare that usually happens when China tries to put its flag across the border line.” This post has been shared more than 600 times.", "These claims were shared online just days after deadly clashes erupted along a disputed border between India and China on June 15, which left at least 20 Indian armed forces members dead. Indian media claim that 43 Chinese soldiers were also killed or seriously hurt -- Beijing is yet to give casualty numbers -- making it the deadliest encounter since 1967 and the first deaths in fighting since 1975. Here is an AFP report on the incident.", "The claims, however, are false; these videos were all circulating online before the June 2020 border conflict.", "First video", "A reverse image search on Google using keyframes extracted with InVID-WeVerify, a digital verification tool, found the same video published here on YouTube, on August 28, 2014.", "The video title reads: “Full Border Fight! Indian and Chinese Soldiers Faceoff in Arunachal Pradesh”.", "Below is a screenshot comparison of the first video in the misleading posts (L) and the YouTube video (R):", "The same video has also circulated in Indian social media posts with other misleading claims, as debunked by AFP Fact Check here.", "Second video", "A reverse image search with a screenshot from the second video found an identical clip published here on the YouTube channel of Deccan Herald, a local newspaper in India.", "The video, published on July 7, 2017, is titled: “Watch: Jawans stop Chinese soldiers from entering Indian territory Part 1”.", "Its description states: “An undated video, presumed to be shot in the second week of June that shows Indian troops forming a human chain and jostling with Chinese soldiers is now going viral on social media.", "“The video which recorded an incident of Indian and Chinese troops bumping against each other, a tactic employed to de-escalate tensions by avoiding slaps or punches, reportedly occurred inside the Line of Control (LoC), according to the sources.”", "The video was also shared among India-based social media users alongside similar claims, as debunked by AFP Fact Check here.", "Below is a screenshot comparison of the second video in the misleading posts (L) and the Deccan Herald video (R):", "Third video", "A reverse image search of a keyframe extracted from the third video found a longer version of the clip published here on YouTube on May 31, 2020, titled “India China Border Fight | Chinese soldiers getting beaten by Indian army at LAC in Ladakh”.", "The footage was also published in this June 2, 2020, report by the Taiwanese news website ETtoday. The headline of the report translates to English as: “Zhao Lijian responded to the border conflict between China and India: Overall 'stable and controllable' / Can properly solve two countries' problem”.", "It reads, in part: “Recently, a video supposedly showing a group of People's Liberation Army soldiers being attacked by another group of Indian soldiers in Pangong Tso has been widely spread on the Internet, which shows that the conflict between China and Indian has intensified again.”", "Pangong Tso is a lake that runs across the territories of both India and China.", "While this video was reportedly related to the 2020 border dispute between China and India, it was posted online in May, before the June 15 deadly clash that broke out in Galwan Valley on the border of the nuclear-armed neighbours.", "Below is a screenshot comparison of the third video in the misleading posts (L) and the ETtoday video (R):", "This video has also circulated online with similar misleading claims, as debunked by AFP Fact Check here in June 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]