["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When Democratic presidential nominee Joe Biden was vice president, his youngest son, Hunter Biden, served on the board of a Ukrainian energy company called Burisma Holdings. It’s a position that’s drawn lots of attention in the runup to the presidential election as Republicans accuse the Bidens of misconduct in connection with overseas business ventures. Though we’ve written about the allegations, in many cases we don’t have enough information to make judgments about their truthfulness.", "But that’s not the case with a recent Facebook post airing an old, inaccurate claim about the Burisma board.", "\"Did you know who sat on the Burisma board with Hunter Biden?\" the Oct. 29 post says. \"PAUL PELOSI, Jr. $$$$? The plot thickens! Very interesting.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We checked a similar statement in January after a conservative blog claimed that Paul Pelosi Jr., son of House Speaker Nancy Pelosi, was an executive at Ukrainian gas company similar to Hunter Biden. And in 2019, we debunked a claim that the sons of Nancy Pelosi, Sen. Mitt Romney and former Secretary of State John Kerry were all on the board of \"energy companies doing business in Ukraine.\"", "We’ve found no evidence that Pelosi Jr. ever served on the Burisma board.", "Here’s what we know.", "Pelosi Jr. once served on the board of an American energy company, Viscoil. After he left the board, the company dissolved and then reformed in Singapore under a different name.", "He wasn’t involved in the reformed company, which — for the record — wasn’t based in Ukraine. It’s unclear to what extent the company has done any business in that country.", "When Pelosi Jr. was on the board, Viscoil was based in California. At that time, a spokesperson for Pelosi said, the company focused \"solely on U.S. business.\" An old version of the company’s website said Viscoil was created to \"engage in research and in the commercial development of hydrocarbon production methods and technologies.\"", "None of that lends credibility to this Facebook claim that Pelosi Jr. was on Burisma’s board. We rate this post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Correction (Dec. 15, 2020): Joe Biden was vice president when his son served on the Burisma Holdings board. An earlier version of this post had an incorrect title; the story has been updated.", "Facebook post, Oct. 29, 2020", "PolitiFact, Was Nancy Pelosi’s son an executive for a Ukrainian gas company? Jan. 17, 2020", "PolitiFact, Pelosi, Romney and Kerry don’t have sons working for companies linked to Ukraine, Oct. 10, 2020", "PolitiFact, Looking at claims about Hunter Biden, and the Senate GOP report that helped fuel them, Oct. 19, 2020", "PolitiFact, A look behind the NY Post headline about Joe Biden and a Ukraine meeting, Oct. 15, 2020", "PolitiFact, Fact-checking Joe Biden, Hunter Biden and Ukraine, Jan. 7, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]