["Pat Robertson says President Barack Obama won’t take Islamic nations to task for harboring terrorists, and the big reason dates to the president’s early school years.", "\"The truth is, we have a president, we have a president whose stepfather was a Muslim, whose stepfather, in Indonesia, put him in an Islamic madrassa,\" Robertson, a religious broadcaster based In Virginia Beach, said during the June 27 edition of his television show \"The 700 Club.\"", "We checked on whether Obama really did attend an \"Islamic madrassa.\" Let’s start with some basics.", "\"Madrassa\" means school in Arabic, but in English, the word has taken on additional connotations. Merriam Webster’s defines it as a \"Muslim school, college or university that is often part of a mosque.\"", "The Congressional Research Service, in a 2008 report, defined a madrassa as an Islamic religious school.", "Revelations that some terrorists developed radical political beliefs at madrassas have led to accusations that the facilities \"promote Islamic extremism and militancy, and are a breeding ground for terrorism,\" the research service said. The report also notes that others believe madrassas \"have been blamed unfairly for fostering anti-U.S. sentiments.\"", "Moments after saying Obama attended an \"Islamic madrassa,\" Robertson added: \"Now, Obama has visceral dislike for the standards that we have in this country. What he thinks is, America is an oppressor, and he thinks that the nation of Islam, the Islamic countries, at least should not be in any way called out for the actions that they have.\"", "Rumors and charges about Obama’s early education have been circulating since he began running for president in 2007. Generally, they accuse Obama of attending a madrassa espousing a rigid form of Islam that’s hostile to the West. They refer to the president’s school days in Indonesia from 1967 to 1971, when he was ages 6 to 10.", "In his 2006 autobiography, \"The Audacity of Hope,\" Obama wrote that in Indonesia, he first attended a Catholic school and later went to a  \"predominantly Muslim school.\"", "In an earlier 2004 autobiography, \"Dreams from My Father,\" Obama wrote that he spent two years at a Catholic school and two years at \"a Muslim school.\" He described himself as a youngster who was not very interested in either religion.", "\"In the Muslim school, the teacher wrote to my mother that I made faces during Koranic studies,\" Obama wrote in 2004. \"My mother wasn’t overly concerned. ‘Be respectful,’ she’d said. In the Catholic school, when it came time to pray, I pretended to close my eyes then peek around the room. Nothing happened. No angels descended.\"", "When the rumors arose about Obama’s Indonesian education, his campaign issued a news release saying he never was a Muslim and was raised in a secular household. Obama has said he became a Christian in his 20s while working as a community organizer in Chicago.", "Several news organizations sent reporters to the school in question and found it was a public school that didn’t promote one particular religion.", "\"This is a public school. We don't focus on religion,\" Hardi Priyono, deputy headmaster of the school, told CNN in a 2007 interview. \"In our daily lives, we try to respect religion, but we don't give preferential treatment.\"", "The school provides some religious study. Priyono told the Chicago Tribune in 2007 that Muslim students learn about their religion, while Christians are taught about their faith.", "The article said that when Obama attended fourth grade in 1971, there was two hours of religious study a week.", "\"At holidays, the school made a practice of teaching students about different religions,\" the Tribune reported. \"Students from all religions celebrated Christmas with a Christmas tree and carols. They celebrated the Islamic holiday of Eid al-Adha by handing out a sacrificed goat to the neighborhood's needy.\"", "A spokesman for the Indonesian Ministry of Religious Affairs told The Associated Press in 2007 that allegations Obama attended an Islamic school were baseless, saying the future president went to \"a public primary school that is open to people of all faiths.\"", "We reached out to Robertson for evidence Obama attended an \"Islamic madrassa.\" Chris Roslan, a spokesman for the Christian Broadcasting Network, told us Robertson would address our question on air. On the June 29 broadcast of \"The 700 Club,\" Robertson said he felt a need to clarify his statement.", "He walked back his previous comments but only up to a point. Robertson paraphrased from Obama’s autobiographical accounts of his time in Indonesia.", "\"He said he spent two years in a predominantly Muslim school in Indonesia where he studied Islam,\" Robertson said. \"So I want to correct that was not a - but in Arabic, a madrassa is a school. That’s what the term in Arabic is. You say ‘school,’ and it translates as ‘madrassa,’ but it’s become now a training ground of Islamic, and apparently, we’re not sure that the president attended one of them, so I want to correct that and let everybody this is precisely what he said - ‘I went to a predominantly Muslim school in Indonesia’ where he studied Islam,\" Robertson said.", "Co-host Wendy Griffith said, \"He studied Islam, but he says he’s a Christian.\"", "\"Yeah, well sure,\" Robertson replied, raising his palms.", "Our ruling", "Robertson said Obama attended an \"Islamic madrassa.\"", "The Congressional Research Service notes that madrassas are Islamic religious schools and in recent years sometimes have been defined as breeding grounds that promote Islamic extremism and terrorism.", "Robertson plays bait-and-switch with definitions. He says the president attended an \"Islamic madrassa\" while accusing him of being weak on terrorism, protective of Islamic nations, and viewing the U.S. as \"an oppressor.\"  He dials it back when pressed for details, noting that madrassa, in Arabic, simply means \"school.\"", "Robertson has a slight leg to stand on in that Obama, as a child in Indonesia, went to a public school where a majority of the students were Muslim. In a 2004 memoir, Obama described it as a \"Muslim school.\" And the future president, as part of the curriculum, spent two hours a week in classes about Islam.", "But Robertson doesn’t tell his viewers the larger part of the story: The school was non-sectarian; it celebrated Christian and Islamic holidays; and that the school offered separate religion classes where Muslim and Christian students could learn about their faiths.", "So we rate Robertson’s misleading statement Mostly False.", "https://www.sharethefacts.co/share/604c3bd5-ce40-4a99-ab56-76cc73b7713f", "Pat Robertson’s comments on the 700 Club, June 27, 2016. (His statement is at just over 9:00 into video).", "Pat Robertson’s comments on the 700 Club, June 29, 2016. (His clarification is made at just over 21:00 into video).", "Emails from Chris Roslan, spokesman for the Christian Broadcasting Network, June 28-29.", "Congressional Research Service, \"Islamic religious schools, Madrasas: Background,\" Jan. 23, 2008.", "PolitiFact, \"Obama attended an Indonesian public school,\" Dec. 20, 2007.", "CNN, \"CNN debunks false report about Obama,\"Jan. 23, 2007.", "The Washington Post, \"Headmaster disputes claim that Obama attended Islamic school,\" Jan. 23, 2007.", "Barack Obama, \"The audacity of hope,\" 2006.", "Barack Obama, \"Dreams from my father,\" 2004.", "Chicago Tribune, \"Obama Madrassa myth debunked,\" March 25, 2007.", "Associated Press, \"Obama debunks claim about Islamic school,\" Jan. 24, 2007.", "Los Angeles Times, \"As a child, Obama crossed a cultural divide in Indonesia,\" March 15, 2007.", "FactCheck.org, \"Sliming Obama,\" Jan. 10, 2008.", "Merriam Websters, \"Madrassa,\" accessed June 28, 2016.", "PolitiFact Virginia, \"Gordon Robertson says Obama was ‘raised Muslim,’\" April 28, 2011.", "PBS, \"Anatomy of a smear,\" Jan. 4, 2008.", "Snopes, \"Who is Barack Obama?\" July 7, 2009.", "Wall Street Journal, \"Republicans fuel rumor that Obama is a Muslim,\" Oct. 21, 2008.", "Politico, \"Untraceable emails spread Obama rumor,\" Oct. 13, 2007.", "The Washington Post, \"Pakistan is still trying to get a grip on its madrassa problem,\" Dec. 16, 2015.", "Barack Obama campaign news release via Vote Smart, \"Debunked Insight magazine and Fox News smear campaign,\" Jan. 23, 2007.", "McClatchy, \"At Obama’s Indonesian school, there’s no doubt he’ll be elected,\" Aug. 27. 2008.", "Jakarta Post, \"Impish Obama couldn’t sit still says school pal,\" Jan. 31, 2007.", "https://www.sharethefacts.co/share/a0a6416b-bf4b-44a0-91e9-7ad988e1a805", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]