["The 21-second video was shared here on Facebook on February 3, 2021.", "The footage shows a crowded railway station.", "“Borivali Station today after Local trains started for General Public,” the photo caption reads.", "Borivali station connects the eponymous suburb with the centre of Mumbai.", "Local train services in India’s densely populated financial capital resumed for the general public on February 1, 2021 after an almost one-year hiatus due to the nationwide coronavirus lockdown that started in March 2020.", "Some trains had already resumed service for essential workers in June 2020.", "The video has also circulated here and here on Facebook alongside a similar claim.", "The claim, however, is false. A reverse image on Google using keyframes from the video found the original footage uploaded to YouTube here on March 21, 2016.  The clip has garnered more than 2.7 million views.", "The caption reads: “Heavy crowding of Mumbai local.”", "Below is a screenshot comparison of the video shared in the misleading Facebook post (L) and the 2016 YouTube clip (R):", "YouTube user Navin Poojary, who uploaded the clip, said in the comments claims that the video was filmed at Borivali railway station.", "Below are photos comparing the similar structures seen in the misleading video (L), and a Google photo (R) at the Borivali railway station highlighted as ‘A’ and ‘B’ by AFP:", "Several other users uploaded similar photos here and here on Google of the same bridge and roof at Borivali station.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]