["This 21-second video was published here on YouTube on September 19, 2019, where it has been viewed nearly 300,000 times.", "The black and white footage shows a motorist crashing his car as he drives out of a car park.", "Below is a screenshot of the misleading post on YouTube:", "The video is headlined: “CCTV: LOONIE BUY-BUST OPERATION - SEPTEMBER 18, 2019”. The same text is superimposed on the video itself.", "“Loonie” is the moniker of Filipino rapper Marlon Peroramas.", "He was arrested for alleged marijuana possession on the night of September 18, 2019, according to this Philippine Daily Inquirer news report.", "The YouTube video was shared on Twitter here, and on Facebook here.", "The same video was shared in another post on YouTube here with a similar claim.", "But the claim is false; the video actually shows an allegedly drunk driver crashing his car at a car park in the Polish capital of Warsaw in 2016.", "A reverse image search for keyframes of the video using the verification tool InVID found this longer, higher quality video of the same incident published on YouTube on September 22, 2016.", "The two-minute 29-second video’s Polish-language title translates to English as: “Garage”.", "The video in the misleading posts corresponds with the 2016 video from the one-minute 33-second mark to the one-minute 54-second mark.", "Below is a screenshot comparison of the video in the misleading posts (L) and the 2016 video (R):", "The 2016 YouTube video was embedded in this report published on September 23, 2016 by Polish news site Warszawa Naszemiasto.", "A Polish speaking journalist in AFP’s Warsaw bureau translated the Polish-language report.", "The first part of the report states cameras located in a building on Wlodarzewska Street in the Ochota district of the Polish capital Warsaw captured the incident.", "The last part of the report states the website was able to confirm with the Warsaw police that the incident captured on camera happened on September 1, 2016, and that the drunk man was arrested and fined 500 zloty or the equivalent of 120 euros.", "The report translates to English as: “You had an alcoholic drink, do not drive your car. Do not enter your car. Cameras registered in a building located on Wlodarzewska street, in Ochota, a drunk man who despite being visibly under effect of alcohol sat in his car. What happened next? It was easy to imagine.", "“The drunk man has been caught by cameras in a building located on Wlodarzewska 87 B street. The video has been released a few days after the incident.", "“We managed to confirm in police station nr 3 in Warsaw that the incident with the drunk person took place on September 1, 2016. The police succeeded in arresting him. The man has been penalised with the fine of 500 pln (120 EUR) and his driver license has been returned to him, according to Edyta Wisowska, a spokesman of police from the Ochota police station.”", "A closer analysis of the 2016 YouTube video shows a Polish sign that states “wyjazd” at the one-minute 42-second mark, which translates to English as \"exit\".", "The video also includes a reference to “garaz 87b” in the top left-hand corner, which corresponds with the street number where the incident was reported to have happened in the Warszawa Naszemiasto article.", "The date of the incident, September 1, 2016, is also shown in the bottom left-hand corner of the video, which is consistent with the Warszawa Naszemiasto article.", "Below is a screenshot of the 2016 YouTube video with these three elements circled in red by AFP:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]