["About this rating", "A photograph purportedly showing a polar bear taking public transportation in Russia is frequently shared online with humorous captions such as \"just a normal day in Russia\":", "This image has also been shared with punny captions such as \"The Polar Express,\" \"The bus was unBEARable,\" \"Auditioning for the new Coca-Cola bear,\" and \"Kindly bear with us as we get this aggressive passenger of the bus.\"", "This picture is a genuine photograph in the sense that it was not digitally manipulated, but it does not, as often claimed, capture a real polar bear exiting a bus in Russia.", "What this picture actually shows is a puppet known as \"Paula the Polar Bear\" exiting a tram in the Czech Republic city of Brno during a \"Save the Arctic\" campaign by Greenpeace. (The name of Rakovecká, a street in Brno, can be seen on the bus sign.) Two activists are actually operating this puppet from the inside as other Greenpeace members inform the public about matters such as climate change and arctic drilling.", "The Greenpeace Czech Republic Facebook page shared an image of Paula the Polar Bear in Liberec in October 2014:", "The Brno news outlet Centrum News reported in 2015 that this realistic polar bear puppet had frightened a few passers-by as it walked through the supermarket in Židenice (translated via Google):", "On Friday afternoon a city police patrol quickly responded to a supermarket in Židenice, where a polar bear, according to a caller, was walking around.", "The policemen in Bubeníčkova Street actually saw a furry white animal, but it was only a costume used by ecological activists.", "The bear costume was very realistic, so some of the passers-by were fooled. Two people were hidden inside the life-sized costume.", "Paula the Polar Bear has made appearances in cities all over the world. Here, for example, is a video of Paula the Polar Bear visiting the Canterbury Cathedral in England:", "The Paula the Polar Bear puppet was also used in a short film starring Jude Law to promote Greenpeace's \"Save the Arctic\" campaign:", "“I came up with the concept after having been asked by Greenpeace to judge a short VW film competition they were running and being taken on a guided tour of the building, when I was duly shown around their warehouse and spotted a life-sized suit of a polar bear called Paula hanging from a pole -- a relic from a play called ‘Greenland’ at the National Theatre in London,” says Michael.", "“After a brief conversation with Head of Greenpeace UK, John Sauven, about their up-and-coming Save the Arctic campaign, I took some pictures of the bear and started thinking about how I could tell her story, and a simple idea came to me: what if, because we had made her homeless, this polar bear had traveled so far in search of food that she would be living on the streets of London.", "“I thought that the obvious parallels with the homeless in any major city might make her issues more obvious to us city dwellers, especially as we live thousands of miles away.”", "The stunning polar bear costume was operated by puppeteers from London’s Broadway and West End production ‘War Horse’ who rehearsed the bear’s articulations. A team of post-effects artists from London’s Moving Picture Company worked on face manipulation.", "A short film documenting the making of \"The Homeless Polar Bear\" provides a better look at how Paula the Polar Bear is operated:", "Prague Daily Monitor.   \"Czech Greenpeace Protesting Against Oil Extraction in Arctic.\"\r\n    8 July 2015.", "Luerzers Archive.   \"Homeless Polar Bear for Greenpeace.\"\r\n    Retrieved 28 November 2018.", "Exner-Pirot, Heather.   \"Blog: #SavetheArctic… from Greenpeace.\"\r\n    RCINet.   19 January 2015.", "Centrum News.   \"V Židenicích u Supermarketu Prý Rádil Lední Medvěd.\"\r\n    28 February 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]