["This Facebook post, which has been shared some 1,100 times since it was published on June 28, 2019, contains an image of a KFC restaurant in Larkana, Pakistan and two photos of fried chicken covered with maggots.", "The post's caption says: “KFC LARKANA, Sindh Branch where Maggots and bugs were found inside the KFC chicken Thigh pieces - These pieces usually have an expiry of 48 Hours but seems like it was keep and served for a longer period.”", "“Please SHARE this Post and Tag all your friends Specially from Larkana and Sindh area” adds the captions.", "Larkana is a city in central Pakistan. Here is photo on Google Maps of the KFC building in Larkana.", "Below is a screenshot of the misleading Facebook post:", "The claim is false; the photos were not taken at a KFC in Pakistan.", "A Google reverse image search led to this October 3, 2018 Facebook post by Facebook user Datta Salve, who says on his about page that he lives in Mumbai, India.", "The post is captioned: \"KFC powai chicken 1 Oct\".", "The post is embedded below:", "Datta Salve told AFP by phone that he had taken the pictures in his Facebook post.", "“I ordered chicken at KFC Powai, Mumbai and was surprised that the worms were everywhere in my chicken,” he said.", "Powai is a northern suburb of Mumbai, in India.", "Below is a comparison of the original images taken by Salve (L) and the ones used in the misleading post (R):", "The same images were also shared on Twitter here on October 5, 2018, with KFC India responding to the post.", "Hi! We have been notified of this issue and are investigating it. Even in theory, the presence of such foreign objects, seem impossible as our chicken is hand breaded by trained cooks, before being cooked at a temperature of 170 degrees or higher. 1/2", "An online report also used the two photos of chicken shown above from Salve’s original Facebook post, alongside claims that KFC restaurants in Pakistan’s central Multan city had been “sealed” by inspectors for food hygiene reasons.", "An official with the Punjab Food Authority, Rana Waseem told AFP by phone: “We have not carried out any raid in Multan, this news is fake and photos are from somewhere else.”", "A Customer Relationship Officer at KFC Multan also confirmed the fast-food chain had not been targeted by any raid.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]