["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Senator Jim Webb, who will not seek reelection next year, has been lamenting the partisanship that grips the nation.\n\nDuring a recent interview with ABC News, the Virginia Democrat was incredulous over the fighting that occurred this summer before Congress raised the debt ceiling so the United States could pay its bills.\n\nAn August deal raised the federal government’s $14.3 trillion borrowing authority to $16.4 trillion, a level that is expected to keep the government operating until early 2013.\n\n\"(President) Ronald Reagan raised the national debt 18 times,\" said Webb, a former Republican who served as Reagan’s secretary of the Navy .\n\nWebb is hardly the first Democrat to cite Reagan’s record on the debt limit. President Barack Obama, in a televised speech on July 25, said raising the borrowing cap has been a routine practice by Congress and presidents since the 1950s. Obama also said Reagan increased the debt ceiling 18 times.\n\nWe asked Webb’s office what the Senator based his statement on. Will Jenkins, Webb’s director of communications, cited a chart by the Office of Management and Budget that details 18 different laws signed to raise the debt limit during Reagan’s presidency from January 1981 to January 1989.\n\nThis seemed like a cut-and-dry case for PolitiFact Virginia. But like so many of the claims we investigate, there was a snag.\n\nWe came across several news stories saying Reagan hiked the debt limit 17 times, not 18. For example, Chris Van Hollen, the ranking Democrat on the House Budget Committee, was quoted in a July 16, 2011, article in The Hill newspaper using the lower number. We also found references to 17 Reagan-era debt limit hikes in The Washington Post and FactCheck.org.\n\nWe looked at the OMB chart again. After each law increasing the borrowing limit is a column showing the new, higher level of the debt ceiling.\n\nTwo of the 18 bills - one approved on May 15, 1987, and another approved on July 30, 1987 - are listed as boosting the debt limit to the same amount -- $2.32 trillion. Should they be counted as one increase, or two?\n\nRichard Kogan, a senior fellow at the liberal Center on Budget and Policy Priorities, noted in an e-mail that the May, 1987 increase to $2.32 trillion was a temporary hike. When that limit expired on July 17, 1987, the debt limit reverted to a previous level of $2.1 trillion, Kogan said.\n\nBut after a couple of weeks, Congress passed yet another temporary debt boost at the end of July 1987 increasing the debt ceiling from $2.1 trillion back to $2.32 trillion, he said.\n\nKogan, a former senior adviser to the Office of Management and Budget, said it’s a semantic question as to whether the July, 1987 should be considered its own increase, but added he personally would consider it a second debt ceiling hike.\n\nOur ruling:\n\nWebb said Reagan signed off 18 times on increasing the national debt. Figures from the Office of Management and Budget do show 18 laws were signed to increase the debt limit during Reagan’s eight years in office.\n\nA semantic argument can be made that the actual debt limit was raised only 17 times during the Reagan administration, but we don’t think it’s worth the haggle. We rate Webb’s statement True.", "ABC News, \"Swing Senator: Will Webb help Obama in Virginia?\" November 4, 2011.\n\nOffice of Management and Budget, \"Table 7.3, Statutory limits on federal debt,\" accessed November 7, 2011.\n\nE-mail from Will Jenkins, director of communications for Sen. Jim Webb, November 7, 2011.\n\n\nPolitiFact, \"Obama says Reagan raised debt ceiling 18 times, George W. Bush seven times,\" July 26, 2011.\n\nFactCheck.org, \"Ron Paul ad invokes Reagan, imprecisely,\" July 27, 2011.\n\nCongressional Research Service, \"The debt limit: history and recent increases,\" April 5, 2011.\n\nCongressional Research Service, \"The debt limit: history and recent increases,\" April 29, 2008.\n\nE-mail from Regan Lachapelle, senior communications associate at the Center on Budget and Policy Priorities, November 10, 2011.\n\nE-mail from Meg Reilly, spokeswoman for the Office of Management and Budget, November 10, 2011.\n\nThe Hill,\"Democrats invoke Reagan in support of debt-ceiling increase,\" July 16, 2011.\n\nWashington Post, \"Who raised the debt ceiling?\" July 14, 2011.\n\nAssociated Press, \"Debt ceiling deadline approaches: Ronald Reagan looms over debate,\" July 23, 2011.\n\nConcord Coalition, \"Understanding the federal debt limit,\" accessed November 7, 2011.\n\nThe New York times, \"Q. and A. on the debt ceiling,\" July 27, 2011.\n\nUSA Today, \"Our view: conservatives have strayed from the Reagan model,\" July 27, 2011.\n\nPolitiFact Virginia,\"Scott says debt limit deal pays for half of Bush tax cuts,\" August 29, 2011.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]