["About this rating", "There are many superstitions that appear around weddings, including the legend that whomever catches the bride's bouquet indicates that they will be the next person to get married.", "This piece of traditional folklore has led to some funny footage of attendees going to extreme lengths to catch (or to avoid) the tossed bouquet. In May 2018, some were convinced that they had stumbled upon a video showing a bridesmaid making an incredibly athletic catch:", "This is not genuine footage of a bridesmaid flying through the air in order to catch a bouquet. This is actually a clip from a 2016 Buick Super Bowl commercial featuring model Emily Ratajkowski:", "The \"she Odell'd it\" line refers to a one-handed catch New York Giants wide receiver Odell Beckham Jr. made during a Sunday Night Football game against the Dallas Cowboys in 2015. That was dubbed one of the greatest catches of all time, and it is well known to football fans, many of whom recognized the reference when they saw the commercial air during the Super Bowl:", "Although Emily Ratajkowski plays the athletic bridesmaid in the commercial, the catch was actually performed by a stunt double. Ratajkowski explained how it was made during an interview with Entertainment Tonight:", "That is a stunt double. I wish I could say that was me, but that is an amazing woman who could do a catch like that in four-inch heels — so insane.", "[...]", "They are using this bad ass lady who is my stunt double and they are putting my face on her so that I look like the bad ass lady.", "Schillaci, Sophie.   \"Super Bowl Q&A: Emily Ratajkowski On Her Ad With Odell Beckham Jr., Bouquet Catching & Keeping That Booty In S.\"\r\n    Entertainment Tonight.   7 February 2016.", "AdAge.   \"Buick - Wedding.\"\r\n    7 February 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]