["About this rating", "On 31 January 2018, the final installment of what National Aeronautics and Space Administration (NASA) has billed as a “supermoon trilogy” will grace our skies. If an event’s impact is measured solely by its lack of statistical probability, this one is to be a doozy.", "Supermoons, which have most recently occurred on 3 December 2017 and 1 January 2018, are full moons that happen to occur when the Earth and the moon are at or near the closest positions in their orbit (an event called a \"perigee\"), making the moon appear about 14% larger and up to 30% brighter.", "Every two and a half years on average, two full moons appear in the same calendar month. Despite the fact that this phenomenon changes nothing about the moon’s physical appearance, the second moon is sometimes referred to as a “blue moon.” Since 1 January was also a full moon, that will make the supermoon on 31 January 2018 both a blue moon and a supermoon.", "Capping all of these coincidences is the fact that Wednesday’s super blue moon will also occur during a total lunar eclipse. Lunar eclipses occur when Earth passes in between the sun and the moon, casting a shadow on the moon, causing what’s referred to as a “blood moon” when the moon is full. Unlike a blue moon, a blood moon actually does alter the color of the moon to a moody red; without the reflection of direct sunlight we usually see on the Moon, the only light that reflects back to us are the distorted reds that have passed through Earth’s atmosphere.", "The confluence of these events have led NASA and media outlets to bill the full moon of 31 January 2018 as a “super blue blood moon.” The best time to see it depends on your location, according to NASA:", "If you live in North America, Alaska, or Hawaii, the eclipse will be visible before sunrise on Jan. 31. For those in the Middle East, Asia, eastern Russia, Australia and New Zealand, the “super blue blood moon” can be seen during moonrise in the evening of the 31st.", "For those unable to view the statistical anomaly on their own, NASA will offer a live feed of the event starting at 5:30 am EST on 31 January 2018. The next time a supermoon and a lunar eclipse will occur simultaneously (ignoring the blue moon part of the trifecta) will be on 21 January 2019.", "Avid readers and lunar fans may recall that a 27 September 2015 supermoon and lunar eclipse combination was billed by NASA at the time as the last such event until 2033. The reason for this apparent discrepancy has to do with the fluid label of “supermoon,” for which there is no formal scientific definition.", "The relative “superness” of a full moon depends on how close it occurs to the perigee -- the specific instant in time that the moon and Earth are closest to each other. The lunar eclipse/full moon this week will actually occur many hours after this event, which will happen at 10:56 am EST the morning of January 30th.", "In the case of the 27 September 2015 event, the perigee between Earth and the moon occurred within two hours of the eclipse making it more “super” than this one.", "Ambiguity of the term “supermoon” aside, the claim that there will be a slightly closer full moon during a lunar eclipse that happens to be the second full moon of the month on Wednesday, 31 January 2018 is true.", "NASA.   \"A Supermoon Trilogy\"\r\n    30 November 2017.", "Hiscock, Philip.   \"Once in a Blue Moon.\"\r\n    Sky and Telescope Magazine.   24 August 2012.", "NASA.   \"‘Super Blue Blood Moon’ Coming Jan. 31.\"\r\n    18 January 2018.", "NASA.   \"NASA Scientist Sheds Light on Rare Sept. 27 Supermoon Eclipse.”\r\n    14 September 2015.", "Tavernier, Lyle.   \"Teachable Moment: What’s a Supermoon and Just How Super is It?\"\r\n    NASA Science.   30 November 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]