["A screenshot of an article headline reporting that a study showed that asymptomatic transmission of Covid-19 “didn’t occur at all” has been shared in multiple Facebook and Instagram posts. The claim is misleading; the authors of the study said their results do not show that asymptomatic carriers cannot transmit Covid-19 and warned against generalising the study’s findings.", "The headline image was published on Instagram on December 31, 2020.", "The headline reads: “Asymptomatic transmission of COVID-19 didn’t occur at all, study of 10 million finds”.", "“Only 300 asymptomatic cases in the study of nearly 10 million were discovered, and none of those tested positive for COVID-19,” the subheading reads.", "The Instagram post’s caption asks: “Do you understand what this is all about? (Hint...it has nothing to do with a virus or your health)”.", "Pictures of the headline were also published on Instagram here and on Facebook here.", "The original article was published on fringe news site LifeSiteNews on December 23, 2020.", "“A study of almost 10 million people in Wuhan, China, found that asymptomatic spread of COVID-19 did not occur at all, thus undermining the need for lockdowns, which are built on the premise of the virus being unwittingly spread by infectious, asymptomatic people,” the report claims.", "The article cites a study published in November 2020 in Nature Communications by researchers at Huazhong University of Science and Technology in Wuhan and other universities in China, Australia and the UK.", "The study was conducted in the latter half of May 2020 after Wuhan relaxed a strict lockdown that had been in place for months.", "However, the authors of the study told AFP that LifeSiteNews’s headline and article are misleading.", "“It is misleading/incorrect/wrong to conclude that ‘all asymptomatic’ individuals infected with Covid-19 are not infectious, based on the results of the paper,” Fujian Song, one of the authors on the study, said in an email on January 6, 2021.", "Song said that the asymptomatic cases identified in the screening programme were truly asymptomatic, which refers to patients who never show symptoms throughout the course of their infection.", "“Infected individuals in other settings may be temporarily asymptomatic or pre-symptomatic (they may become symptomatic after some days), and they can spread the virus even before the onset of symptoms,” he said.", "“Second, these asymptomatic cases were identified 4-8 weeks after the relaxation of >70 days stringent lockdown in Wuhan. By then the epidemic in Wuhan had been effectively under control.”", "Song also cautioned against generalising the results of the study to countries where Covid-19 outbreaks have not been brought under control.", "“The asymptomatic cases identified in the screening programme in Wuhan were likely to be previously infected (antibody positive in >60% of them) and had only inactive remains of viral RNAs, compared with cases in locations with high SARS-CoV-2 virus transmission,” he explained.", "Britain’s University of East Anglia, which also participated in the study, preemptively refuted mischaracterisations of the study’s findings.", "“The research team warn that their findings do not show that the virus can’t be passed on by asymptomatic carriers,” the university said in a press release on November 30, 2020.", "The study “confirms that transmission of Covid-19 can be successfully controlled by well implemented non-pharmaceutical interventions, including face covering, hand hygiene, safe social distancing, contract tracing, and lockdown restrictions,” the statement explained.", "The British Medical Journal published a report on the study’s findings on December 1, 2020. Citing the study’s authors, it said that “the findings cannot be extrapolated to countries where outbreaks have not been brought under control successfully.”", "Similar misleading claims also circulated in French and were debunked by AFP France here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]