["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo purporting to show a flooded airport in Houston is actually an illustration of the effects of sea-level rise on LaGuardia Airport in New York.", "A photo circulating online that purports to show flooding at one of Houston’s major airports after Hurricane Harvey is actually a photo illustration created to show the effects of sea-level rise in New York City.", "Several tweets on Aug. 28, 2017, showed waterlogged passenger jets flooded up to their fuselages.", "\"There appears to be a flooding problem at #HOUSTONairport here at #heathrow we would just squeegee of the runway,\" London-based tweeter @v7dge wrote.", "There appears to be a flooding problem at #HOUSTONairport here at #heathrow we would just squeegee of the runway pic.twitter.com/YPs11d4ldP", "\"#Houston airport looks now more like a port. Terrible situation for the citizens and society. Hope they can recover fast!\" wrote another Twitter user with the handle @lauslahti.", "#Houston airport looks now more like a port. Terrible situation for the citizens and society. Hope they can recover fast! pic.twitter.com/F7I0T5GJxf", "A user in Karachi, Pakistan, called @MadniSwagger posted, \"Ohohoho Houston airport.\"", "Ohohoho Houston airport pic.twitter.com/1JAMTxlu7c", "None of the users identified whether the image was supposed to show Houston’s George Bush Intercontinental Airport or the smaller William P. Hobby Airport, but it’s neither. The image is a fake.", "While it does show an airport — New York’s LaGuardia Airport in Queens — it’s actually a digitally manipulated photo that was used to show the effects of sea-level rise. A 2013 article on ClimateCentral.org credited the image to an artist named Nickolay Lamm, saying it was made to illustrate what a 25-foot increase in sea level would look like at LaGuardia. (There are other images showing the change at 5 feet and 12 feet.)", "Both of Houston’s major airports were shut down by the storm, canceling thousands of flights over several days. Bush and Hobby airports were both expected to resume flights by Aug. 29.", "An Aug. 27 tweet from Houston’s ABC affiliate said, \".@HobbyAirport says about 500 people are trapped. A friend shared these pics of a flooded runway and street with @FotiABC13 #HoustonFlood\" and included photos.", ".@HobbyAirport says about 500 people are trapped. A friend shared these pics of a flooded runway and street with @FotiABC13 #HoustonFlood pic.twitter.com/xvhIlFkQDc", "Other tweets, including this one from the local CBS affiliate on Aug. 26, showed flooding near Bush.", "But the photograph popping up across the Internet isn’t a true representation of the disaster. We rate it Pants on Fire!", "Twitter, @TiffanyKHOU tweet, Aug. 26, 2017", "Twitter, @abc13houston tweet, Aug. 27, 2017", "Twitter, @v7dge tweet, Aug. 28, 2017", "Twitter, @lauslahti tweet, Aug. 28, 2017", "Twitter, @MadniSwagger tweet, Aug. 28, 2017", "ClimateCentral.org, \"U.S. Airports Face Increasing Threat From Rising Seas,\" June 18, 2013", "New York Times, \"With Houston Airports Closed, Airlines Cancel Thousands of Flights,\" Aug. 28, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]