["This Facebook post claiming the Sri Lankan government has imposed a ban on the burqa was published on March 1, 2020.", "Below is a screenshot of the misleading Facebook post:", "The post includes a photo of Sri Lankan President Gotabaya Rajapaksa and a blurry government report, as well as a link to a YouTube video titled “Gazette Notification forbidding burqa issued”.", "The post’s Sinhala-language caption translates to English as: “Burqa banned!! / Gazette notification issued.”", "A similar claim was published in this YouTube video titled “No more Burka in Sri lanka”, which has been viewed over 56,000 times after it was published on February 20, 2020", "A similar claim was also shared here, here, here, here and here on Facebook.", "The claim is misleading; Sri Lanka has not issued a fresh ban on the burqa in March 2020.", "A keyword search for the title of the YouTube video named in the misleading Facebook post found this video published on the channel for Sri Lankan television channel Ada Derana on May 15, 2019.", "Below is a screenshot of the YouTube video titled “Gazette notification prohibiting the burqa issued”:", "Below is a screenshot comparison of the image in the misleading Facebook posts (L) and the Ada Derana video (R)", "The Sri Lankan government imposed a temporary ban on wearing the burqa in May 2019 after a series of suicide bombing attacks on churches and hotels in Sri Lanka on Easter Sunday left at least 290 dead. Here is an AFP report about the attacks.", "On April 29, 2019 the then President Maithripala Sirisena tweeted: “Emergency Regulations will be banned from tomorrow (29.04.2017) with immediate effect on the use of face masks which will compromise the identity of the people in the country which could pose a threat to national and public security.”", "A government gazette was later issued on May 13, 2019 which cemented the ban in law. It stated: “No person shall wear in any public place, any garment, clothing or other material concealing the full face which will in any manner cause any hindrance to the identification of such person.”", "Below is a screenshot of the relevant section of the release:", "The ban was later lifted in September 2019 after the state of emergency expired, according to this report by local television channel Ada Derana.", "On February 19, 2020, Sri Lanka's Parliamentary Committee on National Security put forward a proposal for an “immediate ban on the burqa”, according to this report by the local English-language newspaper Ceylon Today. But the government is yet to make a final ruling on the proposed ban.", "As of February 19, 2020 AFP found no new government gazette on the website for the Department of Government Printing mentioning a burqa ban.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]