["By Eugene Kiely and Lori Robertson", "Posted on September 28, 2020", "In remarks about President Donald Trump’s pick for the Supreme Court, Democratic presidential nominee Joe Biden made some questionable statements:", "The former vice president made a few short appearances during the weekend leading up to the first debate.", "On Sept. 26, Biden spoke to the United States Conference of Mayors for less than 16 minutes, and he delivered brief remarks at the virtual L’Attitude conference. On the same day, MSNBC aired an interview with Biden as part of the San Diego-based Latino conference.", "On Sept. 27, Biden made remarks about Trump’s selection of Amy Coney Barrett to the Supreme Court, speaking for less than 14 minutes.", "By contrast, Trump made five appearances and spoke for about two hours and 15 minutes, including a campaign rally in the swing state of Pennsylvania. See our story, “FactChecking Trump’s Weekend Claims,” for the many false and misleading claims that the president made over the weekend.", "In making his pitch for the Senate to delay action on Trump’s Supreme Court nominee, Biden gave a misleading account of Supreme Court nominees in a presidential election year.", "Biden, Sept. 27: Never before in our nation’s history has a Supreme Court justice been nominated and installed while a presidential election is already underway. It defies every precedent, every expectation of a nation where the people, the people, are sovereign and the rule of law reigns.", "Biden’s campaign told us that Trump should not be allowed to appoint the next Supreme Court justice because voting has already begun — which is what Biden meant when he said “while a presidential election is already underway.” It is true that early voting has started in some states.", "But it is also true that five justices since 1900 were nominated and installed in an election year by four different presidents who were running for reelection. Two of them — William Taft and Herbert Hoover — lost their elections.", "Amy Howe, a lawyer, detailed all instances of Supreme Court vacancies in election years since the turn of the 20th century in an article for SCOTUS Blog.", "Here is the list of five justices who were nominated and installed in an election year by a president running for reelection, based on Howe’s story, as well as White House, Supreme Court and Senate records.", "In every instance, the nomination was made and confirmed by members of the same party — which is the current situation with Trump and the Republican-controlled Senate. The difference, of course, is that the date of the election is much closer this year than it was for any of the nominees who were nominated and approved in the above chart.", "Biden also made the curious argument that senators need to “stand up for the Constitution,” and let the next president fill the vacancy left by the death of Associate Justice Ruth Bader Ginsburg.", "Biden: And I urge every senator to take a step back from the brink, take off the blinders on politics for just one critical moment, and stand up for the Constitution you swore to uphold. … Just because you have the power to do something doesn’t absolve you of your responsibility to do right by the American people. Uphold your constitutional duty.", "Article II, Section 2 of the Constitution says the president “shall nominate, and by and with the Advice and Consent of the Senate, shall appoint … Judges of the supreme Court.” Voting for or against Trump’s nominee — should Barrett clear the Senate Judiciary Committee confirmation process — is upholding the Constitution.", "The Biden campaign told us that the vice president believes the senators have a duty to use their constitutional power of advice and consent to block the nomination, because Trump has overreached his authority in seeking to fill a vacancy while the election is underway.", "Earlier this month, we asked constitutional scholars about Biden’s claim at a speech in Philadelphia that it would be a “constitutional abuse” for a nominee to be installed on the Supreme Court this close to an election. No one said it was.", "“It is not an abuse of power – the president and the Senate have that prerogative,” Kimberly Wehle, a professor at the University of Baltimore School of Law, told us.", "Biden, a former senator who served as vice president under President Barack Obama from January 2009 to January 2017, also repeated some claims that we have written about before.", "Aid to state/local governments. In his remarks to the U.S. Conference of Mayors, Biden distorted comments made by Senate Majority Leader Mitch McConnell, claiming that McConnell said, “Let the states go bankrupt.” Biden said, correctly, that the Senate hasn’t taken up a Democratic House-passed bill to provide additional relief from the coronavirus pandemic, including to state and local governments.", "As we’ve explained before, McConnell said bankruptcy should be a legal option for states facing money woes unrelated to the coronavirus, such as debt due to pension programs. The Republican senator made those remarks in an April 22 radio interview on “The Hugh Hewitt Show,” saying: “I would certainly be in favor of allowing states to use the bankruptcy route,” when asked about states with budgetary woes predating the pandemic. McConnell, who said he wanted any additional state/local funding tied to COVID-19, made clear in subsequent interviews that he was saying bankruptcy should be “an option” and that he didn’t want any future federal aid to “fix age-old problems” in states “wholly unrelated” to the coronavirus pandemic.", "Preexisting conditions. Biden misleadingly claimed that if a Trump-backed effort in court to abolish the Affordable Care Act were successful, “more than 100 million people with preexisting conditions like asthma, diabetes, and cancer could once again be denied coverage.” The figure is an estimate for the number of all Americans, outside of Medicare and Medicaid, with preexisting conditions. Without the ACA, as we’ve explained, they’d lose the preexisting condition protections in that law, but only those who seek coverage on the individual market — where those without employer or public insurance buy plans – would be at risk of being denied insurance.", "The Trump administration has indeed backed a lawsuit to nullify the ACA and once specifically argued, in a 2018 letter from then-Attorney General Jeff Sessions, that two provisions of the law would need to be eliminated if the suit were successful: those guaranteeing that people can’t be denied coverage by insurers or charged more based on certain factors, such as health status. But Trump signed an executive order on Sept. 24 that said “access to health insurance despite underlying health conditions should be maintained” even if the ACA were struck down in court.", "He said in remarks that day he would insist that any new health care legislation from Congress “must protect the preexisting conditions or I won’t sign it.” It’s unclear what specifically Trump means by preexisting condition protections. In 2017, he backed Republican bills that would have included some, but not all, of the ACA’s protections, and he misleadingly tweeted that one of the bills covered preexisting conditions, despite the fact that insurers could have priced policies based on health status in states that allowed it under the legislation.", "But even if the ACA were eliminated and not replaced with something else, it’s misleading for Biden to claim 100 million people “could once again be denied coverage.” Before the ACA, those buying plans on the individual market could face denials or higher premiums based on their health. Only 6% of the population gets coverage on the individual market.", "Employer-based coverage — where 49% of the population gets insurance — couldn’t deny insurance, before the ACA. They could decline coverage for some preexisting conditions for a limited period, if a new employee had a lapse in coverage.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]