["The video by right-wing national cable network One America News Network (OANN) was shared more than 750 times on Facebook in South Africa here and here in late July 2020. The broadcaster counts US President Donald Trump among its fans.", "“The game is on, France government has approved the use of hydroxychloroquine to treat COVID patients. After 78 out of 80 patients have completely recovered after administering hydroxy chloroquine (sic),” the post reads.", "It also makes reference to Stella Immanuel, a doctor who announced on July 27, 2020, that she had successfully treated more than 350 COVID-19 patients with hydroxychloroquine.", "A video of her press conference, filmed on the steps of Capitol Hill, went viral and was shared by Trump.", "AFP Fact Check has debunked Immanuel’s claims and other claims related to the drug here, here and, here.", "AFP has traced the earliest version of the OANN video to April 2, 2020. It was shared in this tweet of a YouTube video that has since been deleted for violating YouTube’s Community Guidelines.", "The news report touts hydroxychloroquine as an effective drug in the fight against COVID-19 and cites France as an example of a country that uses it to treat patients.", "“Reports are pouring in from all over the world that the drug hydroxychloroquine is proving to be effective at fighting the Chinese coronavirus -- now the French government has officially sanctioned the drug after a shocking 78 out of 80 patients fully recovered from the virus after just five days of treatment,” said the reporter.", "As reported by AFP, controversial French doctor Didier Raoult said in March 2020 that his study of 80 patients showed that four out of five treated with hydroxychloroquine had \"favourable\" outcomes.", "He had earlier reported that after treating 24 patients for six days with hydroxychloroquine and the antibiotic azithromycin, the virus disappeared in all but a quarter of them.", "The French government, in the same month, allowed doctors to prescribe it for coronavirus infection in strict cases. You can read the AFP story here.", "But in early April 2020, the European Medicine Agency (EMA) warned that the drug  should only be used in clinical trials or national emergency programmes for the treatment of COVID-19.", "The agency cautioned that the drugs should not be used to treat COVID-19 cases unless absolutely necessary.", "\"It is very important that patients and healthcare professionals only use chloroquine and hydroxychloroquine for their authorised uses or as part of clinical trials or national emergency-use programmes for the treatment of COVID-19,\" it said.", "On May 27, 2020, the French government ordered that doctors should no longer prescribe hydroxychloroquine for COVID-19 patients because it was an unproven and potentially harmful treatment for the disease. Under the French rules, the drug was only to be used in clinical trials. You can find AFP’s English-language story about the announcement here.", "Hydroxychloroquine has long been known to produce serious side effects, including heart arrhythmia, in some people.", "EU-backed trials of the drug in several European countries have been suspended since May 24, 2020, France's Inserm research institute said.", "And on June 5, 2020, the University of Oxford said that it would stop recruiting volunteers \"with immediate effect\" for the first large-scale study of hydroxychloroquine.", "\"Our conclusion is that this treatment does not reduce the risk of dying from COVID among hospital patients and that clearly has a significant importance for the way patients are treated, not only in the UK, but all around the world,\" said Oxford professor and study co-lead Martin Landray.", "On July 4, 2020, the World Health Organization (WHO) announced it would discontinue its Solidarity Trial for hydroxychloroquine and anti-HIV drug lopinavir/ritonavir as COVID-19 treatment.", "“These interim trial results show that hydroxychloroquine and lopinavir/ritonavir produce little or no reduction in the mortality of hospitalized COVID-19 patients when compared to standard of care. Solidarity Trial investigators will interrupt the trials with immediate effect,” the WHO said.", "The UN health agency said that while hydroxychloroquine was accepted as generally safe for patients with malaria and autoimmune diseases, its use “where not indicated and without medical supervision can cause serious side effects and should be avoided.”", "Fresh widespread contention around the drug resurfaced last month after Trump tweeted the footage of Immanuel’s press conference.", "Immanuel said she had become familiar with hydroxychloroquine while treating malaria patients in Nigeria and decided to try it for COVID-19 patients.", "“The result has been the same. I put them on hydroxychloroquine, I put them on zinc, I put them on Zithromax, and they are all well,” said the Houston-based doctor.", "However, multiple experts told AFP that her claims regarding hydroxychloroquine are misleading.", "Dr. Julian Leibowitz, an expert in coronaviruses, a professor of microbial pathogenesis and immunology at Texas A&M’s College of Medicine, told AFP by email that “multiple studies have shown this to be wrong.”", "Dr. Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas at Austin, agreed.", "“These are not cures for the virus. There is no evidence that hydroxychloroquine is effective either as a treatment or prophylactic,” Payne said in an email.", "And Dr. Benjamin Neuman, an expert in coronaviruses who chairs the Biological Sciences department at Texas A&M University-Texarkana, said via email that “Hydroxychloroquine and Azithromycin have, separately and together, done well in a few small studies that generated a lot of hope.”", "But “both clearly and reproducibly failed to work beyond a reasonable doubt in larger studies” needed to determine if they were in fact effective, he said.", "Globally, COVID-19 has infected 18,751,169 people and claimed the lives of 706,362 people, with 11,032,631 recoveries according to AFP data as of August 6, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]