["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "NC Rep. Darren Jackson, the Democratic leader, speaks at a press conference Sept. 11, 2019 after Republicans held a vote on the GOP-proposed state budget, which Democratic Gov. Roy Cooper vetoed.", "North Carolina Republicans held a controversial vote on Sept. 11.", "Months earlier, Democratic Gov. Roy Cooper had vetoed a GOP-authored state budget proposal. So, when Republican House Speaker Tim Moore noticed that many Democrats were absent that morning, he shocked political opponents by holding a vote to override Cooper’s veto.", "News of the vote spread across the internet like a bad game of telephone. Key details of the vote went missing, or were exaggerated.", "\"Republicans in North Carolina used a 9/11 memorial to trick Democrats into missing a key vote,\" the NowThis news service, which has 2.4 million Twitter followers, tweeted that day.", "The tweet was later shared by Elizabeth Warren, a Democratic U.S. senator from Massachusetts who’s running for president. She has 3.2 million followers.", "\"What happened today is beyond unacceptable. Calling a surprise vote on the budget — at the same time that many members were at 9/11 memorial services —is flat-out wrong,\" NC Rep. Chaz Beasley, a Mecklenburg County Democrat, tweeted. Beasley paraphrased reporting by WTVD.", "The Washington Post tweeted a misleading headline, too: \"North Carolina Republicans overrode a budget veto while Democrats were at a 9/11 ceremony.\"", "While the News & Observer’s story and headline — NC House overrides budget veto in surprise vote with almost half of lawmakers absent — were accurate, the Raleigh-based newspaper posted a partly erroneous caption on Instagram: \"Most Democrats were absent for 9/11 ceremonies and were told there would be no vote during the morning session.\"", "But these claims about the budget vote on Sept. 11 all get one thing wrong: Most Democrats weren’t at a 9/11 memorial service.", "PolitiFact NC, which has had a reporter covering the story since the Sept. 11 vote, found only one House Democrat who said he was at a 9/11 event. That Democrat is Rep. Garland Pierce, who said he attended a 9/11 memorial event in Raeford.", "No other Democrat has come forward — not after Speaker Moore slammed what he called \"fake news,\" and not after PolitiFact NC reached out to Rep. Darren Jackson, the House minority leader, to ask if other Democrats attended a 9/11 event.", "Schedule confusion", "Most Democrats skipped the Sept. 11 morning session because they believed it would be a non-voting session, Jackson said in a press conference last week.", "The budget was on the House calendar. But Jackson says Rep. David Lewis of Harnett County, a top Republican, told him there’d be no votes that morning.", "Lewis denies Jackson’s claim. He has acknowledged texting a WRAL reporter to tell her he thought there would be no votes during the Wednesday morning session. But Lewis claims he didn’t relay that prediction to legislators.", "Some corrections made", "Beasley, a Mecklenburg County Democrat who’s running for lieutenant governor, later corrected his claim.", "\"One correction: at least one member, Garland Pierce, was attending a 9/11 memorial service, as was the Governor. The article originally noted that some members were, but it has since been updated. I hate that this budget fight has distracted from the true focus of 9/11,\" he tweeted later, sharing the WTVD story that had been updated.", "The N&O corrected its Instagram post. The Washington Post also tweeted a clarification: \"An earlier version of this article overly generalized the reason for Democrats’ absence from the General Assembly session. The story has been updated.\"", "But some tweets and stories remain inaccurate. As of Tuesday morning, the NowThis tweet had been shared more than 700 times and got 1,600 \"likes.\"", "Our ruling", "Various media outlets said NC Democratic legislators were at a 9/11 memorial service when Republicans held a controversial budget vote. PolitiFact is aware of only one Democrat besides Gov. Cooper who claimed to be at a 9/11 event. We rate this claim False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "Tweet by NowThis News, \"Republicans in North Carolina used a 9/11 memorial to trick Democrats into missing a key vote,\" posted Sept. 11, 2019.", "Tweets by NC Rep. Chaz Beasley, a Democrat from Mecklenburg County who’s running for Lt. Governor.", "Tweets and story by The Washington Post, \"North Carolina Republicans vote to override a budget veto in half-empty Assembly during 9/11 remembrance,\" published Sept. 11, 2019.", "WTVD story, \"'Trickery, deception and lies:' Gov. Cooper blasts Republicans after surprise vote on budget veto override,\" published Sept. 11, 2019.", "Instagram post by the News & Observer on Sept. 11, 2019.", "Email correspondence with Todd Barlow, legislative counsel for House Democratic Leader Darren Jackson.", "News & Observer story, \"NC House overrides budget veto in surprise vote with almost half of lawmakers absent,\" published Sept. 11, 2019.", "Press release from NC House Speaker Tim Moore, a Cleveland County Republican, \"Bogus Report’ of N.C. Democrats Attending Sept. 11 Ceremonies During Veto Override ‘A Giant Pile of Trash’,\" published Sept. 13, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]