["President Donald Trump, right, shakes hands with Joint Chiefs Chairman Gen. Joseph Dunford, left, as Defense Secretary Jim Mattis, center, watches at Arlington National Cemetery on May 29, 2017. (AP)", "• For the second time in two years, Trump has publicly said he gave Mattis his “Mad Dog” nickname, but that’s wrong.", "• Mattis’ nickname dates back at least as far as 2004, when it was used in the headline of a Los Angeles Times article.", "• That was 12 years before Trump first used the nickname publicly, when he was considering Mattis as his defense secretary.", "President Donald Trump has often lashed out at those who criticize him, especially if they are former insiders.", "The pattern repeated itself on June 3, just hours after his first defense secretary, retired Gen. James Mattis, published criticism of Trump, writing that Trump \"is the first president in my lifetime who does not try to unite the American people—does not even pretend to try.\"", "In a tweet, Trump wrote, \"Probably the only thing Barack Obama & I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, & felt great about it. His nickname was ‘Chaos,’ which I didn’t like, & changed to ‘Mad Dog.’\"", "Probably the only thing Barack Obama & I have in common is that we both had the honor of firing Jim Mattis, the world’s most overrated General. I asked for his letter of resignation, & felt great about it. His nickname was “Chaos”, which I didn’t like, & changed to “Mad Dog”...", "It’s not the first time Trump claimed to have given Mattis the nickname \"Mad Dog.\" In a speech at the Conservative Political Action Conference in 2019, Trump said he told Mattis \"we’re going to give you a new nickname, because ‘Chaos’ is not a good nickname. So we changed it to ‘Mad Dog.’\"", "In reality, though, Mattis’ \"Mad Dog\" nickname was in common circulation long before Trump tapped him for his cabinet. It dates back at least as far as 2004, and probably well before that. (The White House and the Trump campaign did not respond to inquiries for this article.)", "On April 16, 2004, the Los Angeles Times published an article filed from Iraq headlined, \"Marines’ ‘Mad Dog Mattis’ Battles for Iraqis’ Support.\" The article said, \"Behind his back, troops call him ‘Mad Dog Mattis,’ high praise in Marine culture. ‘He can swear as much as any enlisted man,’ a corporal said.\"", "Later that year, the Los Angeles Times published another article that referred to the nickname, saying that the general was \"known as ‘Mad Dog Mattis’ to his men.\"", "The earliest instance of Trump calling Mattis \"Mad Dog\" that we could find from searching Google and Nexis was on Nov. 20, 2016, when Trump tweeted, \"General James ‘Mad Dog’ Mattis, who is being considered for Secretary of Defense, was very impressive yesterday. A true General's General!\"", "General James \"Mad Dog\" Mattis, who is being considered for Secretary of Defense, was very impressive yesterday. A true General's General!", "During the confirmation hearing for his nomination as Defense secretary in January 2017, Mattis told senators that the nickname \"was given to me by the press, and some of you may have experienced similar occasions with the press where perhaps they didn't get it quite right.\"", "News reports have suggested that Mattis has not been a big fan of his nickname. Meanwhile, the nickname \"Chaos\" that Trump referenced comes from the acronym for \"the colonel has an outstanding solution,\" something his troops said as a gentle dig behind his back in the 1990s, according to the Marine Corps Times.", "Trump said that Mattis’ \"nickname was ‘Chaos,’ which I didn’t like, & changed to ‘Mad Dog.’\"", "This is the second time that Trump has said he gave Mattis his \"Mad Dog\" nickname, but it’s flat wrong. The nickname dates back at least as far as 2004, when it was used in the headline of a Los Angeles Times article — 12 years before Trump first used the nickname publicly as he was considering Mattis as his Defense Secretary.", "We rate the statement Pants on Fire.", "Donald Trump, tweet, June 3, 2020", "Donald Trump, tweet, Nov. 20, 2016", "The Atlantic, \"James Mattis Denounces President Trump, Describes Him as a Threat to the Constitution,\" June 3, 2020", "Los Angeles Times, \"Marines’ ‘Mad Dog Mattis’ Battles for Iraqis’ Support,\" April 16, 2004", "Los Angeles Times, \"The Fight for Iraq,\" Oct. 24, 2004 (acessed via Nexis)", "Military Times, \"Trump claims he coined the nickname ‘Mad Dog’ Mattis,\" March 3, 2019", "Marine Corps Times, \"The origin of Mattis’ call sign, ‘Chaos,'\" Sept. 21, 2017", "CNN, \"Meet the 'Mad Dog' Donald Trump wants to lead the Pentagon,\" Dec. 3, 2016", "CNN, \"Mattis: 'Mad Dog' was a nickname given by the press,\" Jan. 12, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]