["On September 2, Facebook user Deepak Bagi posted a disturbing video of a man who is lying supine on the ground while a mob can be heard questioning him about child-kidnapping. The mob also thrashes him with sticks. Bagi shared the video with the claim that a child-kidnapper was caught by locals in Lodipur, beaten-up and later arrested by Dhammaur police.", "A few other individuals have posted the same video with an identical narrative.", "A Twitter user also posted the same video with a message that the video was circulating on WhatsApp.", "@amethipolice लोदीपुर धम्मौर पुलिस स्टेशन बच्चा चोरी मार पीट की घटना Whatsapp पर तेज़ी से फैलाया जा रहा है", "@khyatigarg_ips madam Please take appropriate action ASAP. if it’s recent incident at dhammaur Police station @Uppolice @policenewsup @News18UP @up100 @yvikashsamiti pic.twitter.com/wbHu4ITmHj", "— khushnoor Mirza (@KhushnoorSir) September 3, 2019", "With a keyword search on Google, we found a report published by Amar Ujala on September 1, 2019. A group of labourers, who were travelling in a pick-up truck, had a tiff with a salesman at a local liquor shop. The group tried to forcefully take the salesman with them in their pick-up truck when the salesman began crying for help and shouting, “baccha chor baccha chor (child kidnappers.)” According to the report, the incident took place in a village located in the jurisdiction of Piperpur police station of Amethi district, Uttar Pradesh.", "In a statement given to the media, Amethi SP Khyati Garg informed, “From the twelve people who were beaten up, one has died – Siyaram, a resident of Sonbhadra [district]. Two people are critical who have been referred to Lucknow for treatment. Rest of the nine people are being treated here in Amethi district.” She rubbished the child-kidnapping rumour by saying, “Whatever rumour [child-kidnapping], there was no truth in it. We completely deny the child-kidnapping rumour, there is no child-kidnapping gang operating here”.", "दिनाँक 01.09.19 को थानाक्षेत्र पीपरपुर के अंतर्गत ग्रामीणों द्वारा मजदूरों को मारने पीटने की घटना के संबंध में #amethipolice अधीक्षक @khyatigarg_ips गर्ग द्वारा में दी गई बाईट pic.twitter.com/zocnEb7VpI", "— AMETHI POLICE (@amethipolice) September 2, 2019", "Alt News contacted Piperpur police station regarding the claims circulating on social media. The police reiterated that these were only rumours and the ones attacked were not child-kidnappers. We were also informed that the man in the video is Siyaram, a physically challenged man, who was lynched by the mob. According to the police, nine people were arrested in the matter.", "In conclusion, a physically-challenged labourer was falsely accused of being a child-lifter, brutally thrashed with sticks and lynched by a mob in Uttar Pradesh. A video of the gruesome incident where the same man lost his life due to the false rumours is now being circulated on social media to further propagate the fictitious hearsay.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]