["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Donald Trump campaigned in Sacramento on June 1, 2016. Jae C. Hong / AP", "During a campaign speech in Sacramento on Wednesday, Donald Trump repeated claims about how many votes he’s received in the Republican presidential primary.", "\"We’ve broken the all-time record in the history of the Republican Party\" for votes in a primary election, the presumptive GOP nominee said. \"We’ve broken it by millions.\"", "This is not the first time Trump has repeated the \"all-time record\" claim while in California. He said it on April 29 at the state’s Republican Party Convention when he was on pace to break the record but was still short at the time. We rated it \"False … for now.\" He appears to have secured that record now.", "Trump’s victory in the Washington primary nearly a month later, on May 24, put him over the top, said Eric Ostermeier, a political science professor at the University of Minnesota and founder of the number-crunching blog Smart Politics.", "But we wondered about the second part of Trump’s latest statement: \"We’ve broken it by millions.\"", "Had Trump made a correct claim in one breath only to mangle the truth in the next? We set out on a fact check.", "Presumed GOP presidential nominee Donald Trump campaigned in Sacramento on June 1, 2016 ahead of California's primary election. Jae C. Hong / AP", "Our research", "Ostermeier told us Wednesday night that Trump got ahead of himself, once again.", "\"Trump will have broken the GOP record by millions after the remaining states vote on June 7th,\" the professor said in an email. \"But, currently sitting at 11.70 million votes, he is now only a shade more than 150,000 votes ahead of George W. Bush’s previous mark set in 2000, which tallied 11.54 million direct primary and caucus votes.\"", "Trump’s campaign had not responded to a request for comment as of Wednesday night.", "The remaining contests include California, Montana, New Jersey, New Mexico and South Dakota, all on June 7.", "Ostermeier is not the only one tracking vote tallies. RealClearPolitics.com shows Trump at 11.53 million popular votes -- slightly behind Bush’s 2000 vote total, certainly not \"millions\" ahead.", "Trump’s 2016 vote count has benefitted, Ostermeier said, from a larger national population, a more competitive race and from lasting nearly two months longer than Bush’s contest against Arizona Sen. John McCain. Ostermeier added that Trump also \"lost votes\" to this year’s crowded field of GOP candidates.", "Our ruling", "Trump said he’s broken \"by millions\" the record for GOP presidential primary votes.", "With victories on June 7th, including in California, he may well smash the record.  But he’s not there yet.", "We rate Trump’s claim False again … for now.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/5e69aa63-1805-4e12-87c5-4c8a5f49be9a", "Donald Trump, Sacramento campaign speech, June 1, 2016", "PolitiFact California, \"Donald Trump’s claim about receiving the most votes ever in Republican primaries is False … for now,\" May 2, 2016", "Interview, Eric Ostermeier, political science professor, University of Minnesota, founder of blog Smart Politics, June 1, 2016", "Smart Politics, \"Trump (Officially) Becomes All-Time GOP Primary Vote Leader,\" May 25, 2015", "RealClearPolitics.com, \"2016 Republican Popular Vote,\" accessed June 1, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]