["The image was published on Facebook here on September 17, 2020.", "The purported quote is dated \"September 2020\". It reads: “In fact, you’d be surprised at how much can be avoided if people stop insisting on their personal freedoms. Because insisting on human rights is not only selfish, it’s stupid.”", "The Facebook post's caption reads: \"Is this idiot for real?\"", "The posts circulated after Melbourne, the capital city of Victoria, continued its months-long effort to curb the novel coronavirus. Under strict measures extended on September 6, residents were ordered to stay at home except for work, exercise, medical care or to buy essentials.", "A similar claim was shared on Facebook here, here, here, here, and here.", "The claim, however, is misleading.", "A keyword search on Google of the purported quote found it was included in this satirical article published by the Australian edition of UK magazine The Spectator on September 15, 2020. The purported comment can be seen in the article's fourth paragraph.", "The article notes at the top that “what follows is satire”.", "In response to the misleading posts, a Victorian government spokesperson told AFP that the quote was fabricated.", "“This is not a comment from the Premier,\" the spokesperson said in an email on September 21, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]