["President Donald Trump speaks at a campaign rally at WesBanco Arena on Sept. 29, 2018, in Wheeling, WV. (AP/Pablo Martinez Monsivais)", "At a rally in Wheeling, W.Va, President Donald Trump touted record-low poverty rates for minorities in the United States.", "\"The poverty rates for African Americans and Hispanic Americans -- it’s been incredible, they’ve all reached their lowest levels in the history of our country,\" he said at the rally on Sept. 29, 2018.", "Is this correct? Yes, at least as far back as poverty data has been calculated.", "First, a refresher on how poverty is calculated.", "The Census Bureau \"uses a set of money income thresholds that vary by family size and composition to determine who is in poverty. If a family's total income is less than the family's threshold, then that family and every individual in it is considered in poverty.\"", "While the official poverty line is the same regardless of geography, they are updated yearly for inflation. Non-cash benefits, such as public housing, Medicaid, or food stamps, are not factored into the calculation.", "We looked at Census Bureau data for the poverty status by race and Hispanic origin from 1966 to 2017. Here’s the full run of that data:", "In 2017, African-American poverty was 21.2 percent, which was below the previous record low of 21.8 percent the previous year, 2016. (Prior to 2002, data is available only for \"black\" Americans. After that year, data is available for \"black alone\" and \"black alone or in combination.\" We used the data for \"black alone or in combination\" for the period in which it is available.)", "Meanwhile, for Hispanics, the 2017 poverty rate was 18.3 percent, which edged out the previous record low of 19.4 percent in 2016.", "African-American poverty peaked at 41.8 percent in 1966. Hispanic poverty peaked at 30.7 percent in 1994.", "While Trump didn’t directly take credit for the decline in his Wheeling remarks, it’s worth noting that the poverty rate had fallen for several years running under his predecessor, President Barack Obama. So the pattern stems from the generally improving economy under both presidents.", "Trump said, \"The poverty rates for African Americans and Hispanic Americans -- it’s been incredible, they’ve all reached their lowest levels in the history of our country.\"", "He’s right that poverty rates hit their historical lows in 2017 since the statistic was first calculated consistently in 1966. We rate the statement True.", "U.S. Census Bureau, \"Income, Poverty, and Health Insurance Coverage in the United States: 2017,\" Sep. 12, 2018", "U.S. Census Bureau, historical poverty data, accessed Oct. 23, 2018", "U.S. Census Bureau, \"How the Census Bureau Measures Poverty,\" accessed Oct. 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]