["About this rating", "On 12 July 2017, the US News House web site published a report with the headline: \"Just In: John McCain is NO LONGER A SENATOR.\"", "Five and a half years after Senator John McCain killed off what was left of The Maverick — the independent-thinking, “not afraid to tell it like it is” character he’d been LARPing since the 2000 Republican primary — in order to win a contentious primary against Tea Party challenger J.D. Hayworth, he’s facing the prospect of the end of his career once again.", "This time, it’s against a state senator who’s perfectly content with grifting votes at a Donald Trump rally. McCain’s seat has been targeted by conservative groups for years now to no avail, but this time, it’s a fair question to ask if McCain’s heart is in it anymore.", "The same article was republished four days later by the Royal Column and Conservative Army web sites. Those web sites don't repeat or provide any evidence for the claim made in the headline - that McCain had left office.", "The headline is no more than click-bait, and the article itself consists entirely of material copied and pasted from a January 2016 Salon.com opinion piece by Paul Blest.", "The article mentions McCain's 2010 Republican primary victory over former U.S. Congressman J.D. Hayworth and says \"this time,\" he's facing a state senator. This is a reference to Kelli Ward, the former Arizona State Senator who challenged John McCain in the 2016 Senate primary, and whom McCain ultimately defeated.", "It's possible the 18-month-old opinion piece was plagiarized in July 2017 amid concerns over the Arizona senator's health. McCain is 80 years old, and underwent brain surgery on 14 July 2017 to remove a blood clot from above his left eye, leaving him in recovery for more than a week and causing Senate Majority Leader Mitch McConnell to delay a vote on the Republican health care plan.", "Blest, Paul.  \"This is the End of John McCain: Why the Arizona Senator Could Finally Be Facing Retirement.\"\r\n  Salon.com.  9 January 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]