["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "According to the latest poll, public support for legalizing medical marijuana in Florida is high (pun intended).", "If the language for the ballot initiative gets past the Florida Supreme Court, voters will have their say in November 2014, when they’re asked to approve an amendment to state Constitution.", "But the initiative as a whole still has its fair share of critics, including many law enforcement officials.", "Grady Judd, president of the Florida Sheriffs Association, wrote an editorial opposing the amendment in the Sun-Sentinel, criticizing the ballot measure as essentially marijuana legalization.", "\"Authors of the amendment have included a truck-sized loophole in the definition of debilitating diseases, which changes the word disease into ‘condition.’ And what constitutes a valid ‘condition?’ \" Judd wrote. \"Any condition where the ‘use of marijuana would likely outweigh the potential health risks’ of someone who claimed to be sick. This means people who alleged minor ailments such as muscle spasms, neck pain, back pain and even menstrual cramps have qualified for government-sanctioned pot-smoking.\"", "PolitiFact Florida wanted to check out what conditions patients could get medical marijuana licenses for under the proposed Florida law.", "The amendment", "Let’s start by taking a look at the proposed medical marijuana amendment text. The ballot summary reads:", "\"Allows the medical use of marijuana for individuals with debilitating diseases as determined by a licensed Florida physician. Allows caregivers to assist patients’ medical use of marijuana. The Department of Health shall register and regulate centers that produce and distribute marijuana for medical purposes and shall issue identification cards to patients and caregivers. Applies only to Florida law. Does not authorize violations of federal law or any non-medical use, possession or production of marijuana.\"", "So when a doctor prescribes cannabis, the Department of Health will issue the patient a license. Under Florida law, patients would not be able to grow their own plants.", "Approved patients could purchase marijuana from registered, state-regulated centers. The amendment says how the centers will operate with regard to registration, record-keeping and safety would be determined by the department after passage.", "Because medical marijuana would be legally dispensed, the program is government approved. However, saying it’s \"government-sanctioned\" isn’t quite right, because government officials are not encouraging marijuana use, as the definition of the word \"sanction\" would imply.", "In the amendment text itself, which goes beyond the ballot summary, we get a list of qualifying diseases:", "And here’s the part that Judd referred to: \"or other conditions for which a physician believes that the medical use of marijuana would likely outweigh the potential health risks for a patient.\"", "That means it’s up to doctors to determine if patients could benefit from using medical marijuana.", "Judd draws a comparison between what the proposed amendment in Florida would allow and what patients in other states have experienced.", "Out of the 20 states (plus the District of Columbia) that have legalized medical marijuana, only California and Massachusetts have requirements similar to Florida’s proposal that allow for physician discretion when it comes to qualifying conditions. Most other states have a finite list of conditions, but say that the health department could add more or assign waivers. So Florida’s amendment would have a more relaxed standard than most states.", "When we reached out to Judd, his spokesman told us that it’s clear medical marijuana access would not be limited to what he referred to as \"debilitating\" illnesses.", "Other critics of medical marijuana have pointed out that any system, even in states with stricter rules, is not immune to loopholes and abuse. For example, an Arizona TV station reported that 90 percent of cardholders in the state claimed chronic pain. However, the biggest age group claiming chronic pain was 18- to 30-year-olds, even though chronic pain is more common in older adults.", "So we can understand why Judd’s editorial speculates about the possibility that some healthy individuals will try to acquire licenses.", "Experts say", "So we know Florida has a flexible definition of which conditions qualify a patient for medical marijuana, which supports Judd’s point. But should the conditions he lists really be considered \"minor ailments\"?", "University of California, San Francisco doctor Donald Abrams has studied the effects of cannabis on cancer and HIV patients. Based on his experience treating and studying chronic illnesses, he said the conditions Judd listed are often serious.", "\"Some of these things that your sheriff considers to be trivial require people to take opiates,\" Abrams said, adding that these medications (such as morphine) are less safe than marijuana.", "Several experts pointed out that muscle spasms are a common symptom of multiple sclerosis, a chronic inflammatory disease that would already be greenlighted for medical marijuana treatment if the Florida amendment passes.", "Neck pain, back pain and menstrual cramps are also frequently treated with prescription pain medication.", "Today chronic pain affects about 100 million U.S. adults, according to the American Academy of Pain Medicine.", "Oh, and as for menstrual cramps, ladies? Abrams said Queen Victoria opted for a little marijuana therapy to relieve her pain in the 19th century.", "So yes, Judd is right that someone with one of these ailments would be eligible for a medical marijuana license at a physician’s discretion. But it’s a misleading generalization to describe these conditions as \"minor.\"", "Our ruling", "Judd said that people with \"minor ailments\" could get access to marijuana if Florida’s proposed amendment passes next year. He mentioned spasms and other chronic pain as a minor condition, when sometimes those conditions are quite serious. But compared to most other states, Florida’s ballot language is flexible because it allows for physicians to determine whether a patient’s condition qualifies for a license. We rate Judd’s statement Mostly True.", "American Academy of Pain Medicine, \"Facts and figures on pain,\" accessed Nov. 25, 2013", "BBC, \"History of cannabis,\" accessed Nov. 25, 2013", "CBS 5 Arizona, \"Medical marijuana going to young, healthy,\" May 15, 2013", "Email interview with Lana Beck, Drug Free America Foundation spokeswoman, Nov. 22, 2013", "Email interview with Scott Wilder, Grady Judd spokesman, Nov. 22, 2013", "Florida House of Representatives, \"Constitutional amendment petition form,\" July 10, 2013", "Florida Sun-Sentinel, \"Grady Judd: Medical marijuana is a sham,\" Nov. 19, 2013", "Marijuana Policy Project, \"Key aspects of state and D.C. medical marijuana laws,\" Aug. 26, 2013", "Phone interview with Donald Abrams, University of California San Francisco cancer and integrative medicine specialist, Nov. 24, 2013", "Phone interview with Grady Judd, Florida Sheriffs Association president, Nov. 22, 2013", "Phone interview with Kris Hermes, Americans For Safe Access spokesman, Nov. 22, 2013", "Phone interview with Mason Tvert, Marijuana Policy Project spokesman, Nov. 25, 2013", "Phone interview with Susan MacManus, University of South Florida state government professor, Nov. 22, 2013", "Save Our Society From Drugs, \"Who is REALLY smoking marijuana under the guise of medicine?\" July 2013", "Tampa Bay Times, \"Florida medical marijuana petition won’t allow users to grow their own,\" July 17, 2013", "Tampa Bay Times, \"New Florida poll: 82 percent of voters favor legalizing medical marijuana,\" Nov. 21, 2013", "University of California San Francisco, \"UCSF study finds medical marijuana could help patients reduce pain with opiates,\" Dec. 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]