["On August 13, several social media users claimed that former president Pranab Mukherjee has passed away. The hashtag #ripPranabMukherjee was the number one trend on Thursday morning, as per the data on Trends24, a website that tracks Twitter trends.", "Rajdeep Sardesai, consulting editor at India Today Group, tweeted, “Breaking: Former president Pranab Mukherjee has passed away.. farewell Pranab da.. many many fond memories of a dyed in the wool true Indira generation politician who lived and breathed politics..” Sardesai subsequently deleted his tweet.", "Similarly, journalist Swati Chaturvedi and Congress member Vamshi Chand Reddy also claimed that Mukherjee passed away. Both these tweets were subsequently taken down.", "This slideshow requires JavaScript.", "Alt News has received several requests to fact-check the news on WhatsApp (+917600011160) and on our official Android application.", "As per media reports, former president Pranab Mukherjee tested positive for COVID-19 on August 10. Mukherjee had also tweeted about contracting the virus. His infection was discovered prior to brain surgery to remove a clot.", "On a visit to the hospital for a separate procedure, I have tested positive for COVID19 today. I request the people who came in contact with me in the last week, to please self isolate and get tested for COVID-19. #CitizenMukherjee", "— Pranab Mukherjee (@CitiznMukherjee) August 10, 2020", "The news of Pranab Mukherjee’s death was refuted by his son Abhijit Mukherjee who took to Twitter to clarify, “My Father Shri Pranab Mukherjee is still alive & haemodynamically stable! Speculations & fake news being circulated by reputed Journalists on social media clearly reflects that Media in India has become a factory of Fake News.”", "My Father Shri Pranab Mukherjee is still alive & haemodynamically stable ! Speculations & fake news being circulated by reputed Journalists on social media clearly reflects that Media in India has become a factory of Fake News .", "— Abhijit Mukherjee (@ABHIJIT_LS) August 13, 2020", "In a follow-up tweet, Abhijit wrote, “Update: My father is & has always been a fighter! He is slowly responding to medical interventions & all his vital parameters are stable. I urge upon every well-wisher to pray for my father’s speedy recovery! We need them.”", "Update : My father is & has always been a fighter ! He is slowly responding to medical interventions & all his vital parameters are stable . I urge upon every well wisher to pray for my father's speedy recovery ! We need them 🙏 https://t.co/7FdYxcUwXR", "— Abhijit Mukherjee (@ABHIJIT_LS) August 13, 2020", "Mukherjee’s daughter Sharmistha Mukherjee also refuted the news of her father’s passing.", "Rumours about my father is false. Request, esp’ly to media, NOT to call me as I need to keep my phone free for any updates from the hospital🙏", "— Sharmistha Mukherjee (@Sharmistha_GK) August 13, 2020", "Pranab Mukherjee is currently recovering after brain surgery at New Delhi’s Army Research and Referral hospital. “The condition of former President Pranab Mukherjee remains unchanged this morning. He is deeply comatose with stable vital parameters and continues to be on ventilatory support: Army Research & Referral (R&R) Hospital, Delhi,” tweeted ANI.", "The condition of former President Pranab Mukherjee remains unchanged this morning. He is deeply comatose with stable vital parameters and continues to be on ventilatory support: Army Research & Referral (R&R) Hospital, Delhi https://t.co/JPhaOOoEvL", "— ANI (@ANI) August 13, 2020", "Rajdeep Sardesai apologised for his blunder upon discovering that he had fallen for misinformation.", "My deep deep apologies for falling for fake news being circulated on Pranab Mukherjee passing away. I am deeply distraught for falling for this fake news.. it was unprofessional of me to not reconfirm it before tweeting. Apologies to all.. and prayers with the family.. 🙏🙏🙏", "— Rajdeep Sardesai (@sardesairajdeep) August 13, 2020", "Meanwhile, Swati Chaturvedi and Vamshi Chand Reddy shared Sharmistha and Abhijit Mukherjee’s rebuttal.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]