["The claim was published here on Facebook on July 20, 2020. It has been shared more than 1,000 times.", "The text post is accompanied by a picture of Facebook Chief Executive Officer Mark Zuckerberg and two other screenshots of Facebook users posting the comment “Gratula”.", "The post’s Malay-language caption translates to English as: “The best. Mark zuckerberg chief executive of facebook creates a new word GRATULA to make sure your facebook account is safe. Type GRATULA in the comments if it's red, your account is still safe. if it doesn't turn to red, please change your facebook password. Your account has been hacked! Congratulations to the red one.”", "A similar claim was published in Facebook posts here, here and here, and has been shared more than 6,300 times. Some posts date back to 2018.", "The claim is false, Facebook said.", "In an email on July 22, 2020, a Facebook spokesperson told AFP: “Some words on Facebook are animated or colour coded in News Feed. Posting a specific word to Facebook does not secure your account. Security is built into every Facebook product and we offer several security features, such as login alerts and two-factor authentication, to help you add an extra layer of protection to your account. We encourage all people to review and update their safety settings. More details are (available) here.”", "Facebook users can also report issues that occur on their accounts here.", "“Gratula” is not a new word. It means “congrats” in Hungarian.", "AFP has debunked several claims in multiple languages related to Facebook. The posts include a scam tactic in Nigeria to gain Facebook followers; purported charges for Facebook platform usage; a new policy giving Facebook full access to user content; and a hoax about Facebook hackers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]