["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Donald Trump turned a question about the Trans-Pacific Partnership into an opportunity to discuss the United States’ trade deficit with China during the Nov. 10, 2015, Fox Business debate.", "For the record, the TPP involves Asian nations, but not China.", "Still, Trump said that \"We’re losing now over $500 billion a year in terms of imbalance with China.\"", "Last month at a campaign rally in Sioux Falls, Iowa, Trump said \"we have almost a $400 billion trade imbalance with China.\"", "A jump of more than $100 billion in less than a month? Really?", "No.", "We reached out to Trump’s campaign for more information on the figure, but did not hear back. However, according to data from the Census Bureau, the U.S. trade deficit with China clocked in at $343 billion in 2014. That makes Trump off by more than 31 percent.", "For comparison, a $343 billion trade gap is roughly the entire Gross Domestic Product of Denmark.", "So far, the trade deficit for 2015 has been calculated through September 2015, totalling almost $274 billion. Over the last 12 months of available data, the trade deficit has totaled $364 billion.", "That’s a big deficit but not more than $500 billion as Trump said.", "Since 1986, the yearly U.S. trade deficit with China has grown from year to year except in 2001 and 2009. See our chart for more information.", "Our ruling", "Trump said that \"we’re losing now over $500 billion a year in terms of imbalance with China.\"", "Last month, Trump said almost $400 billion during a speech in Iowa. He should have stuck to that figure.", "The 2014 trade deficit totaled $343 billion, and it’s expected to be larger in 2015 but not more than $500 billion.", "Trump’s claim rates Mostly False.", "Google Sheets, \"Trade Deficit Since 1985,\" Nov. 8, 2015", "C-SPAN, \"Donald Trump Campaign Rally in Sioux City, Iowa,\" Oct. 27, 2015", "U.S. Census Bureau, \"Trade in Goods with China,\" accessed Nov. 8, 2015", "The World Bank, \"GDP (current US$),\" accessed Nov. 9, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]