["A video of a temple exquisitely decorated is doing the rounds on social media. It is being claimed that the video shows the decoration of the pandal for Ram Mandir Bhumi Pujan in Ayodhya. From the account @RatanKAgrawal, the clip garnered over 100 retweets. “राम मंदिर, अयोध्या के भूमिपूजन के लिए पंडाल की सजावट,” reads the Hindi caption.", "Decoration of Pandal for bhumi pujan of Ram Mandir, Ayodhya. 👇", "राम मंदिर, अयोध्या के भूमिपूजन के लिए पंडाल की सजावट। 👇 pic.twitter.com/jLqJwbWhIu", "— रतन कुमार अग्रवाल (@RatanKAgrawal) August 1, 2020", "It was also shared on Facebook page Kolhapur shree mahalaxmi today darshan with a caption in Marathi.", "🌸👆भूमी पूजन मंडप , अयोध्या …डोळ्याचे पारणे फिटवणारी सजावट ,खरच धन्य आहेत भारतीय …कारण मोदी है तो ही मुमकीन है । 🌸👆🌸", "Posted by Kolhapur shree mahalaxmi today darshan on Saturday, 1 August 2020", "It is viral on both Facebook and Twitter. Alt News has also received several fact-check requests on its official mobile application.", "A reverse image search on Yandex led us to a YouTube video uploaded on January 5, 2020, where similar decoration is visible. As per the video description, this is the Sri Ranganatha Swamy Temple in Hyderabad, a temple dedicated to Hindu deity Vishnu.", "A picture of an idol of Vishnu inside the temple on Google Maps matches with the idol visible in the YouTube video.", "The same idol is also visible in the viral video at 1:24 minutes.", "As the date of Bhumi Pujan at Ram Mandir in Ayodhya draws closer, misinformation surrounding the commencement of the temple construction is on a rise. In this case, an old video from Hyderabad was shared as preparations for the Bhumi Pujan. Recently, we had debunked another video falsely shared as Indians in Spain taking out a dhol procession celebrating the upcoming August 5 event where Ram Mandir’s foundation stone will be laid.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]