["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Old City has had a party reputation the last few years. Bars dominate 2nd and 3rd streets between Market and Chestnut. Philly Mag memorably christened it the land of 1,000 Snookis in a 2010 article.", "But according to the inaugural \"State of Old City\" report released earlier this month by the neighborhood organization Old City District, the Snookis have moved out and the Sheldon Coopers have moved in. Old City is now inhabited by a booming young, college-educated population and a cluster of tech and marketing businesses.", "In an interview about the findings with the Philadelphia Business Journal, Old City District executive director Job Itzkowitz expounded on the good news by comparing current Old City to the old party-filled days.", "\"We used to have more than a dozen clubs and that’s what we were known for,\" he said, \"and now we’re down to two.\"", "It sure seems like Old City has a nightlife scene that can get a little… douchey? … on Friday and Saturday nights. And if you’re out there, it sure seems like there’s more than two clubs around. We decided to see whether Old City has changed as much as Itzkowitz claims.", "Let’s start by talking about the definition of a club. Itzkowitz said he was referring to what he termed nuisance establishments, crazy bars with sketchy promoters who brought in disorderly crowds that spilled onto the sidewalks and streets.", "\"Go back and look at the bars in the 2010 (Philly Mag) article and see how many of them still exist,\" he said.", "That article mentioned 32 Degrees, Heat, Grey Social Lounge, Cebu, Dreemz, Moda, Blurr, Triada, Bleu Martini and Red Sky as troublesome bars. Only Bleu Martini remains.", "Barry Gutin, owner of Old City’s Cuba Libre, used to own 32 Degrees. He said club ownership \"can be done well or done poorly.\" His definition of a club is a place that is open late at night and have no food or only a small menu to satisfy PLCB requirements. Cuba Libre, for instance, would not fit the bill. Neither would other popular Old City establishments like National Mechanics and Plough and the Stars. The only places that mostly meet that definition are Recess Lounge, Brasil’s Nightclub, B Side Hookah Lounge and Infusion. Bleu Martini actually has a full menu of entrees like filet mignon, sea bass and surf ‘n’ turf.", "\"If you’re asking are there fewer clubs now and fewer problems now, the answer is yes,\" Gutin said. \"There were a lot of places trying to make money and lowering their standards for clientele to try and survive.\"", "In a regulatory sense, the PLCB separates restaurants from clubs by type of license. Almost all of Old City’s numerous bars have restaurant licenses. The lone place with an active club license in the neighborhood is Recess Lounge.", "HughE Dillon, Philly celebrity watcher, said Old City used to be \"an out of control, rumble in the street kinda late night area,\" but has lately been pleased with what he regards as a safer late night scene.", "\"Now,\" he said, \"people just seem to rush to get in line at Big Ass Slices 218 Market Street, when the bars let out.\"", "Our Ruling", "Old City District executive director Job Itkowitz claimed the number of Old City clubs had declined from more than a dozen to two. We found at least 10 clubby establishments that have closed in the last several years, and going by different interpretations of \"club\" Old City has somewhere between one and four clubs.", "We rule the statement Mostly True.", "Email interview, HughE Dillon, Philly celebrity watcher.", "News article, \"Old City is young, hip and smart: District’s inaugural report,\" Philadelphia Business Journal, May 12, 2016.", "News article, \"What the hell happened to Old City?\" Philadelphia, August 27, 2010.", "Phone interview, Job Itzkowitz, Old City District executive director.", "Phone interview, Barry Gutin, Cuba Libre owner.", "Report, \"State of Old City,\" Old City District, May 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]