["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A 46-year-old wealthy investment manager in Kentucky is mounting a Republican primary challenge to the state’s senior senator, Minority Leader Mitch McConnell. Matt Bevin comes from the tea party wing of the GOP. Early polls suggest Bevin has a ways to go before he could unseat McConnell, but Kentucky voters sent libertarian favorite Sen. Rand Paul to Washington, and Bevin has the money to get his message to party activists.", "The two candidates have begun trading attack ads. The latest from Bevin ties McConnell to the financial rescue measures passed by Congress as the economy headed into a tailspin in 2008. Here’s the key text from Bevin’s ad:", "Announcer: After pushing the Wall Street bailout through the U.S. Senate, Mitch McConnell bragged (video clip of McConnell) \"This has been the Senate at its finest.\"", "Announcer: And what are fact-checkers saying about Mudslinging Mitch’s latest attacks on conservative Matt Bevin?", "Misleading (image from Washington Post)", "Doesn’t add up (image from local Fox news)", "Like Obama campaign attacks (image from Washington Post)", "After 30 years in Washington, voting for one bailout after another, slinging mud is all Sen. McConnell has left.", "The ad plays to antigovernment sentiment among people who see Washington’s multibillion dollar intervention in 2008 as a gross overreach of public power and a favor to the financial elite. We will examine this specific claim the ad makes to link McConnell to specific actions.", "Did McConnell push the bailout, formally known as the Troubled Asset Relief Program or TARP, through the Senate?", "To answer that, we have to go back to September and October 2008. As the housing market bubble burst, the web of investments that bound just about every financial player to each other threatened a global freeze on lending. On Sept. 29, 2008, three days before the Senate vote on TARP, two leading voices from the conservative think tank, the Heritage Foundation, described the situation. In \"The bailout package: Vital and acceptable\", Edwin Meese, President Ronald Reagan’s attorney general, and Stuart Butler wrote:", "\"Some key parts of the credit market are on the verge of gridlock, resulting not just in the collapse of major financial institutions but also in credit disruption that is severely weakening the long-term prospects of non-financial companies. And while this is currently most visible in Wall Street and in the financial sector, it is only a matter of time before the fallout hits Main Street, with potentially devastating economic effects for typical American households.\"", "President George W. Bush was pressing for passage of a $700 billion bailout. So were GOP presidential nominee John McCain and the Democratic nominee, Barack Obama.", "In late September, an effort to get a bill through the House of Representatives had just failed. The action shifted to the Senate where McConnell played a key role in negotiations. In a floor speech right before the Senate voted, McConnell took credit for the package and urged his fellow Republicans to approve the emergency intervention.", "\"After extensive consultation between the majority leader and myself and the leaders in both parties here in the Senate, we believe we have crafted a way to go forward and to get us back on track,\" McConnell said. \"This is the only way to get the right kind of solution for the American people.\"", "The Senate passed the TARP on a vote of 74 to 25, with 40 Democrats, one independent and 33 Republicans including McConnell voting in favor. Nine Democrats and 15 Republicans voted against it.", "On the night the bill passed, McConnell joined Republicans and Democrats in a quick press conference to mark the moment.", "\"This has been the Senate at its finest,\" McConnell said. \"In the years that I’ve been here, I can’t recall a single time, where in this close proximity to an election, both sides have risen above the temptation to engage in partisan game playing if you will, to address an issue of great magnitude.\"", "We should note that part of the compromise that produced TARP included a provision to release the money in two installments. When a vote came for the second infusion of cash, in January 2009, McConnell joined 32 Republicans and nine Democrats in a failed effort to oppose it.", "McConnell said he voted for the first installment on the condition that it be used to prevent a systemic economic collapse but didn't like that part of it was used to help the auto industry.", "\"The current (Bush) administration used these funds for the auto industry, a move that I opposed. Now Congressional Democrats are urging more of the same,\" McConnell said in a statement. \"The American people still don't have assurances that this money will not be wasted or misused to play favorites.\"", "According to a recent Treasury report, of the $420.61 billion dollars spent under TARP including the government’s stake in the insurer American International Group, $420.49 billion has been returned to the government.", "Our ruling", "Bevin said that McConnell pushed the Wall Street bailout through the Senate. The record shows that McConnell actively supported emergency government intervention in the financial markets and spoke openly of playing a key role in crafting compromise legislation. However, to say that he pushed the bill through the Senate downplays that other political leaders, including the Republican president and the party’s presidential nominee, also pressed to get the measure passed. The ad also ignores that in January 2009, there was a second bailout funding vote and on that one, McConnell voted no.", "Still, McConnell worked hard to get the initial bailout through the Senate. We rate the claim Mostly True.", "Bevin for Senate, Finest, Aug. 6, 2013", "Email interview with Nachama Soloveichik, spokesperson, Matt Bevin for Senate, Aug. 8, 2013", "Email interview with Allison Moore, spokesperson, McConnell Senate Committee ‘14, Aug. 8, 2013", "New York Times, Bush to hold meeting on bailout, Sept. 25, 2008", "New York Times, Senate to vote today on bailout plan, Oct. 1, 2008", "The Hill, Senate passes bailout, Oct. 2, 2008", "Mitch McConnell, Senate floor speech: Economic rescue, Oct 1, 2008", "Fox News, Interview with Mitch McConnell, Oct. 1, 2008", "Heritage Foundation, The bailout package:Vital and acceptable, Sept. 29, 2008", "Mitch McConnell, Press release: TARP: Questions remain on use of additional funds, Jan. 13, 2009", "Heritage Foundation, Time to end the TARP bailout, Dec. 15, 2008", "National Journal, Mitch McConnell’s team prepares to defend his role in the coming fiscal showdown, Aug. 4, 2013", "Politico, McConnell: TARP worked, Oct. 2, 2009", "U.S. Treasury Department, Daily TARP update, Aug. 12, 2013", "Govtrack.us, Vote results - S.J. Res. 5, Jan. 15, 2009", "U.S. Senate, HR 1424 vote results, Oct. 1, 2013", "Govtrack.us, Vote results - TARP, HR 1424, Oct. 1, 2008", "U.S. Senate, HR 3221 vote results, July 26, 2008", "Government Printing Office, HR 3221, July 26, 2008", "CNN, Feds unveil rescue plan for Fannie and Freddie, Sept. 7, 2008", "National Journal, Who is Mitch McConnell’s mystery tea party rival?, Feb. 20, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]