["Conservative commentator Michele Bachmann discusses Donald Trump's appeal with Don Lemon on CNN on Sept. 10, 2015. (Screengrab)", "All that talk about how unpopular Donald Trump is with Hispanics? In Michele Bachmann’s view, the opposite is true: Trump is polling at epic levels among Hispanic voters.", "Bachmann, whose life after the U.S. House has included stints as a conservative cable news pundit, said on CNN Tonight with Don Lemon on Sept. 10 that Trump is remarkably popular with minorities compared to the rest of the Republican field, even as he floats mass deportations, ending birthright citizenship and building a border wall as his first orders of business.", "\"Donald Trump's numbers show that he's the highest with African-Americans that any Republican has ever been, and the highest with Hispanics that any Republican has ever been,\" Bachmann said.", "Like, ever ever?", "Given that Trump himself has said he’s polling No. 1 with Hispanics, PunditFact wanted to know if Bachmann is correct.", "What the polls say", "A spokesperson for Bachmann did not return our messages asking how she knows Trump’s numbers are \"the highest with Hispanics that any Republican has ever been.\"", "A survey of summer headlines indicates she is wrong", "Wall Street Journal: \"Hispanics hold dim view of Donald Trump, poll finds\"", "CNN: \"Poll: 82 percent of Hispanics view Donald Trump unfavorably\"", "Politico: \"Poll: Trump’s popularity increasing, but not with Hispanics\"", "Gallup: \"Hispanics Frown on Trump, but Not Rest of GOP Field.\"", "Without a doubt, more Hispanics have made up their minds about Trump than the other candidates. But not in the way Bachmann said.", "As the Gallup poll shows below, the broader Hispanic view of Trump is strongly negative.", "Trump’s net favorable rating, according to Gallup, ranks last of all candidates at -51 percent (65 percent unfavorable, 14 percent favorable).", "The next-lowest candidates are from Texas, Sen. Ted Cruz and former Gov. Rick Perry (who’s out of the race), tied at net -7 percent.", "Florida natives Jeb Bush and Sen. Marco Rubio top the tracking poll, with Gallup noting Bush’s favorability jumped as Trump’s fell this summer, undermining the theory that Trump is hurting the other candidates in the race with Hispanics.", "Gallup’s survey is based on interviews with about 650 Hispanics from July 8 to Aug. 23 with a margin of error of 5 percentage points.", "It’s no outlier. A Univision Noticias poll also shows Trump lacking the most support among Hispanics. Polling by The Economist/YouGov drives home the point.", "In a survey of more than 230 Hispanic adults, 62 percent said they had a very unfavorable view of Trump, compared to 43 percent of 2,000 voters of all backgrounds who felt the same way.", "Again, all of the other candidates were viewed more favorably.", "The Economist/YouGov poll was based on 2,000 interviews conducted Aug. 28-Sept. 1 via an opt-in Internet panel, with a margin of error of 2.8 percentage points.", "Problems with data", "Hispanics are not a monolithic voting bloc but a growing share of the population with roots in Spanish-speaking countries. However, most Hispanic registered voters lean toward the Democratic Party, with the Republican share accounting for about 25 percent, said Mark Hugo Lopez, the director of Hispanic polling at the Pew Research Center.", "The more relevant figure to this discussion is how Republican Hispanic registered voters feel about Trump compared to other candidates, Lopez said, since it is their vote that will influence the GOP state primaries.", "The problem with that is Republican Hispanic voters have not been queried as much as the broader electorate this early in the election cycle. Doing this well requires hiring Spanish speakers for interviews, randomly surveying households and asking respondents if they consider themselves Hispanic or Latino, and then making sure at least half of the respondents are reached by cell phone, Lopez said, reflecting Hispanic household trends.", "Some pollsters try to get at this through micro-sampling their larger pool of poll respondents, but the results are often meaningless because the sample is so small.", "The Economist/YouGov poll, for example, asked voters who identify as Republican to choose their preferred GOP nominee.", "Broken down by race/ethnicity, 28 percent of GOP-leaning Hispanic voters chose Trump, followed by \"no preference\" at 18 percent, and Bush at 15 percent.", "Here’s the problem with running away with those results and proclaiming Trump the favorite: Just 34 Hispanic adults answered the question. Put another way, that means 10 people chose Trump, six said they had no preference, and five chose Bush.", "No self-respecting statistician would say this tiny sample reflects the sentiment of all registered Hispanic Republicans.", "Also, the higher support for Trump makes sense, since he also posts higher name recognition than the other candidates. Only 9 percent of the larger pool of Hispanic voters said they did not know how they felt about Trump, compared to 22 percent for Bush and 24 percent for Rubio. The numbers were much higher for the rest of the field.", "A state poll?", "A Google search shows where Bachmann might be going with her erroneous claim. Some blogs crowed about a poll by Gravis Marketing for the conservative One America News Network that found \"Trump leads Nevada poll with overwhelming Hispanic support.\"", "The Hispanic population is small in Iowa, New Hampshire and South Carolina, the first three states to hold presidential caucuses or primaries next year, but that’s not true for Nevada, which goes fourth.", "About 31 percent of Hispanic respondents said they would vote for Trump in a Republican primary, followed by Wisconsin Gov. Scott Walker at 11.4 percent, according to OAN.", "While this might sound good for Trump (and Bachmann), they shouldn’t read too much into the poll’s declarations. As CBS News pointed out when Trump made reference to this poll, the OAN poll is based on robocalling, which means a computer talked with respondents.", "This method is not as reliable, and it’s more problematic for reaching Hispanic residents — half of whom rely only on cell phones (higher than for African-Americans and whites). Robocalls to cell phone numbers are not permitted by federal regulators.", "It’s also not clear if the poll included a Spanish-speaking component, Lopez said.", "One last red flag: The poll’s details do not show how many Hispanics were asked the question from the sample of 620 registered Republicans. So we don’t know how many Hispanic Republican voters chose Trump. (Remember how much a handful of responses from Hispanic adults made Hispanic support for Trump appear in the YouGov poll?)", "That said, Lopez said the Hispanic Republican registered voter results seem to align with the view of Republicans overall in that poll, \"and I doubt the 31.4 percent for Hispanics is statistically different from the 27.7 percent of all Republican registered voters\" in Nevada who said they would vote for Trump.", "Our ruling", "Bachmann said Trump’s polling numbers show that he’s \"the highest with Hispanics that any Republican has ever been.\"", "We didn’t even have to crack open the history books of all Hispanic support for all Republicans ever to disprove her claim. Trump sits — and in many cases, firmly — at the bottom of favorability polls among Hispanics compared to the other GOP candidates.", "We rate the claim False.", "Wall Street Journal, \"Hispanics hold dim view of Donald Trump, poll finds,\" Aug. 3, 2016", "YouTube, \"David Brock, Michele Bachmann on Trump and Clinton, with Don Lemon 9/10,\" Sept. 11, 2015", "Gallup, \"Hispanics Frown on Trump, but Not Rest of GOP Field,\" Aug. 24, 2015", "Washington Post, \"Trump’s support spikes among Republicans,\" July 15, 2015", "Interview with Mark Hugo Lopez, Pew Research Center director of Hispanic polling, Sept. 11, 14, 2015", "Interview with Karlyn Bowman, American Enterprise Institute polling expert, Sept. 11, 2015", "Interview with William Jordan, YouGov spokesman, Sept. 11, 2015", "Univision, \"Destino 2016: A survey of the Latino Vote; A bipartisan poll of the Hispanic electorate,\"", "The Economist/YouGov poll, Aug. 28-Sept. 1, 2015", "USA Today, \"Trump on track to win GOP Hispanic vote: Column,\" July 27, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]