["The Facebook video, archived here, shows a person sliding a blackish substance onto a plate. The accompanying post claims it is \"the cancer of a woman that was extracted through surgery\".", "The person holds what appears to be a garlic clove close to the dish, seemingly causing the black blob to move away. The test is repeated with a ring, which seems to attract the substance.", "\"Placing a garlic clove next to the cancer, the cancer moves away from it, trying to keep its distance. Upon placing gold next to the cancer, it is drawn towards the gold and keeps coming closer to it,\" the post reads.", "\"Those who have cancer please be advised to avoid wearing gold so as to avoid the cancer's deteriorating and worsened effects on the body. On the other hand, please keep on consuming garlic. Please keep on forwarding this. It may save a life.\"", "The video has been shared thousands of times here and here since 2017, with multiple posts across YouTube and Facebook.", "Clinical health specialist Michael Herbst of the Cancer Association of South Africa told AFP he believed the video clip was “unlikely to be truthful”.", "“It is altogether impossible for a piece of ‘dead’ human cancer tissue (removed surgically) to ‘come alive’ and react in the manner displayed in the video clip,” Herbst said in an email.", "Scientific testing has revealed that garlic cloves contain a variety of phytochemicals, many of which show cancer-fighting properties in the lab.", "The American Institute for Cancer Research says eating the root regularly lowers the risk of colorectal cancers.", "“The Allium genus(family) includes garlic, onions, shallots, leeks, and chives... Epidemiological studies indicate some associations of Allium vegetable consumption with decreased risk of cancer, particularly cancers of the gastrointestinal tract,” Herbst said.", "Recent studies suggest high garlic and onion consumption could also protect against other cancers such as prostate, breast and lung cancer - read this medical journal for more.", "However, \"it is absolutely irrational to think that there is a silver bullet to treat all cancers especially because of the complexity of the disease,” said Imran Keeka, a South African doctor based in Kwa-Zulu Natal province.", "Keeka has been a specialist in Chinese medicine for almost two decades - with a special interest in integrative oncology. He called the misleading video “nothing more than wizardry”.", "Contrary to the misleading claim, researchers have been looking into the benefits of using gold nanoparticles to potentially diagnose and treat colorectal cancers.", "“There is no documented rationale to suggest that people should not wear gold, in fact, there are studies and ongoing research that show that using gold nanoparticles in the treatment of cancer may be very effective,” Keeka told AFP.", "Similarly, Herbst said there was \"heightened interest in the application of gold nanoparticles (AuNPs) to the management of cancer, encompassing diagnosis, monitoring, and treatment\".", "\"AuNPs could be used as drug delivery agents that target cancer cells or in gene therapy,\" he added.", "Mudzuli Maphupha, a PhD chemistry candidate at the University of Witwatersrand, told AFP that the substance on the plate could either be magnetic putty or ferrofluid probably being moved about by an item under the plate.", "“Basically it could be magnetic putty or ferrofluid, and that’s because it’s moving, it’s attracting and repelling from something but definitely not the garlic or the gold,” Maphupha said via WhatsApp.", "Keeka, meanwhile, stressed it was important for people to seek professional opinions in healthcare matters.", "“Even when using complementary and alternative medicines. There is the myth that because it is natural, it is safe. In the wrong hands, more harm than good is the outcome.”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]