["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The photo and accompanying text are both fabricated.", "The original picture is from a 2008 event in Florida, and the gun was digitally added. It’s been circulating online since at least 2012.", "Biden wasn’t even in Wisconsin in 2019.", "A manipulated photo that dates back more than a decade is finding new life amid the coronavirus quarantine.", "An image of Democratic presidential frontrunner Joe Biden shared more than 2,000 times purports to show Joe Biden sticking a gun in an elderly woman’s mouth. The accompanying text claims it happened at a 2019 rally in Wisconsin.", "Here’s the post:", "JOE BIDEN WANTS THIS PICTURE OFF THE INTERNET BUT WE NEED TO KEEP SHARING IT", "MAGA", "KAGA", "Story: In 2019, Joe Biden was confronted by 63 year old Melinda Bares at a rally in Wisconsin. Bares claimed Biden was trying to take guns from law abiding citizens, to which Biden claimed \"guns are just as dangerous as poison and knives, and I will prove it!\" He then held a gun to Bares, and said she is even more scared than normal.", "It was posted March 23, 2020, but began circulating heavily in early April. The comments showed many Facebook users taking it seriously, calling Biden \"evil\" and asserting this as further reason to support Bernie Sanders.", "But the image is fabricated.", "Here’s the background.", "The \"story\" accompanying the photo is pure fiction. Biden didn’t even attend any public events in Wisconsin in 2019, according to records maintained by the Milwaukee Journal Sentinel.", "The original picture is from a Sept. 2, 2008, rally in Deerfield Beach, Fla. It was taken by an Associated Press photographer and published in an online Washington Post story that same day.", "The woman is 87, not 63, and her name is Annalou Trebitz, according to the original caption. There are other clues to the age of the photo, like the \"Seniors for Obama\" sticker on Trebitz’s jacket.", "The picture — with the gun digitally inserted into the scene — has been circulating online since at least May 2012, according to Snopes, which fact-checked the picture (rating it False) in January 2017.", "A picture and caption making the rounds on Facebook claims to show Joe Biden sticking a gun in a woman’s mouth at a 2019 rally in Wisconsin.", "It’s actually an altered photo from a 2008 event in Florida, with the gun digitally added. It’s been circulating online for at least eight years.", "And Biden wasn’t even here in 2019.", "This is a ridiculous fabrication and a malicious lie. Since we don't have any stronger rating to use, we rate this post Pants on Fire.", "Facebook, viral post, March 23, 2020", "The Washington Post, Joe Biden, Yiddishe Veep, Sept. 2, 2008", "Snopes, Does a Photograph Show Joe Biden Putting a Gun in a Woman’s Mouth?, Jan. 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]