["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wendy Davis, asked if she’s unethically profited while in public office, suggested her opponent has committed infractions including one that resulted from hundreds of thousands of dollars in campaign donations.", "Responding to a reporter at the Sept. 30, 2014, gubernatorial debate in Dallas, the Democratic gubernatorial nominee and Fort Worth state senator accused Texas Attorney General Greg Abbott, her Republican foe, of selling out Texans to serve the \"interests of people who make donations to his campaign.\"", "As an example, Davis pointed out \"payday lenders who have given\" Abbott’s campaign \"$300,000 and then received a ruling from him that they can operate in a loophole in the law that allows them to charge unlimited rates and fees.\"", "Davis was revisiting a topic she’s consistently explored: that a 2006 letter from Abbott’s state office allowed payday lenders to skirt state lending laws.", "After Davis’ proclaimed link between Abbott’s campaign donations and official action was described by the El Paso Times in January 2014, we found Half True her statement that Texas payday lenders were charging 1,000 percent interest. In rare instances, lenders charged 1,000 percent annual interest, but payday loan rates then averaged 465 percent.", "For this fact check, we gauged whether Abbott piled up hundreds of thousands of dollars in campaign donations and then issued a ruling favorable to payday lenders, which offer low-dollar, high-interest short-term loans targeting low-income people who live paycheck to paycheck. The loans are generally for $100 and $500 and are most often issued for two weeks. They’re considered risky because low-income borrowers are relatively unlikely to be able to pay them back.", "Abbott campaign contributions", "To our inquiry about the $300,000 described as given to Abbott, Davis campaign spokesman Zac Petkanas emailed us records of Abbott campaign contributions as filed in campaign reports at the Texas Ethics Commission covering Sept. 16, 2002 nearly through July 2014.", "Our own sampling of state records showed Abbott’s campaign fielded:", "--$80,000 from Trevor Ahlberg, CEO of Irving-based payday lender Cash Store, in eight  installments from Aug. 16, 2006 to June 16, 2014;", "--$57,500 from Roderick Aycox, founder of Georgia-based payday lender LoanMax, in five installments from Nov. 12, 2009 to June 9, 2014;", "--$30,500 from Cash America International Inc. PAC in 14 contributions from Sept. 16, 2002 to July 29, 2014;", "--$30,000 from Ace Cash Express Inc. PAC, in eight donations from Oct. 5, 2005 to July 29, 2014.", "Then again, according to Petkanas and state records, less than 5 percent of the tallied payday-lender donations, or $13,000, had come in by Jan. 12, 2006, which was the date Abbott’s office issued the ruling criticized by Davis.", "By phone, Petkanas said Davis did not mean to say in the debate that all the $300,000 was given before Abbott’s office ruled on payday lending.", "Texas Payday Lenders: Regulation and Evasion", "There's a lot of background to state actions involving payday lenders.", "In 1999, then-Texas Attorney General John Cornyn, Abbott’s predecessor, filed lawsuits against selected payday lenders, saying the companies were dodging state laws regulating interest rates. Separately, a \"usury\" provision in the Texas Constitution caps interest rates on short-term loans from unlicensed lenders at 10 percent.", "Cornyn, saying lenders were getting away with interest rates of up to 1,000 percent, said: \"This kind of abusive payday lending is illegal in Texas, and those companies who continue this practice will face serious consequences.\"", "An October 2000 report by the Sunset Advisory Commission found that \"in recent years, different types of lending businesses have attempted to evade regulation\" including payday lenders. It recommended the Legislature \"authorize\" the \"Office of Consumer Credit Commissioner to regulate payday loans\" in order to \"help control unlawful interest rates.\"", "In 2001, state lawmakers agreed to changes in law bringing payday lending under the office’s regulation and directing the Texas Finance Commission to adopt rules guiding the industry. According to a May 2001 bill analysis by the House Research Organization, the requested rules \"would prohibit a lender from using a device, pretense, or subterfuge to avoid regulation of the lender’s transactions, including by recharacterizing fees on a loan as a purchase of a good or service.\"", "Resulting additions to Texas law include a chart specifying acceptable fees for payday loans of various dollar amounts and durations.", "But in subsequent years, according to Austin American-Statesman news reports, Texas payday lenders found a way around the law by partnering with out-of-state banks, which financed payday loans out of the reach of Texas laws.", "State and national legislators then raised concerns about payday lenders dodging the restrictions; the Federal Deposit and Insurance Corporation cracked down in 2005, limiting the number of payday loans a bank could issue and constricting the profitability of partnerships between payday lenders and banks.", "That’s when Texas payday lenders, under pressure from regulation, started transitioning to a new business model, called a credit service organization (CSO) in summer 2005, the Statesman reported In January 2006. Its news story said Texas payday lenders ditched partnerships with FDIC-regulated banks and began working with \"third-party unregistered lenders.\" It also said Texas \"payday lenders got a boost recently from Texas Attorney General Greg Abbott\" in the form of a letter affirming the legality of the CSO model.", "Between 2004 and 2014, payday lender storefronts increased more than tenfold in Texas, the El Paso Times reported Feb. 4, 2014.", "Abbott’s interpretation of state law", "Next, we looked at the Abbott \"ruling\" declared by Davis. It turned out to be an aide's legal analysis.", "In 2005, the attorney general’s office, headed by Abbott, fielded two requests to review the legality of payday-lender CSOs, agency spokesman Jerry Strickland said by email, one an August 2005 verbal request from the consumer credit commissioner, who inquired after a court case raised questions about whether the state had any sway over CSOs. In Lovick v. Ritemoney Ltd., the plaintiff accused payday lender Ritemoney Ltd. of disguising illegal interest fees as service charges. A state district judge, Rhesa Hawkins Barksdale, wrote that \"Texas law does not construe such credit service fees as disguised interest,\" and the complaint was dismissed.", "Strickland said the other request for Abbott’s judgment came in writing Sept. 8, 2005 from then-state Sen. Eliot Shapleigh, D-El Paso. Shapleigh wrote that as a CSO, \"a payday lending company dodges both federal guidelines restricting payday loans and the interest-rate limits established by the Texas Finance Commission. As the state’s leading enforcement agency, it is imperative that your office investigate this new business model and take necessary enforcement actions against businesses purposefully and illegally skirting Texas laws.\"", "On Jan. 12, 2006, Barry McBee, the state’s first assistant attorney general, signed a letter responding to the commissioner, Leslie Pettijohn, saying there was \"nothing patently illegal\" about payday lender CSOs under state law and there was no statutory limit to the fees they could charge.", "McBee’s letter pointed out that, in keeping with state law, payday lender CSOs were charging the maximum-permitted 10 percent interest on loans plus service fees to arrange the loan between a borrower and third-party lender. He wrote that, according to Chapter 393 of the Texas Finance Code, there is not \"any limit on the amount of fees\" a CSO can charge in such transactions.", "\"Any discussion of whether the use of this model is the best public policy choice for the State of Texas,\" McBee wrote, \"is one that must be addressed by the Legislature and has not been explored by this office.\"", "Legislative Review", "In the 2013 legislative session, lawmakers debated reforming payday lending practices, but attempts stalled.", "Expert Analysis", "By phone, Don Baylor, a former senior policy analyst for the Austin-based Center for Public Policy Priorities, which advocates for programs serving low-income Texans, said that after the Lovick v. Ritemoney ruling, payday lenders remained uncertain if they could legally operate as CSOs. But, Baylor said, \"it’s fair to say the OAG letter provided enough regulatory certainty for the entire (payday lending) industry to jump on board with the CSO model.\"", "Baylor also said that after the Lovick ruling, \"the attorney general doesn’t have the authority to prohibit loans from being made under the CSO model.\"", "He credited the explosion of payday lender CSOs to ambiguous wording in the 1987 Credit Services Organization Act, which was written to help Texans improve credit scores and not with payday lenders in mind, he said. \"Payday lenders found the CSO costume and dressed up in the costume,\" said Baylor. \"It’s a very creative way they came up with to get around the constitutional usury limits.\"", "Our Ruling", "Davis said payday lenders gave Abbott $300,000 in campaign donations \"and then received a ruling from him that they can operate in a loophole in the law that allows them to charge unlimited rates and fees.\"", "This statement references a 2006 legal analysis -- not a ruling -- from a top state aide to Abbott that tracked with a court ruling permitting payday lenders to charge unlimited fees in spite of state caps on related interest. Clarification is needed in that only 5 percent of the described $300,000 in donations occurred before the analysis was issued. Regardless, Abbott's office reaffirmed a way for politically supportive payday lenders to squeeze Texas borrowers.", "We rate this statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Video, \"Texas Gubernatorial Debate\", C-SPAN, Sept. 30, 2014", "News story, \"Sen. Wendy Davis: Attorney General Greg Abbott at fault for payday-lending uptick,\" Marty Schladen, El Paso Times, Jan. 7, 2014", "Emails, Zac Petkanas, communications director, Wendy Davis campaign, Oct. 7, 2014", "Telephone interview, Zac Petkanas, Austin, Oct. 7, 2014", "Document, payday lender contributions to Texans for Greg Abbott, Wendy Davis for Texas, Sept. 16, 2002 - July 29, 2014 (received by email from Zac Petkanas, Oct. 7, 2014)", "News story, \"Cornyn files suit in Austin and Mcallen against ‘payday’ lenders,\" Office of the Attorney General news release archive, May 12, 1999", "News story, \"Cornyn announces $1 million settlement with ‘payday’ lender Cash Today\", Office of the Attorney General News Release Archive, Dec. 17, 1999", "Document, bill analysis of S.B. 317, Senate Research Center, Feb. 21, 2011", "Document, \"Payday Loans; Deferred Presentment Transactions\", Rule §83.604, Texas Administrative Code", "Document, legal finance charges for short term loans, Rule §83.604(c), Texas Administrative Code", "News story, \"Payday loans OK in Texas\", Amy Schatz, Austin-American Statesman, June 17, 2000 (Nexis search)", "News story, \"Texas senate caps ‘payday loan’ rates\", Juan Elizondo Jr., Austin American-Statesman, April 20, 2001 (Nexis search)", "Document, bill analysis of Senate Bill 317, House Research Organization, May 17, 2001", "Document, Staff Report 2000, Texas Sunset Advisory Commission", "News story, \"Payday lenders hope bill will reverse their fortunes; Measure that would let companies boost fees is being watched closely by Wall Street\", Robert Elder, Austin American-Statesman, April 22, 2005 (Nexis search)", "News story, \"Payday loan bill lenders wanted dies in House; Parliamentary move scuttles plan, shares in EZCorp, others plunge\", Robert Elder, Austin American-Statesman, May 12, 2005 (Nexis search)", "News story, \"Payday lending debate heats up,\" Austin American-Statesman, posted online Jan. 8, 2014", "News story, \"EZCorp’s outlook prompts shares to surge\", Robert Elder, Austin American-Statesman, Jan. 26, 2006 (Nexis search)", "News story, \"Report: Texas AG Greg Abbott received more from payday lenders than previously stated\", Marty Schladen, El Paso Times, Feb. 4, 2014", "Emails, Jerry Strickland, press secretary, Office of the Texas Attorney General, Oct. 6, 2014", "Document, written request for Texas Attorney General to review legality of payday lender CSOs, Senator Eliot Shapleigh, Sept. 8, 2005", "Emails, Rudy Aguilar, director of consumer protection, office of the Texas consumer credit commissioner, Oct. 14, 2014", "Document, Chapter 393 Credit Services Organizations, General provisions, Texas Finance Code", "Telephone interview, Don Baylor, senior associate, The Urban Institute, former senior policy analyst at the Center for Public Policy Priorities, Washington, D.C., Oct. 23, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]