["The image of the purported article was published on Facebook here on June 22, 2020.", "The article includes a logo for Newshub, a New Zealand media site.", "It contains a headline that reads: “Gore to remove trout statue after complaint from offended vegan threatening to pull it down”", "Gore is a small town located on New Zealand’s South Island.", "The Facebook post’s caption reads: “#News #opinion”", "The posts circulated after anti-racism protests in the US and the UK targeted statues associated with slavery and colonial history.", "The same image was shared hundreds of times in another Facebook post querying the purported news here and here with a similar claim.", "The claim, however, is misleading.", "In response to the misleading posts, Newshub told AFP it had not published the hoax article seen in the purported screenshot.", "“Newshub did not publish that story or any story with that title (or subject). In addition we have identified several formatting discrepancies, which confirm it is a fake,” the statement read in an email on July 3, 2020.", "An online keyword search for the purported article found no exact matches.", "The purported article shows a tag for \"Southland\", the region in New Zealand where Gore is located. It can be seen in the image below.", "A search of the Newshub website using the Southland tag retrieved no results for the purported article.", "The District Council of Gore also denied the claim, saying the town has no plans to remove its Brown Trout Statue.", "“The Gore District Council has not had threats, nor has it any intention of taking down the trout statue,” a District Council spokesperson told AFP in an email on July 3.", "The statue is located near the centre of the town and is within walking distance of the Mataura River, which runs through Gore township and is renowned for its brown trout fishing.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]