["About this rating", "Former Alabama judge Roy Moore contributed to a study course which argued that women should not hold political office.", "Roy Moore did not author the chapter that made that argument.", "As Roy Moore continued to deny allegations that he pursued a sexual encounter with a 14-year-old when he was 32, the web site Think Progress uncovered another interesting detail about the former Alabama judge's past: According to the web site, Moore co-authored the 2011 textbook Law and Government: An Introductory Study Course which contained a section arguing that women should not hold political office:", "Alabama Republican Senate Candidate Roy Moore co-authored a study course, published in 2011 and recently obtained by ThinkProgress, that instructs students that women should not be permitted to run for elected office. If women do run for office, the course argues, people have a moral obligation not to vote for them. The course is also critical of the women’s suffrage movement, which in 1920 secured some American women the right to vote.", "The course, called “Law and Government: An Introductory Study Course,” includes 28 hours of audio and visual lectures given by Moore and others, as well as a study guide. The course is available for purchase on Amazon, where “Chief Justice Roy Moore” is listed as a co-author alongside Doug Phillips, Dr. Joseph C. Morecraft, and Dr. Paul Jehle.", "Although Think Progress never said that Moore had personally penned the portion of the study guide arguing that women should not hold political office, the use of the term \"co-author\" left some readers confused. This confusion was exacerbated as social media users omitted the \"co\" entirely and labeled Moore the study guide's sole author:", "One lecture in the Vision Forum study course on which Moore worked is given by William O. Einwechter, a teaching elder at Immanuel Free Reformed Church. The lecture is titled “What the Bible Says About Female Magistrates.” The lesson argues that the Bible forbids women from holding elected office.", "An unidentified man introduces Einwechter’s lesson and criticizes the women’s suffrage movement.", "Law and Government: An Introductory Study Course was not a typical textbook. It consists of a collection of lectures (28 hours of audio and video) and a companion study guide. The study course was created by Vision Forum, an evangelical Christian organization that advocated \"biblical patriarchy\" and was shuttered in 2013 after its President Doug Phillips was accused of sexual abuse. Law and Government was largely based on a series of lectures from a 2008 conference called \"Witherspoon School of Law and Public Policy\" that was \"especially designed for young men.\"", "It's unclear if this study course was ever used at a university, or if the material was merely marketed to the men who attended to Witherspoon School of Law and Public Policy conference. Our search for this material turned up several listings on eBay, Amazon, and other book sellers, but no universities.", "It's also important to note that the Witherspoon School of Law and Public Policy wasn't an actual school. It was an annual four-day \"crash course\" that was hosted by Vision Forum in which Moore and other like-minded figures delivered lectures to young men concerning a \"biblical approach to law and public policy.\"", "Vision Forum describes it this way:", "Enter the Witherspoon School of Law and Public Policy, a four-day crash course designed to equip students, attorneys, lawmakers, pastors, and fathers with a Reformation understanding of the Scriptures as the source book for law and liberty and the only sure foundation for addressing the challenging ethical questions of the twenty-first century. The Witherspoon School is especially designed for young men who desire to influence our nation for righteousness and who recognize that, to do so, they must communicate an entire world and life view as dictated by Holy Scripture.", "Moore was a longstanding faculty member of Vision Forum's Witherspoon School of Law and Public Policy. The introduction for \"The Law Of The Land: Chief Justice Moore's Message To America,\" another DVD produced by Vision Forum's and featuring a lecture by Moore, stated that the former judge had served as \"faculty\" for the conference since 1999.", "A November 2017 Slate article further explored Moore's connections with Vision Forum and the Witherspoon School:", "Moore’s entanglements with the Vision Forum are complex. He contributed frequently to its publications, usually on topics relating to law, policy, and government. Starting in 1999, he served as a “faculty member” at the group’s Witherspoon School of Law and Public Policy, a misleadingly named four-day conference open only to men. Moore’s legal foundation, the Foundation for Moral Law, has published recommendations of Phillips’ work, and Vision Forum likewise frequently supported and published Moore.", "Although Moore's defenders may quibble with labeling him a \"co-author\" of this guide (while he is listed as an author on various listings for the material, he is labeled a \"featured speaker\" in the study course's packaging), the Alabama Senate candidate contributed to this study course and was a longtime faculty member of the \"school\" that produced these lectures:", "Although a spokesperson for Moore's campaign did not specifically address the Think Progress report, they did release a statement saying that despite the judge's involvement with Vision Forums, the Witherspoon School, and this study guide, the judge \"never suggested or believed\" that women were unqualified for public office:", "“Judge Moore believes that men and women are created equal by God and has never suggested or believed that women are unqualified for public office,” his campaign said in a statement on Friday. “Judge Moore has supported constitutional conservatives — both men and women — for decades and will continue to do so.”", "McCrummen, Stephanie.   \"Woman Says Roy Moore Initiated Sexual Encounter When She Was 14, He Was 32.\"\r\n    The Washington Post.   9 November 2017.", "Baird, Addy.   \"Textbook Co-Authored by Roy Moore in 2011 Says Women Shouldn’t Run for Office.\"\r\n    Think Progress.   29 November 2017.", "Graham, Ruth.   \"One Group That Thinks Grown Men 'Courting' Teen Girls Is Natural? Fundamentalist Home-Schoolers.\"\r\n    Slate.   14 November 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]