["“Is Trudeau threatening the President of the United States with war?” asks a November 5 Facebook post, attaching a screenshot of what appears to be a Canadian Press article headlined, “Trudeau promises military intervention if Trump refuses to leave office.”", "According to the screenshot, the article, also shared here and here, was published November 3, 2020, as Americans voted in the presidential election. A Google search for the headline brings up no results from major media websites that day.", "The screenshot also claims that Trudeau said in a November 3 press conference that “the global democratic order must be enforced.”", "The prime minister’s public itinerary for that day, which can be found here, mentions that he held a press conference in Ottawa along with other ministers. A video recording of the full press conference shows they mainly discussed providing help for small businesses and the Covid-19 pandemic.", "At one point, Trudeau is asked about the American election, but does not mention invading the country, nor does he utter the phrase about enforcing “global democratic order.”", "The article, which is similar in design to ones on public broadcaster CBC’s website and was made to look like it originated from Canada’s national news agency, is actually fake.", "“The story is a fabrication,” Jim Bronskill, The Canadian Press reporter whose byline appears on the article, told AFP by email.", "A spokeswoman for the Canadian prime minister’s office also dismissed the article saying, “This is indeed disinformation.”", "Setting aside the massive difference in the size of the Canadian army compared to its US counterpart, which benefits from the world’s largest budget, the two nations are also close trade and military allies.", "Trudeau initially refrained from commenting on the results of the US election, but on November 9, 2020, he called US President-elect Joe Biden to congratulate him on his election win.", "Trudeau also expressed confidence in the US election system while declining to comment on Trump's refusal to concede defeat, saying he would continue to work with Trump on bilateral issues until Biden's inauguration in January.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]