["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During a legislative session marked by backlash against state-mandated testing, Rep. George Lavender offered an amendment to drop some Texas exams for an Iowa alternative.", "\"I think we need to get at least an American company doing our tests instead of an English company,\" the Texarkana Republican said April 29, 2013, during debate on a House bill to cut and shorten some tests given under the State of Texas Assessments of Academic Readiness.", "The bill won House approval, but without Lavender’s amendment to substitute the Iowa Tests of Basic Skills for certain STAAR exams, which was tabled.", "Does an English company provide Texas’ tests?", "Since September 1981, according to histories of Texas testing on the education agency’s website, the state’s primary contractor for statewide assessment programs has been the same: the company known today as NCS Pearson, Inc.", "By phone, Lavender told us, \"I know they have a lot of employees in Texas and I know they have a lot of employees worldwide, but the fact is that they’re a British company, and I would much prefer a U.S.-based company to be doing our testing.\" The Texas program isn’t functioning as intended, he said, and there are other tests that \"have been proven to work across the country.\"", "Susan Aspey, vice president of public affairs for New York-based Pearson North America, told us by phone, \"Pearson PLC is the parent company. It is based in the U.K. Pearson’s North American education businesses are based here in North America. Pearson’s testing businesses are based in Minnesota. In the state of Texas, Pearson employs 1,800 people.\"", "Specifically, NCS Pearson is incorporated in Minnesota, she said. Corporate websites and profiles from Bloomberg Businessweek show the company is headquartered in Bloomington, Minn., and was founded in 1962 as National Computer Systems to score psychology diagnostic tests; the name changed to NCS Pearson in 2000 when it was bought by U.K. company Pearson PLC.", "Pearson PLC today is a global education services company headquartered at 80 Strand in London that also owns book publisher Penguin and the Financial Times news organization. It listed 42,980 employees in its 2012 annual report, including 18,552 in \"North American education\" and 16,751 in \"international education.\" Aspey said, \"Pearson employs three times as many people in the U.S. as it does in the U.K.\"", "Under NCS Pearson’s 2010-2015 contract with Texas’ schools agency, the company will be paid $468 million for STAAR and Texas Assessment of Knowledge and Skills (TAKS) tests and services. Two of the largest subcontracted amounts were listed as going to online learning company Desire2Learn, based in Canada, and Chicago-based communications firm RR Donnelley.", "And who writes the STAAR tests? Three subcontractors plus Texas educators, agency spokeswoman Debbie Ratcliffe told us by email. Items for the test are drafted, she said, by the San Antonio-based K-12 Education Division of a global, private organization, the Princeton, N.J.-headquartered nonprofit Educational Testing Service, and two companies named Lone Star and Tri-Lin Integrated Services. Then they’re edited by the agency and committees of Texas educators, Ratcliffe said.", "Our ruling", "Lavender said the state’s mandatory tests come from an English company.", "Pearson, the parent company of Texas’ testing contractor, is English. Then again, NCS Pearson is incorporated in Minnesota and was American-owned until 2000. Also, test items are generated by subcontractors including the San Antonio division of a global organization headquartered in New Jersey.", "Lacking these clarifications, the statement rates as Mostly True.", "Texas House of Representatives, floor debate, April 29, 2013", "House Bill 2836, 83rd Texas Legislature", "Amendment offered by Rep. George Lavender to House Bill 2836, tabled April 29, 2013", "Telephone interview with state Rep. George Lavender, R-Texarkana, April 30, 2013", "Texas Education Agency, Technical Digests 2001-2011, accessed online May 6, 2013", "Telephone and email interviews, excerpted, with Susan Aspey, vice president of public affairs, Pearson North America, May 3, 2013", "BloombergBusinessweek, company overview of NCS Pearson, Inc., accessed online May 6, 2013", "BloombergBusinessweek, company snapshot of Pearson PLC,, Inc., accessed online May 6, 2013", "Pearsonassessments.com, \"Our History\" web page, accessed May 6, 2013", "Pearson.com, \"Our History\" web page, accessed May 6, 2013", "Pearson PLC \"Annual Report and Accounts, 2012,\" accessed online May 6, 2013", "Texas Education Agency contract with NCS Pearson, Inc., signed June 14, 2010", "Email interview, excerpted, with Debbie Ratcliffe, Texas Education Agency communications director, May 2, 2013", "Email interview, excerpted, with Tom Ewing, director, press relations, Educational Testing Service, May 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]