["The video was published here on Facebook on September 16, 2020.", "The one-minute, 37-second video shows two dancers waltzing to the song Delilah by Tom Jones.", "The caption reads: “ROBOTS are DANCING. This classical dance was created in China and broadcast at Shanghai Disneyland. They are not dance artists, but robots made in China. The performance time is only about 5 minutes, but the waiting time for tickets is 4 hours, and the ticket price is 499 yuan. It is more complex than Japan and has perfect facial expressions. Send this video out for everyone to watch and let us enjoy it together. Both dancers are robots. They are so realistic that they cannot be distinguished …”", "Shanghai Disneyland refers to the Shanghai Disney Resort, a theme park which is a joint venture between US-based conglomerate, The Walt Disney Company and Chinese state-run company, Shanghai Shendi (Group).", "The video was also shared widely on Facebook alongside the same claim here and here, on Twitter here, and YouTube here.", "The claim is false.", "A reverse image search using keyframes generated using digital verification tool InVID-WeVerify, followed by a keyword search on YouTube, found the same video published on the BBC’s official YouTube channel on December 7, 2013. The video shows the BBC One watermark in the top left-hand corner of the video.", "The YouTube video's title reads: “Abbey Clancy & Aljaz dance the Viennesse Waltz to 'Delilah' - Strictly Come Dancing - BBC One”.", "Abbey Clancy is a British model and TV presenter. Aljaz Skorjanec is a professional dancer from Slovenia.", "Strictly Come Dancing is a popular UK television programme in which celebrities are paired with professional dancers as part of a dance competition.", "Clancy and Skorjanec performed the Viennese waltz to Tom Jones’ Delilah in the quarter final week of the series in 2013. It was aired on December 7, 2013.", "Below is a screenshot of the video in the misleading Facebook post (L) and the YouTube video (R):", "This video shows dancing robots that were recently put on show in China.", "A similar misleading claim has cropped up multiple times but has previously been linked to different videos, as debunked by fact checkers here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]