["One Facebook post featuring the photo has been shared 100 times since it was published on February 26, 2021.", "“2007 internally displaced women and children in Kenya,” reads the text in the photo.", "In 2007, violence erupted in Kenya following disputed presidential elections in December that led to the deaths of more than 1,100 people and displaced more than 600,000.", "The violence continued into 2008 and centered in the Rift Valley, where members of the Kalenjin and Luo ethnic communities (who largely supported the defeated Raila Odinga) fought with those from the Kikuyu community, to which the country’s outgoing leader Mwai Kibaki belonged.", "In March 2010, the International Criminal Court (ICC) approved a probe into the crimes against humanity that occurred during the turmoil.", "Two years later, ICC judges confirmed that four Kenyans, including incumbent President Uhuru Kenyatta and his deputy William Ruto, would be tried. However, Kenyatta’s case was dropped in 2014 and Ruto’s in 2016.", "The false Facebook posts accuse Ruto of being responsible for the violence against the Kikuyus, with one caption saying he “caused a lot of pain, sadness, and suffering”.", "The same photo was also posted on Twitter on February 26, 2021, with a similar claim.", "By conducting a reverse image search on TinEye, AFP Fact Check found that the photo shared in these social media posts was taken in the Democratic Republic of the Congo (DRC) on November 22, 2012, and not in Kenya in 2007.", "Shot by Dai Kurokawa for the European Press Agency (EPA), the picture can be found in their archive here.", "The caption reads: “Residents of Sake walk toward Goma fleeing their homes with their belongings to avoid the fighting between the M23 rebels and the Congolese government troops, on the road between Goma and Sake in eastern Democratic Republic of Congo, 22 November 2012.”", "Furthermore, the photograph has been manipulated on Facebook — the original image does not have blazing fires in the background.", "The March 23 Movement (M23) was a rebel military group based in eastern DRC, mainly in the province of North Kivu. The militia group agreed to disarm in 2013 after suffering several defeats against government-led troops and UN-backed forces.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]