["About this rating", "On 22 March 2016, the UK's Daily Star newspaper published a sensational article reporting that Cadbury and other chocolate manufacturers had \"banned\" use of the word \"Easter\" on the packaging of their products in order \"to stop 'offending' other religions\":", "Cadbury is now selling a Dairy Milk \"Egg Hunt Pack\" while Nestlé advertises Aero's \"chocolate egg with bubbly bars\".", "The E-word is apparently so offensive that posh chocolatiers Green & Blacks once described the most important date on the Christian calendar merely as \"the festival of chocolate and loveliness\".", "This prompted \"angry and frustrated\" campaigner David Marshall to set up the Meaningful Chocolate Company, in which his Fairtrade charity \"Real Easter Egg\" puts the religious message on to the packaging.", "He said: \"It's deeply disappointing and shameful that some of the biggest companies in the country are censoring the centuries' old tradition.", "\"It shows they're insensitive and uncomfortable with the Christian faith.\"", "Several other UK newspapers picked up on the Daily Star's exaggerated reporting and asserted that the word \"Easter\" had been more prominently displayed on Cadbury products in recent years than it is now:", "Although the pictured Cadbury \"Egg Hunt Pack\" does not prominently display the word \"Easter\" on the front of its packaging, Cadbury clearly hasn't \"banned\" mention of that holiday in association with their products. For example, they also sell an \"Easter Egg Hunt Gift\" that comes in a box which clearly displays the phrase \"Happy Easter\" on its front:", "Furthermore, a brief scan of the Cadbury's web site reveals at least four other mentions of the word \"Easter\" in additional to page dedicated to Easter gifts and another page directing people to local Easter Egg hunts. The company has also made frequent mentions of the holiday in their social media accounts:", "While many of the company's 2016 chocolate offerings do not mention the word \"Easter\" on the front of their packaging, some of those products plainly still do:", "Cadbury maintains that no policy has been enacted to remove the word \"Easter\" from their packaging and that most of their products still reference \"Easter\" on the back of the packaging if not the front:", "A Cadbury spokesman also offered a comment on the controversy to the Independent denying any effort to eliminate or downplay references to Easter:", "\"Most of our Easter eggs don't say Easter or egg on the front as we don't feel the need to tell people this — it is very obvious through the packaging that it is an Easter egg,\" said the unnamed spokesperson, who denied that political or religious correctness is behind the move.", "Although there may be some truth to the claim that the word \"Easter\" is not prominently displayed on all Cadbury chocolate products, the company has clearly not \"banned\" references to that holiday in their product packaging.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]