["Multiple posts on Facebook claim the group has begun a “massive” recruitment process for the refinery near Lagos, ahead of the scheduled start of production next year.", "“The long awaited Dangote Refinery Recruitment is here. Interested Applicants should click the link below to apply,” Titus Olaboye, a Facebook user, wrote.", "The custom-made bit.ly link, which includes the phrase \"Dangote_Refinery_Recruitment2019\", redirects readers to a page on Nigerian news site ejesgist.com. The site purportedly lists posts available at the refinery such as “field engineer” and “area head”, but it does not redirect to the Dangote Group’s recruitment page.", "Kadaria Ahmed, a prominent Nigerian journalist with 174,000 Twitter followers, also posted the link on the social media site where it was retweeted more than 3,400 times.", "As a standard practice, the Dangote Group publishes its job openings on its website and publicises the openings through its official social media accounts. The last such job opening was advertised on the company’s Twitter account on December 6.", "We are hiring!\n\n\t\tRole: Area Sales Manager\n\n\t\tInterested qualified candidate should email CV& cover letter to NASCONcareers@dangote.com by December 14, 2018 || Please share with your network. pic.twitter.com/YhB0lp9EHC", "There is no sign of the 4,000 supposed openings at the refinery, despite the post on the Ejesgist site claiming the application deadline is March 31.", "There are no posts currently listed under “refinery” on the conglomerate’s website and Anthony Chiejina, head of corporate communications for the Dangote Group, told AFP that the recruitment claim should be disregarded. ​", "Spoof job advertisements are common in Nigeria, where unemployment hit 23.1 percent in the third quarter of 2018 -- 20.9 million people.", "Exploiting the fact that millions of Nigerians are looking for work, some of these posts are simply designed to drive traffic to a website in order to boost advertising revenues.", "Some, however, seek to swindle unsuspecting job seekers out of their money through a range of different methods.", "Aliko Dangote, 61, was named by business magazine Forbes as Africa’s richest man for the seventh year in a row in 2018, with a fortune estimated at $12.2 billion.", "Born into a wealthy Nigerian family, he founded Africa’s largest cement producer, Dangote Cement, and has interests in salt, sugar and flour manufacturing.", "His ambitious plan to set up the largest refinery of its kind in the world, built on a vast stretch of swampland east of Lagos is costing an estimated $12 billion and has been hit by repeated delays. While the company now says it should start operations in 2020, some industry insiders predict it could be delayed until 2022.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]