["The video was viewed more than 2.8million times after it was published on Facebook here on May 23.", "The post’s caption reads: “Exclusive: Real Footage of PIA PK 8305 AirPlane Crashed in Karachi.”", "The video was published one day after a PIA plane crashed into homes near Pakistan’s Karachi Airport. At least ninety seven people were killed in the crash, AFP reported.", "The same video was also shared alongside a similar claim on Facebook here, here, here and here; on YouTube here; and on Twitter here.", "The claim is false.", "A reverse Google image search of keyframes extracted from the video using InVID-WeVerify, a video verification tool, found the clip is an animation.", "It was published on YouTube here on May 22, 2020, in a post titled: “PIA Plane Crash Karachi”.", "As noted in the YouTube post’s description, the video is an animation created using X-Plane 11, a flight simulation programme published by technology company Laminar Research.", "The description reads: “All my plane crash videos are just simulated crashes. Real plane crashes are terrible, do not watch real crashes just for your entertainment. All crashes created with:FSX (Microsoft Flight Simulator X) & AFS2 (Aerofly Simulator 2) & X-Plane 11.”", "Below are screenshot comparisons of the misleading Facebook video (L) and the animated YouTube video (R):", "The same YouTube channel also published other animated simulations of plane crashes that were shared in misleading social media posts about the May 22 accident in Pakistan. AFP debunked the videos here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]