["About this rating", "Some daily death totals from COVID-19, including in December 2020, have been remarkably high by historical standards. Several days have seen more deaths recorded from COVID-19 than resulted from the attacks on Pearl Harbor, and a few days have come close to reaching the number of fatalities that resulted from the 9/11 terrorist attacks.", "The ranking in the meme omits certain natural disasters whose death tolls were greater than the daily totals incurred from COVID-19. And at the peak of the 1918 influenza pandemic, daily death totals, if they were formally recorded, would have exceeded the daily death totals resulting from COVID-19 in 2020.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In December 2020, amid a renewed surge in new COVID-19 cases and deaths in the United States, many thousands of internet users shared a list that purported to put the devastating impact of fatalities from the pandemic into stark historical context.", "On Dec. 8, Twitter user @Sundae_Gurl posted a list of the eight \"Deadliest Days in American History,\" with four of the eight purportedly taking place during the first week of December 2020 (image above).", "Memes that included the same content and figures were widely promoted on Facebook, Twitter and Instagram.", "The list began to be shared during the week of Dec. 7, 2020, so the mentions of \"last Tuesday\", \"last Wednesday\", \"last Thursday\" and \"last Friday\" were clearly a reference to Dec. 1 through Dec. 4, 2020. Anyone viewing the list, with the same figures, from Dec. 14 onwards, should bear that in mind.", "The broader point made by those promoting the meme was thoroughly sound. The COVID-19 pandemic has indeed resulted in daily death totals in the United States that are remarkably high by historical standards, and have on several occasions exceeded the number of fatalities from the attacks on Pearl Harbor, for example.", "However, the ranking omitted some natural disasters whose fatalities were more numerous than even the highest daily tolls from COVID-19, as of Dec. 9, 2020. Furthermore, if official daily tallies were recorded of deaths during the peak of the 1918 influenza pandemic, those figures would also exceed the daily fatality figures from COVID-19.", "Interpretation", "The first, obvious problem with the list is that it does not take into account the thousands of deaths, from various causes, that take place as a matter of course every day in the United States.", "For example, the U.S. Centers for Disease Control and Prevention (CDC) recorded more than 2.8 million deaths in 2018, the most recent year for which official figures are available. That's an average of 7,779 per day — a higher death toll than almost all of the days listed in the meme. For perspective, in 2018 the CDC recorded 655,381 deaths from heart disease alone — an average of 1,796 deaths per day from that single cause.", "Official figures are not systematically available for all deaths, from all causes, on a day-to-day basis, so a definitive ranking of the \"deadliest days in American history\" — understood as the days on which the highest number of deaths, from all causes, were attributable — is not possible.", "However, given that the deaths listed for Dec. 1 through Dec. 4, 2020, relate exclusively to COVID-19, and the other four days on the list relate exclusively to discrete events, like the Battle of Antietam or the Galveston hurricane, it's reasonable to conclude that the list is intended as a ranking of the highest death tolls from a specific event or cause that took place on a single day.", "Indeed, Twitter user @Sundae_Gurl — whose Dec. 8 tweet was the most widely shared instance of the list that we found — stipulated this very disclaimer, writing \"It's excess deaths attributable to a specific reason.\"", "For those reasons, we will assess the list on that basis — as a ranking of the highest death tolls from a specific event or cause on a particular day — while noting that much of the confusion and argument surrounding the meme could have been avoided if that disclaimer had been included in the ranking itself in the first place.", "Methodology", "Another brief clarification is required. In some cases, deaths attributable to an event that took place on a specific day are not recorded until after that day, or do not take place until after the day itself. For example, in the years after the Sept. 11, 2001, terrorist attacks, the New York Medical Examiner's office continued to certify a small number of deaths as homicides from the attacks, even though the victims did not die on the day itself, but later died from illnesses or injuries directly attributable to the attacks, or in cases where the victim's remains were never identified but circumstantial evidence yielded a conclusion that they had died on 9/11.", "Fatalities from military battles and natural disasters often follow a similar pattern — a number of deaths either don't take place until after the event itself, or aren't recorded until afterwards, but they are undeniably caused by that specific event on the specific day in question. In other words, the meme counts deaths from 9/11, rather than on 9/11; deaths from the attack on Pearl Harbor, rather than deaths during the attack on Pearl Harbor, and so on.", "Ranking", "The list shared widely in December 2020 contained some notable omissions and questionable figures, and the inclusion of likely daily death totals from the peak of the 1918 influenza pandemic would eclipse those resulting from COVID-19 between Dec. 1 and Dec. 4, 2020, and see them relegated from the \"Top 8\".", "Nonetheless, the daily death tolls from COVID-19 have indeed been very high by historical standards. It is of particular symbolic significance that several days in 2020, including during the first week of December, saw more deaths from COVID-19 than the 2,403 American deaths that resulted from the attacks on Pearl Harbor on Dec. 7, 1941 — a milestone event in modern American history, which President Franklin D. Roosevelt dubbed \"a date which will live in infamy.\"", "Notable mass-fatality events omitted from the list include the San Ciriaco hurricane, which killed a reported 3,369 people in Puerto Rico, after it made landfall there on Aug. 8, 1899; and the Lake Okeechobee hurricane, which killed an estimated 2,500-3,000 people as it swept through parts of Florida on Sept. 16, 1928.", "Historically, the death toll from the San Francisco earthquake on April 18, 1906, had been set in the hundreds, but decades of research led by former city archivist Gladys Hansen revealed more than 3,400 deaths directly attributable to the disaster, as well as a political cover-up of those fatalities. In 2005, the San Francisco Board of Supervisors formally voted to record a new official death count in accordance with Hansen's research.", "Finally, the 1918 flu pandemic caused hundreds of thousands of fatalities throughout the United States. Daily death totals are not available, but the U.S. Census Bureau recorded all deaths from influenza and pneumonia as attributable to \"pandemic mortality\" and reported (page 27) that 477,467 such deaths had taken place in the U.S. in 1918. Of those, 79.8 % took place in \"the last four months of the year\" — Sept. 1 through Dec. 31, 1918.", "That's 381,019 deaths from the flu pandemic in just 122 days, an average of 3,123 per day. Given that that figure is only an average, it is certain that at least a few days during the autumn of 1918 saw death tolls from the flu pandemic comfortably in excess of 3,000, which would cause the four days from early December 2020 to be further relegated in the rankings of \"The Deadliest Days in American History.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]