["A fake news story said former Attorney General Loretta Lynch brought House Speaker Paul Ryan to a 2016 meeting with Bill Clinton. (AP photo)", "An online post that said House Speaker Paul Ryan witnessed the 2016 meeting between former President Bill Clinton and former Attorney General Loretta Lynch is a fake news story that is part of a larger contrived saga.", "A headline on a July 11, 2017, post on Wazanews.tk read, \"There was someone else on that plane for the secret Bill Clinton/Loretta Lynch meeting.\" Facebook users flagged the story as being potentially fake as part of the social media site’s efforts to cut down on fake news.", "The post is based on a real June 27, 2016, meeting Clinton and Lynch had on the tarmac of the Phoenix airport, which drew fire because former Secretary of State Hillary Clinton was under investigation for keeping a private email server.", "Supposedly new information about the meeting came to light, the post said. A Baltimore Morning News reporter determined from flight paperwork that Ryan traveled with Lynch to Phoenix, specifically to attend the meeting with Clinton.", "The story launched into several melodramatic theories why the trio were meeting, including possibly brokering then-presidential candidate Hillary Clinton’s \"freedom at the expense of an embarrassing national election loss.\"", "There’s no newspaper called the Baltimore Morning News, and there’s no proof Ryan was at all involved in the meeting, because the story is fake.", "Wazanews.tk is a website registered in Amsterdam, but the story appeared to originate on OurLandOfTheFree.com, which makes up its content.", "OurLandOfTheFree.com said it \"makes no guarantee that anything you find here will be based at all in reality.\" There is no contact information readily available on the site.", "The site followed up this story about Ryan joining Clinton and Lynch with several more posts. One said a Justice Department pilot was going to spill the beans about the meeting on Fox News, but ended up being found dead (but not before leaving behind details of the discussion).", "Again, none of it is true.", "This is another example of a series of fake stories attempting to fool readers with a bogus saga about an oft-cited political event.", "We rate the claim Pants On Fire!", "Editor's note: The meeting between Bill Clinton and Loretta Lynch was in 2016. A typo in an earlier version of the story had the incorrect year.", "Wazanews.tk, \"BREAKING: There Was Someone Else On That Plane For The Secret Bill Clinton/Loretta Lynch Meeting,\" July 11, 2017", "CNN, \"Bill Clinton meeting causes headaches for Hillary,\" June 30, 2016", "New York, \"Bill Clinton’s Tarmac Visit With Loretta Lynch Is Looming Larger and Larger,\" Dec. 22, 2016", "OurLandOfTheFree.com, \"BREAKING: There Was Someone Else On That Plane For The Secret Bill Clinton/Loretta Lynch Meeting,\" July 11, 2017", "OurLandOfTheFree.com, \"BREAKING: Pilot Who Heard Every Word Of Clinton/Lynch Secret Meeting Breaks His Silence,\" July 13, 2017", "OurLandOfTheFree.com, \"BREAKING: Pilot Who Witnessed Secret Cliton/Lynch Meeting Found Dead,\" July 14, 2017", "OurLandOfTheFree.com, \"BREAKING: Dead Pilot Left ‘In Case Anything Happens To Me’ Package,\" July 16, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]