["The Facebook post, shared more than 3,800 times since August 20, 2020, reads: “So 8 white springbok players have been fired for not kneeling for BLM...well I will never support them again and you must know that now SA rugby is dead. Racism at its max and Nothing will get done (sic).”", "The Springboks are the reigning Rugby World Cup champions.", "The claim refers to an English Premiership Rugby match between Harlequin FC and Sale Sharks on August 14, 2020, when teams returned after a five-month hiatus owing to the novel coronavirus pandemic. Contracted South African players, among them Springboks, featured in the game, which was won 16-10 by Harlequins.", "As reported by AFP, the teams took a few moments before the match to shine the light on racism in rugby: Sale Sharks players wore white T-shirts with the words \"Rugby against racism\", while their opponents decided to \"take a knee\".", "The gesture has become a protest symbol of BLM after American former football quarterback Colin Kaepernick kneeled whenever the US national anthem was played.", "The rugby clubs were encouraged by Premiership Rugby to mark the fight against racism any way they saw fit.", "“For the start of each game in the first round of Gallagher Premiership Rugby, Premiership Rugby is proud to support our clubs and players as they show respect for black lives and racial equality,” part of the statement read.", "“Time will be given before games to honour equality, under the banner of Rugby Against Racism.”", "Each team’s plans to highlight the campaign were noted in the statement, with Sale Sharks “wearing ‘Rugby Against Racism’ T-shirts when the team runs out this weekend at the Twickenham Stoop”. Four Sale Sharks players also took a knee before the match, although it wasn’t indicated beforehand that they would do that.", "Three days later, South Africa’s Sports Minister Nathi Mthethwa held a media briefing on August 17, 2020, to announce that he would “seek clarity” from SA Rugby after some of the country’s national players were among those who did not kneel.", "A Sport24 report on August 22, 2020, said that all eight of Sale’s South African players, including World Cup winners Faf de Klerk and Lood de Jager, wore the T-shirt.", "Sale Sharks director of rugby, Steve Diamond defended his players and suggested Mthethwa “concentrate on his own job”.", "“Taking a knee is everybody’s choice and I don’t think the politicians should get involved, they normally make a mess when they do, so just leave us and the lads and let them have their own opinion,” he said.", "\"I don't think politicians should get involved, they normally make a mess when they do.\"@SaleSharksRugby boss Steve Diamond gives his view on comments made by South Africa's minister for sport.#RugbyRestart pic.twitter.com/3riuwrpV52", "SA Rugby's general manager for communications also confirmed that claims Springboks players were fired were false.", "“As SA Rugby holds no contractual relationship with any players based overseas (including those contracted to Sale), it is technically impossible for them to be fired and therefore the report is, indeed, fake news,” wrote Andy Colquhoun in an email to AFP Fact Check.", "“We have been requested by our sports minister to report to him on the subject and as that process is not quite complete we have not made any public comment on the matter as yet,” he added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]