["By Saranac Hale Spencer", "Posted on January 21, 2021", "A viral meme presents quotes from some Democratic lawmakers to misleadingly suggest they were advocating violence. They were supporting protests over various issues.", "Days after a mob of President Donald Trump’s supporters stormed the Capitol on Jan. 6, a meme featuring some out-of-context quotes from Democratic lawmakers started spreading widely on social media.", "The meme featured four quotes paired with pictures of four lawmakers looking angry.", "One version includes text that says, “DEMOCRATS NOT IMPEACHED FOR INCITING VIOLENCE.” Others were shared with text such as, “NEVER FORGET: Democrats have been stoking public unrest and violence for years!”", "While it’s true that the lawmakers made the statements, the quotes are presented without any information about when they were made, the topics they addressed or the actions that followed.", "With context stripped away for some of those quotes and suggestive text added, the meme has garnered thousands of comments expressing outrage.", "“These are wicked vile soulless monsters. They must pay for their hateful crimes,” said one Facebook user.", "“And these people should be in prison for inciting to harm others,” said another.", "The meme surfaced at a time when the Democratic-controlled House was preparing to impeach Trump for “inciting violence against the Government of the United States” at a rally on Jan. 6 — the day Congress met to verify Joe Biden as the winner of the 2020 presidential election. Biden won both the Electoral College and the popular vote in an election federal, state and local election officials called “the most secure in American history.” Then-Attorney General William Barr said there were no signs of fraud on a scale that would have changed the results.", "Trump, who had been making false claims that the election had been stolen from him for two months, delivered a speech at a “Save America” rally outside the White House prior to the assault on the Capitol. Trump spoke for more than an hour, saying at one point, “We fight like hell and if you don’t fight like hell, you’re not going to have a country anymore.” Some of his supporters then marched to the Capitol, fought police and overran the building. Five people died.", "Jennifer Ryan, a Texas woman who is facing federal charges for entering a restricted building and disorderly conduct on Capitol grounds, told a local CBS affiliate after her arrest that she thought Trump should pardon her. “I thought I was following my president. I thought I was following what we were called to do,” she said. “He asked us to fly there. He asked us to be there. So I was doing what he asked us to do.”", "Whether or not Trump’s remarks are similar to the Democratic statements featured in the meme is a matter of opinion. Some Republican members of Congress thought they were. In the debate before the impeachment vote, two congresswomen — Rep. Debbie Lesko of Arizona and Rep. Lisa McClain of Michigan — read some of the quotes included in the meme.", "Below we’ll present the facts about the four Democratic quotes included in the meme, explaining the context in which they were made and what, if any, violence followed.", "In August, the U.S. Postal Service was expecting a surge in mail-in ballots for the Nov. 3 election due to the COVID-19 pandemic. A coronavirus relief bill under consideration at the time had included funds to cover associated costs, a move that Trump opposed.", "During an Aug. 15 interview on MSNBC, host Tiffany Cross asked Rep. Ayanna Pressley, “Will the Post Office get funded?”", "Pressley answered, “They need to be. … Listen, I’m looking to the public. You know, this is as much about public outcry and organizing, and mobilizing, and applying pressure so that this GOP-led Senate and that these governors that continue to carry water for this administration, putting the American people in harm’s way, turning a deaf ear to the needs of our families and our communities — hold them accountable. Make the phone calls, send the emails, show up. You know, there needs to be unrest in the streets for as long as there’s unrest in our lives and, unfortunately, there’s plenty to go around.”", "Only the words in bold were included in the meme.", "We could find no evidence that there has been violence related to the debate about postal funding following Pressley’s interview.", "That partial quote, though, was picked up and highlighted by right-wing media outlets at the time.", "The same outlets were giving significant attention to riots that were going on in Portland, Oregon.", "The riots had grown out of the nationwide demonstrations against police brutality and systemic racism, sparked by the May 25 death of George Floyd.", "In a June 1 radio interview, Pressley had expressed her support for the peaceful demonstrations and condemned the destruction and looting that followed some of them.", "“Community organizers are community builders. They are not destroyers,” Pressley said in that interview. “And it is deeply painful that there are forces at work to infiltrate and to undermine the good work, the vigilant work, of people who are committed to peace and justice in earnest, despite how slow coming that has been.”", "“We can’t allow those destroyers, who seek to distract, to derail, to undermine, to co-opt this movement,” she said, contrasting them with the demonstrators she supported, whom she likened to the Freedom Riders of the 1960s.", "Despite her previously stated position on the type of protest she supported, the social media posts over the summer included only her partial statement about unrest, as does the currently circulating meme.", "Most of the protests following Floyd’s death were peaceful; research published in June found that about 80% of protests were peaceful, and a study published in September found that 93% were peaceful.", "In a June 18 interview with talk show host Stephen Colbert, then-Sen. Kamala Harris, who hadn’t yet joined the Democrats’ presidential ticket, was asked about her participation in the demonstrations and her opinions about related issues.", "That discussion lasted for about six minutes and Harris described a protest that she had attended this way:", "“I’ll tell you one of the things, Stephen, that I saw that gives me such hope — people who seemingly have nothing in common, who know they have everything in common. It was really, it’s a beautiful sight — people of every race, age, gender together, seeing the commonality and it was then the commonality of spirit and it was something that was so very powerful and I think we all have to recognize it for what it is. … We have arrived at a point in our country that we should recognize, this is not just a moment, it is a movement. It is a movement that is fueled by the diversity, the beautiful diversity, of who we are, coming together as a unified body demanding, in this case, change and justice for everyone.”", "Later in the segment, after Colbert expressed concern about waning coverage of the protests, Harris said:", "“Right, that’s right. But they’re not going to stop. They’re not going to stop. This is a movement — I’m telling you. They’re not going to stop. And everyone beware because they’re not going to stop … they’re not going to stop before Election Day in November and they’re not going to stop after Election Day. … Everyone should take note of that on both levels … that they’re not going to let up and they should not and we should not.”", "The meme appears to have paraphrased the section in bold this way: “Protesters should not let up.”", "While Harris has voiced support for peaceful protests beyond this interview, we could find no instance in which she advocated violence.", "She attended a demonstration sparked by Floyd’s death in Washington, D.C., as she discussed with Colbert, and posted a video of it to Twitter. The demonstration in the video shows no violence.", "She also said in a speech on Aug. 27: “We must always defend peaceful protest and peaceful protesters. We should not confuse them with those looting and committing acts of violence.”", "Two members of the Trump administration had highly publicized encounters with critics at Washington, D.C., area restaurants in June 2018.", "On June 19, a group confronted then-Homeland Security Secretary Kirstjen Nielsen while she dined at a Mexican restaurant. They criticized her participation in implementing a policy that separated children from their parents at the border (we’ll explain more on that next) and chanted “shame” at her.", "On June 22, the owner of a Lexington, Virginia, restaurant asked then-Press Secretary Sarah Sanders to leave. The owner, Stephanie Wilkinson, said at the time, “I explained that the restaurant has certain standards that I feel it has to uphold, such as honesty, and compassion, and cooperation. I said, ‘I’d like to ask you to leave.'”", "Two days after that, on June 24, a video surfaced showing Rep. Maxine Waters of California speaking to a group of supporters in Los Angeles.", "“You have members of your cabinet that have been booed out of restaurants. Who have protesters taking up at their house, who sang — ‘no peace, no sleep; no peace, no sleep.’ And guess what — we’re going to win this battle, because while you try and quote the Bible, Jeff Sessions and others, you really don’t know the Bible. God is on our side. On the side of the children. On the side of what’s right. On the side of what’s honorable. On the side of understanding that if we can’t protect the children, we can’t protect anybody. And so, let’s stay the course. Let’s make sure we show up wherever we have to show up. And if you see anybody from that cabinet in a restaurant, in a department store, at a gasoline station, you get out and you create a crowd and you push back on them and you tell them they’re not welcome anymore, anywhere.”", "The portion in bold is what appears in the meme.", "Of the four quotes included in the meme, this one is the most accurately portrayed. Waters did encourage her supporters to confront members of the Trump administration in public places. But there is no evidence that her remarks resulted in any violence.", "In April 2018 then-Attorney General Jeff Sessions announced a new “zero tolerance policy” for immigrants caught crossing the border illegally.", "That policy had the effect of separating children from their parents, since adults were detained by the U.S. Marshals Service and sent to federal court while children (who can’t be held in adult detention facilities) were referred to the Department of Health and Human Services’ Office of Refugee Resettlement.", "During then-House Minority Leader Nancy Pelosi’s weekly press conference on June 14, 2018, a reporter asked about the new policy.", "Pelosi spoke for about five minutes on the issue and cited a statement from the United States Conference of Catholic Bishops that called the policy “immoral.” She also cited a 2017 statement from the National Association of Evangelicals that had praised the U.S. asylum system.", "Toward the end of her answer, Pelosi said:", "“When we had a hearing on a subject related to this — asylum seekers, refugees, etc. — the Association of Evangelicals, the Evangelicals, testified … they called it the crown jewel of America’s humanitarianism. Crown jewel of American humanitarianism. And, in order to do away with that crown jewel, they’re doing away with children being with their moms. … I just don’t even know why there aren’t uprisings all over the country and maybe there will be when people realize that this is a policy that they defend. It’s a horrible thing.”", "The meme took only the portion in bold, slightly edited to say: “I just don’t know why there aren’t uprisings all over the country. Maybe there will be.”", "Some demonstrations against the policy had happened before Pelosi’s statement on June 14, 2018, but most of them took place after that, according to press reports. It’s unclear whether or not any of the participants were motivated by Pelosi’s statement, but it’s worth noting that the family separation policy had received widespread attention at the time and at least 49 Republican lawmakers had criticized the policy.", "The protests against the policy appear to have been peaceful. We could find no evidence that any of them became violent.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "U.S. House. “Impeaching Donald John Trump, President of the United States, for high crimes and misdemeanors.” (as passed by the House 12 Jan 2021).", "Department of Justice. Investigations regarding violence at the Capitol. Accessed 15 Jan 2021.", "Trump, Donald. “Donald Trump Speech “Save America” Rally Transcript January 6.” Rev.com. 6 Jan 2021.", "United States of America v. Joshua Black. Affidavit in support of criminal complaint and arrest warrant. U.S. District Court for the District of Columbia. 13 Jan 2021.", "Lesko, Debbie. House Rules Committee Debate on Impeachment Resolution Against President Trump. C-SPAN. 12 Jan 2021.", "McClain, Lisa. House Passes 25th Amendment Resolution to Remove President Trump from Office. C-SPAN. 12 Jan 2021.", "Kiely, Eugene. “Trump Proves Biden Right on USPS Funding, Mail-In Ballots.” FactCheck.org. 14 Aug 2020.", "“AM Joy.” Video and transcript. MSNBC via the Internet Archive. 15 Aug 2020.", "Locke, Kaitlyn. “Rep. Ayanna Pressley Calls For Focus To Remain On Peaceful Activism, Passing Legislation That Condemns Police Brutality.” WGBH, Boston Public Radio. 1 Jun 2020.", "The Late Show with Stephen Colbert. “Sen. Kamala Harris: The Nationwide Protests Are A Movement. They’re Not Going To Stop.” YouTube. 18 Jun 2020.", "Harris, Kamala (@KamalaHarris). “People are in pain. We must listen.” Twitter. 30 May 2020.", "CBS News. “Kamala Harris vows to stand with the protesters in Kenosha, Wisconsin.” YouTube. 27 Aug 2020.", "Chappell, Bill. “‘Shame!’: Protesters Shout At DHS Head Kirstjen Nielsen, Eating At Mexican Restaurant.” NPR. 20 Jun 2018.", "Stracqualursi, Veronica. “Sarah Sanders says she was kicked out of restaurant because she works for Trump.” CNN. 24 Jun 2018.", "Department of Justice. Press release. “Attorney General Announces Zero-Tolerance Policy for Criminal Illegal Entry.” 6 Apr 2018.", "Gore, D’Angelo. “Nielsen’s Rhetoric on Family Separations.” FactCheck.org. 20 Jun 2018.", "PBS NewsHour. “Rep. Pelosi holds weekly news conference.” YouTube. 14 Jun 2018.", "McCausland, Phil, Patricia Guadalupe and Kalhan Rosenblatt. “Thousands across U.S. join ‘Keep Families Together’ march to protest family separation.” NBC News. 30 Jun 2018.", "Cirillo, Jeff. “Here Are the Republicans Opposing Migrant Family Separation.” Roll Call. 19 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]