["About this rating", "In 2018, ALDI UK ran a campaign in which they offered to provide surplus food at no charge to charities in the UK on Christmas Eve in order to give help to those in need.", "The offer was not available in the U.S. and was not exclusively offered to homeless people but instead was made available to charities (not the general public), who had to apply by 18 November, long before most Facebook users shared a viral meme about the campaign.", "In December 2018, as the countdown to Christmas began in earnest for many in the United States and elsewhere, a viral social media post claimed that one popular cut-price supermarket chain had made a generous offer to help out those in need: \"Christmas Eve, at 4pm Aldi will be giving away their leftover food to the homeless. Please share.\"", "Similar versions of this post were widely shared among Facebook users in the United States, but it was primarily circulated in the United Kingdom and Ireland, where ALDI is especially popular and has been part of the supermarket landscape for longer than in the United States:", "News acccounts reiterated the \"free food from ALDI\" concept in December 2019.", "A spokesperson for ALDI UK confirmed that these social media posts referred to a genuine offer made by ALDI in 2017 and again in 2018 but clarified that the offer was not available in the United States:", "ALDI USA operates independently from ALDI in other countries. We aren’t currently implementing a nationwide Christmas Eve food donation, but we do give back to our communities in partnership with Feeding America. All of our stores work with local food banks in the Feeding America network to donate overstocked food products, short-dated items or products with lightly damaged packaging that are still safe for consumption.", "ALDI US did partner with the grocery delivery company Instacart in November 2018 to match customer donations of free meals to those in need on Thanksgiving Day.)", "Although the message was also widely shared among Facebook users in Ireland, a spokesperson for ALDI Ireland confirmed that ALDI UK's Christmas Eve campaign did not extend to Ireland. However, the spokesperson clarified that ALDI Ireland's ongoing partnership with the charity FoodCloud would continue during the 2018 Christmas period, including on Christmas Eve.", "From the end of November until 9 December, ALDI Ireland collaborated with FoodCloud on a Christmas-specific campaign called \"Food for Good,\" which invited customers to donate surplus food items in designated boxes at ALDI locations throughout Ireland.", "The message first went viral in December 2017, when it was posted to Facebook by a user in England.", "That message was shared widely again in December 2018, but because it does not contain certain details, some users in the United States and Ireland were left with the mistaken impression that the offer was available in their country.", "Furthermore, both in 2017 and 2018, the offer was structured in a more organized way than simply providing unsold food to anyone in need who turns up at an ALDI location on 24 December.", "The 2017 announcement (authenticated by ALDI UK) invited charities to register with the company two weeks in advance, imposing a deadline of 8 December 2017, and specifying that those organizations would have to come to their local store after 4 PM on Christmas Eve to pick up whatever unsold products were available:", "In 2018, ALDI UK made their \"Christmas Eve\" announcement even earlier and imposed an even earlier deadline (18 November 2018) for interested charities to apply:", "Conclusion", "It is true that ALDI UK offered to provide surplus food to charities throughout the United Kingdom on Christmas Eve in 2018, as they did in 2017. Presumably, some of those charities serve the homeless but not exclusively so.", "However, the offer does not apply in the United States, Ireland or anywhere else, and the act of sharing the many Facebook \"alerts\" which were prevalent in December 2018 was actually of little or no value to the general public, even in the United Kingdom. This is because the offer was available specifically to charities, not the general public as such, and the deadline for charities to apply to take part in the program had already passed by 18 November 2018.", "Barr, Sabrina.   \"ALDI to Give Away Free Food on Christmas Eve to Those in Need.\"\r\n    Independent.   18 December 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]