["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republicans have had months to plan for Democrat Russ Feingold’s announcement that he would seek a rematch against U.S. Sen. Ron Johnson, who defeated him in 2010.", "The big word came May 14, 2015, when Feingold released a 90-second video saying he was in the race. Knowing that Feingold is teaching a course at Stanford University in California, the National Republican Senatorial Committee pounced.", "Not long after Feingold tweeted his announcement, the NRSC issued this retort:", "\"In what may be the oddest move of the campaign season thus far, Stanford Professor and failed 2010 candidate Russ Feingold announced his Wisconsin Senate run today from … California.\"", "The line of criticism was repeated throughout the day, including by conservative talk show host Charlie Sykes and on his Right Wisconsin website. More recently, it was picked up by Gov. Scott Walker, when he said Feingold \"announced his candidacy for U.S. Senate while he was still in California.\"", "And the NRSC has continued to press the idea on its website, with a map that circles California (\"where Feingold announced\") and Wisconsin (\"where he’s running.\")", "So did Russ Feingold’s attempt at a Wisconsin comeback really begin in the Golden State?", "Prof. Feingold", "Since his 2010 defeat after 18 years in Washington, Feingold has taught classes at Lawrence University in Appleton, Wis., Marquette University in Milwaukee and twice at Stanford. He also held a temporary assignment for 18 months as the U.S. State Department envoy to the Great Lakes region of Africa. He left that post earlier this year.", "His current Stanford class is called \"Implications of Post-1994 Conflicts in Great Lakes Region of Africa: an American Perspective.\" The course, offered to graduate and law school students, runs from March 30 to June 3, meeting from 4:15 p.m. to 7:15 p.m. on Wednesdays.", "We asked NRSC communications director Andrea Bozek for evidence to support the group’s claim that Feingold announced his new campaign from California.", "Her response: \"If he was at class Wednesday night, how did he get back by 9:15 in the morning\" on Thursday for an announcement?", "Asked if the group had proof that Feingold was in California at the time of the announcement, she responded: \"I think the onus is on Sen. Feingold to prove that he was in the state when this video went out.\"", "The announcement", "Before we take a closer look at Feingold’s day, we should note that his campaign announcement video was made in the living room of the house he has owned for years in Middleton, Wis. That home -- and its garage door on which Feingold once painted campaign promises -- has factored prominently in his previous campaigns.", "During the 2010 campaign, WISN-AM radio talk show host Mark Belling claimed that Feingold faked an ad to make it appear that he was standing outside the house. We rated the claim Pants on Fire and Belling later backtracked.", "So what about Feingold’s whereabouts on May 14?", "A look at his Twitter and Facebook accounts provides solid evidence that he was in Wisconsin that day.", "An entry posted at 11:10 a.m. on Twitter includes a picture of Feingold sitting on a patio, talking on the phone. The message reads: \"At home in Middleton. Excited to travel Wisconsin, meet with folks, and kick off our campaign. -RDF\"", "The day goes on from there with pictures of visits to the Mocha Moment Coffee House in Janesville, and a stop for a beer at the Memorial Union Rathskeller at the University of Wisconsin-Madison.", "Meanwhile, other tweets suggest Feingold has been back and forth while teaching the Stanford class.", "A March 21, 2015 tweet read: \"At home today prepping for my class at Stanford. Took a break in beautiful Pheasant Branch Creek in Middleton.\"", "Bozek said Republicans would continue to emphasize Feingold’s out of state job and have assigned a \"tracker\" to follow Feingold when he is in California. On May 21, 2015, they posted and tweeted videos of Feingold walking to his class.", "\"If you want to represent Wisconsin families you need to dedicate your time to listening to their concerns, rather than meeting with donors in California, \" Bozek said.", "So how did Feingold teach his Stanford class and yet make it back to Wisconsin for the big day? His campaign said the answer was pretty simple: a red eye flight.", "Feingold took United Airlines flight 995 from San Francisco to Chicago. The flight left at about 11:45 p.m. Wednesday and arrived in Chicago at about 5:44 a.m. Thursday morning, said Russ for Wisconsin campaign manager Tom Russell.", "Feingold was picked up at the airport and back in the Badger State when his latest quest began, his campaign said.", "Our rating", "The National Republican Senatorial Committee said that Russ Feingold announced his campaign for Senate while in California.", "But tweets and other evidence shows he was in Wisconsin at the time.", "We rate the claim Pants on Fire.", "National Republican Senatorial Committee Twitter account", "National Republican Senatorial Committee website", "Telephone interview, Andrea Bozek, National Republican Senatorial Committee,  May 21, 2015", "Russ Feingold Twitter account", "Russ Feingold campaign Facebook account", "Russfeingold.com", "Emails, Max Croes, Democratic Party of Wisconsin, May 20, 21, 2015", "Stanford University course bulletin", "Right Wisconsin, \"Russ Feingold’s very weird announcement,\" May 14, 2015", "United Airlines website", "Milwaukee Journal Sentinel, \"Russ Feingold announces rematch Senate bid against Ron Johnson in 2016,\" May 14, 2015", "WISC-TV, Channel 3000.com, \"Gov. Walker discusses Israel trip, defends travel,\" May 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]