["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Quest dehumidifiers manufactured in Madison, Wis., are sold to marijuana growers in states that allow sale of the drug for medical or recreational use. (Andy Manis photo)", "In a TV interview during a campaign visit to Milwaukee, Libertarian presidential candidate Gary Johnson was asked about his support for the legalization of marijuana.", "He replied by making a claim we want to check.", "\"And let’s see, 60 percent of Americans now support legalizing marijuana,\" Johnson said on the Sept. 4, 2016 edition of the \"Upfront with Mike Gousha\" public affairs show on WISN (Channel 12).", "Only a month earlier, the former Republican governor of New Mexico had made a less aggressive claim, saying \"most\" Americans supported legalization. PolitiFact National’s rating was True, as multiple polls generally showed support in the low 50s.", "It seems unlikely that in a few short weeks it would jump to 60 percent.", "But let’s take a look.", "Previous factcheck", "When Johnson made his earlier claim, our colleagues found that in 12 of 14 national polls taken since the start of 2014, 50 percent or more of Americans supported legalization. The information, covering a period of more than 2.5 years, was taken from the PollingReport.com database", "As for the other two polls, legalization led in one by 48 percent to 47 percent and in the other by 49 percent to 48 percent.", "In the three latest polls in the database, the numbers crept closer to 60 percent, with support at 54 percent, 56 percent and 58 percent.", "But averaging the 14 polls, legalization led 53 percent to 44 percent.", "Another poll", "Johnson’s campaign, however, pointed us to another relatively recent poll that wasn’t included in the database.", "The Associated Press-NORC Center for Public Affairs Research poll, conducted in February 2016, found that 61 percent of Americans said the use of marijuana should be made legal.", "(Interestingly, 53 percent said marijuana use in their communities was a moderately serious, very serious or extremely serious problem, compared to 45 percent who said it was not at all serious or not too serious.)", "Reporting on the poll, the Washington Post’s Wonkblog said the 61 percent support, a notch above Johnson’s claim, was an all-time high.", "A parting note, though it doesn’t bear on our rating of Johnson’s claim about national numbers:", "In a July 2016 poll of registered voters in Wisconsin, the Marquette Law School Poll asked:", "When it comes to marijuana, some people think that the drug should be fully legalized and regulated like alcohol. Do you agree or disagree with that view?", "The results: 59 percent agreed, 39 percent disagreed.", "Our rating", "Johnson said: \"Sixty percent of Americans now support legalizing marijuana.\"", "A March 2016 poll found 61 percent support, but that is the only recent survey we could find showing support that high. Fourteen other polls going back more than two years show a majority of Americans back legalization, but generally support was in the low 50s.", "We rate Johnson’s statement Mostly True.", "WISN-TV, \"Upfront with Mike Gousha\" show (9:10), Sept. 4, 2016", "Email, Gary Johnson campaign spokesman John Vaught LaBeaume, Sept. 9, 2016", "PolitiFact National, \"Gary Johnson correct that most Americans support legalizing marijuana,\" Aug. 17, 2016", "Associated Press-NORC Center for Public Affairs Research, \"American Attitudes toward Substance Use in the United States\" poll, interviews conducted Feb. 11-14, 2016", "Washington Post, \"Support for marijuana legalization has hit an all-time high,\" March 25, 2016", "PollingReport.com, illegal drugs polling", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]