["A video of a dead body placed inside a coffin surrounded with flowers is doing the rounds on social media. It is being claimed that this video confirms the death of North Korean leader Kim Jong-un who hasn’t been in the public eye lately. The leader’s absence from the commemoration of his grandfather Kim Il-sung’s 108th birthday on April 15 has fuelled rumours of his death. A Twitter user posted the video with the message, “Confirmed North Korea Dictator Kim Jong UN is Dead.”", "Confirmed North Korea Dictator Kim Jong UN is Dead.#KimJongUn #KIMJONGUNDEAD pic.twitter.com/7uRmoSoYse", "— ಸೆಕ್ಯುರಿಟಿ ಜಮೀರ (@SmJameer) April 29, 2020", "A frame from this video along with another image of a body inside a coffin was also broadcasted by TV9 Bharatvarsh.", "Alt News has received several requests on its official Android application to fact-check this video. The same video has been shared by several individuals on Facebook and Twitter.", "Alt News found that the video dates back to 2011 and shows Kim Jong Il’s body laid out in a memorial palace in North Korea’s capital Pyongyang.", "“Footage filmed by APTN North Korea showed the glass coffin holding Kim’s body, surrounded by blossoms of his namesake flowers, red ‘kimjongilia’. He was covered with a red blanket, his head placed on a white pillow.” reported American news agency Associated Press. The video is dated December 20, 2011.", "The image which is claimed to be the image of Kim Jong-Un’s dead body lying on the floor has been fact-checked Polygraph. It was found that the image appears to be a morphed version of a photograph of the late Kim Jong Il, Kim Jong Un’s father. However, we are unable to independently confirm this.", "In conclusion, a video of late Kim Jong Il’s dead body lying at a memorial palace has been shared as of Kim Jong-Un’s dead body to confirm his death. At the time of writing this fact-check, there are no credible reports in the media which confirm the speculation about the death of the North Korean leader.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…"]