["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The day before the April 26 primaries in Connecticut, Delaware, Maryland, Pennsylvania and Rhode Island, the John Kasich super PAC New Day for America was making calls to would-be voters featuring the recorded voice of Michael Reagan, a political consultant and son of former President Ronald Reagan.", "His claim about Hillary Clinton caught our ear.", "\"Polls show Kasich's the only one who can beat Hillary Clinton in the fall. Trump loses. Cruz loses. And Kasich wins in a landslide. Isn't that what this race for president is really about? Becoming president? And if we don't win in November, Hillary Clinton has promised to raise taxes by $1 trillion dollars,\" Reagan says.", "To put that number in perspective, the national debt has reached nearly $19.2 trillion, or more than $60,000 for every man, woman and child in the United States.", "PolitiFact has looked at the presidential candidates' tax plans and, for the Clinton proposal, we relied on a March 3, 2016, analysis by the Tax Policy Center, a nonpartisan think tank.", "The center says that Clinton's proposal would indeed increase tax revenue by $1 trillion — $1.1 trillion in fact.", "But that money would be raised over 10 years. Clinton, even if she were elected in November and reelected in 2020, wouldn't be in office that long.", "Reagan's message on behalf of New Day misses another point that may make the increase less onerous to most voters: \"Nearly all of the tax increases would fall on the top 1 percent; the bottom 95 percent of taxpayers would see little or no change in their taxes,\" according to the report.", "For example, filers with an adjusted gross income higher than $1 million would have to pay an effective tax rate of 30 percent. Any money earned above $5 million per year would be assessed an extra 4 percent surcharge. (The surcharge would kick in at $2.5 million for married couples filing separately.)", "Clinton's plan also aims to discourage multinational corporations from using various schemes to lower or eliminate the taxes they have to pay in the United States.", "However, according to the report, her proposal would make the tax code more complex and the higher tax rates for the people who earn the most money would reduce \"incentives to work, save and invest.\"", "When we heard back from New Day for America, spokeswoman Connie Wehrkamp directed us to Clinton's interview with the New York Daily News and an analysis by the conservative Americans for Tax Reform, both of which make it clear that the $1 trillion would be raised over 10 years, a distinction made by neither New Day nor Reagan.", "\"Liberals may think increasing taxes by $1 trillion is a good idea, but we very strongly disagree,\" Wehrkamp said in an email.", "Our ruling", "New Day spokesman Reagan said, \"Hillary Clinton has promised to raise taxes by $1 trillion.\"", "Her plan does, in fact, call for raising a trillion dollars, but it would do so over 10 years — longer than she could serve as president, even if she were re-elected. So if she brought in roughly $100 billion per year, even a two-term Clinton administration couldn't fulfill a promise to bring the total to $1 trillion.", "Also, the statement ignores another key bit of data — that the money would be raised by tax changes targeted to the richest Americans, a group that has seen its top tax rate drop dramatically since the 1950s and early 1960s, when the marginal tax rate was over 90 percent.", "Because the statement is partially accurate but leaves out important details or takes things out of context, we rate it Half True.", "https://www.sharethefacts.co/share/74e26b13-8562-44ce-a220-60187aef6984", "A previous version of this fact-check included an erroneous line about the per-individual share of the national debt should Clinton's plan go into effect. It has been removed.", "Bureau of the Public Debt, The Debt to the Penny and Who Holds It, accessed April 26, 2016", "U.S. Census Bureau, U.S. & World Population Clocks, accessed April 26, 2016", "PolitiFact, \"PolitiFact's guide to the 2016 presidential candidate tax plans,\" April 7, 2016, and \"Barack Obama says taxes are lower today than under Reagan, Eisenhower,\" Sept. 22, 2010", "Tax Policy Center, \"An Analysis of Hillary Clinton's Tax Proposals,\" March 3, 2016", "Forbes, \"Hillary Clinton Would Raise Taxes On High-Income Households by $1.1 Trillion Over 10 Years,\" March 3, 2016", "Email, Connie Wehrkamp, spokeswoman, New Day for America super PAC, April 26, 2016", "New York Daily News, \"TRANSCRIPT: Hillary Clinton meets with the Daily News Editorial Board, April 9, 2016,\" April 11, 2016", "Americans for Tax Reform, \"Hillary Confirms Trillion Dollar Tax Hike Plan,\" April 12, 2016, accessed April 26, 2016", "The Tax Foundation, \"Federal Individual Income Tax Rates History; Nominal Dollars; Income Years 1913-2013,\" accessed April 26, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]