["About this rating", "The episode in question did show a campaign to censor and cover up the male figure's genitals in Michelangelo's \"David,\" and the show did air in 1990, years before several real-life campaigns to similarly censor replicas of the statue.", "Michelangelo's \"David,\" and replicas of it, have been covered up, and been the subject of censorship campaigns, ever since the statue was first unveiled in Florence in the early 16th century. The show's writers didn't so much \"predict\" such campaigns, as satirize previous ones, which happened to be replicated in the years since the episode aired.", "Several times in recent years, various websites and online \"listicles\" have claimed that, among other uncanny predictions, the Simpsons once pre-empted the real-life censorship of Michelangelo's \"David\" statue.", "In particular, in 2017 the comedian and former NFL punter Pat McAfee devoted a five-minute segment on his podcast to reviewing and promoting various claimed instances where the classic animated sitcom was remarkably prescient about events that were yet to happen.", "He said: \"The censorship of Michelangelo's David: 1990 [it occurred on the show], 2016 it happened.\"", "Likewise, in a 2018 article listing more than 30 occasions when \"real life has imitated 'The Simpsons,'\" the Daily Telegraph wrote:", "Itchy and Scratchy also featured heavily in the 1990 episode Itchy and Scratchy and Marge, in which Marge led a censorship campaign, horrified by the show's violence. She later realised the censorship had gone too far, after Michelangelo's David was taken to a Springfield museum, and local citizens protested against the statue's nudity.", "In 2001, a Florida-based shop put a replica of Michelangelo's David outside its front door. A handful of citizens objected to the \"indecent\" statue and successfully campaigned to have David's private parts covered with a cloth.", "More recently, in 2014, an elderly British couple, Clive and Joan Burgess, received complaints from neighbours and faced an intervention from their local council, after they placed a replica of the statue in their front garden.", "In May 2019, Business Insider published a list of \"18 Times 'The Simpsons' Accurately Predicted the Future,\" including the bowdlerization of \"David\":", "\"An episode from 1990 titled 'Itchy and Scratchy and Marge' showed Springfieldians protesting against Michelangelo's statue of David being exhibited in the local museum, calling the artwork obscene for its nudity. The satire of censorship came true in July 2016, when Russian campaigners voted on whether to clothe a copy of the Renaissance statue that had been set up in central St. Petersburg.\"", "The basic facts, dates, and descriptions of events laid out in these articles and in McAfee's podcast were accurate. The episode in question was Season 2, Episode 9, \"Itchy and Scratchy and Marge,\" and it did indeed first air on Dec. 20, 1990.", "In the episode, Marge rails against the ultra-violence and obscenity of the \"Itchy and Scratchy Show,\" and leads a campaign of censorship against the cartoon. The writers brilliantly examine and expose the relativity and subjectivity of taste, obscenity, and moral standards in culture, and Marge's crusade spirals out of control, culminating in a local group picketing Michelangelo's \"David\" for its nudity.", "It's also true that, as McAfee alluded to, a campaign took place in the Russian city of St. Petersburg in 2016 that aimed to remove a replica of the statue, or cover up the male figure's genitals — not a far cry from the kind of campaign depicted in the 1990 \"Simpsons\" episode.", "However, the difficulty in claiming that Matt Groening and his writers \"predicted\" the censorship of Michelangelo's \"David\" lies in the fact that campaigns to cover up nude works of art in general, and \"David\" in particular, have existed for centuries. The prevalence of fig leafs on classical statues is testament to that, as Alexxa Gotthardt wrote for the website Artsy in 2018:", "Take Michelangelo's famous sculpture \"David\" (1501–04), a muscular, starkly naked depiction of its namesake biblical hero. The work scandalized the artist’s fellow Florentines and the Catholic clergy when unveiled in Florence’s Piazza della Signoria in 1504. Soon after, the figure’s sculpted phallus was girdled with a garland of bronze fig leaves by authorities.", "60 years later, just months before Michelangelo’s death, the Catholic Church issued an edict demanding that “figures shall not be painted or adorned with a beauty exciting … lust.” The clergy began a crusade to camouflage the pensises and pubic hair visible in artworks across Italy. Their coverups of choice? Loincloths, foliage, and — most often — fig leaves. It has became known as the “Fig Leaf Campaign,” one of history’s most significant acts of art censorship.", "A more recent example, described by the website of the Victoria and Albert Museum in London, came in the mid-1800s, when the Grand Duke of Tuscany presented Queen Victoria with a 6-meter-high cast of the original statue:", "\"The story goes that on her first encounter with the cast of 'David' at the Museum, Queen Victoria was so shocked by the nudity that a proportionally accurate fig leaf was commissioned. It was then kept in readiness for any royal visits, when it was hung on the figure using two strategically placed hooks.\"", "Rather than \"predicting\" the censorship of Michelangelo's \"David,\" the writers of \"The Simpsons\" were merely describing and satirizing moral crusades of that kind, which had already been happening for hundreds of years, and happened to continue to take place in the nearly 30 years since the episode first aired.", "Truth Equals Fiction (Blog).  \"Simpsons Did It -- Michelangelo's 'David' Protest.\"\r\n  27 July 2015.", "Hancock, Edith.  \"11 Times The Simpsons Accurately Predicted the Future.\"\r\n  Business Insider/The Independent.  11 November 2016.", "Murray, Tom.  \"18 Times 'The Simpsons' Accurately Predicted the Future.\"\r\n  Business Insider.  15 May 2019.", "The Daily Telegraph.  \"Mexico Winning the World Cup -- and 30 Other Times Real Life Has Imitated The Simpsons.\"\r\n  27 June 2018.", "BBC News.  \"Russians to Vote on Covering Up Michelangelo's David.\"\r\n  28 July 2016.", "Gotthardt, Alexxa.  \"Why Fig Leaves Cover the Private Parts of Classical Sculptures.\"\r\n  Artsy.  5 April 2018.", "The Victoria and Albert Museum.  \"David's Fig Leaf, Perhaps by D. Brucciani & Co., About 1857.\"\r\n  Accessed 29 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]