["About this rating", "On April 15, 2020, hundreds of Michiganders turned up in the state's capitol for Operation Gridlock, a protest against the stay-at-home orders implemented to combat the spread of the COVID-19 coronavirus disease. As social media lit up with comments and photographs of the event, one image supposedly showing a flag bearing a swastika flag and the words \"Trump\" and \"Pence\" started to go viral.", "This appears to be a genuine photograph. However, it was not taken in Lansing, Michigan, during Operation Gridlock in April 2020 and it may not actually show a Trump supporter.", "This photograph was taken a month earlier at a protest in Boise, Idaho. Twitter user @notaxiwarrior first shared this image on March 2, 2020, along with the following caption:", "Today I witnessed a bunch of trump supporters crashing a peaceful rally I was attending with my family. They were profane, disrespectful & crowded behind a nazi flag. Not one trumpster confronted him on his racism. They all stood behind him of course, showing their true selves", "In a follow-up message, @notaxiwarrior added more details:", "Edit for clarification: This was at a Bernie Sanders rally, the trump supporters were counter protesting. It was held at the Ann Morrison park in Boise, ID.", "Today I witnessed a bunch of trump supporters crashing a peaceful rally I was attending with my family. They were profane.", "It should be noted that while this photograph is real, the person holding this flag may not actually be a Trump supporter. Additional images from the event appear to show that this person was holding a Bernie Sanders sign at another point during the rally:", "Footage of this person holding the flag can be glimpsed around the 4:30 mark of the following video:", "Unfortunately, this isn't the first time that a Nazi symbol has been displayed at a Bernie Sanders rally. A few days after this photograph was taken, a man unfurled a Nazi flag at a Sanders rally in Arizona, as BuzzFeed News reported:", "A man waving a Nazi flag and shouting “Heil Hitler” was kicked out of a rally for Bernie Sanders on Thursday, a shocking incident targeting the man running to be the first Jewish president.", "The flag, styled professionally in the actual designs of Nazi Germany, hung prominently over a banister at the 7,000-person Arizona Veterans Memorial Coliseum at the start of Sanders’ speech. The person stationed himself in the upper deck of the arena, behind where Sanders was speaking.", "The above-displayed image was not taken during the Operation Gridlock protest in April 2020 in Lansing, Michigan. However, at least one protester did display a swastika at Operation Gridlock to suggest that the \"stay-at-home\" orders implemented in Michigan were comparable to Nazi Germany.", "People protest against excessive quarantine amid the coronavirus pandemic at the Michigan State Capitol in Lansing, Michigan on April 15, 2020. The protest was organized by Michiganders Against Excessive Quarantine several days after Michigan Gov. Gretchen Whitmer extended her order through April 30 and took the requirements of staying home a step further, banning crossing the street to visit with neighbors or driving to see friends, among other things mandatory closure to curtail COVID-19. (Photo by JEFF KOWALSKY/AFP via Getty Images)", "Nichols, Anna Liz and Susan Demas.   \"Whitmer Stay Home Order Protest Turns Into Trump Celebration with Confederate Flags and Guns.\"\r\n    Michigan Advance.   6 March 2020.", "Cramer, Ruby and Miriam Elder.   \"A Man Unfurled A Nazi Flag And Shouted Anti-Jewish Slurs At A Bernie Sanders Rally.\"\r\n    Buzzfeed.   6 March 2020.", "Censky, Abigail.   \"Michigan Stay-At-Home Order Prompts Honking, Traffic-Jam Protest.\"\r\n    NPR.   15 April 2020.", "KTVB.   \"Hundreds of Bernie Sanders Supporters March in Boise.\"\r\n    29 February 2020.", "Click On Detroit.   \"Detroit’s Jewish Community 'Condemns' Behavior, Signage of 'Operation Gridlock' Protestors.\"\r\n    16 April 2020.", "Updated [20 April 2020]: Added additional photographs and videos of the person holding the swastika flag and noted that person holding the flag may have been posing as a Trump supporter.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]