["About this rating", "An immunization plan was rolled out during the last days of the Trump administration in early January 2021 to administer COVID-19 vaccinations to personnel stationed at the Guantanamo Bay naval base and those working at the Joint Task Force Guantanamo detention facility. On Jan. 29, the Department of Defense announced that it would offer vaccines to detainees on a voluntary basis.", "Just two days after the detainee immunizations were announced, the Department of Defense put that part of the program on hold to analyze rollout measures.", "It is not yet known how many, if any, detainees were given a COVID-19 vaccination.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "A plan to administer COVID-19 immunizations on a voluntary basis to detainees at Guantanamo Bay, Cuba in late January 2021 sparked controversy on the internet after some pointed out that accused terrorists — including Sept. 11, 2001, mastermind Khalid Sheikh Mohammed — would receive a vaccination ahead of American citizens.", "Some social media users like New York Rep. Elise Stefanik posited that Biden would vaccinate detainees ahead of American citizens, and news sources reported that the plan was squashed only after “Republicans reacted with anger to the plan.”", "While it is true that a plan to immunize prisoners on a voluntary basis was proposed then subsequently put on hold after The New York Times broke the story, there are some important caveats to note.", "Colloquially known as Guantanamo Bay, it is important to first point out that the facility in Cuba is home to both the Joint Task Force Guantanamo (JTF GTMO) detention facility and the 45-acre Guantanamo Bay naval base.", "The prison camp was opened in January 2002 to hold detainees suspected of links to Al Qaida and the Taliban following the Sept. 11, 2001, attacks, including five men who at the time of writing were facing a trial by military commission.", "JTF GTMO is home to 40 detainees and roughly 1,500 personnel, including troops, government employees, guards, medical professionals, officers, and linguistics. On the other hand, the naval base houses around 6,000 people, including military personnel and their families.", "A plan to vaccinate residents of Guantanamo Bay was announced under the Trump administration and was rolled out on Jan. 9, 2021 — nearly two weeks before U.S. President Joe Biden took office — to Tier 1A groups, which included healthcare workers, emergency responders, and law enforcement. On January 25, the U.S. Naval Hospital at Guantanamo Bay expanded vaccinations to their Tier 1B groups to then include front-line essential workers and Tier 1C individuals with high-risk medical conditions and those over age 65.", "At the time, it was not immediately clear whether detainees at the facility would also be vaccinated, until the Department of Defense (DOD) announced a plan on Jan. 29 to give the COVID-19 vaccination on a voluntary basis to detainees held in the Guantanamo Bay prison camp. In a statement sent to Snopes, DOD Spokesman Mike Howard said the following:", "The Department of Defense authorized U.S. Southern Command and Joint Task Force – Guantanamo Bay to offer and administer vaccines to detainees and prisoners under their care. COVID-19 vaccinations will be offered to all detainees and prisoners. It will be administered on a voluntary basis and in accordance with the Department's priority distribution plan. Authorization came in the form of a memorandum signed January 27, 2021 by Terry Adirim, Principal Deputy Assistant Secretary of Defense for Health Affairs.", "However, that plan was soon halted. In a tweet dated posted the next day, Pentagon Press Secretary John Kirby announced that the plan to immunize inmates at Guantanamo Bay had been put on pause.", "Snopes contacted DOD Spokesperson Lieutenant Col. Kenneth Howard to clarify why the plan was put on hold. We were referred to a media briefing held on Feb. 2, in which Kirby addressed questions regarding COVID-19 vaccine administration at Guantanamo Bay.", "https://www.dvidshub.net/video/782314/pentagon-press-secretary-holds-briefing", "In the briefing, Kirby was asked specifically why the decision was made to begin vaccinating the prisoners in the first place, and under which administration. Kirby appeared to confirm that the vaccination plan had been underway before Biden took office, but his explanation was unclear:", "The Department had a vaccination plan, a schema if you will, for phasing in the vaccination of American men and women who support the military, their workforce -- different phases. The goal being, of course, to vaccinate those that needed it the earliest and the fastest -- you know, health care workers and -- that -- and the supporting staff to them, for instance, were -- you know right at the top of the list.", "[…]", "The vaccination plan underway was underway before President Biden took office, before Secretary Austin took office. That's not an -- that's not to impugn that decision-making process at all but just to answer your question that that was -- that scheme was already underway and being executed.", "When asked why the Guantanamo Bay immunization plan was put on hold, Kirby said that it was to provide an opportunity to better understand how the base will move through its planned phases and “just to take a look to make that we better understand that process.”", "“Again, as I mentioned over the weekend in keeping with our desire to make sure that the health and well-being of our troops and their families are really foremost in mind,” he added.", "The DOD was not able to tell Snopes how many people at Guantanamo Bay had been infected with the novel coronavirus or how many had received the vaccination at the time of this writing. We were referred to the U.S. Southern Command Public Affairs, which oversees the JTF GTMO facility. In a phone interview, Major Gregory McElwain of JTF GTMO said he was not able to release the number of COVID-19 confirmed cases at the base, nor how many immunizations had been administered to personnel. We will update the article accordingly.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]