["“DON’T BUY ANYTHING FROM OLD CITY PISTA HOUSE AS WELL DO NOT BUY FROM KARACHI BAKERY”, reads a message posted along with a video where a man can be seen complaining about the quality of the food at the store. The message urges social media users to not buy anything from Pista House, a bakery chain based in Hyderabad. The same video posted by a Facebook user named Sanjay Jain DeenDayal has been shared more than 400 times.", "DON’T BUY ANYTHING FROM OLD CITY PISTA HOUSE AS WELL DO NOT BUY FROM KARACHI BAKERY", "Posted by Sanjay Jain DeenDayal on Sunday, 21 July 2019", "Several other individuals have shared the video on Facebook with a similar narrative.", "The same video is circulating on Facebook with the following claim in Telugu, “హైదరాబాద్ లోని KARACHI BAKERY లో ఐటమ్స్ చూడండి.. ఎలా పాచిపోయాయో (See items in Karachi Bakery, Hyderabad -translated)”.", "The video is also circulating on social media with a claim that it’s from Moti Bakery, Ahmedabad.", "Alt News has received requests to fact-check the video on its official App where it is claimed that this video was shot at Naaz Bakery, Pune.", "On a closer analysis of the video, we found that the label on the food packets reads, “Treats Bakery”. A Google search reveals that the store shown in the video is Treats Bakery, Karachi and NOT Pista House, Hyderabad.", "On further searching for Treats Bakery, Karachi, Alt News found a clarification video in which Pakistani food authority personnel along with the owner and the customer can be seen.", "Mohammed Tehseen, the man who claims to be the food safety officer said, “We had received a complaint through social media that a kid had vomited after eating stale food product. Within half an hour, we reached the spot with police and took action.”", "The customer who had complained about his child’s upset stomach said, “Yesterday, a sudden incident took place where there was a misunderstanding. The kid had actually eaten a Pizza after which a piece of the food item had stuck in his throat due to which he started vomiting. We later came to know that it was ketchup and not blood.” He further appreciated the Sindh Food Authorities [SFA] for the timely action and I have no complaints with the owner of the bakery as well.", "In conclusion, a video of an enraged customer involved in an altercation with the management of a bakery shop in Karachi, Pakistan was falsely attributed to several famous bakeries across India.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]