["Sen. Josh Hawley, R-Mo., speaks to reporters as he returns to the Senate chamber on Jan. 7, 2021. (AP)", "Hawley was referring to a demonstration held by activist group ShutDownDC, which livestreamed the demonstration.", "The Youtube video shows a protest that, while disruptive, did not include threats or attempts to break inside.", "Police reports conflict with Hawley’s account.", "Before he objected to election results in two states at the Capitol, Missouri Sen. Josh Hawley told his followers about an incident occurring at his Vienna, Va., home near Washington while Hawley was in Missouri.", "\"Tonight while I was in Missouri, Antifa scumbags came to our place in DC and threatened my wife and newborn daughter, who can’t travel,\" he wrote. \"They screamed threats, vandalized, and tried to pound open our door. Let me be clear: My family & I will not be intimidated by leftwing violence.\"", "He was referring to a demonstration held by activist group ShutDownDC. The group was protesting Hawley’s announcement that he would object to electoral votes from some states when the Senate convened Wednesday to certify the results of November’s election. President Donald Trump has claimed without evidence that the election was riddled with election fraud. PolitiFact and other independent fact-checkers have found these claims of voter fraud to be false.", "Hawley’s tweet got traction on social media, and Missouri Gov. Mike Parson on Wednesday equated Hawley’s claim to the violence by Trump supporters at the U.S. Capitol.", "So what happened at Hawley’s house? Around 7:45 p.m. Jan. 4, police showed up to the demonstration, and their account of the event was much different from Hawley’s.", "\"People were peaceful,\" officer Juan Vazquez, a spokesman for the Vienna Police Department, told the Associated Press.", "Vasquez said the protesters violated several laws, such as a Virginia law banning picketing in front of a house, a town ordinance against being loud in front of a home and a littering code as protesters wrote messages with chalk on the sidewalk. But Vasquez said that when officers explained the violations, \"everyone just left.\"", "\"There were no issues, no arrests,\" he said. \"We didn’t think it was that big of a deal.\"", "ShutDownDC livestreamed the entire demonstration on YouTube. The video shows a protest that, while disruptive, included no threats and no attempts to break inside. There was also no violence. However, protesters wrote messages on the sidewalk with chalk and were warned by police for that.", "There were about 15 people there, according to the Washington Post.", "Protesters shouted chants such as \"shame on Hawley\" and \"protect democracy from the GOP.\" Protesters also lit candles, held signs, gave speeches and walked up to his door to deliver a copy of the U.S. Constitution.", "Phil Letsou, Hawley’s deputy communications director, pointed to a moment in the video where protesters exchange words with Hawley’s wife and neighbors who came outside. The wife and the neighbors asked the protesters to leave, which they refused, but the protesters did not threaten, commit violence, vandalize or attempt to break in.", "The demonstration lasted for about a half hour.", "Hawley said protesters at his Virginia home \"screamed threats, vandalized, and tried to pound open (his) door.\"", "This conflicts with police accounts of the event and a video showing the full demonstration. The demonstration was disruptive, but the full video shows it was not as violent as he made it sound.", "We rate this claim Mostly False.", "Josh Hawley on Twitter, Jan. 4, 2021", "PolitiFact, Fact-checking false claims about the 2020 election, Nov. 19, 2020", "The Associated Press, AP FACT CHECK: Trump’s claims of vote rigging are all wrong, Dec. 2, 2020", "The Associated Press, Police: Protesters outside Sen. Hawley’s home were peaceful, Jan. 5, 2021", "YouTube, Vigil For Democracy, Jan. 4, 2021", "The Washington Post, Sen. Josh Hawley says ‘Antifa scumbags’ terrorized his family’s Virginia home. Police called the protesters ‘peaceful’, Jan. 5, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]