["About this rating", "During the first three months of 2018, President Trump made good on a core campaign promise by announcing a series of import tariffs to protect American industries from what he described as the unfair trade practices of other countries.", "In January, he imposed tariffs on washing machines and solar panels aimed at reducing cheap imports from China and South Korea. A few weeks later, on 1 March, he announced a 10 percent tariff on aluminum imports and a 25 percent tariff on steel.", "The latter had the unintended consequence of sparking a stock sell-off on Wall Street, reflecting investors' fears of a looming international trade war and inflation. Predictably, the stock prices of American steel producers rose in response to the tariff announcement. Those of auto makers and other businesses heavily dependent on foreign steel took a hit.", "One of the latter was the crane manufacturer Manitowoc, whose share price tumbled from $29.72 the day before the announcement to $26.93 the day after. That surprised no one, but something curious did happen over the few weeks just prior to Trump's speech. According to a 2 March report by progressive news site Think Progress, billionaire investor Carl Icahn, a former economic regulatory adviser to Trump, sold off $31.3 million worth of Manitowoc stock:", "Billionaire investor and longtime Trump confidant Carl Icahn dumped $31.3 million of stock in a company heavily dependent on steel last week, just days before Trump announced plans to impose steep tariffs on steel imports.", "In a little-noticed SEC filing submitted on February 22, 2018, Icahn disclosed that he systematically sold off nearly 1 million shares of Manitowoc Company Inc. Manitowoc is a “is a leading global manufacturer of cranes and lifting solutions” and, therefore, heavily dependent on steel to make its products.", "The filing came just seven days before a White House event where Trump announced his intention to impose a 25 percent tariff on steel imports.", "Without ever mentioning the phrase \"insider trading,\" the article's author, Judd Legum, implied that such may have taken place, highlighting what he termed the \"impeccable timing\" of Icahn's sell-off. Other sources, including the New York Times, Bloomberg, and Washington Post, noted the timing as well. Bloomberg reported:", "The billionaire investor sold more than a third of his stake in the Manitowoc, Wisconsin-based company, which has a sizable exposure to U.S. steel imports, from Feb. 12 through Feb. 22, according to a regulatory filing last Friday. Icahn remains Manitowoc’s fifth-largest holder with about 4.8 percent of the company’s common shares.", "President Donald Trump started an investigation to determine the effect of steel and aluminum trading on the U.S. last April, citing national security concerns. The U.S. Commerce Department delivered its recommendations for steel to the president on Jan. 11 and for aluminum on Jan. 22. Both were made public on Feb. 16.", "Though Trump and Icahn's relationship stretches back many years and they're sometimes described as \"longtime friends\" (Think Progress called Icahn a \"confidant\" of Trump's), the Washington Post has characterized their association as highly competitive and centered more around business than friendship.", "\"I’ve known him over the years, as an acquaintance. I like him,\" the Post quoted Icahn as saying. “But I don’t see him all that much. I’m pretty much a workaholic.\" Though Icahn served as an special adviser to the president on regulatory reform during the first half of 2017, he resigned the informal, unpaid position when allegations of conflicts of interest surfaced (Icahn denied the allegations). In a 1 March television interview, Icahn said he hadn't had much interaction with Trump \"in the last four or five months.\"", "Even so, Think Progress ran a follow-up article quoting Duke University law professor James D. Cox, an expert on insider trading, to the effect that the timing of Icahn's stock sell-off \"was 'awfully suspicious' and 'unquestionably' warrants a federal investigation\":", "Icahn would have material information even if Trump never had made up his mind he was going to impose the tariffs. There are cases out there that say, you know, look, if your privileged access gives you information that makes you a better person to judge the likelihood of an uncertain event, then that’s inside trading… So if Trump had some long conversation, or even a short conversation, with Icahn or in Icahn’s presence, talking about what are the upsides and downsides of this, that’s something that most people don’t know about, and Icahn would then be able to have a better insight of the possibility, if not likelihood, that Trump would impose these tariffs.", "NPR reported on 3 March that a White House spokesman had dismissed allegations that insider information was exchanged on the grounds that \"Trump has long said both publicly and privately that he wanted to impose tariffs.\"", "On 5 March, the nonpartisan watchdog group Project On Government Oversight (POGO) released a letter calling on the Securities Exchange Commission (SEC) to investigate Icahn for possible insider trading.", "On 7 March, Icahn categorically denied receiving advance notice of the tariff announcement in a terse statement posted on his web site (emphasis in the original):", "We don’t generally comment on rumors, but the recent media speculation regarding our sale of Manitowoc stock calls for a response. We state for the record: Any suggestion that we had prior knowledge of the Trump administration’s announcement of new tariffs on steel imports is categorically untrue. We reduced our position in Manitowoc for legitimate investment reasons having nothing to do with that announcement.", "A 23 February analysis of Icahn's Manitowoc sell-off by research analyst Matt Hogan characterized the company's stock as overvalued and underperforming, and the company's projected growth in comparison to its peer group as \"mediocre.\" Manitowoc's share prices had been falling steadily since 26 January.", "Although there is precedent for pursuing insider trading charges against government officials and others who misappropriate nonpublic government information for profit, academic experts on insider trading told us that the evidentiary bar for proving that an illicit exchange of privileged information took place is quite high, making prosecution in a case like this, given what we know, unlikely. Moreover, the information in question pertained to a policy change with broad potential effects on entire industries. Insider trading charges more typically revolve around the misappropriation of so-called \"material information\" specific to particular companies and products.", "As of this writing, the SEC has not publicly responded to POGO's demand for an investigation, and declined our invitation to comment on the matter.", "Carey, Nick and Banerjee, Arunima.  \"U.S. Steel, Aluminum Stocks Up on Trump's Tariffs, but Other Industries Fear Price Rises.\"\r\n  Reuters.  1 March 2018.", "Deveau, Scott.  \"Icahn Sold Down Stake in Steel-Linked Investment Before Tariffs.\"\r\n  Bloomberg.  2 March 2018.", "DiChristopher, Tom and Rosenfeld, Everett.  \"Carl Icahn Resigned from Trump Adviser Role Ahead of Article Alleging Conflict of Interest.\"\r\n  CNBC.  20 August 2017.", "Eltagouri, Marwa.  \"Shortly Before Trump Announced Tariffs, His Former Adviser Dumped Millions in Steel-Related Stocks.\"\r\n  The Washington Post.  2 March 2018.", "Harwell, Drew.  \"Inside the Rocky Bromance of Donald Trump and Carl Icahn.\"\r\n  The Washington Post.  30 April 2016.", "Henning, Peter J.  \"The Fine Line Between Political Intelligence and Insider Trading.\"\r\n  The New York Times.  8 April 2013.", "Hogan, Matt.  \"Why Carl Icahn Just Cut His Manitowoc Stake by 33 Percent.\"\r\n  Seeking Alpha.  23 February 2018.", "Hohmann, James.  \"The Daily 202: Trump Triangulates on Trade. Here Are Five Takeaways from the Tariff Announcement.\"\r\n  The Washington Post.  2 March 2018.", "Legum, Judd.  \"Trump Confidant Dumped Millions in Steel-Related Stock Last Week.\"\r\n  Think Progress.  2 March 2018.", "Legum, Judd and Baird, Addy.  \"This Is What an Insider Trading Expert Thinks About Carl Icahn's Stock Dump.\"\r\n  Think Progress.  5 March 2018.", "Lynch, David J. and Paletta, Damian.  \"Trump Announces Steel and Aluminum Tariffs Thursday Over Objections from Advisers and Republicans.\"\r\n  The Washington Post.  1 March 2018.", "Parks, Miles.  \"Before Trump Announced Tariffs, Icahn Sold Off Millions in Steel-Related Stocks.\"\r\n  NPR.  3 March 2018.", "Swanson, Ana and Plumer, Brad.  \"Trump Slaps Steep Tariffs on Foreign Washing Machines and Solar Products.\"\r\n  The New York Times.  22 January 2018.", "Wattles, Jackie.  \"Trump's Tariff Bombshell: Catch Up Here.\"\r\n  CNN.  5 March 2018.", "CarlIcahn.com.  \"Statement Regarding Manitowoc.\"\r\n  7 March 2018.", "CNBC.  \"CNBC Transcript: Icahn Enterprises Chairman Carl Icahn Speaks with CNBC's Scott Wapner on 'Fast Money Halftime Report' Today.\"\r\n  1 March 2018.", "Project On Government Oversight.  \"POGO Asks SEC to Investigate Carl Icahn for Insider Trading.\"\r\n  5 March 2018.", "U.S. Securities and Exchange Commission.  \"SEC Files Charges in Trading Scheme Involving Confidential Government Information.\"\r\n  24 May 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]