["By Saranac Hale Spencer", "Posted on March 2, 2018", "Q: Did Georgia “ban Muslim culture”?", "A: No. A headline making that claim is based on a proposed state bill that never became law.", "The Georgia legislature passed an anti-masking law in 1951 in order to subdue widespread intimidation by Ku Klux Klan members who wore hoods to conceal their identity.", "Sixty five years later, in 2016, a state representative tried to amend that law so that it would apply to anyone who wears a garment that conceals his or her face in public.", "But criticism that the change was aimed at Muslims prompted the bill’s sponsor, Jason Spencer, to drop it just two days after he filed it.", "“While this bill does not contain language that specifically targets any group, I am mindful of the perception that it has created,” Spencer said in a prepared statement. “My objective was to address radical elements that could pose a threat to public safety.”", "At the time, a false headline based on that bill circulated online saying: “Georgia Becomes First State To BAN Muslim Culture In Historic Move To Restore Western Culture.”", "That headline is still circulating.", "Facebook users recently flagged a story that was posted with it as potentially false. It’s just as wrong now as it was then.", "The original story that accompanied the headline includes a mixture of claims that are true, such as the fact that Spencer had proposed the bill, and claims that are not true, such as “Islam is not a religion.”", "Islam is the second largest religion in the world behind Christianity, and both share their roots with Judaism. Those three major religions are known as the Abrahamic religions since they all recognize Abraham as their first prophet.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "Official Code of Georgia. “§ 16-11-38. Wearing mask, hood, or device which conceals identity of wearer.” LexisNexis. Accessed 2 Mar 2018.", "The State v. Miller. 398 S.E.2d 547. Supreme Court of Georgia. 5 Dec 1990.", "Georgia House of Representatives. “Offenses against public order; wearing mask, hood, or device; change certain provisions.” As pre-filed 15 Nov 2016.", "Gould Sheinin, Aaron. “Lawmaker to withdraw ‘anti-burqa’ bill after wave of criticism.” Atlanta Journal-Constitution. 17 Nov 2016.", "Spencer, Jason. “Rep. Jason Spencer to Withdraw House Bill 3.” Georgia House of Representatives. 17 Nov 2016.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]