["About this rating", "A Los Angeles man by the name of Karp Jensen is married to Danielle Fishel, the actress who played Topanga on “Boy Meets World.” Jensen confirmed that he purchased the infamous box of Cinnamon Toast Crunch that allegedly contained shrimp tails at a Costco located on the corner of Topanga Canyon Boulevard.  However....", "At the time of this publication, it has not yet been independently confirmed that the items found in the Cinnamon Toast Crunch box were shrimp tails.", "Shortly after a Los Angeles-based man named Karp Jensen went viral for allegedly finding cinnamon toast “shrimp tails” in his cereal box, social media users pointed out that the comedian also had a long string of connections to fishy puns. It appeared to be a coincidence of prawntastic proportions.", "A tweet posted by a user of the name Batmanda on March 23, 2021, pointed out that the man behind #Shrimpgate2020 was married to Danielle Fishel, an actress who played Topanga on the 1990s ABC series “Boy Meets World.” In the tweet, Batmanda pointed out other punny similarities, which appeared to some to be too good to be true. One might even say fishy.", "But Jensen confirmed to Snopes in an email that the above tweet is correct and responded as such on Twitter. However, we rate this claim as “Mostly True” because there are a few caveats to note.", "First, a quick recap of the saga known to some as \"Shrimpgate.\"", "In mid-March 2021, Jensen went viral for photographs shared in Twitter posts that he claimed showed “shrimp tails” in his cereal. At the time of this publication, it has not yet been determined by experts whether the items found in the Cinnamon Toast Crunch box were actual shrimp tails, nor has it been confirmed at which point in production they may have contaminated the box. The specimens were reportedly in line to be DNA tested by a crustacean expert named Adam Wall to determine if they are, in fact, the tails of shrimp and what species they may belong to. Cinnamon Toast Crunch producer General Mills denied the possibility that the alleged shrimp tails were mistakenly included in the box during production. (Until further information is revealed by these investigations, we have rated Jensen’s claims about foreign objects in the cereal box as “Unproven.”)", "It is true that Jensen married Danielle Fishel, who played Topanga in \"Boy Meets World,\" in 2018, as reported by People at the time. An Instagram post dated Nov. 4 showed the two on their wedding day:", "And yes, Jensen has been a guest on the Pistol Shrimp Podcast. He even has a pair of “pistol shrimp socks” available for sale on his website — a connection that some online users speculated could be a marketing ploy.", "According to Jensen, the two boxes of Cinnamon Toast Crunch were purchased at a Costco store in Woodland Hills, California, on the morning of March 20, 2021. A Google Maps search revealed that the Woodland Hills Costco is located on the corner of Victory Boulevard and Topanga Canyon Boulevard.", "Snopes readers also asked our team to confirm whether Jensen previously rapped under the pseudonym “Hot Karl,” which we also determined to be true. And yes, he wrote a book titled, “Kanye West Owes Me $300: And Other True Stories from a White Rapper Who Almost Made it Big.”", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]