["A tweet by an account @HAL_India has been shared widely on social media. This tweet responds to Defence Minister Nirmala Sitharaman’s recent statement that the deal for the procurement of 126 Rafale combat aircraft which was sought under the UPA regime fell through because Hindustan Aeronautics Limited (HAL) did not have the required capability to produce them.", "Those who are saying that HAL is not capable of producing Rafale jets should know what we at HAL have produced ✈ MiG-21 ✈ MiG-27 ✈ Jaguar ✈ Hawk ✈ Sukhoi-30 ✈ Dornier 228", "V hv also produced 🚁 Light combat helicopter 🚁 Light utility helicopter 🚁 Chetak 🚁 Dhruv 🚁 Rudra pic.twitter.com/SNlJ5lm92h", "— Hindustan Aeronautics Limited (Parody) (@HAL_India) September 18, 2018", "Posted on September 18, the tweet has been retweeted over 1400 times already. Many social media users have shared it, in the process lauding HAL for ‘standing up for itself’ against the assertion of the Defence Minister over the MMRCA deal which has been mired in controversy. It has been shared widely on certain Facebook pages which includes the official page of the Mumbai Youth Congress. It has also been posted by the page FekuExpress which has over 530,000 followers. Another page which has posted it is Drunk Journalist which has a follower base of over 145,000.", "Why Is Defence Minister Nirmala Sitharaman Lying , And Defaming HAL For Being Incapable of Building #Rafale Planes. HAL…", "Posted by Mumbai Youth Congress on Thursday, September 20, 2018", "Several individual users too have shared this tweet with the claim that HAL has ‘given a befitting reply to Nirmala Sitharaman’.", "As can be seen from the name of the account, the tweet which has been shared so profusely on social media is not from the official account of Hindustan Aeronautics Limited. This is mentioned in the Bio section itself which clarifies that this is an unofficial account. Another point worth noting is that in the tweet which has gone viral, the name of the account, as can be seen, is Hindustan Aeronautics Limited. However, the word ‘parody’ was added to the name of the account later.", "Moreover, HAL has tweeted that the account HAL_India ‘impersonates’ the official handle and that a formal complaint has been lodged with Twitter regarding the same. To this tweet, Hal_India replied, clarifying that it is not the official account of HAL.", "It has come to our notice that Twitter handle @HAL_India impersonates our this official handle @HALHQBLR. A formal complaint has already been lodged with Twitter. All are requested to take a note of this. @DefProdnIndia @drajaykumar_ias @DefenceMinIndia @SpokespersonMoD", "— HAL (@HALHQBLR) September 20, 2018", "There are numerous instances wherein social media users unwittingly fell for unofficial or parody accounts. This tendency has been observed mostly in the context of spoof accounts of mainstream media organisations in general and TV news channels in particular. Social media users are encouraged to check the veracity of the accounts which they may endorse.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]