["The photo was published on Facebook here on December 24, 2019. It has been shared more than 700 times.", "Below is a screenshot of the misleading post:", "The Thai-language caption translates to English as: “Snake eats tortoise, may those who share win a lottery.”", "The same photo was also published here alongside a similar claim in April 2016 in another Facebook post that has been shared more than 250,000 times.", "It was also shared on Twitter here in May 2014 with a similar caption that translates to English as: “A snake ate a tortoise, they both died eventually. It was probably starving.”", "Below is a screenshot of the misleading tweet:", "The photo has been circulated in a misleading context; it actually shows a sculpture of a snake created by Thai artist Chatchawan Amsomkid.", "Amsomkid told AFP via Facebook Messenger on December 26 that he created the metal sculpture entitled “Greedy”. It can be seen here in the pamphlet (pg. 8) for his 2014 solo exhibition, “In The Serpent's Belly.”", "Below is a screenshot of the photo:", "“The photo that has circulated in social media posts was shot during the preparation of the event. As you can see there are two metal pieces in the photo, they were used to carry the sculpture up to the exhibition,” he told AFP.", "“It was just about noon, the building’s staff were on break and they came down. I imagine that they found the sculpture interesting, so they took some photos.”", "A reverse Google image search found the exact photo was published here on May 20, 2014, in an article by International Business Times that debunked a claim that the snake had eaten a wok.", "The article’s headline reads: “'Python Swallows A Wok' is Hoax, Photo of Snake is a Sculpture”.", "Below is a screenshot of the photo in the misleading post (L) and the photo in the International Business Times report (R):", "In June 2014, the Thai Public Broadcasting Service also covered the misinformation about the sculpture, reporting on Facebook here that it was created by a Thai artist.", "The post’s Thai caption translates to English in part as:", "“Chatchawan Amsomkid does not take offense to the public for misunderstanding, and admitted that reading comments from audiences outside the art scene actually helps him to create new ideas for his future works.”", "The post adds that the sculpture is a “metaphor of greed, which destroys everything” and is a “satirical take on a society of corruption.”", "Below is a screenshot of Thai PBS’ post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]