["By Angelo Fichera", "Posted on May 21, 2018", "Q: Did the alleged gunman in the deadly shooting at Santa Fe High School confess “love for Obama”?", "A: No. That story was first published on a self-described satirical website.", "The alleged 17-year-old gunman who authorities say confessed to the shooting at Santa Fe High School in Texas last week — which killed eight classmates and two teachers — did not tell police that he had “love” for former President Barack Obama. Nor is there any evidence that Dimitrios Pagourtzis said he hoped to “end gun violence” by carrying out another mass shooting.", "Yet those false claims circulated online in recent days after a self-described satirical website carried a May 18 story stating as much. The story was then picked up elsewhere, including on viralitythings.us, which did not label it as satire. Facebook users rightly flagged the report as potentially false.", "The article originated on Daily World Update, a website that routinely labels its work as satire. But its posts are often republished and treated as fact.", "The piece is filled with absurd statements that might betray its dubiousness — for those who read beyond the headline.", "For instance, it refers to a “Texas Rangers Inner-City Cooperative that pairs wealthy white folks with impoverished black and Latino kids to make them some extra money mowing lawns and doing some gardening.” There is no evidence of such a cooperative, and certainly not one associated with the actor Chuck Norris (known for his role in Walker, Texas Ranger), as the story says.", "Authorities have said Pagourtzis confessed to the shooting, but have not determined a motive for the attack.", "False news often percolates amid national tragedies, as affirmed by the misinformation shared after the school shooting in Parkland, Florida.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories flagged by readers on the social media network.", "“About.” Daily World Update. Accessed 21 May 2018.", "“BREAKING: Santa Fe Killer Confesses His Love For Obama.” Daily World Update. 18 May 2018.", "“BREAKING: Santa Fe Killer Confesses His Love For Obama.” Viralitythings.us. 19 May 2018.", "Horwitz, Jeff, and Juan A. Lozano. “In deadly school shooting, a confession but motive a mystery.” Associated Press. 19 May 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]