["The abrogation of key provisions of Article 370 has given rise to a deluge of misinformation online. In the latest such attempt, a collage of multiple photographs has been circulated on social media to portray the Indian government’s brutality in Kashmir.", "If you cannot raise voice for humanity, then you have no right to live in society, How do those people, whose Kashmiri brothers have been prisoners for 28 days and are suffering from hunger, sleep in peace The Sanghis should not be happy. @UN @hrw#28DaysOfKashmirShutdown pic.twitter.com/CVDpVwqnZ0", "— MOHD FAHEEM KHAN (@MOHDFAH96579422) September 2, 2019", "The collage has been shared using several hashtags like #28DaysOfKashmirShutdown, #KashmirBleedsUNSleeps, #KashmirUnderThreat, etc. It has also been shared on Facebook.", "#28DaysOfKashmirShutdown", "Posted by Emran Ansary on Monday, 2 September 2019", "A fact-check of these images reveals that they are old and unrelated to recent events unfolded in Kashmir.", "We found this image in a 2018 blogpost which claimed that it is from Kashmir. Alt News was unable to confirm the same however, its existence last year proves that it cannot depict recent brutality in the region.", "The image of the wounded boy was found in a magazine which ascribed it to renowned photograph Steve McCurry. The picture was uploaded by the magazine in 2015 described as, “Kabul, Afghanistan.”", "This image was shot in Kashmir but in 2017. Getty Images describes it as, “Indian police officials arrest a Kashmiri youth during clashes after Friday congregational prayers outside The Jamia Masjid in Srinagar on May 19, 2017.”", "This photograph was taken during the funeral of 16-year-old Kaiser Ahmad who was killed in Kashmir. According to the boy’s parents, he died in police custody due to torture, however, the police refuted any involvement in his death. The image was uploaded by Getty Images on November 5, 2016.", "The image of a young girl with pellet injuries was uploaded by Al Jazeera in 2016. It was shot in Srinagar.", "The above photograph was found in a 2010 blogpost which claimed that it was shot in Kashmir.", "The oldest instance of this image, taken from a different angle, was uploaded by Shutterstock in 2004 described as, “Sameena Sister of Rafiq Ahmad Throws Her Veil at a Police Officer’s Feet Begging Him for the Release of Her Brother during a Demonstration for His Release.”", "This photograph was used in a 2016 Medium article on the book ‘Do You Remember Kunan Poshpora?’, which is about – “Kunan and Poshpora, the twin villages in Kashmir became the site of mass rape of women and sexual torture of men by the Indian Armed Forces.” The image has been credited to a Reuters photographer Danish Ismail.", "We were unable to ascertain details about one of the photographs from the collage. Our fact-check, however, found that eight out of the nine images were old thus unrepresentative of recent events in Kashmir.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]