["About this rating", "In August 2014, interest in an in-development product called \"Undercover Colors\" swept the social web. According to the students who hatched the idea behind Undercover Colors, this nail polish formula would work to detect the presence of drugs commonly used to facilitate date rape.", "Undercover Colors maintained a Facebook page, on which the company's social media team explained why the product was conceived and how it would work:", "While date rape drugs are often used to facilitate sexual assault, very little science exists for their detection. Our goal is to invent technologies that empower women to protect themselves from this heinous and quietly pervasive crime.", "For our first product, we are developing a nail polish that changes color when it comes in contact with date rape drugs such as Rohypnol, Xanax, and GHB. With our nail polish, any woman will be empowered to discreetly ensure her safety by simply stirring her drink with her finger. If her nail polish changes color, she'll know that something is wrong.", "However, Undercover Colors didn't demonstrate they had anything more tangible than a concept: we saw no evidence that the start-up had produced an effective prototype, and some critics maintained that the concept of such a drug-detecting fingernail polish wasn't even a feasible one:", "While the media cheers, we suffer from a severe lack of any actual data on whether these testing kits function. A study of commercially available \"date-rape\" drug testing coasters found that they were unreliable — changing color for things like different brands of mineral water, taking an extremely long time for ketamine, and giving a false positive once milk was used. Another study of commercially available card testing kits found that in laboratory conditions, testers only correctly detected two out of three drugged samples. An interactive lesson at University at Buffalo found that the GHB test was only an acid test. Anything acidic: wines, fruit juices, would have caused it to turn positive. Compounding the issue, GHB also occurs naturally in wines.", "While the most frequently used drug in date rapes or DFSAs (drug facilitated sexual assaults) is alcohol, multiple studies found the most common substances were cannabis, cocaine, and MDMA. GHB and Rohypnol were found to be relatively rare.", "These tests focus their attention on three to four drugs, GHB (y-Hydroxybutyric acid), Rohypnol or “roofies” (flunitrazepam), Xanax (alprazolam), and Special K (ketamine). All of these drugs can weaken your resolve, and knock you out at a high enough dosage. Even if these kits worked and were 100% reliable, this is a losing battle. Wikipedia lists over 100 benzodiazepines like Xanax and Rohypnol including phenazepam (which can cause you to black out for days) and etizolam. Going beyond benzos adds hundreds more sedatives/hypnotics like Benadryl (diphenhydramine) and Unisom Sleep Tabs (doxylamine) which can be bought over the counter.", "The designer drug explosions means that there’s an entire galaxy of drugs that are just a molecular tweak away. Rapists watch TV and read the Huffington Post. They will know when these things come out and they’ll adapt accordingly. So pack up a 40-pound combined gas chromatograph and the mass spectrometer, and let's drop in a Raman spectrometer as well to test every drink and then learn to read the results. But this too, is futile.", "The social media pages associated with the nail polish product have since been taken down, and the Undercover Colors website switched to promoting a product called SipChips: single-use, individually wrapped drug test kits that could be unobtrusively attached to key fobs or cellphones.  The Undercover Colors FAQ explained why the company \"moved away\" from marketing a drug-detecting nail polish product:", "There are several reasons why the product has evolved -- from the limitations with the chemistry of the nail polish format to consumer feedback throughout our development process. Consumers told us they wanted a format that was gender neutral, portable, discreet and accurate, and we believe the product we have today meets those needs.", "In December 2018, Undercover Colors announced the release of the SipChip product that took the place of the originally planned nail polish:", "Specializing in the evolution of lateral flow technology, Undercover Colors spent years creating the discreet device now known as SipChip™ which detects more of the drugs most commonly used to facilitate sexual assault – in over 100 beverages – than any other test on the market. If someone has suspicions about their beverage, just one drop of their drink on the SipChip™ can determine whether or not it is safe to drink. Similar to a pregnancy test, the lateral flow technology shows one line if the SipChip™ detects the presence of drugs, two if it does not.", "While interest in nail polish and chips that detect common drugs used in date rape was initially high, not everyone was pleased with the idea. Rape prevention advocates posited that the nail polish drug detection system was a form of tacit victim blaming, one which suggested the onus should be on potential victims to prevent rape, as feminist writer Jessica Valenti opined in a column for the Guardian:", "I'm appreciative that young men like want to curb sexual assault, but anything that puts the onus on women to \"discreetly\" keep from being raped misses the point. We should be trying to stop rape, not just individually avoid it.", "Prevention tips or products that focus on what women do or wear aren't just ineffective, they leave room for victim-blaming when those steps aren't taken. Didn't wear your anti-rape underwear? Well what did you expect?", "Business Wire.   \"Undercover Colors Debuts SipChip™, The Most Comprehensive Date Rape Drug Detection Device Designed for Personal Use.\"\r\n    12 December 2018.", "Kim LaCapria is a former writer for Snopes.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]