["About this rating", "The Prohibition era lasted little more than a decade — from 1920 to 1933 — but its effects stretched far beyond those years.  Speakeasies and saloons are still lionized by historical fetishists, and slang from that era is still in American English today.", "One popular story about Prohibition is that the cocktail (using both the general definition of a \"mixed drink\" and the specific one of spirits, bitters, and sugar) emerged as a wholly American invention, straight from the alcohol ban. The popular mixed drinks, or so the story goes, were created to dilute or mask the pungent (if not outright nasty) taste of moonshine or bathtub brew:", "Where beer and wine had previously been the drinks of choice, now alcohol was drank much more frequently, as it was easier to transport and took up less space, making it cheaper for speakeasy patrons. It was at this time that the \"cocktail” was born, which had virtually been non-existent prior to Prohibition....", "This sounds plausible, bolstered by a mixology recipe book a bit later in the century, penned by a bartender named \"Professor\" Jerry Thomas and advancing the claim that cocktails came straight from the States.", "But human nature being what it is, how plausible is it that humanity has been consuming fermented drinks for thousands of years and only stumbled onto cocktails in the past few hundred?  As it turns out, not very.  Despite \"Professor\" Thomas's valuable contributions to cocktail culture, not even the word is American: the first time the word can be found in print (at least where the drinks are concerned) is in 1798 — in a London newspaper.  (Thomas worked in London before returning to the United States.)", "So Americans didn't invent the cocktail, after all.  But they did help popularize it — just not during Prohibition.  Mixed drinks actually showed up long before the 1920s; they were already well known in colonial times, an era in which alcohol was consumed routinely and enthusiastically.  A 1991 article in the Organization of American Historians Magazine of History has alcohol consumption in the late 1700s at about three and a half gallons per person a year, or double today's rates:", "By 1770 Americans consumed alcohol regularly with every meal. Many people began the day with an \"eye-opener\" and closed it with a nightcap. People of all ages drank, including toddlers who finished off the heavily sugared portion at the bottom of a parent's mug of rum toddy.", "That alcohol was often in the form of various mixed drinks, but they didn't officially evolve into the cocktail (officially, a mixture of \"aromatic bitters\" mixed into spirit with water and a dash of sugar) until a bit later.  Bitters, which are highly concentrated plant extracts, were used medicinally for centuries, but became famous in the 1800s in Venezuela (home of Angostura) when they were used to treat Simon Bolivar's army. As bitters were often taken with spirits and sugar to make them more palatable, they quickly went from medicinal to recreational use.", "Back in the United States, the rate of alcohol consumption was rising quickly. Historian W.J. Rorabaugh writes that by the 1830s, the average person drank around four gallons of alcoholic beverages per year:", "...after 1800, as the quantity of spirits consumed increased, the total quantity of alcohol consumed from all sources until it reached a peak of nearly 4 gallons per capita in 1830. This rate of consumption was the highest in the annals of the United States.  After reaching this peak, consumption fell sharply under the influence of the temperance movement, and since 1840 its highest levels have been under 2 gallons — less than half the rate of consumption in the 1820s.", "According to cocktail historian David Wondrich, bitters were an easy addition to the ferment, with the added bonus of being medicinal (early advertising sold bitters as hangover cures).  It was an addition to which both Europeans and Americans took enthusiastically:", "In any case, by the middle of the 1700s, gin and bitters, brandy and bitters, and wine and bitters all appear frequently on both sides of the Atlantic. Indeed, in May 1783, when British officers were meeting with George Washington and his staff to arrange the British surrender of New York, “Washington pulled out his watch,” as the Loyalist William Smith recorded in his diary, “and observing that it was near Dinner Time, offered Wine and Bitters.” With this we should bear in mind the New Orleans Daily Picayune's 1844 observation that “although the term of ‘wine-and-bitters’ be in appearance specific, it is indeed one of the most generic which the wealth of the English language furnishes,” and it is easily comprehended as the cocktail itself. Was the Father of His Country the host of the first cocktail hour on record? It's possible.", "Alcohol use continued to grow until Prohibition cut it, but not by as much as temperance proponents thought it might. Speakeasies quickly sprang up like mushrooms after a rain; a thriving black market brought in beer, wine, and liquor; and everyone knew someone with a still somewhere.", "But speakeasies, where the threat of raids loomed every moment, weren't a place to nurse your elegant and sophisticated mixed drink, no matter what you might have heard.  They were instead a place to bolt down alcoholic drinks as quickly as possible, writes Wondrich:", "So if you desire a real speakeasy tipple, you can have either a glass of Champagne or a whiskey-and-ginger-ale highball. That’s about it. All that talk of the fabulous cocktails made in the midst of Prohibition in order to mask the flavors of badly made alcohol is wrong. When your drinking experience is an illegal one, you just want to get down to drinking.", "After Prohibition ended, \"Americans didn't know a damn thing about drinking,\" Esquire lamented. (The magazine was launched in 1933, the same year Prohibition was repealed.)  The elegant tastes of medicinal bitters and delicately mixed drinks were all but forgotten:", "Fourteen years of adulterate alcohol and literally criminal bartenders had turned us into a nation of indiscriminate liquor swillers, people who thought the right wine for filet of sole was gin and orange juice.", "So clearly, cocktail culture had to be built up again from scratch. Luckily, the Old World had never even considered an alcohol ban and so the recipes were there, waiting to return to the United States, once Prohibition was repealed.", "And what of the word \"cocktail?\" How did a drink that began as a hangover cure and medicinal morning pick-me-up get its name?  Its history is murky and its etymology difficult to pin down, but cocktail historian David Wondrich says he thinks his theory is \"pretty solid\":", "I actually know where \"cocktail\" came from, pretty solidly. It's in the book. Ginger was used in the horse trade to make a horse stick its tail up. They'd put it in its ass. If you had an old horse you were trying to sell, you would put some ginger up its butt, and it would cock its tail up and be frisky. That was known as “cock-tail.” It comes from that. It became this morning thing. Something to cock your tail up, like an eye-opener. I’m almost positive that’s where it’s from.", "Brown, Jared.   \"The Surprising History of the Cocktail.\"\r\n    The Telegraph.   13 December 2012.", "Rorabaugh, W.J.   \"The Alcoholic Republic: An American Tradition.\"\r\n    Oxford University Press.    1979.", "Rorabaugh, W.J.   \"Alcohol in America.\"\r\n    OAH Magazine of History.    Fall 1991.", "Sherwood, Alison.   \"What Are Bitters and How Are They Used in Cocktails?\"\r\n    Journal Sentinel.    18 March 2014.", "Smith, Peter.   \"A Brief History of Bitters.\"\r\n    Smithsonian.com.    20 March 2012.", "Thomas, Jerry.    \"The Bartender's Guide: How to Mix Drinks or the Bon Vivant's Companion: 1862 Edition\"\r\n    Createspace Independendent Publishing Platform.    2010.", "Wondrich, David.   \"Imbibe!: From Absinthe Cocktail to Whiskey Smash, a Salute in Stories and Drinks to \"Professor\" Jerry Thomas, Pioneer of the American Bar Featuring the Original Formulae.\"\r\n    Penguin Group.    2007, 2015.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]