["Erie County Clerk Michael P. Kearns (Harry Scull Jr./Buffalo News file photo)", "Erie County Clerk Michael Kearns has emerged as one of the most vocal opponents of New York state’s new law allowing people who are in the country illegally to obtain driver’s licenses.", "In a tweet on the day the New York State Senate passed the Green Light Bill and Gov. Andrew Cuomo signed it, Kearns, whose office oversees the Erie County Department of Motor Vehicles, claimed the law offers undocumented immigrants \"protections that US citizens don’t receive.\"", "When reached by phone, Kearns said he was referring to a section in the new law that requires motor vehicle commissioners to give notice to an individual within three days in the event an immigration enforcement agency requests information about that individual.", "Drivers whose information is requested by other law enforcement agencies do not get a three-day notice.", "\"There’s a different standard,\" he said. \"That’s a protection that I don’t have now.\"", "New York lawmakers’ decision to grant driver’s licenses to undocumented immigrants has provoked a strong reaction from people who are opposed to the idea. So we decided to look into Kearns’ claim.", "The Green Light Law allows undocumented immigrants to obtain standard (non-commercial) driver’s licenses.", "It prevents DMV employees from turning over information to immigration enforcement agencies without a judicial warrant or court order. If a warrant or court order is received by the DMV, directing employees to hand over records or information about a driver to an immigration authority, DMV commissioners must notify the driver, regardless of the driver’s immigration status, about the request within three days.", "Kearns claims that this notification is a special protection for undocumented drivers. While this provision may alert undocumented drivers that Immigration and Customs Enforcement or Customs and Border Protection agents are asking about them, one expert we spoke with noted that it could help everyone.", "There is a history of ICE wrongly targeting U.S. citizens for deportation, said Kendra Sena, senior staff attorney at the Government Law Center at Albany Law School.", "In 2008, a man born in North Carolina, with no Mexican heritage, was wrongly deported to Mexico and eventually settled his case with the federal government. In 2013, Syracuse University published a study showing ICE had issued detainers, a notice that they planned to apprehend an individual, for 834 U.S. citizens and 28,489 legal permanent residents, in the previous four years. In the last two years, ICE’s efforts to detain naturalized and native-born U.S. citizens have made headlines, including the case of a U.S. Marine born in Michigan.", "Sena said the notice provision applies in the immigration context but not in others because the consequences of immigration action can be so severe.", "The provision that provides notice to drivers who have caught the attention of immigration enforcement applies to every driver, regardless of their immigration status, said Fabien Levy, press secretary for the State Attorney General’s Office.", "Under the law, the response by DMV to agencies requesting information does not change based on the immigration status of the driver, said Nicole Hallett, director of the Community Justice Clinic at the University at Buffalo School of Law.", "\"There is no scenario in which an agency would make two requests for information, one regarding a citizen and one regarding an undocumented immigrant, and would be permitted to comply with the former but not the latter,\" Hallett said. \"The DMV would either be prohibited from complying in both or be permitted to comply in both depending on the identity of the agency.\"", "Kearns said that undocumented immigrants receive protections under the Green Light law that are not afforded to U.S. citizens.", "Under the law, if an immigration enforcement agency obtains a court order or judicial warrant to secure information about a driver, the DMV must notify the driver within three days. This notification would happen regardless of whether the driver is in the country legally or not.", "While this provision may help more undocumented drivers than those drivers with documentation, all are treated equally under this provision.", "We rate Kearns’ statement False.", "Tweet, @Mickey_Kearns, June 17, 2019. Accessed June 19, 2019.", "Phone interviews, Erie County Clerk Michael Kearns, June 20, 28, 2019.", "Text of Green Light Law, Assembly Bill A3675B, \"Relates to the ‘driver's license access and privacy act’; repealer,\" June 17, 2019. Accessed June 27, 2019.", "Email interview, Nicole Hallett, assistant clinical professor; director, Community Justice Clinic, University at Buffalo School of Law, June 26, 2019.", "Email, phone interviews, Kate Madigan, Legislative Director, Assemblyman Marcos A. Crespo, June 26, 2019.", "Email, phone interviews, Fabian Levy, press secretary, Office of New York State Attorney General Letitia James, June 26, 28, 2019.", "Phone interview, Kendra Sena, senior staff attorney, Government Law Center, Albany Law School, June 27, 2019.", "\"Erie County clerk: ‘I will not be granting licenses to illegal immigrants,’\" The Buffalo News, June 18, 2019. Accessed June 26, 2019.", "Phone interview, Professor Theo Liebmann, Hofstra University, Maurice A. Deane School of Law, June 27, 2019.", "Email, phone interviews, Michael Fraser, director of communications, Assembly Minority Leader Brian Kolb, June 27, 2019.", "\"Born in Philadelphia, U.S. citizen says he was held for deportation to Jamaica at ICE’s request,\" Washington Post, Dec. 4, 2018. Accessed June 28, 2019.", "\"Who are the targets of ICE’s detainers?\" Transactional Records Access Clearinghouse, Syracuse University, Feb, 20, 2013. Accessed June 28, 2019.", "\"U.S. Citizen Detained by ICE is Awarded $55,000 Settlement,\" New York Times. Accessed June 28, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]