["The video was shared in this Facebook post on December 2, 2020.", "The text superimposed on the three-minute, 26-second video reads: “Karachi Pakistan today”", "The post’s Sinhala-language caption translates to English as: “May all the people in the world be protected”", "The claim circulated just hours before tropical cyclone Burevi made landfall in Sri Lanka, before hitting India about 24 hours later.", "The video was shared with a similar claim on Facebook here, here, here, here and here.", "The claim is false; the footage actually shows a tsunami that hit Japan in 2011.", "A reverse image search with video keyframes obtained using digital verification tool InVID-WeVerify found this YouTube clip published on October 25, 2012. It is titled; “Tsunami gaining speed on Minato district, Ishinomaki city [Video provided by viewers]”.", "It was published by an account named FNN11 - an official channel of Fuji News.", "From the 35-second mark to the four-minute one-second mark, the YouTube clip is identical to the footage featured in the misleading Facebook posts, as seen in the below screenshot comparisons:", "The same video can be seen in this YouTube clip published on April 30, 2011 titled ‘2011 Japan Tsunami: Ishinomaki [stabilized with Deshaker]’.", "The video was filmed here in the Japanese city of Ishinomaki.", "AFP has previously fact checked the video here and here after it circulated with other misleading claims.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]