["A long post claiming COVID-19 is not, in fact, caused by a virus but, instead, by a bacterium has gone viral. The post says that Italian doctors, in defiance of the World Health Organization, have found it to be \"nothing more than\" thrombosis, which can be treated with aspirin.", "\"Thanks to Italian Doctors who finally disobeyed WHO's Global Health Law not to perform an autopsy on the dead Coronavirus and they discovered that *It is NOT a VIRUS but BACTERIA* that causes Death!!! It causes Blood Clots to form and results in the Death of the Patient. Families World Wide should start asking for Autopsies on their Dead Relatives!\" the widely shared post states.", "\"Italy beats the so-called Covid-19, which is nothing more than \"Disseminated Intravascular Coagulation\" (Thrombosis).", "\"*And the way to fight or cure it is with \"antibiotics, anti-inflammatories and anticoagulants\" like simple ASPIRIN ... which indicates that this disease has been poorly treated.*\"", "The post was shared as early as May 21, including by a user who said \"Not sure how accurate this information is.\" The post has been widely shared since.", "The novel coronavirus was identified by Chinese authorities on Jan. 7.", "Since then, the Italian Ministry of Health has not announced a discovery of a cure or changed its stance on what causes COVID-19. It continues to describe COVID-19 as a viral disease and explains that antibiotics are an ineffective treatment because the virus is not bacterial.", "The WHO has not prohibited autopsies of COVID-19 patients nor does it have the power to create and enforce laws.", "The WHO and the Centers for Disease Control and Prevention released guidelines for health care workers to safely conduct autopsies of confirmed and suspected COVID-19 patients.", "Viruses are microscopic collections of DNA or RNA coated in proteins. Viruses cannot multiply independently, so they infect host cells. This often kills or damages the host cells.", "Once a virus infects cells, the immune system must fight it. Targeted vaccines bolster the immune system’s ability to fight a specific virus and prevent disease. There is not yet a vaccine for the novel coronavirus that causes COVID-19.", "More:With drivers worried about COVID-19 spreading, here's how your next car could be virus-proof", "“Because viruses don’t have the same components as bacteria, they cannot be killed by antibiotics; only antiviral medications or vaccines can eliminate or reduce the severity of viral diseases,” the National Human Genome Research Institute explains.", "Viruses, like the flu, can rapidly mutate, making new vaccines necessary.", "The WHO addressed confusion about COVID-19’s viral nature and lack of response to antibiotics on its “Myth busters” page.", "“No, antibiotics do not work against viruses, only bacteria,” the website says. “To date, there is no specific medicine recommended to prevent or treat the new coronavirus (2019-nCoV).”", "According to the post, the Italian Ministry of Health concluded that aspirin and other anticoagulants could treat COVID-19, however, medical researchers have not found any evidence to support that claim.", "\"It is now clear that the whole world has been attacking the so-called Coronavirus Pandemic wrongly due to a serious pathophysiological diagnosis error,” a May 25 version of the post says. “According to valuable information from Italian pathologists, ventilators and intensive care units were never needed.”", "The WHO conducted a systematic review of 73 studies into the effects of nonsteroidal anti-inflammatory drugs — NSAIDs — such as ibuprofen, aspirin, disclofenac and naproxen, on acute respiratory viruses and found no evidence to prove aspirin could cure or treat COVID-19.", "Photo gallery:Coronavirus is changing everyday life across the US", "Researchers are expected to complete another clinical trial on the effects of aspirin on COVID-19 patients in June.", "As an example of the anti-inflammatory drug’s ability to treat the virus, the popular social post references “the impressive case” of a family allegedly cured of COVID-19 with aspirin, lemon juice and honey.", "“The next day they woke up as if nothing had happened to them!” the May 2 post says.", "International Fact-Checking Network signatory Rappler fact-checked this alleged cure April 28.", "An early version of the claim was debunked by Brazilian site Agência Lupa on May 15 after circulating on WhatsApp.", "“Italian doctors disobey WHO's global health law, in order not to perform autopsies on people who have died of coronavirus, discovering that it is NOT a VIRUS, but a BACTERIA, which causes death,” the WhatsApp message translates.", "Indian newspaper India Today addressed the claim May 25 after it appeared in an internet article and began circulating on Facebook.", "The viral article was posted to publishing platform “Medium” and is now under investigation for violating the platform's rules.", "India Today shared an achieved version of the article, which it traced to the Nigerian website Efogator.com.", "The Efogator’s article offered no sources to support its claims. When a reader pressed for a source in the comment section, Efogator shared the link to a PolitiFact article that debunked its claims.", "FactCheck.org addressed the claim May 27 in response to similar posts.", "We rate the claim that COVID-19 is a bacterial disease and can be easily treated with aspirin FALSE because it is not supported by our research. The claim has been debunked several times and health officials maintain COVID-19 is caused by a virus  and has no known cure.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]