["About this rating", "In May 2020, social media users began circulating a meme showing the arrest of a suspect whose two areas of exposed skin — his face and shin — appeared to be different in complexion, along with a claim that CNN had altered the image to \"push an agenda\" by \"putting a black guy's head on a lily white dude\":", "The 40-year-old man arrested in the above screenshot was suspected in a knife attack at the Manchester Arndale shopping mall in England on Oct. 11, 2019, in which three people were stabbed and two others injured, according to BBC News:", "Five people were injured in a stabbing at a shopping mall in Manchester, northwest England, and a man is being detained under the UK's Mental Health Act, police said.", "The incident took place at the Arndale Centre at around 11:15 a.m. local time, where a man who was carrying a \"large knife\" began \"lunging and attacking people,\" Assistant Chief Constable Russ Jackson of Greater Manchester Police said.", "Jackson said while the injuries are \"nasty,\" none of them are life-threatening.", "He said police did not know the motivation behind the attack, adding that \"it appears random, and it is brutal.\"", "Following the attack, a man originally was arrested on suspicion, preparation and instigation of an act of terrorism. He is believed to have acted alone.", "A statement tweeted later by Greater Manchester Police said: \"The 40-year-old man, who was arrested on suspicion of committing a terrorism offence, has now been assessed by specialist doctors and compulsorily detained under the Mental Health Act. The investigation will continue in order to fully understand the motives behind the attack.\"", "Whatever the explanation for the difference in shading of the exposed areas circled in red above - lighting, camera angles or skin tone variation - it had nothing to do with CNN's supposedly altering anything.", "BBC News.   \"Manchester Arndale Stabbings: Victim Named as Chloe McGurk.\"\r\n    12 October 2019", "Britton, Bianca.   Anti-Terror Police Investigate Manchester Stabbing Attack That Injured 5.\"\r\n    CNN.   11 October 2019.", "Wilkinson, Damon and Sophie Halle-Richards.   \"Neighbours Say They 'Immediately Recognised' Arndale Stabbing Suspect, As Police Raid North Manchester Flat.\"\r\n    Manchester Evening News.   12 October 2019", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]