["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A recent Facebook post wrongly claims that people don’t die of COVID-19 at home, suggesting, perhaps, that the deaths of hundreds of thousands of people are due to poor medical care, or that the disease that has shuttered so much of the world is a hoax.", "\"Nobody is found dead of corona in their homes.. They all die at the hospital,\" the post says. \"Let that sink in.\"", "The majority of COVID-19 deaths in the United States occur in an in-patient health care setting or at a nursing home or long-term care facility, according to a provisional death count kept by the Centers for Disease Control and Prevention. But as of Sept. 17, nearly 10,000 people had died at home, too.", "A July ProPublica article about home deaths from COVID-19 in Houston describes a woman who died at home while her daughter was calling 911. An autopsy revealed the primary cause of death was COVID-19. They hadn’t realized that she had the disease, but as cases then surged in the Houston area, a rapidly growing number of residents died of COVID-19 at home, according to a review of Houston Fire Department data by ProPublica and NBC News. While many people who die at home aren’t tested for COVID-19, an \"increasing number\" of at-home deaths have been confirmed to show they were caused by the disease, the story says.", "This Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The coronavirus is not a hoax, and you can read all of PolitiFact’s coverage about it here.", "We rate this post False.", "Facebook post, Sept. 7, 2020", "Johns Hopkins University of Medicine, COVID-19 dashboard, visited Sept. 17, 2020", "CNN, A plan to save coronavirus patients from dying at home, April 12, 2020", "ProPublica, A spike in people dying at home suggests coronavirus deaths in Houston may be higher than reported, July 8, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]