["By Robert Farley", "Posted on December 6, 2017", "In a Fox News interview, White House Counselor Kellyanne Conway wrongly claimed that “the Clinton Foundation doesn’t exist anymore.” Contributions to the Clinton Foundation declined in 2016, tax records show, but the charity is still very much operational.", "Conway made her comment about the Clinton Foundation when she was asked about reports of potential political bias by an FBI agent investigating Hillary Clinton’s use of a private email server for government business while secretary of state.", "“It’s very frustrating to many law-abiding Americans who look up and always see a double standard, always see special exceptions for Hillary Clinton,” Conway said Dec. 4 on “Fox and Friends.” “Look, the Clinton Foundation doesn’t exist anymore, which also means they aren’t taking gazillions of dollars from countries that don’t respect women and girls, wink wink.”", "Conway’s inaccurate comment was quickly challenged by Clinton Foundation staff on social media, where they listed some of the foundation’s recent accomplishments.", "“We’ve continued and expanded our work in 2017 – fighting the opioid crisis, promoting renewable energy, opening opportunities for girls and women, and improving health and wellness,” Brian Cookstra, a spokesman for the Clinton Foundation told us via email. “Our work continues to make a difference in the lives of millions across the US and around the world.”", "Recently released tax documents show contributions to the Clinton Foundation dipped in 2016 to $62.9 million. That’s down from $108.9 million in 2015, and from $172.6 million in 2014.", "That led to headlines in conservative news outlets about the decline, including on Breitbart — “Clinton Foundation Donations Plummeted Following Hillary’s Election Loss”– and in the New York Post —  “Donations to Clinton Foundation plunged along with Hillary’s election defeat.”", "But Clinton Foundation officials say the decline in contributions was expected, and not tied to Clinton’s election loss.", "According to Cookstra, there are “some very clear reasons” for the drop in revenue. The Clinton Foundation wrapped up a three-year, $250 million endowment campaign in 2015, and so contributions spiked during those years (and dropped off after), he said. The voluntary restrictions placed on fundraising during the campaign also negatively impacted fundraising, he added.", "In a letter accompanying the foundation’s tax returns, Clinton Foundation CEO Kevin Thurm wrote: “As has been previously reported this year, we saw a decline in revenue in 2016 that we had anticipated. Part of this is attributable to closing out the endowment campaign that ended in 2015, which has helped make our programs more sustainable. In addition, starting in 2015 when Secretary Clinton launched her presidential campaign, we voluntarily adopted restrictions on fundraising. But, as the examples of our progress listed above demonstrate, our programs’ strong work continued in 2016 – and right into 2017.”", "Some of the expanded programs undertaken by the foundation in 2017 include work to address the opioid crisis, improve community health access and improve school nutrition — all of which has been well-documented in various media outlets.", "In August, Charity Navigator gave the Clinton Foundation a rating of four out of four stars. Guidestar says the foundation participates at its platinum level for transparency. And the Better Business Bureau concluded that the foundation met all 20 of its standards for charity accountability. It also enjoys an “A” rating from CharityWatch, a project of the American Institute of Philanthropy. (Early in the last presidential campaign, we debunked Republican claims that only a fraction of donations to the Clinton Foundation go to charitable works. The figure is closer to 88 percent, according to one independent philanthropy watchdog.) Forbes listed the Clinton Foundation as the 36th largest U.S. charity in 2016.", "In early 2017, the Clinton Foundation did dramatically scale back the Clinton Global Initiative, which held an annual conference for corporate, government and nonprofit leaders to brainstorm on how best to tackle world issues. The New York Times reported in February that most of the initiative’s 100 employees had been laid off.", "But the Arkansas Democrat-Gazette reported that while the high-profile annual meeting had been discontinued, CGI did not shut down completely, and would continue to host its CGI University meeting, which annually attracts more than 1,000 student leaders from around the globe. CGI also continues to convene community and government leaders on specific issues, such as a meeting this year to focus on improving women’s access to health care in the Caribbean.", "Conway also said that since the Clinton Foundation doesn’t exist anymore (again, it clearly does), it “means they aren’t taking gazillions of dollars from countries that don’t respect women and girls, wink wink.” During the campaign, then-candidate Donald Trump criticized the Clinton Foundation for accepting millions of dollars from countries that “treat women horribly.” The Washington Post reported that Saudi Arabia, United Arab Emirates, Qatar and Oman were among the countries that have contributed.", "During the campaign, Clinton announced that she was stepping down from the foundation board, and that the foundation would only accept foreign donations for certain “economic development or climate-focused work,” namely from Australia, Canada, Germany, the Netherlands, Norway and the United Kingdom. In August, BuzzFeed reported that the foundation is once again applying for grants from foreign governments. According to Cookstra, in the past year, the government of Germany made contributions to the foundation for the specific purpose of building health clinics in Malawi. He did not provide information on any other foreign donations.", "Meanwhile, House Republicans have been pushing U.S. Attorney General Jeff Sessions to appoint a special counsel to investigate unsubstantiated accusations that the Clinton Foundation accepted donations in exchange for Clinton’s help in allowing Russia to take control of Uranium One, a company with uranium mining rights in the U.S., when she was secretary of state. In November, Sessions asked federal prosecutors to “evaluate” whether the department should open an investigation. During a House judiciary hearing, Sessions rejected the idea that the department is dragging its feet, telling a Republican congressman, “You can have your idea but sometimes we have to study what the facts are and to evaluate whether it meets the standards it requires.”", "We reached out to the White House press office about Conway’s false claim that the Clinton Foundation “doesn’t exist anymore,” but it did not provide a response for publication.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]