["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Officers gather for crowd control near a massive police presence set up outside a house as they investigate a shooting in Philadelphia, Wednesday, Aug. 14, 2019. (AP Photo/Matt Rourke)", "Six police officers were injured in a shooting in Philadelphia on Aug. 14. As with other recent shootings, misinformation claiming it was planned wasn’t far behind.", "The shooting ended after an hours-long standoff with the suspect, who was being served a narcotics warrant. Some Facebook users speculated that the incident was staged. One user with nearly 30,000 followers posted a news clip of the event with a caption that suggested two officers faked gunshot wounds.", "\"WTF!! Philadelphia Shootings Fake AF!!\" the user wrote. \"Police Officers Spray Fake Blood on themselves during Philadelphia Shooting.\" Similar claims were also shared on Reddit.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "One post linked to a broadcast from ABC News on YouTube. Around one hour and 21 minutes into the stream, two officers appear to be putting something on their hands beside a police car. The substance also appears to splatter on the ground.", "The suspicious Facebook posts claim this is fake blood. A comment on the second post suggests that it might instead be a kind of disinfectant containing iodine, which is a dark reddish color.", "We reached out to the Philadelphia Police Department for more context. It said the assertion that its officers were faking their injuries is false.", "\"This is outrageous,\" the department’s public affairs office said in an email. \"Police officers were transported to Temple University Hospital and Albert Einstein Medical Center for gunshot wounds. This video is one of our police officers that suffered a gunshot wound Wednesday.\"", "When asked about the substance that appears in the video, the police department said it’s real blood.", "\"The officer was applying pressure on his arm and when he let go of the pressure blood squirted out,\" the PPD said in an email. \"It is unknown what the other officer was trying to do.\"", "RELATED COVERAGE: Why people believe \"false flag\" conspiracies", "Philadelphia police are known for \"a load and go approach to officer injuries,\" said Jeffrey Bumgarner, head of the Department of Criminal Justice and Political Science at North Dakota State University, in an email. That means officers are often taken to hospitals in police cars rather than waiting for emergency medical services.", "Because the post is not accurate and makes a ridiculous claim, we rate it Pants on Fire!", "ABC News broadcast, Aug. 14, 2019", "Emailed comment from Jeffrey Bumgarner, head of the Department of Criminal Justice and Political Science at North Dakota State University, Aug. 18, 2019", "Facebook post, Aug. 14, 2019", "Facebook post, Aug. 15, 2019", "The New York Times, \"What We Know About the Philadelphia Police Shooting,\" Aug. 15, 2019", "PolitiFact, \"Fact-checking misinformation after the El Paso, Dayton shootings,\" Aug. 5, 2019", "PolitiFact, \"Why do some people think mass shootings are staged every time?\" Aug. 8, 2019", "Reddit post, Aug. 15, 2019", "Emailed statements from the Philadelphia Police Department, Aug. 16 and 19, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]