["About this rating", "When the world celebrated at midnight on Jan. 1, 2020, few foresaw the devastating year that was to come. Previously, in November 2019, a deal was announced that TGI Fridays would soon be sold. The company would also be taken public on the stock market. The total value was set to be $380 million.", "TGI Fridays is poised to become a public listed company again after its parent company, TGIF Holdings, agreed a sale to blank check company Allegro Merger Corp in a deal worth $380m.", "Blank check companies are typically listed organisations with no operations that raise money from investors via an IPO for acquisitions.", "TGIF's holders will receive a combination of cash and stock valued at $30m and Allegro will assume approximately $350m of net debt.", "At the time, Allegro CEO Eric Rosenfeld found TGI Fridays to be an attractive offer: \"Fridays' highly predictable stream of franchise and licensing revenue is very attractive and we believe that Fridays provides a compelling value to our shareholders.\"", "Restaurant Business Online even reported that the deal included something special for shareholders: \"An additional $2 million in Allegro shares will be paid to Fridays’ shareholders if the chain hits certain post-closing performance thresholds, which were not disclosed.\"", "Nation's Restaurant News also published a story that included the \"biggest evolution\" that was set to come to the restaurant chain:", "The biggest evolution coming to TGI Fridays is the brand's refocus on its bar scene. The restaurant chain was initially conceived as a singles' bar 50 years ago, and [TGI Fridays CEO Ray] Blanchette said that he thinks the restaurant has gotten away from that original vision.", "\"I think our bar is a major differentiator versus our core competition, and we believe it could be better leveraged to drive incremental traffic by offering high-quality value-focused social experiences,\" Blanchette, left, said. \"So last week, in the Baltimore market, we kicked off this relaunch program with new drinks, new pricing, an enhanced atmosphere, bartender training, and unique marketing.\"", "A new slogan: \"Happy hours are better than non-happy hours will be supported with increased digital and TV ad spending.\"", "Wheels were in motion to revitalize the restaurant chain. The $380 million deal was set and ready to go. However, that all changed after March 2020.", "It's true that the $380 million deal to sell TGI Fridays and take the company public was canceled due to the COVID-19 pandemic.", "On April 6, 2020, Restaurant Dive reported that the deal was off:", "The merger between TGIF Holdings and Allegro Merger Corp. was canceled last week due to \"extraordinary market conditions and the failure to meet necessary closing conditions,\" according to a regulatory filing.", "As a result, privately held TGI Fridays will no longer be going public.", "Yahoo! Finance reported on the timing of the matter, which couldn't have been much worse than it was.", "\"Obviously our timing was about as bad as you could hope for,\" said Blanchette.", "\"I mean, we were literally going to go public in March, March 30 was the deadline on the SPAC. Obviously, that is not our priority today, our priority is focused on our team.\"", "Almost two months later, on May 27, 2020, word came down that 386 TGI Fridays locations would close for good.", "As of February 2021, it was not known if a new or similar future deal would be reached again between TGI Fridays and a buyer.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]