["By Eugene Kiely", "Posted on December 11, 2017 | Updated on December 12, 2017", "President Donald Trump made the false claim that “black home ownership just hit the highest level it has ever been in the history of our country.” That’s not remotely accurate.", "The National Association of Realtors referred us to the Census Bureau, which has quarterly survey data by race dating to 1994 (table 16). The black home ownership rate was 42 percent for the third quarter of 2017, and there have been 86 quarters since 1994 that had higher rates than that, according to the Census Bureau.", "The president raised the issue of black home ownership during a Make America Great Again rally in Pensacola, Florida, where he urged neighboring Alabamians to vote for Republican Roy Moore in the Dec. 12 special U.S. Senate election. Moore has been accused of sexual misconduct with teenagers — including one as young as 14 — when he was a younger man in his 30s.", "“So get out and vote for Roy Moore,” Trump said of the former state judge, who has denied the allegations.", "At one point in the rally, Trump spotted a “blacks for Trump sign.”", "Trump, Dec. 8: I love these guys. Look at these guys, “blacks for Trump.” I love you. I love you. By the way, now that you bring it up, black home ownership just hit the highest level it has ever been in the history of our country. Congratulations.", "The audience roared with approval. But hold the applause.", "The White House did not respond to our request for evidence to support the president’s claim. But we checked with the National Association of Realtors for the best home ownership statistics, and it referred us to census data — which we summarized above.", "The Census Bureau website provides 95 quarters of home ownership data since 1994. After we sorted the census figures, the 42 percent black home ownership rate for the third quarter of 2017 clocked in at 87th.", "The highest rate during that nearly 24-year span was 49.7 percent in the second quarter of 2004. The lowest rate was 41.2 percent in the third quarter of 1995.", "In fact, the most recent third quarter rate isn’t even the highest this year, let alone “in the history of our country.” The rate was 42.7 percent in the first quarter and 42.3 percent in the second quarter, so if anything there has been a slight downward trend in 2017.", "The Census Bureau also has decennial census data on home ownership by race dating to 1950. The black home ownership rate was higher in 1980 (44.4 percent) and 1990 (43.4 percent) than in the most recent quarter. It was lower in 1970 (41.6 percent) and 1950 (34.5 percent). There was no rate provided for 1960.", "Clarification, Dec. 12: The third quarter rate came in 87th out of 95 quarters, making it the 87th highest, or ninth lowest, rate. We originally mistakenly said it was the 87th lowest.", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]