["About this rating", "In the summer of 2018, readers expressed surprise and skepticism at widely-shared social media posts which suggested that Domino's — a company that makes pizza — had begun a project to pave over cracks and potholes on roads in the United States.", "On 12 June, Twitter user @GothicKingCobra posted a photo of what appeared to be fresh asphalt covering cracks in a pavement, with the Domino's logo and the words \"Oh yes we did\" stenciled on top of it. The post read:", "Dominos is paying their own money to pave over potholes in cities because cities aren’t taking responsibility and this is the greatest PR ever and honesty so sad that a pizza chain is doing the governments job pic.twitter.com/seXY0Ovoq5", "— trey (@GothicKingCobra) June 12, 2018", "The tweet was later re-posted on Facebook. The photograph was earlier shared on Reddit by a user based in Delaware, but originally appeared in a CBS Philadelphia article on 11 June 2018.", "The image is authentic and was taken in Milford, Delaware. The Domino's paving project is real. In a press release on 11 June, the company wrote:", "Domino's is saving pizza, one pothole at a time. Cracks, bumps, potholes and other road conditions can put good pizzas at risk after they leave the store. Now Domino's is hoping to help smooth the ride home by asking customers to nominate their town for pothole repairs at pavingforpizza.com.", "Four cities and towns have already reached agreements with Domino's to receive funding for the roadworks: Burbank, California; Bartonville, Texas; Athens, Georgia; and Milford, Delaware.  According to the company, the project has already filled forty potholes in Milford:", "﻿", "CBS Philadelphia.  \"Domino's Pizza Repaves Potholes in Milford, Delaware.\"\r\n  CBS Philadelphia.  11 June 2018.", "Domino's Pizza.  \"Press Release -- Don't Let Bad Potholes Ruin Good Pizza! Domino's Starts Paving for Pizza.\"\r\n  Domino's Pizza/PR Newswire.  11 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]