["The image was published on Twitter here on January 26, 2021.", "“A woman in Mexico discovered some photos of a younger woman with her husband so she stabbed him in a jealous rage!” the tweet reads.", "“The problem was that they were photos of her when she was younger.”", "Major tabloid newspapers New York Post and Britain's Daily Mirror published the photo alongside a claim it shows a woman in Mexico who stabbed her husband. It also circulated on Twitter in various languages, including Portuguese and Indonesian.", "The claim, however, is false.", "A keyword search found the photo was published by Argentina’s Naval Prefecture on its Twitter account on September 26, 2019.", "“We have caught one of the most wanted women in the country,” the Spanish tweet reads. “A nurse, she was given a life sentence in 2011 for the rape, torture and death of a minor during a satanic ritual in Mercedes, Corrientes in 2006”.", "Capturamos a una de las mujeres más buscadas del país. De profesión enfermera, tiene una condena de prisión perpetua desde el 2011 por la violación, tortura y muerte de un menor durante un ritual satánico realizado en la ciudad correntina de Mercedes en 2006 pic.twitter.com/Kqw11CK9Gx", "The woman, who had been on the run since 2012, was arrested in a suburb of Buenos Aires on September 25, 2019, the Argentine Naval Prefecture said in a statement. The statement included the same photo of the woman shared in the misleading social media posts.", "The woman was wanted for murder “with cruelty, treachery; sexual abuse and illegitimate deprivation of liberty,” the statement reads.", "The photo was published alongside accurate reporting by Argentine national news agency Télam.", "The false claim that the photo shows a Mexican woman who stabbed her husband in January 2021 appears to have originated in a Facebook post from January 23, 2021 on an unverified page called Policía Municipal.", "The Department of Public Security in Sorona, the Mexican state where the posts claim the stabbing occurred, did not respond to AFP's request for comment.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]