["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump speaks during a campaign rally at Erie International Airport, Tom Ridge Field in Erie, Pa, Tuesday, Oct. 20, 2020. (AP)", "About 2,000 ballots in a precinct in Los Angeles omitted the presidential race entirely. The county sent replacement ballots.", "About 400 ballots in Michigan omitted Vice President Mike Pence’s name. State elections officials said the error was fixed within hours.", "A theme of President Donald Trump’s final rallies of the 2020 campaign is that \"phony\" ballots are everywhere.", "Speaking at a rally in Erie, Pa.,Trump continued his attacks on the integrity of the election and mail-in ballots, saying without specifics \"they have the phony fake ballots all over the place.\"", "\"They're throwing them in the garbage can. Oh, they happen to have the name Trump on them. Isn't that shocking?\" Trump said Oct. 20. \"How about the ones that were printed without my name on it, right? They had everything on it. They had every race, they had everything. You had the Senate, you had everything, they forgot to put me down.\"", "We contacted the Trump campaign about ballots without his name and did not get a response. It’s possible that Trump was referring to faulty ballots in one precinct in Los Angeles, which he talked about on Twitter and in an Oct. 8 interview on Fox News.", "On Oct. 5, Los Angeles elections officials learned that a small percentage of mail ballots omitted the presidential race entirely. That meant that it wasn’t only Trump’s name that was missing, but also Democratic nominee Joe Biden.", "The faulty ballots were mailed to a single precinct of just over 2,100 voters out of a total of more than 5.6 million registered voters in the county, according to an Oct. 5 statement by the Los Angeles County Registrar-Recorder/County Clerk. The affected voters in Woodland Hills were contacted via roboball and email and the county sent them new ballots.", "As of Oct. 21, there were no additional reports of ballots elsewhere omitting the presidential race, Mike Sanchez, a spokesperson for the elections office, told us. His office attributed the faulty ballots to a printing error.", "The voters who were sent a corrected ballot will only be allowed to vote once. The return envelopes have a bar code with the identification for each voter so that election officials can log in that the person cast a ballot, preventing a second ballot from the same voter being counted.", "On Sept. 17,  Trump tweeted about another ballot screw up, that time in Michigan. The ballot omitted Vice President Mike Pence’s name and made it appear as if Trump was running with Jeremy Cohen, who is a Libertarian candidate.", "Trump said it was deliberate, but the secretary of state called it a misprint.", "About 400 ballots were downloaded by local election clerks with candidates for vice president listed incorrectly, said Tracy Wimmer, spokesperson for Secretary of State Jocelyn Benson. The error happened when clerks were downloading the ballots for military and overseas voters. Wimmer told PolitiFact that the problem was resolved within a few hours.", "\"The misprint was the result of an isolated human error, and it would not happen again,\" Wimmer told PolitiFact. \"We do not know how many of these ballots were sent to voters, but clerks were instructed to immediately alert voters of the error and send a corrected ballot. Voters who use the incorrect ballot instead of corrected ballots will still have their vote counted.\"", "As of Oct. 19, of the nearly 3 million ballots requested in Michigan, 1.5 million have already been returned.", "In his Erie rally, Trump also commented about ballots thrown in the trash. A New Jersey mail carrier was charged by federal prosecutors who said he discarded 1,875 pieces of mail including 99 ballots.", "In Luzerne County, Pa., news reports stated that an election worker discarded nine military ballots in September. Election officials said that sometimes military ballots arrive inside envelopes that do not clearly mark them as ballots, and there was confusion. Secretary of State Kathy Boockvar said it was an error.", "RELATED: Trump whiffs describing Wisconsin ballot case", "Trump said \"phony\" ballots \"were printed without my name on it.\"", "We found an instance of about 2,000 ballots sent to a single precinct in Los Angeles that skipped the presidential race entirely — not just his name, but Biden’s and the other candidates, too. The county quickly replaced those faulty ballots.", "Errors are not evidence of a conspiracy to favor one candidate or commit fraud. We rate this statement Mostly False.", "Factba.se, FirstDraft - Speech: Donald Trump Holds a Campaign Rally in Erie, Pennsylvania, Oct. 20, 2020", "Factba.se, Interview: Maria Bartiromo Interviews Donald Trump on Fox Business, Oct. 8, 2020", "ABC7, More than 2,000 LA County ballots printed, mailed without presidential race, Oct. 6, 2020", "Detroit Free Press, 'Error' results in some Michigan ballots for overseas voters omitting Mike Pence's name, Sept. 15, 2020", "Fox2Detroit, Trump calls Michigan leader Benson a 'Trump Hater' after ballot snafu with Pence name's omitted, Sept. 17, 2020", "U.S. District Court District of New Jersey, Complaint against Nicholas Beauchene, Oct. 6, 2020", "U.S. Attorney’s Office District of New Jersey, Postal Employee Arrested for Dumping Mail, Including Election Ballots Sent to West Orange Residents, Oct. 7, 2020", "President Donald Trump’s tweets Oct. 6, 2020 and Sept. 17, 2020", "Michigan Secretary of State Jocelyn Benson, Press release, Oct. 20, 2020", "Sacramento Bee, Fact check: Did 2,000 L.A. County voters get ‘faulty’ ballots? Oct. 10, 2020", "Times Leader, Discarded Luzerne County ballots weren’t fraud, state election chief says, Sept. 30, 2020", "AP, 9 discarded ballots weren’t fraud, state election chief says, Sept. 30, 2020", "Telephone interview, Mike Sanchez, spokesperson for Los Angeles County Registrar-Recorder/County Clerk, Oct. 21, 2020", "Email interview, Tracy Wimmer, spokesperson for Michigan Secretary of State Jocelyn Benson, Oct. 21, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]