["U.S. Sen. Tammy Baldwin, D-Wisconsin, claimed 97 percent of gun owners support universal background checks. (Getty)", "Students planning a national school walkout, angry that more hasn’t been done to protect them from school shootings, might have more support from adults than they realize when it comes to gun control.", "The walkouts are planned for March 14, 2018, the one-month anniversary of the school shooting in Parkland, Fla., that left 17 people dead.", "Speaking about Parkland, U.S. Sen. Tammy Baldwin, who is being challenged by two Republicans in her bid for re-election, made a claim about background checks that might sound extreme.", "At a WisPolitics event on Feb. 22, 2018, eight days after the shooting, the Wisconsin Democrat said:\n\nWe know that we need change. And it’s frustrating because there is a high level of consensus across America on the sort of common-sense safety measures that need to be brought up and passed. Among gun owners -- and I'm a gun owner myself -- 97 percent support expanded, universal background checks so we don’t have the gun-show loophole, so that we don’t have the internet purchases that don’t go through a thorough background check.", "To reiterate, Baldwin’s claim is about support among gun owners, not just the general public, for requiring background checks for all gun sales, not just those done by federally licensed dealers.", "Prior fact checks", "Four months before the Florida school shooting, we rated True a claim by Milwaukee County Executive Chris Abele that 90 percent of Americans \"support universal background checks\" for gun purchases.", "We found a half dozen national polls that showed support at or near 90 percent. And an October 2017 poll taken by Gallup after Abele made his claim found support at 96 percent.", "But that’s the general public. What about gun owners?", "Quinnipiac poll", "To back Baldwin’s claim, her campaign cited a national telephone poll by Quinnipiac University in Hamden, Conn., of 1,249 people who identified themselves as registered voters.", "The poll, done with live interviews on landlines and cell phones, was taken over four consecutive days, starting Feb. 16, 2018 -- two days after the school shooting in Parkland.", "The question: \"Do you support or oppose requiring background checks for all gun buyers?\"", "Before we get to the results, there is one wrinkle here: Respondents weren’t asked if they were gun owners themselves; rather, they were asked if they, or anyone in their home, owns a gun.", "The result was 97 percent support among gun households (as well as 97 percent among all respondents in the poll).", "The margin of error for the gun households (which made up 555 of the 1,249 total respondents) was plus or minus 5 percentage points.", "Three polling experts -- Marquette Law School Poll director Charles Franklin, Karlyn Bowman at the American Enterprise Institute and Janine Parry, director of the Arkansas Poll -- told us they were not aware of any other national polls done in recent months that published results about gun owner support of universal background checks.", "We did find a poll of people who identified themselves as gun owners, by the Pew Research Center, which asked: \"Would you strongly favor, somewhat favor, somewhat oppose, or strongly oppose making private gun sales and sales at gun shows subject to\nbackground checks?\" The result: 77 percent of gun owners strongly or somewhat favored.", "But that poll was taken in March 2017, 11 months before the Parkland shooting.", "It’s tempting to think that support reached 97 percent in the Quinnipiac poll simply because it was taken days after the Parkland shooting. But Quinnipiac’s results have been consistent.", "For example, support was 94 percent among gun households in Quinnipiac’s December 2017 and November 2017 polls, the most recent ones done before the February 2018 poll.", "Our rating", "Baldwin says \"97 percent\" of gun owners support universal background checks.\n\nThe figure is correct for the latest national poll, completed days before her claim, that asked about requiring background checks for all gun purchases.", "The only clarification is that the respondents weren’t all necessarily gun owners, but rather lived in a household where they or someone else own a gun.", "We rate Baldwin’s statement Mostly True.", "WisPolitics, Tammy Baldwin remarks (3:30), Feb. 22, 2018", "Email, Tammy Baldwin campaign spokesman Bill Neidhardt, Feb. 23, 2018", "PolitiFact Wisconsin, \"Do 90% of Americans support background checks for all gun sales?\" Oct. 30, 2017", "Email, professor of law and public policy and director of the Marquette Law School Poll Charles Franklin, Feb. 23, 2018", "Email, Arkansas Poll director Janine Parry, Feb. 28, 2018", "Email, American Enterprise Institute senior fellow Karlyn Bowman, Feb. 28, 2018", "Quinnipiac University Poll, news release, Feb. 20, 2018", "Gallup, \"Guns,\" accessed Feb. 23, 2018", "Pew Research Center, \"America’s Complex Relationship With Guns,\" June 22, 2017", "Email, Quinnipiac University Poll assistant director Tim Malloy, Feb. 28, 2018", "PolitiFact Ohio, \"Do majority of NRA members support background checks for guns?\" Feb. 27, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]