["By Angelo Fichera", "Posted on February 6, 2019", "A quote attributed to President Donald Trump in Facebook posts actually originated in a well-known satirical New Yorker column.", "There are at least three indicators on a Borowitz Report column that it is satirical.", "“Satire from The Borowitz Report” appears above the headline of each story. A short biography of the author, Andy Borowitz, notes that his report is a “satirical column on the news.” And a tag beneath each story again labels it as satire. He is a well-known satirist.", "Nevertheless, an invented quote attributed to President Donald Trump that appeared in a recent Borowitz piece has surfaced in a number of popular Facebook posts, and on Twitter, that present the comment as real.", "“I can do my job without any intelligence whatsoever,” the made-up quote reads.", "The Facebook posts in question not only share it without context or a disclaimer, but erroneously claim that it’s “his actual quote.” It’s not.", "Though Trump has at times taken issue with, or offered mixed messages on, the findings of the U.S. intelligence community, he has not “stopped taking intelligence briefings,” as the Facebook posts claim. That part was also included in the Borowitz column.", "The president’s private schedules from November 2018 through January 2019, recently obtained by Axios and confirmed by White House officials, show frequent half-hour intelligence briefings were scheduled.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Borowitz, Andy. “Trump Comes Out Strongly Against Intelligence.” The New Yorker. 30 Jan 2019.", "Farley, Robert. “Trump’s Mixed Messages on Russian Meddling.” FactCheck.org. 23 Jul 2018.", "McCammond, Alexi and Jonathan Swan. “Read Trump’s “Executive Time”-filled leaked private schedules.” Axios. 3 Feb 2019.", "Trump, Donald (@realDonaldTrump). “The Intelligence people seem to be extremely passive and naive when it comes to the dangers of Iran. They are wrong! When I became President Iran was making trouble all over the Middle East, and beyond. Since ending the terrible Iran Nuclear Deal, they are MUCH different, but….” Twitter. 30 Jan 2019.", "Trump, Donald (@realDonaldTrump). “….a source of potential danger and conflict. They are testing Rockets (last week) and more, and are coming very close to the edge. There economy is now crashing, which is the only thing holding them back. Be careful of Iran. Perhaps Intelligence should go back to school!” Twitter. 30 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]