["“Guess which community is waving Pakistan flags in India’s Tamilnadu state? Buddhists? Zoroastrians? Must be Jews,” read a June 9 tweet by Tarek Fatah, posted along with a video of a bike rally where several people can be seen waving green coloured flags. As per Fatah, the rally took place in Tamil Nadu and the flags were of Pakistan. At the time of writing this article, his video drew over 51,000 views.", "Guess which community is waving Pakistan flags in India’s Tamilnadu state? Buddhists? Zoroastrians? Must be Jews. pic.twitter.com/ypeXYknY0o", "— Tarek Fatah (@TarekFatah) June 9, 2019", "The clip shared by Fatah was originally circulated by the Twitter handle SahaJio (@oldhandhyd), which claimed that the incident took place in Palani, Neykarapatti during Ramzan. The user seemed to have recorded the video first uploaded as a Facebook post.", "Ramzan in TN Palani, Neykarapatti. A clear pattern of provoking, testing the reactions is emerging, pan India. pic.twitter.com/S9nOJwTyDs", "— SahaJio🇮🇳 (@oldhandhyd) June 8, 2019", "The video also found its way to Facebook.", "If one carefully watches the video, the bike-borne individuals are not waving Pakistani flags. The country’s flag has a rightward facing crescent moon and star and a white strip on the left.", "The flags in the video do not have the white strip. Alt News noticed two different kinds of flags in the clip – one, which has a crescent moon and a star in the middle; two, which has a crescent moon and star in the middle and three stars on the left.", "The first kind is a typical Islamic flag often used by the Muslim community in the sub-continent. The origin of the second could not be traced, however, it too appears to be a generic religious flag.", "The Quint had earlier fact-checked the video and inferred that the flags seen in the video were of the India Union Muslim League (IUML). While the same could not be established by Alt News by looking at the video, The Quint spoke to a police officer in Palani Taluka who said, “The video is from Neikkarapatti. It is of a procession which was held during Ramzan here in the Kottaimanthai area of the village. It is an annual event, and happens every year”. He further added that the video showed IUML flags and not the Pakistani flag.", "A longer version of the video was uploaded on Youtube on June 5. Here, the flags are more distinctly visible. One can clearly spot that none of them is the Pakistani flag as they do not have a white strip on the left.", "The fact-check conclusively establishes that the video does not depict Pakistani flags being raised in Tamil Nadu during Ramzan. Such misinformation regularly appears on social media, circulated several times by Tarek Fatah himself. Last year, the Pakistani-Canadian writer had shared an old video of IUML flags raised in Uttar Pradesh to claim that Muslims in Rajasthan waved Pakistani flags to celebrate Congress’s victory in the assembly elections.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]