["About this rating", "A map shows hospital employees' estimations of the five states where the most cases of human trafficking take place.", "The map does not chart the overall prevalence of human trafficking throughout the U.S., nor does it identify specific trafficking \"hotspots\" within states.", "A photograph of a newspaper article featuring a map purportedly identifying human trafficking hotspots in the U.S. has been circulated via social media since April 2019:", "This map originated with an article published in the April 4, 2019, edition of the Mount Vernon (Ohio) News. It doesn't actually chart the specific locations in the U.S. where human trafficking incidents were documented as having taken place; rather, it was part of an exercise by one hospital's staff to try to identify the five states with the most cases of human trafficking:", "During Knox Community Hospital’s inaugural Patient Safety Awareness Week activities held March 10-16, KCH staff combined their knowledge of U.S. states with an insidious topic — that is growing in cases each year — to gain more insight into the situation.", "Working with Christina White, RN, an Emergency Department nurse, and Levi Motter, RN, KCH patient safety officer, about 100 hospital employees were asked to stick five pins in different colors on a Human Trafficking Map. These would be the five states they believed had the most cases of human trafficking -- including both sex tracking or labor trafficking, and sometimes a combination of the two.", "According to that article, the employees were fairly accurate overall in identifying the five states with the highest levels of trafficking activity:", "Overall, Motter said, KCH staff members did a good job in recognizing the five states with the most reported cases of human tracking: California, Texas, Florida, Ohio, and New York, in that exact order. Most got the five states right. But only two of 100 employees had the exact order right, he added.", "White and Motter both noted that many people would rightly guess the coastal, densely populated states of California, Florida and New York as being a beacon to criminal activity that involves human trafficking, and Texas as well. It’s the largest state in the continental United States and shares a long border with Mexico.", "But why Ohio?", "“Its freeways, with easy access in and out of the state,” White said. Motter agreed, adding, “You can get across Ohio in about two and-a-half to three hours.”", "This information corresponds with data presented by the Polaris Project's National Human Trafficking Hotline (NHTH) for 2018.", "The Facebook post reproduced above does err in citing western Pennsylvania as the site of one of the \"biggest concentrations in the country for abductions and trafficking.\" As noted above, the pins in the map only denote states as a whole (not regions within states), and according to the NHTH's data, in 2018 Pennsylvania ranked 11th in number of human trafficking cases among U.S. states.", "Also, the Facebook post above references \"abductions and trafficking,\" but in fact most human trafficking does not involve the kidnapping of victims through physical force:", "By far the most pervasive myth about human trafficking is that it always — or often — involves kidnapping or otherwise physically forcing someone into a situation. In reality, most human traffickers use psychological means such as, tricking, defrauding, manipulating or threatening victims into providing commercial sex or exploitative labor.", "National Human Trafficking Hotline.   \"Human Trafficking Myths and Facts.\"\r\n    Accessed 3 January 2020.", "National Human Trafficking Hotline.   \"Hotline Statistics.\"\r\n    Accessed 3 January 2020.", "Di Giovanni, Larry.   \"Knox Community Hospital Staff ‘Pin’ Human\r\nTrafficking Hotspots.\"\r\n    Mount Vernon News.   4 April 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]