["A state income tax cut proposed by Gov. Chris Christie would provide greater savings to more affluent New Jerseyans, but according to Democratic state Sen. Paul Sarlo, that’s nothing new.\n\nAs Sarlo sees it, the Republican governor has already cut taxes for the wealthy once before.\n\nAt the start of the Jan. 30 Senate Budget and Appropriations Committee meeting, Sarlo, who serves as committee chairman, provided some opening remarks about how the governor’s proposal would disproportionately benefit high-income earners.\n\n\"The proposed tax cut plan is measuring up as a potential billion-dollar gift for those who are high-income earners,\" Sarlo (D-Bergen) told his fellow legislators. \"This would be the second tax cut for the rich by the governor in two years.\"\n\nIf the latest proposal would be the second tax cut, what was the first?\n\nSarlo told us in a phone interview that Christie cut taxes the first time when he vetoed a bill in 2010 to increase the income tax rate on taxable income exceeding $1 million, or the so-called \"millionaires tax.\"\n\nBut PolitiFact New Jersey found there’s a difference between stopping a tax increase and cutting taxes. The governor’s veto helped millionaires avoid a larger tax rate, but Christie has maintained the rates he inherited upon entering office in January 2010.\n\nFour economic experts also told us the governor’s veto doesn’t qualify as a \"tax cut.\"\n\nFirst, let’s review the history behind the millionaires tax.\n\nIn 2009, then-Gov. Jon Corzine, a Democrat, and the Democrat-controlled Legislature approved a one-year increase in some high-income tax rates. The higher rates were effective for tax year 2009 and reverted to their previous levels on Jan. 1, 2010 -- before Christie took office.\n\nA few months later, the Legislature passed a bill to increase the tax rate on taxable income exceeding $1 million from 8.97 percent to 10.75 percent. Christie immediately vetoed that bill and a related measure, and state Assembly Democrats later could not gather enough votes to override the vetoes.\n\nThrough his veto, Christie \"preserved the tax cut\" provided when the higher rates expired at the end of 2009, according to Sarlo.\n\nBut four economic experts argued that the governor’s veto should not be considered a tax cut.\n\n\"I don’t believe that maintaining current law by vetoing the bill should be characterized as a tax cut,\" Jim Nunns, a senior fellow with the nonpartisan Tax Policy Center, said in an email. \"(Likewise, vetoing a bill that proposed some tax cut relative to current law should not be characterized as a tax increase.)\"\n\nJ. Fred Giertz, an economics professor at the University of Illinois at Urbana-Champaign, echoed the same argument: \"Since the tax was never in place, the veto did not result in a tax decrease. The veto kept taxes the same and kept taxes from increasing.\"\n\nBut Sarlo maintained that Christie’s veto led to a tax cut.\n\n\"His actions resulted in the higher income brackets getting a reduced rate,\" Sarlo told us. \"His actions resulted in a tax cut.\"\n\nChristie spokesman Kevin Roberts argued that Democrats could have renewed the millionaires tax before it expired at the end of 2009.\n\n\"Factually, the tax surcharge (which I believe is what it technically was) expired under a Democratically controlled legislature and a Democratic Governor, before Governor Christie took the oath of office,\" Roberts told us in an email. \"Pants on fire.\"\n\nOur ruling\n\nDuring a Senate committee meeting about Christie’s proposed income tax cut, Sarlo claimed: \"This would be the second tax cut for the rich by the governor in two years.\"\n\nSarlo was referring to Christie vetoing the proposed millionaires tax in 2010. But that veto just kept income tax rates at the same levels as when the governor took office. Those millionaires actually got their tax cut under a Democratic governor and the Democrat-controlled Legislature -- before Christie took office.\n\nYet since Christie’s veto stopped a proposed tax increase from going through, we rate the statement Half True.", "To comment on this ruling, go to NJ.com.", "Sen. Paul Sarlo remarks at Senate Budget and Appropriations Committee hearing, Jan. 30, 2012\n\nPolitiFact New Jersey, NJEA ad: Not renewing Jersey’s millionaire’s tax gives break to wealthy residents, June 19, 2011\n\nInterviews with Sen. Paul Sarlo, Feb. 1-2, 2012\n\nNew Jersey Department of the Treasury, Summary of 2009 Tax Legislation, accessed Feb. 1, 2012\n\nEmail interview with Matthew Murray, economics professor at the University of Tennessee, Feb. 1, 2012\n\nEmail interview with Jim Nunns, senior fellow at the Urban Institute Tax Policy Center, Feb. 1, 2012\n\nEmail interview with J. Fred Giertz, an economics professor at the University of Illinois at Urbana-Champaign, Feb. 1, 2012\n\nEmail interview with George Zodrow, economics professor at Rice University, Feb. 1, 2012\n\nThe Star-Ledger, Face-off with N.J. Dems about taxes marks defining moment for Gov. Chris Christie, May 21, 2010\n\nThe Star-Ledger, N.J. Assembly, Senate panels approve 'millionaires tax,' Gov. Chris Christie vows to veto it, May 13, 2010\n\nThe Star-Ledger, N.J. Assembly Dems fail to gather Republican votes to override millionaires-tax veto, June 22, 2010\n\nOffice of Legislative Services, Fiscal Estimate for Assembly Bill A10, May 25, 2010\n\nNew Jersey Department of the Treasury, 2010 Division of Taxation Annual Report, May 2011\n\nEmail interview with Kevin Roberts, a spokesman for Gov. Chris Christie, Feb. 1, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]