["Rep. Adam Schiff gets set to speak at Northwestern University on Oct. 3, 2019, in Evanston, Ill. (AP/Arbogast)", "Rep. Adam Schiff, D-Calif., said in September that the House Intelligence Committee had not communicated with the whistleblower before the complaint about President Donald Trump’s phone call with Ukrainian President Volodymyr Zelensky was filed.", "But recent reporting from the New York Times revealed that Schiff, the committee chairman, had indeed learned about the outlines of the whistleblower’s concerns days in advance.", "Seeking guidance, the whistleblower turned to a House Intelligence Committee aide, who advised the whistleblower to get a lawyer and file a complaint with the intelligence community inspector general, per committee procedures. The aide shared some of that information with Schiff.", "As the Washington Post’s Fact Checker first noted, this revelation flies in the face of Schiff’s public comments during the month of September, when he dodged questions about whether he or his committee had talked to the whistleblower and, in one case, denied that they had.", "On Sept. 17, more than a week before the whistleblower’s complaint was made public, MSNBC’s Sam Stein asked Schiff if he had heard from the whistleblower and if he wanted to.", "\"We have not spoken directly with the whistleblower,\" Schiff said. \"We would like to. But I’m sure the whistleblower has concerns that he has not been advised, as the law requires, by the inspector general or the director of national Intelligence just as to how he is to communicate with Congress, and so the risk for the whistleblower is retaliation.\"", "RELATED: What the whistleblower law says about sharing complaints with Congress", "The New York Times report, which quoted Schiff spokesman Patrick Boland acknowledging that \"the whistle-blower contacted the committee for guidance,\" shows that this statement was inaccurate.", "While it was not publicly known that Schiff’s committee had communicated with the whistleblower ahead of the complaint’s filing, Schiff knew the truth. When given the chance to say that the whistleblower had reached out to a committee aide, he did not.", "The New York Times reported that the committee aide received only a vague outline of the whistleblower’s concerns. Without revealing the whistleblower’s identity, the aide then told Schiff \"some of what the officer conveyed,\" the report said. Other outlets reported similar details.", "Previously, Schiff had given the impression that his committee never spoke to the whistleblower.", "Before Schiff’s MSNBC interview — in which he flatly stated, \"We have not spoken directly with the whistleblower\" — Schiff also evaded a question from CNN’s Anderson Cooper about whether he’d been contacted by the whistleblower or the whistleblower’s legal representation.", "\"I don’t want to get into any particulars,\" Schiff said during the Sept. 16 interview. \"I want to make sure that there’s nothing that I do that jeopardizes the whistleblower in any way.\"", "Schiff has since clarified his remarks. He told the Daily Beast that until recently, he did not know for certain whether the complaint detailing the Trump-Zelensky call was submitted by the same whistleblower who contacted his staff.", "He also said he thought the questions asking if the committee had heard from the whistleblower were focused on whether the whistleblower had testified privately in Congress.", "\"I was really thinking along the lines of wanting to get him to come in to testify,\"  Schiff told the Daily Beast. \"I regret that I wasn't much more clear.\"", "In a statement to PolitiFact, a spokesperson for the House Intelligence Committee said Schiff’s comments on MSNBC were \"intended to answer the question of whether the committee had heard testimony from the whistleblower, which they had not.\"", "\"Nonetheless, he acknowledges that his statement should have been more carefully phrased to make that distinction clear,\" the spokesperson said.", "Mark Zaid, the whistleblower’s counsel, declined to comment on the whistleblower’s outreach to committee staff but stressed that the whistleblower wrote the complaint \"entirely on their own.\" We addressed the false claim that Schiff helped write the complaint in a separate fact-check.", "Schiff said, \"We have not spoken directly with the whistleblower.\"", "The New York Times and other news organizations later reported that the whistleblower sought guidance from a House Intelligence Committee staffer before formally lodging the complaint.", "We rate this statement False.", "MSNBC on YouTube, \"Rep. Schiff: We Would Love To Talk Directly With Whistleblower | Morning Joe | MSNBC,\" Sept. 17, 2019", "The Washington Post, \"Schiff’s false claim his committee had not spoken to the whistleblower,\" Oct. 4, 2019", "CNN, \"Schiff cleans up after saying committee had no contact with whistleblower,\" Oct. 3, 2019", "The Daily Beast, \"Trump’s Plan to Save His Presidency: Take a Hatchet to Adam Schiff,\" Oct. 3, 2019", "Adam Schiff on Twitter, Oct. 2, 2019", "The New York Times, \"Schiff Got Early Account of Accusations as Whistle-Blower’s Concerns Grew,\" Oct. 2, 2019", "The Washington Post, \"Whistleblower sought informal guidance from Schiff’s committee before filing complaint against Trump,\" Oct. 2, 2019", "The New York Times, \"White House Knew of Whistle-Blower’s Allegations Soon After Trump’s Call With Ukraine Leader,\" Sept. 26, 2019", "Rep. Adam Schiff on YouTube, \"Rep. Schiff on CNN: Director of National Intelligence Under Subpoena for Whistleblower Complaint,\" Sept. 16, 2019", "Email interview with Mark Zaid, counsel for the whistleblower, Oct. 4, 2019", "Statement from the House Intelligence Committee, Oct. 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]