["“BREAKING: NYPD TRUCKS SURROUND TEUMP TOWER IN ANTICIPATION OF VIOLENT RIOTS OVER POSSIBLE TRUMP VICTORY; ALSO, ELECTION DAY RIOTS BREAK OUT IN DC | PRAYERS UP! (sic),” reads the caption on this Facebook post published on November 3, 2020.", "The post contains three images: two show dump trucks filled with sand parked in front of Trump Tower while the other features a woman raising her hands during a protest.", "Trump Tower is President Donald Trump’s New York residence on Fifth Avenue in Manhattan.", "Using the social media monitoring tool CrowdTangle, AFP Fact Check found the same set of images was published elsewhere on Facebook alongside the same claim.", "However, the claim is misleading.", "AFP Fact Check traced two of the images back to 2016 when New York City sanitation trucks with sand barricaded Trump Tower for the presidential election won by Trump.", "The other photo was shot during an anti-Trump demonstration two months before the 2020 vote, in which Trump's Democrat rival Joe Biden has been declared the winner.", "Multiple reverse image searches on Google led to the original versions of the photos in AFP’s photo archives.", "The first two images showing trucks were shot by AFP photographer Timothy Clary on November 10, 2016 -- shortly after Trump was elected for his first and only term.", "“A protective barrier of Sanitation Department trucks are parked in front of Trump Tower on 5th Avenue to provide security to US President-elect Donald Trump on November 10, 2016 in New York,” reads the captions on the two AFP photos as seen here and here.", "The other image was taken more recently by another AFP photographer, Kena Betancur, during an anti-Trump protest in September 2020.", "It was captioned: “Protesters march in New York on September 5, 2a020, during a ‘Trump-Pence Out Now’ Nationwide Day of Action demonstration.”", "Pence refers to incumbent Republican Vice-President Mike Pence who will be replaced by Kamala Harris under the Biden administration. She is the first woman and first South Asian to hold that US office, as AFP reports here.", "Meanwhile, the Washington Times and The New York Post reported that at least five large dump trucks and an NYPD bus had been parked in front of Trump Tower as the country went to the polls on November 3, 2020.", "Betancur also documented the scenes of the barricade in front of Trump Tower on election eve.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]