["About this rating", "A video purportedly showing a woman stabbing her dancing partner (presumably her spouse or boyfriend) has been making its way around the internet since at least February 2018.", "The following footage could be considered NSFW:", "We've encountered numerous versions of this video on both English- and Russian-language websites. The accompanying captions and comments have not provided much detail about where or when the video was filmed, and they have been contradictory in the details they have provided. For instance, one Facebook post claimed that these two individuals were strangers to each other, while a YouTube post asserted that they were husband and wife. Another tweet didn't venture a guess as to the relationship between these two individuals but stated that the stabbing occurred after the man accidentally stepped on the woman's foot.", "In other words, this shocking video has been circulating for several months without anyone's offering any genuine context for it.", "The example included at the top of this article dates to 27 February 2018 and is the earliest posting of this clip that we could uncover. However, a higher-quality version of this video (which included an additional 20 seconds of footage) was posted to YouTube on 6 March 2018. That version, too, failed to provide any credible context about what the footage depicted, although it did offer us a better look at the alleged stabbing.", "The first thing we noticed is that this couple is dancing on a stage similar to ones found in a small theater house. The band, the various pieces of furniture, and the \"cutting award\" prop in which the knife rested suggested some sort of stage(d) production:", "We took a closer look at the actual stabbing and this, too, seemed more aligned with a theatrical production than an actual attempt at murder.", "For example, one of the knife's slash markings appeared to be visible on the man's shirt prior to the commencement of the actual stabbing:", "We reached out to Steve Tolin, the founder of Tolin FX, a special FX Makeup studio that has worked on some of the bloodier aspects on movies such as Jack Reacher, Adventureland, and the show Mindhunters, to ask his opinion on this stabbing footage. He told us that in his opinion this stabbing appeared fake and was likely created with a prop called a \"bleeding knife.\"", "A bleeding knife prop makes it appear as if a mortal wound is being inflicted while fake blood is actually squirted out from a rig behind the knife's blade as it is dragged across a surface. Here's a very child friendly version of the bleeding knife prop from Dreamworks TV:", "The use of such a prop would also explain why the incident depicted in the viral video isn't nearly as bloody as one might expect (the human body, after all, contains about 5 liters of blood, while a prop knife only holds a few ounces). The man is shown being slashed three times across the back and once across the throat, yet not a drop of his blood is visible on the dance floor. The bleeding from the victims's back wounds also seem to stop abruptly once the knife is no longer in contact with his shirt.", "Additionally, this video purportedly shows a knife tearing open a man's flesh through his shirt, yet the shirt appears mostly undamaged (other than a few stains) at the end of the attack:", "Although we have not been able to pinpoint the specific origins of this video, we are highly skeptical that it shows a real, spontaneous stabbing taking place on a dance floor.", "Geggel, Laura.   \"How Much Blood Is in the Human Body?\"\r\n    Live Science.   3 March 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]