["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake news items claiming that pop star Lady Gaga was arrested after criticizing Melania Trump is a hoax that’s been circulating since before the 2016 election.", "The story claims that Lady Gaga’s Nov. 6, 2016, tweet criticizing Trump set in motion a dramatic chain of events that unfolded days before the country would cast their ballots in the general election.", "\".@MELANIATRUMP to say u will stand for \"anti-bullying\" is hypocrisy. Your husband is 1 of the most notorious bullies we have ever witnessed,\" Lady Gaga tweeted.", "According to the fake account, just hours after the offending tweet, Gaga and Melania Trump met face-to-face, with Gaga hurling insults while the future first lady ignored the enraged pop star. That’s when Gaga threw something at Trump, according to fake witnesses, forcing the Secret Service to intervene.", "\"The New York Post tried to reach out to the NYPD after it was reported that GooGoo was taken away in a black Yukon in handcuffs, but as of yet there’s no record of an arrest,\" the item read. \"You can rest assured if this incident isn’t prosecuted by the corrupt liberals in the city government that the less-than-lady will be staring down the barrel of a multi-million dollar lawsuit.\"", "The item surfaced Sep. 3 on American Flavor, which we’ve previously labeled a fake news site. But the ersatz claim’s origins trace back to a Nov. 6, 2016, item on an outlet called America’s Last Line of Defense, a satirical site whose mission is to inflame conservative readers and draw them into mistaking extraordinary conspiracies for truth.", "A photo that ran alongside the original item purports to show Gaga being arrested. But as one eagle-eyed writer at Snopes points out, it’s actually a screengrab of actress Amanda Bynes being escorted into a courthouse in 2013.", "We rate this claim Pants on Fire!", "America’s Last Line of Defense, \"Lady Gaga’s Twitter Attack On Melania Trump Lands Her In Handcuffs When The Two Meet Face To Face,\" Nov. 6, 2016", "Tweet by Lady Gaga, Nov. 6, 2016", "American Flavor, \"Lady Gaga’s Twitter Attack On Melania Trump Lands Her In Handcuffs When The Two Meet Face To Face,\" Sept. 3, 2017", "Snopes, \"Lady Blah-Blah: A report that Lady Gaga was arrested for tweeting a negative comment about Melania Trump is a hoax\"", "PolitiFact, \"PolitiFact's guide to fake news websites and what they peddle,\" April 20, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]