["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "This Tuesday, Jan. 26, 2016 file photo Eddie, 51, a homeless man who would only give his first name and lives in a tent on the street in downtown Los Angeles. (AP Photo/Richard Vogel)", "During his run for California governor, Republican John Cox has tried to tie Democrat Gavin Newsom to the state’s growing homeless problem. In Cox’s latest radio campaign ad, a narrator even uses \"Newsomville\" to describe the state’s homeless camps \"springing up in every town.\"", "At Monday’s gubernatorial debate, Cox attacked Newsom over San Francisco’s struggle with this human crisis.", "\"Gavin was mayor (of San Francisco) for eight years. He didn’t solve the homeless problem here at all. And it’s gotten worse.\"", "We wanted to know whether Cox was right. Did Newsom really fail to \"solve the problem at all\"? And has it \"gotten worse\"?", "We set out on a fact check.", "Our research", "Newsom was San Francisco’s mayor from January 2004 to January 2011. He has served as the state’s lieutenant governor for the past seven-plus years. Few big city mayors in the United States, if any, have completely solved homelessness during their tenures.", "For his part, Newsom has often pointed to his role in cutting San Francisco’s \"street population by 40 percent\" during his time as mayor, adding his administration \"got 12,000 people off the street.\" His campaign has cited the 2009 San Francisco Homeless Count and Survey to support that statement.", "We examined that claim in May and rated it Half True. We found Newsom cherry-picked the timeframe of this reduction, which took place from 2002 to 2009, two years before he became mayor to two years before he left that office.", "The street population went back up by 400 during his final two years. But even considering that uptick, the city’s unsheltered total still decreased by 31 percent from 2002 to 2011", "RELATED: Fact check round-up of California governor's debate", "Tracking San Francisco's overall homeless population", "We also noted that Newsom’s statement does not reflect the slight increase in San Francisco’s overall homeless population during his time as mayor. The first available report during his tenure, from January 2005, shows a total of 6,248. By January 2011, Newsom’s final month in office, that number was 6,455.", "San Francisco’s most recent overall count, from June 2017, places the total at 7,499. That’s 1,044 higher than Newsom’s final month as mayor, and generally supports the last portion of Cox’s statement that the problem has \"gotten worse.\"", "Newsom credited as leader", "While the homeless crisis continues in San Francisco, Newsom has been credited as a leader on the topic. A 2010 San Francisco Chronicle article said Newsom had \"moved more homeless people into supportive housing in his seven years in office than any other mayor in the city's history - and has one of the best track records of any mayor in the country on that score.\"", "Newsom’s campaign pointed a 2016 Chronicle investigation Beyond Homelessness, which examined the city’s response to the issue over the past two decades.", "Here’s what the newspaper found:", "\"Gavin Newsom, took the most aggressive stance yet toward tackling the issue. In 2004, he announced a 10-year plan to end chronic homelessness.", "While it failed to reach that goal, it did result in moving 22,000 homeless people off the streets either into housing or onto buses headed home. And in the past few years, the majority of the city’s indigent military veterans — many suffering post-traumatic stress from as far back as the 1970s — have been moved indoors, thanks in part to a national effort led by the U.S. Department of Veterans Affairs.", "And yet the city’s streets look the same today.", "\"There’s a mythology that you can, quote unquote, end homelessness at any moment,\" Newsom said in 2014.  \"But there are new people coming in, suffering through the cycles of their lives. It’s the manifestation of complete, abject failure as a society. We’ll never solve this at City Hall.\"", "The city’s bus ticket program, Homeward Bound, which accounts for sending thousands of homeless out of San Francisco, has been criticized by some homeless advocacy groups as simply moving the problem elsewhere.", "Asked to support Cox’s claim, his spokesman responded in an email: \"Wait, is there not a homeless problem in SF?\"", "Our ruling", "Republican John Cox claimed Gavin Newsom \"didn’t solve the homeless problem\" in San Francisco \"at all,\" adding \"it’s gotten worse.\"", "Under Newsom’s administration, San Francisco’s homeless street population fell by 31 percent, from 2002 to 2011. Newsom has been credited with taking an aggressive stance on the topic and for helping move thousands off the street into housing or onto buses.", "The overall sheltered and unsheltered homeless population, however, rose slightly during Newsom’s tenure, and has increased since he left office by more than 1,000, supporting the second part of Cox’s statement.", "But the first part of his claim, that Newsom didn’t solve the problem \"at all,\" ignores his accomplishments. While homelessness didn’t end on Newsom’s watch, he made steps considered unprecedented for the city.", "We rate Cox’s statement Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "See all of PolitiFact California's governor's race fact checks here.", "Related coverage from Capital Public Radio:", "The Key Moments From John Cox and Gavin Newsom's Only California Governor's Debate", "Insight Special: California Governor's Debate Recap", "John Cox, gubernatorial debate, October 8, 2018", "Matt Shupe, spokesman for John Cox for Governor, email exchange Oct. 8, 2018", "Nathan Click, spokesman for Gavin Newsom for Governor, email exchange Oct. 8, 2018", "2017 San Francisco Homeless Count & Survey, accessed October 2018", "2011 San Francisco County Homeless Count and Survey, accessed October 2018", "2009 San Francisco Homeless Count and Survey, accessed October 2018", "San Francisco Homeless Count 2005, accessed October 2018", "PolitiFact California, Has California’s homeless population ‘skyrocketed’? And how does it rate nationwide?, March 27, 2018", "PolitiFact California, Gavin Newsom's Half True claim on reducing San Francisco’s homeless ‘street population’, May 10, 2018", "San Francisco Chronicle, Newsom gets homeless off streets - problems linger, Dec. 8, 2010", "San Francisco Chronicle, A decade of homelessness: Thousands in S.F. remain in crisis, accessed May 2018", "The San Francisco Examiner, SF expanding program that has bused 10K homeless residents out of town in past decade, June 29, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]