["A video of some Indian army personnel dancing to the tune of a popular Punjabi song is circulated on social media. “Indian Army Celebration In Base Camp Over Surgical Strikes“, reads the caption attached to the same video posted by Telugu news channel Mojo TV.", "భారత సైన్యం సంబరాలు | Indian Army Celebration In Base Camp Over Surgical Strikes | MOJO TV", "భారత సైన్యం సంబరాలు Indian Army Celebration In Base Camp Over Surgical Strikes | MOJO TV", "Posted by Mojo TV Telugu on Tuesday, 26 February 2019", "The video is also shared by individual users with an identical narrative on Facebook and Twitter. Facebook pages – Bonno Troll, Our PM Narendra Modi, Mission MODI 2019, Hindustani Sena and Mera Bharat Mahan posted the video claiming that it depicted the Indian Army celebrating the attack on Pakistan.", "Twitter handle @Muaaaahrwadi posting the video said, “Leaked video of Indain Air Force yesterday at 4:30 A.M.”", "Alt News found that the video is old and NOT related to the recent air strike on Pakistan conducted by the Indian Air Force. A YouTube search with keywords, “Indian army dance”, reveals that it is an 11-month old video.", "In conclusion, an old video where Indian army personnel were seen dancing was passed off on social media with a false narrative that they were celebrating the air-strike on Pakistan.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]