["About this rating", "Well into the latter part of 2017, social media users continued to circulate an image touting a petition seeking to overturn the results of the 2016 U.S. presidential election due to purported Russian interference, even though the information it referenced was long outdated.", "The advancement of a motion before the U.S. Supreme Court to nullify the presidential 2016 election was covered in an Occupy Democrats  article of 23 February 2017:", "A longshot legal petition to nullify the 2016 federal elections based on the Constitution’s “Guarantee Clause” just moved forward at the Supreme Court this week, after last week the Trump administration declined to reply. Our Supreme Court set the case for Conference on Friday, March 17th to put the petition in front of all of the Justices. (see below)", "According to a career prosecutor interviewed for this story, four of the eight justices must then vote that Blumstein vs. U.S. meets their high standard to go to a full hearing. Additionally, the three Massachusetts women who petitioned the court have asked for the appointment of a Special Master, which is a special officer to weigh the evidence and make findings to the Court. There has never before been a case about the Constitution’s Guarantee Clause (which obliges the federal government to protect states from foreign invaders) like this decided in front of the Supreme Court.", "Three extraordinary citizens from Massachusetts filed this court action, seeking to nullify the election late last year. They cited the actions of Austria and Ukraine who held revotes after unfairly held elections as legal precedents.", "Diane Blumstein, Nancy Goodman, and Donna Soodalter-Toman argue in the case, that Russia cyber invaded America and that our Intelligence Community’s reports in October and January, along with the FBI’s public statements prove that our Executive Branch concluded a foreign invader influenced the 2016 elections.", "The Occupy Democrats item noted that the referenced court action was \"a longshot\" and later indicated that the petition \"has a 1% chance of even being heard by the court, let alone of being decided favorably\" for the petitioners. However, news of that petition was mistakenly spread by readers and others in the form of claims holding that the U.S. Supreme Court would definitely soon be considering an action to \"nullify\" the results of the 2016 presidential election.", "Versions of the rumor typically linked to a weighty-sounding 6 January 2017 \"Writ of Mandamus\" filed by the three petitioners, who sought relief including enjoinment of the 20 January 2017 inauguration of President Trump. Another widely shared piece of evidence was one hosted on SupremeCourt.gov (16-907) which suggested that the petition was to be \"distributed for conference\" on 17 March 2017. That designator was widely interpreted as a tacit indication that the Court had decided the claim had merit and ought to be discussed, but consultancy firm Counsel Press noted in a 2012 blog post that \"distributed for conference\" is no specific barometer of a petition's likelihood of being heard:", "Every petition that is docketed at the U.S. Supreme Court, and remains on the docket, will eventually be distributed for a conference, usually held on a Friday. The date of the conference depends upon whether or not the Court is in session, in recess or on vacation. (There were 39 conferences during the 2011 Term.) Does this mean the Court will discuss each petition distributed during their conference? Absolutely not! Although this is a very closely guarded secret, I would estimate that, at best, only 20-25% of the petitions distributed for a given conference are actually discussed during that conference and few, if any, of those discussed, are granted. Those which aren’t discussed, become automatically denied.", "In any event, “distributed for conference” is a somewhat misleading phrase.", "We contacted Counsel Press for further clarification and spoke to Liebman, who reiterated that under 20 percent of distributed petitions even rated discussion during the conferences. Liebman added that the Chief Justice directed the Court to take note of cases they believed merited discussion, and the vast majority of distributed cases didn't rate. He opined that the individuals who filed this petition had a better chance of winning a Powerball lottery than of seeing their petition move forward.", "Indeed, on 20 March 2017 the petition was listed as having been DENIED by the court.", "Previous claims about election audits, faithless electors, and similar legal \"longshots\" proved popular on social media, but all such efforts died on the vine.", "Liebman, Roy I.   \"Distributed for Conference at the Supreme Court of the United States.\"\r\n    Counsel Press.   25 October 2015.", "Oliver, Erin.   \"Did You Know the Supreme Court May Nullify the Election?\"\r\n    Medium.   7 February 2017.", "SupremeCourt.gov.   \"No. 16-907, Title: In Re Diane Blumstein, Et Al., Petitioners V. Federal Respondents, Et Al.\"\r\n    19 January 2017   (Updated 22 February 2017).", "Supreme Court of the United States.   \"Blumstein Vs. U.S. — Writ of Mandamus.\"\r\n    6 January 2017.", "We modified the status of this page to \"MIXTURE\" and reworded the claim to better distinguish between the petition's docketing and its likelihood of success.", "We modified the status of this page to \"OUTDATED\" to note that the referenced petition had long since been denied.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]