["About this rating", "The photograph depicts an elderly gentleman crying as he marched in a parade in Russia in 2007.", "The man wasn't identified as the last surviving member of a battle group or a World War II veteran, and he wasn't crying because everyone else in his battle group had died.", "A number of social media pages devoted to attracting likes and shares have published a variation of the above-reproduced image, stating that it depicts the \"last surviving WWII veteran of his battle group\" crying as he marched alone in a Memorial Day parade and urging viewers to spread the photograph:", "In early July 2015, a heartbreaking image of a crying older gentleman walking alone on a parade route and carrying a balloon and a bouquet of flowers spiked in popularity once again. Understandably, viewers who came across the photograph wished to know more about the scene captured, many of them believing the image was taken in the United States or England, where variations described the locale as a \"victory parade\" or a Memorial Day event (often appearing with the phrase \"am I alone in here?\"):", "A reverse image search reveals that the photograph was not new in 2015, nor did it originate in the U.S. or UK; it originally appeared on Russian sites as early as 2009.", "The image experienced a popularity surge in England in April 2016, and at that time both the BBC and the Telegraph looked into its origins. The latter obtained some additional details from photographer Alexander Petrosyan, who snapped the picture in St. Petersburg, Russia, in May 2007:", "\"It was taken at a Victory Parade on May 9, 2007, on the Nevsky Prospekt in St. Petersburg, Russia,\" he revealed.", "He also explained why the veteran appears so upset in the photo and his hopes about tracking him down.", "\"The veteran was upset that he was behind the column with other veterans and could not catch up with them,\" he said.", "\"Now I'm looking for this veteran. I hope that I will find him and find out his name.\"", "Both newspapers noted that the man's identity was unknown, and it unclear whether he was a WWII veteran:", "Some have claimed he looks too young to be a WWII veteran, although a Russian military expert told the BBC he could have been as young as 13 when he signed up.", "Mr Petrosyan has re-posted the photo on his Facebook page in an attempt to track down the mystery veteran.", "Most versions of the image describe the fellow affirmatively as the \"last veteran of his WWII battle group marching alone in a Victory Day Parade,\" but Petrosyan possessed the most knowledge about the image and was unable to verify the pictured man's military status. Moreover, since Petrosyan stated that the man was crying because he was unable to catch up with the group of veterans he was marching with, he was not \"marching alone.\" Clearly some unsupported details were tacked onto the photograph to add emotional weight to an already sad image.", "Malloy, Mark.   \"Mystery Surrounds Heartbreaking Photo of Veteran Marching Alone at Victory Parade.\"\r\n    The Telegraph.   14 April 2016.", "BBC News.   \"The Mystery Veteran Who Won the Internet's Heart.\"\r\n    14 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]