["By Angelo Fichera", "Posted on September 11, 2018", "Q: Was Nancy Pelosi’s granddaughter seen wiping her nose with the American flag?", "A: No. The young woman in a video from one of President Trump’s rallies is not Pelosi’s grandchild.", "At a Sept. 6 Montana rally featuring President Donald Trump, a high school senior’s facial expressions earned him the viral nickname #PlaidShirtGuy and national media coverage.", "Yet he wasn’t the only one whose behavior drew scrutiny. Others noticed a young woman on stage behind the president in camera shots, seemingly using the American flag to wipe her nose; she can also be seen wearing it as a scarf.", "But some websites are falsely identifying the young woman as House Minority Leader “Nancy Pelosi’s granddaughter Adrianna Pelosi.”", "“This is just another dirty liberal trick intended to make patriotic, red-blooded Americans look bad,” a Sept. 9 story on theamericanews.co reads. “Liberals will stop at nothing to push their agenda on the rest of us.”", "The dubious claim is undermined by the fact that the House Democratic leader doesn’t even have a granddaughter named Adrianna — as her deputy chief of staff, Drew Hammill, confirmed to FactCheck.org. Pelosi has nine grandchildren and the girl in the video is not one of them, he said in an email.", "In reality, the story was first published by a website that is part of a network whose self-described satirical work often gets mistaken for real news. The version republished on theamericanews.co failed to include any disclaimers about the piece’s satirical intent.", "The post included a photo of Pelosi with her granddaughter Madeline Prowda at the screening of an HBO documentary in May 2014.", "Users on Facebook shared both versions of the story, some leaving comments betraying their belief in the nonsensical claim.", "“That’s disgusting and for Pelosi to allow this just shows us how deranged she is,” one woman remarked.", "It’s not the first time supposedly satirical websites have targeted Pelosi’s family. In 2017, we wrote about fictional stories that claimed two of Pelosi’s daughters had been arrested.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "“About.” Worstpot.us/ever. Accessed 10 Sep 2018.", "“BREAKING: Girl Who Wiped Nose With Flag At Trump Rally Is Pelosi’s Granddaughter.” Theamericanews.co. 9 Sep 2018.", "“BREAKING: Girl Who Wiped Nose With Flag At Trump Rally Is Pelosi’s Granddaughter.” Worstpot.us/ever. 8 Sep 2018.", "Hammill, Drew, deputy chief of staff to Rep. Nancy Pelosi. Emails sent to FactCheck.org. 10 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]