["One Facebook post, shared in this group supporting President Kenyatta with more than 300,000 followers, has since attracted more than 700 reactions and 47 shares.", "A caption accompanying the misleading post read: \"PRESIDENT KENYATTA launches new generation Kenyan currency in accordance with Constitution; currency to have symbols not portraits of persons. Hongera! [Congratulations!] Kenya.\"", "However, a spokesman for the Central Bank of Kenya (CBK) told AFP that only new coins, and no new notes, have so far been released.", "The coins were launched by Kenyatta in line with the 2010 constitution which outlawed portraits and images of individuals on currency. The current banknotes bear portraits of Kenyatta’s father, Jomo Kenyatta, Kenya’s first president, and the second president Daniel Moi.", "The new coins replace images of ex-presidents with depictions of wildlife.", "The 20-shilling, 10-shilling, 5-shilling and 1-shilling, new generation coins. pic.twitter.com/BlvQvf7vRa", "A reverse image search on Google and Yandex shows that the photos of mocked-up Kenyan bank notes have circulated on social media before, first appearing in September 2017 when activist Okiya Omtatah sought a court order compelling the CBK to issue new notes and coins after the bank missed the constitutional deadline of August 2015 for issuing new currency.", "The images were then shared in this Facebook group with more than 1.2 million followers while this website published an article claiming that the images of the new currency notes had been leaked.", "It is unclear whether the images do in fact represent what the new notes will look like when they are issued. However, they appear not to meet a key requirement to prevent counterfeits in the form of a distinct interwoven security thread running vertically down the right-hand side of the notes.", "​", "The notes also bear dates of January 1, 1999, and January 1, 2003, years prior to the passing of the new constitution.", "CBK is expected to at some point launch new banknotes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]