["About this rating", "On 2 September 2016, the faux-spirituality web site Spirit Science reported that a Spanish fisherman named Luigi Marquez was swallowed by a whale and resided in its belly for three days before being \"flushed out\" safely, enabling him to return to his daily life.", "According to Spirit Science, the story was written by the web site The Hearty Soul, which appears to be a clickbait web site dedicated to so-called natural health remedies (with titles like \"10 Plants That Attract Positive Energy and Instantly Make You Happier\"). It originated earlier this year on an Indian publication's web site that labeled it a spoof story.", "The article features the image of shirtless man that is claimed to be the fisherman, Luigi Marquez — but it isn't. The man pictured is actually named \"Mike\" and the picture was taken from a 2015 YouTube video in which Mike demonstrates turning his swim trunks into a flotation device.", "The story appears to have started circulating this year when on 4 April 2016 in the New Delhi-based publication The Indian Express posted it in a section dedicated to viral stories. At the bottom of the article, the following disclaimer appears: \"This story is a spoof and you are suitably warned.\"", "It seems many were not sufficiently warned. Other than Spirit Science, the yarn has been picked up by web sites with names like ScoopWhoop.com and Ways of Healthy Life 365.", "The story is lifted from the Old Testament biblical tale of Jonah, who was swallowed by a whale which then spat him out. The story is usually interpreted as a fable as opposed to historical fact. It was reiterated at the turn of the 20th century with the story of James Bartley, a sailor who was supposedly swallowed by a sperm whale and retrieved alive after the animal allegedly died of constipation. (The veracity of that story is questionable as well.)", "While it is conceivable toothed whales like a sperm whale could physically swallow a human being, prolonged survival is extremely unlikely. The issue was addressed on a June 2010 episode of the BBC podcast program Naked Scientists by marine biologist Helen Scales, who said even on the off chance that you dodge the whale's teeth and digestive system, there isn't enough breathable air inside it to support life.", "Express Web Desk. \"A whale of a story, waiting to be swallowed\"\r\n  The Indian Express. 4 April 2016", "Eveleth, Rose. \"Could a Whale Accidentally Swallow You? It Is Possible\"\r\n  Smithsonian. 25 February 2013", "The Naked Scientist Podcast. \"Could a human survive being swallowed by a whale or big fish, like Jonah\"\r\n  27 June 2010", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]