["About this rating", "A photograph purportedly showing a couple sharing an intimate moment while watching the Apollo 8 rocket launch in 1968 is frequently circulated on social media:", "This is not a genuine photograph, but rather a composite of at least two different images.", "The source photograph for the image of the couple was taken circa 2016 at the Tretyakov Gallery in Moscow, Russia. Instead of watching the Apollo 8 rocket launch, this couple was actually taking in a painting by Viktor Vasnetsov called \"Ivan Tsarevich Riding the Grey Wolf.\"", "While we haven't been able to definitively determine the photographer, the Chronicle Magazine attributed this image to Андрей Строганов (Andrey Stroganov). Here's a look at the doctored image (left) and the original photograph (right). We flipped the doctored version to better match the original:", "The rocket launch in the background of this image has little to do with NASA or the Apollo 8 mission. This image actually shows Japan's H-2A rocket taking off from the Tanegashima Space Center in May 2010. The original image is available via the Associated Press, along with the following caption:", "Japan's H-2A rocket carrying Akatsuki, which is set to become the country's first probe to orbit Venus to examine its climate, blasts off into space from Tanegashima Space Center in Kagoshima Prefecture, southwestern Japan, on May 21, 2010. (Kyodo via AP Images)", "Here's a look at the doctored image (left) and the original rocket photograph (right):", "In sum, the viral image purportedly showing a \"couple watching the Apollo 8 spacecraft launch in 1968\" is actually a composite image comprising a 2016 photograph of a couple viewing a painting and a 2010 photograph of a rocket launch in Japan.", "Suzuki, Miwa.   \"Japan Rocket to Blast off With Venus Probe and 'Space Yacht.'\"\r\n    Phys.org.   17 May 2010.", "Correction [April 11, 2022]: The referenced painting in the source photograph is called \"Ivan Tsarevich Riding the Grey Wolf,\" and was painted by Viktor Vasnetsov.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]