["Atlanta Mayor Kasim Reed is talking about going before voters in March with a plan for chipping away at a backlog of repairs to city roads, sidewalks, bridges and buildings.", "Some of the projects could be retreads from a grab bag of $7 billion-plus in road and sidewalk improvements that were pitched to voters in 10 metro counties in 2012.", "The transportation sales tax, or T-SPLOST as it was called, was rejected by a majority of voters in nine of 12 regions across the state, but not by Atlantans. Nearly 60 percent of voting city residents supported the 1 percent tax.", "Details of the proposed March referendum are still being ironed out, including what projects would be funded.", "But at a news conference July 29, Reed talked of the work that’s waiting.", "\"There is no dispute. The minimum number of infrastructure (needs) in Atlanta is $900 million,\" the mayor told reporters.", "We decided a fact check was in order and reached out to the city and Tom Weyandt, Atlanta’s deputy chief operating officer.", "Weyandt told us $900 million is on the conservative side.", "At least one forecast puts the costs of the backlog of projects at about $1.02 billion, with $881 million in transportation, $130.8 million for facilities. (Some estimates out there are as high as $1.1 billion.)", "The $1.02 billion cost projections are based on two reports -- one from 2010 that sized up the condition of city bridges, roads, sidewalks, streetlights, traffic signals and signs; and one completed this year that looked at city buildings in need of repair or replacement.", "On the long list of potential transportation projects are 1,634 miles of road that need resurfacing and vast portions of sidewalks and curbs that require improved access for the disabled. (In 2009, the U.S. Department of Justice initiated a compliance review of the facilities and policies of the city of Atlanta as it relates to provisions of the Americans With Disabilities Act (ADA) of 1990. As one of the outcomes, the city’s Public Works Department had to identify and install curb ramps on sidewalks resurfaced since January 1992. The estimated backlog is 31,442 noncompliant intersections at an estimated cost of $52 million.)", "Also identified as in need of repair or replacement are 14 bridges that have been rated poor to fair. The average age of a bridge in the city is 57 years old, and the oldest has stood for 108 years, according to city records.", "A recent presentation suggests city officials divvy up the $1 billion-plus this way: $262 million, or 31 percent, in street resurfacing; $259 million, or 30 percent, in bridge replacement and maintenance; and $204 million, or 24 percent, in sidewalks, curbs and ADA ramps. The remaining 15 percent would go to signals, streetlights, signs, unpaved roads, school zone flashers and similar improvements.", "In terms of facility improvements, tentative plans call for putting $130.8 million into returning some fire stations, police stations and recreation centers to good condition.", "For some that would mean renovation. For others, it would mean replacement.", "The referendum is expected to be for a maximum of $250 million in bonds, said Anne Torres, the mayor’s spokesman. The understanding is that more money would be requested from voters down the road, she said.", "A final list of proposed projects for the referendum is expected by November or December.", "To summarize: Reed said the city has infrastructure needs that will cost at least $900 million. That’s a conservative estimate based on studies and previous comments by him and others.", "We rate Reed’s statement as True.", "\"Reed forecasts ways to save money and fund infrastructure bond,\" The Atlanta Journal-Constitution, July 29, 2014", "Infrastructure backlog report.", "Blue Ribbon Commission report on waste and efficiency,", "City’s bond presentation", "Interview and emails with Anne Torres, director of communications, Mayor Kasim Reed’s Office", "Phone interview with Tom Weyandt, city’s deputy chief operating officer", "Facilities and fleet report", "2010 State of the City’s Infrastructure and Fleet Inventory,", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]