["The video was published on Facebook here on February 19, 2021. The post has been shared over 690 times.", "The one-minute, 40-second video shows a woman holding a snowball over a lit candle, which causes part of the snowball to blacken.", "The post's caption reads:  “Fake snow on texas..\n\t“Haarp used chemtrail snow.\n\t\"#OperationDarkWinter\n\t\"#WeatherModification”.", "Haarp refers to the High-frequency Active Auroral Research Program, which studies the properties and behavior of the ionosphere.", "Chemtrail refers to the chemtrails conspiracy theory, which alleges that governments or other parties secretly add toxic chemicals to the atmosphere from aircraft.", "The post circulated after a snowstorm in February 2021 in Texas brought record-low temperatures, causing millions of people to go without water and electricity for days, as AFP reported here.", "The video was also shared alongside similar claims on Facebook here and on YouTube here.", "The fake snow claim also circulates in other videos showing people attempting to melt snow with candles or lighters on Facebook here, on Twitter here, on YouTube here and on TikTok here.", "The claim, however, is false, according to experts.", "Julienne Stroeve, a senior research scientist at the US National Snow & Ice Data Center, told AFP via email on February 25, 2021: “When you apply heat to the snowball, the snowball will first start to absorb that water in the porous spaces and you can always feel that as the snowball gets harder before it melts, and it makes sense to me that the soot from the lighter could darken the snow slightly.”", "Stroeve also directed AFP to this video posted by scientist and blogger Philip Plait on February 3, 2014, in which he debunked a similar conspiracy theory that circulated on social media after a snowstorm paralysed the US city of Atlanta in late January 2014.", "“The snow itself is absorbing water and becoming slushy,” Plait says in the video. “But what’s going on with the burn marks? … When you hold the lighter up to the snow, it is not that the snow is scorching. It is the incomplete combustion products, this pollution, this soot is basically coming out of the flame itself and plating itself onto the snow ball.”", "Plait also published this article in Slate magazine debunking the claim.", "Scientists from the Imagination Station Toledo museum in the US state of Ohio also conducted the snow heating experiment and debunked the false claim in this YouTube video published on February 1, 2014.", "Science educational website Science Notes also published this infographics debunking the claim:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]