["About this rating", "On Sept. 23, 2020, Kentucky Attorney General Daniel Cameron addressed the news media after a state grand jury announced it did not indict any of the Louisville Metro Police Department (LMPD) officers in the police shooting death of a 26-year-old Black woman, Breonna Taylor. One officer, Brett Hankison, was indicted for \"wanton endangerment\" for firing his gun into a neighbor's home.", "Shortly after the decision was announced, a rumor started to circulate on social media holding that Cameron, a Republican and the first Black man to serve as attorney general in Kentucky, was married to the granddaughter of U.S. Senate Majority Leader Mitch McConnell.", "One Facebook user wrote: \"In case you didn't know, Kentucky AG Daniel Cameron married Mitch McConnell’s granddaughter last month!\" This rumor was frequently accompanied by a set of images supposedly showing Cameron's wife:", "These are genuine photographs of Cameron and his wife, Makenze Evans. However, Evans is not the granddaughter of McConnell.", "Although this rumor was widely circulated on social media, we have yet to encounter anything in terms of \"proof\" that Cameron's wife is McConnell's granddaughter. A spokesperson for Cameron told us: \"The Attorney General is not married to Mitch McConnell’s granddaughter.\"", "This rumor likely stems from the fact that McConnell attended Cameron's wedding. In August 2020, Cameron and Evans were married in a small outdoor ceremony in Louisville. The wedding stirred up some controversy as it took place during the COVID-19 pandemic and in the middle of the Taylor investigation.", "McConnell's attendance wasn't due to a familial relation, however. Cameron and McConnell are both prominent politicians in Kentucky and have previously worked together. According to Lead Stories, Cameron worked as McConnell's legal counsel from 2015 to 2017. The Courier Journal described Cameron as McConnell's \"protege.\"", "We have not been able to find much biographical information for Evans, but there is no evidence to support the claim that she is the granddaughter of McConnell.", "Oppel Jr., Richard; Taylor Bryson, Derrick; Bogel-Burroughs, Nicholas.   \"What We Know About Breonna Taylor’s Case and Death.\"\r\n    The New York Times.   24 September 2020.", "Tobin, Ben.   \"Kentucky Attorney General Daniel Cameron Gets Married with Mitch McConnell in Attendance.\"\r\n    Courier-Journal.   3 August 2020.", "Tereszcuk, Alexis.   \"Fact Check: Kentucky Attorney General Daniel Cameron's Wife Is NOT Mitch McConnell's Granddaughter.'\r\n    Lead Stories.   24 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]