["About this rating", "In April 2017, after several articles reported that the White House was unprepared for its annual Easter Egg Roll and that the president would be in Florida on Easter weekend, many on social media wondered whether the event had in fact been canceled:", "Several factors may have led people to believe that the White House had cancelled the annual Easter Egg Roll. A New York Times article published an article on 11 April 2017, for instance, reported that the White House may be unprepared for the annual event:", "President Trump received an urgent warning in February, informing him of a crucial date he was about to miss.", "“FYI manufacturing deadlines for the Easter eggs are near,” said a Twitter post directed at Mr. Trump; the first lady, Melania Trump; and the president’s daughter Ivanka Trump. “Please reach out!”", "The message came from Wells Wood Turning & Finishing, the company that supplies commemorative wooden eggs for the annual White House Easter Egg Roll, the 138-year-old celebration that has drawn 35,000 people to the South Lawn in recent years.", "The staff of the company, based in Buckfield, Me., wondered whether the Trumps planned to continue distributing the wooden eggs as party favors, or whether they were even going to have a White House Easter Egg Roll at all.", "The Hill also reported that President Trump would be spending at least part of Easter weekend at Mar-a-Lago and not the White House:", "President Trump plans on returning to Mar-a-Lago, his luxury resort in Palm Beach, Fla., this coming Easter weekend.", "“Yes, I’ll be here for Easter,” he said at Trump International Golf Course in West Palm Beach, Fla., according to The Palm Beach Daily News.", "“Is Easter next week?” Trump added when pressed on his schedule. \"Well then, I guess I’ll be back next week.”", "Some people may have also been confused by the cancellation of a local Easter Egg hunt in Pennsylvania.", "With reports circulating that the White House was struggling to organize the event, that Trump was possibly spending the holiday at Mar-a-Lago, and the unrelated news about the cancellation of a local Easter egg hunt, it's not surprising that some mistakenly assumed that the White House had cancelled the Easter Egg Roll. However, the event is still listed on the White House web site and no official announcements have been made about its potential cancellation:", "Join us on Monday, April 17th, 2017, for the 139th White House Easter Egg Roll! We will be live-streaming from the South Lawn of the White House, so you can follow along with the reading nook, music stage, official egg roll, and other fun events.", "The White House Easter Egg Roll is a timeless White House tradition, dating back to 1878 and the presidency of President Rutherford B. Hayes. President Donald J. Trump and First Lady Melania Trump are honored to continue the traditions of the past, while weaving new traditions into the fabric of our Nation’s history.", "Notably, the event is scheduled for the Monday after Easter Sunday. Although Trump may spend the Easter Holiday at Mar-a-Lago, he is still scheduled to be at the White House on Monday for the annual event.", "As of this writing, the White House Easter Egg Roll is still scheduled to go on as planned.", "Associated Press.   \"Egg Hunt Canceled Because Rowdy Parents Ruined Easter for Their Innocent Children.\"\r\n    10 April 2017.", "Russonello, Giovanni.   \"The White House’s Easter Egg Problem Gets the Late-Night Treatment.\"\r\n    New York Times.   13 April 2017.", "Hensch, Mark.   \"Trump headed to Mar-a-Lago for Easter weekend.\"\r\n    The Hill.   10 April 2017.", "Donnelly, Shannon.   \"EXCLUSIVE: President Trump to return to Palm Beach for Easter weekend.\"\r\n    Palm Beach Daily News.   9 April 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]