["About this rating", "Fears about immigration from Mexico and other Spanish-speaking Central and South American countries have been rife for many years, especially among right-wing observers, and especially when it comes to the state of California.", "In May 2018, \"America's Last Line of Defense\" — a Facebook page and notorious producer of fake news and self-described \"satire\" — played on these fears about displacement of English-speakers with a fabricated meme:", "The Governor of California just signed a law that will require all students to learn Spanish.", "The man shown in the photograph is not California Governor Jerry Brown, who looks like this:", "Rather, the man shown in the meme is Vermont Governor Phil Scott, in what appears to be a still frame from an April 2018 YouTube video about Scott's signing of a new gun control law.", "As of May 2018, there are not any proposals before the California legislature which would \"require all students to learn Spanish.\"", "In 2016, voters in the state passed Proposition 58, which overturned a long-standing ban on bilingual school instruction. The measure did not require all students to learn Spanish, but it did allow for some classroom instruction to be conducted through the Spanish language, something that had previously not been allowed.", "America's Last Line of Defense is part of a network of fake news pages and web sites — including Freedum Junkshun and As American As Apple Pie — run by Christopher Blair, who operates under several pseudonyms. Although he claims to produce satire, the precise target of that purported satire is often not clear in Blair's content, which often contains fake and inflammatory xenophobic storylines and themes.", "Sanchez, Claudio.  \"Bilingual Education Returns to California. Now What?\"\r\n  National Public Radio.  25 November 2016.", "Palma, Bethania.  \"Fake News Purveyors Apologize for 'Satire' Story Calling Fallen Soldier a Deserter.\"\r\n  Snopes.com.  31 October 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]