["Is there really a shark swimming in the ocean that’s been alive since 1627?", "That’s what one viral Facebook post claims.", "The Jan. 21 post displays an image of an ancient-looking shark and claims the \"392-year-old shark\" was recently discovered in the Arctic Ocean. \"This guy was wandering the oceans back in 1627,\" the post says.", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "In this case, there is a little truth here: The image is legitimate, and it does show the longest-living species of shark, but the shark’s exact age isn’t clear.", "Here’s how we know. We ran a reverse-image search and found that the photo appeared in online news articles in July 2017. Captions say the photo depicts a Greenland shark in the Arctic Ocean. The image is credited to Julius Nielsen, a researcher at the Greenland Institute of Natural Resources.", "The photo was taken during Nielsen’s 2016 study on the sharks.", "The study used radiocarbon dating to measure carbon isotopes absorbed in the eye tissue of 28 female Greenland sharks. Analysis presented a probability range that suggested the sharks were at least 272 years old, and could be as much as 512 years old, with the midpoint range being around 390 years.", "Shortly after the study published, articles that claimed scientists had discovered a 512-year-old shark started circulating on the internet. Nielsen addressed the rumors in an interview with Live Science and in a December 2017 post on his Instagram account:", "\"All of this is just the same story coming to life from August 2016 and please note that we have not found any sharks to be 600 or 500 yr old.... we have ESTIMATED (meaning that it has not been verified) that one shark was AT LEAST 272 yr old or in more detail that this shark was between 272-512 yr old with 95.5% certainty (the latter also being an unverified estimate). Take home message from the authors of the investigation was that Greenland shark longevity is measured in centuries.\"", "The Facebook post shares an authentic image of a Greenland shark, a species scientists believe to be the longest-living vertebrate in the world. But the researcher who took the photo has said the study estimated one shark was at least 272 years old, and could have been as much 512 years old, but no specific age was verified.", "The photo is real and the shark is old, but we are not sure of the age. We rate this Half True.", "Facebook post, Jan. 21, 2020", "Tin Eye, reverse image search, Jan. 28, 2020", "Inews.co.uk, 400-year-old sharks could hold the secret to long life, July 5, 2017", "News.com.au, Sharks could hold the secret to long life, July 6, 2017", "Instagram, Julius Nielsen post, Dec. 14, 2017", "Science.org, Eye lens radiocarbon reveals centuries of longevity in the Greenland shark (Somniosus microcephalus), Aug. 12, 2016", "Snopes, Did Researchers Discover a 512-Year-Old Shark?, Dec. 11, 2018", "Live Science, No, Scientists Haven't Found a 512-Year-Old Greenland Shark, Dec. 15, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]