["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With oil prices setting record highs and hovering around $100 a barrel, most candidates talked during a Jan. 5, 2008, debate about what they would do to bring prices down. New Mexico Gov. Bill Richardson talked about what he had already done.", "Richardson served as secretary of the Energy Department under former President Bill Clinton, from late 1998 until the end of 2000.", "\"I went to OPEC countries and tried to get them to increase production so prices would go down,\" Richardson boasted. \"At the time, there was a home heating oil crisis here in New England. I created reserves of home heating oil.\"", "Richardson did indeed visit several OPEC countries in the spring of 2000, including Kuwait and Saudi Arabia, encouraging them to increase supply, which would help keep prices lower, according to the Energy Department Web site.", "Those visits followed a memorably expensive winter for New Englanders, who suffered spiking prices for home heating oil, giving rise to what many called the Northeastern home heating oil crisis. Winter prices for home heating oil in New Hampshire more than doubled from February 1999 to February 2000, when New Hampshire prices peaked at $1.89 a gallon.", "On July 10, 2000, President Clinton directed Richardson \"to establish a 2-million barrel home heating oil component of the Strategic Petroleum Reserve in the Northeast.\" With Richardson in charge, the Energy Department established the 2-million-barrel reserve later that year.", "The following winter, prices fell back slightly, hovering in the mid $1.50s.", "The Bush administration continued the home heating oil reserves, according to the Energy Department Web site. In mid 2007, those reserves stood just shy of 2-million barrels.", "But that hasn't stopped prices from surging, as Richardson himself pointed out. \"Look at prices now in New Hampshire, $3.20, something like that. It's the highest ever.\"", "In fact, Richardson underestimated New Hampshire prices. The weekly average topped $3.34 a gallon on Dec. 31, 2007, according to the Energy Information Administration.", "PolitiFact looked back at peak prices from the previous crisis. In February 2000 in New Hampshire, prices hit $1.89 per gallon. Using an inflation calculator from the Bureau of Labor Statistics, we calculated that it equaled $2.31 in 2007 dollars, more than a dollar shy of the current price. We also looked back over Energy Information Administration prices for New Hampshire going back to 1990, adjusting several price spikes for inflation. None came close to today's price.", "Richardson told the truth: He visited OPEC countries around the same time as the home heating oil crisis in New England, and he helped establish the home heating oil reserve.", "Did that reserve lower prices? That's unclear, since the reserve remains today, even though — as Richardson himself points out — heating oil prices in New Hampshire are \"the highest ever.\"", "Still, Richardson earns a True.", "U.S. Department of Energy,\n\nNortheast Home Heating Oil Reserve — Profile", "U.S. Department of Energy,\n\nEnergy timeline,\n\n1991 to 2000", "Bureau of Labor Statistics,\n\nInflation calculator", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]