["About this rating", "In late 2019, Facebook posts went viral warning that human traffickers in nondescript white vans were using the vehicles in abductions across the United States.", "Generally speaking, there's no way to predict the type of car a potential criminal might drive, and it's always good to be aware of one's surroundings and avoid uncomfortable situations. However, no evidence exists that white vans are being used in trafficking kidnappings around the country in any widespread or coordinated fashion.", "The claim that white vans are being spotted in association with human trafficking appears to be a social media hoax and also a variation on a common theme: One of the most frequent forms of scarelore — a term that refers to making vague but terrifying claims on social media that go viral, despite having no basis in fact — are allegations that human traffickers are luring women using various tactics.", "In December 2019, Baltimore Mayor Jack Young gave the hoax credibility when he warned in a televised interview about people in white vans who were abducting girls for purposes of human trafficking and even selling body parts. Local and federal authorities responded by saying they had no such reports.", "Sadly, these kinds of trafficking rumors have led to deadly violence. In November 2019, a man driving a white van in Memphis, Tennessee, was shot and killed after he was falsely accused of attempting to abduct a woman. In March 2019, similar rumors led to an outbreak of violence in suburbs of Paris, France, when a mob attacked a community of Roma people, who were falsely accused of using white vans to abduct women. White van drivers around the U.S. have spoken out about harassment and threats they have received as the result of the hoax.", "A Facebook spokesperson told us that the platform has reduced the distribution of such posts, saying in a statement that, \"Posts with this claim have been rated as false by third-party fact-checkers and we’re dramatically reducing their distribution. People who see these false posts on Facebook, try to share them, or have already shared them will see warnings that they’re false.\"", "Noor, Poppy. \"Facebook Took Action on a Fake Story on White Vans – but What About These Hoaxes?\"\r\n  The Guardian. 5 December 2019.", "Broach, Janice. \"Woman Shared Facebook Warnings About White Vans Before Deadly Shooting.\"\r\n  WMC. 27 November 2019.", "The Journal. \"How an Internet Hoax About a 'White Van Kidnapper' Sparked Violence in Paris.\"\r\n  30 March 2019.", "Simms, Barry. \"Mayor's Comments on Human Trafficking Not Based on Specific Incident.\"\r\n  WBALTV. 3 December 2019.", "Collman, Ashley. \"Unfounded Rumors About Suspicious White Vans Are Going Viral on Facebook and Putting Drivers' Lives at Risk.\"\r\n  Insider. 5 December 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]