["A job advertisement on The New York Times (NYT) seeking a South Asia Business Correspondent based out of New Delhi created quite a stir on media outlets sympathetic to Prime Minister Modi. A portion of the job description stating, “India’s future now stands at a crossroads. Mr Modi is advocating a self-sufficient, muscular nationalism centered on the country’s Hindu majority,” did not sit well with PM Modi’s supporters.", "However, amid the brouhaha, supporters of the PM have revived an appreciative piece claimed to have been penned by NYT editor-in-chief Joseph Hope.", "The piece has also been widely shared by individual users on Facebook. We found that Gaurav Pradhan shared it on his Telegram channel.", "This slideshow requires JavaScript.", "The same piece was circulating earlier in February when farmers’ protests grabbed international attention after several celebrities and politicians tweeted in solidarity. International media outlets also started covering the protests, many of whom reported on police violence and the internet shutdown.", "The lengthy piece on Prime Minister Narendra Modi was shared to portray international support for him.", "Twitter user @angshguds made this claim in a January 29 tweet, which garnered more than 650 retweets at the time of writing.", "The editor of The New York Times is Dean Bacquet and a thorough search of the NYT website did not throw up any employee named ‘Joseph Hope’", "Moreover, the excerpt is replete with grammatical errors which would be unusual for an editor of an international media outlet. The author also seems to have gone out of their way to shower praises on Prime Minister Modi.", "Alt News reached out to Ari Isaacman Bevacqua, Director of Communications at The New York Times. He informed us that the American daily has neither written any such story on PM Modi nor does it have an employee named ‘Joseph Hope’.", "NY Times Communications also took to Twitter to call out the fake story viral in the outlet’s name, “A false claim circulating in India related to Prime Minister Narendra Modi and The New York Times has been fact-checked; it is not true.”", "A false claim circulating in India related to Prime Minister Narendra Modi and The New York Times has been fact-checked; it is not true. https://t.co/wh8J0ll570 pic.twitter.com/UY3l7r0QLj", "— NYTimes Communications (@NYTimesPR) January 30, 2021", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]