["About this rating", "In January 2020, as many young people started to worry about the potential of a third world war in the wake of a U.S. drone strike that killed Iran Gen. Qassem Soleimani, a text message started making its way around  claiming the U.S. Army was re-starting the military draft.", "The text message, which was ostensibly sent by the U.S. Army Recruiting Battalion, informed recipients they had been selected for the draft, and that they should visit their nearest military branch as soon as possible:", "The military draft has not been re-started, and these messages were not sent out by the Army.", "U.S. Army Recruiting Command put out a statement on Jan. 7, 2020, explaining that these text messages were fraudulent.", "A number of fraudulent text messages informing individuals they have been selected for a military draft have circulated throughout the country this week.", "U.S. Army Recruiting Command has received multiple calls and emails about these fake text messages and wants to ensure Americans understand these texts are false and were not initiated by this command or the U.S. Army.", "[...]", "The draft has not been in effect since 1973. The military has been an all-volunteer force since that time. Registering for the Selective Service does not enlist a person into the military.", "The U.S. Army Command and General Staff College wrote on Twitter that \"The U.S. Army is NOT contacting anyone regarding the draft.\"", "Searches for terms such as \"draft age\" spiked on Google after Soleimani's death on Jan. 3, 2020. This trepidation provided a ripe opportunity for \"satirist\" and hoaxers to push out misinformation. The Selective Service, the agency that would be responsible for conducting a new draft, put out a statement on Twitter saying no military draft would occur unless the Congress and U.S. president passed legislation:", "United States Army Recruiting Command.   \"URGENT NEWS: Army Recruiting Discredits Military Draft Texts.\"\r\n    7 January 2019.", "Rempfer, Kyle.   \"Army Says Text Messages Saying 'You've Been Selected for the Military Draft’ Are Fake.\"\r\n    Army Times.   7 January 2019 .", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]