["Rep. Joaquin Castro, D-Texas, speaks during the final day of the Democratic National Convention in Philadelphia, July 28, 2016. (AP Photo/Paul Sancya)", "Democratic Congressman Joaquin Castro claimed the U.S. economy would be negatively impacted if the Trump administration eliminated an immigration protection mostly benefitting Central Americans.", "The U.S. government routinely reviews whether to extend or terminate a country’s Temporary Protected Status designation, applied to countries with ongoing armed conflict, natural disasters, epidemics and other extraordinary, temporary conditions preventing the safe return of their nationals.", "Opponents of this status argue that while the protection is intended to be temporary, some designations are continuously renewed, allowing some recipients to stay in the country for many years. But Castro said ending it would come at a real cost of lost workers.", "\"Ending #TPS and deporting legal workers would cost the United States ~$164 billion in GDP over a decade,\" Castro tweeted on Nov. 1, ahead of the deadline for the U.S. government to decide on the current TPS status for Honduras and Nicaragua.", "Ending #TPS and deporting legal workers would cost the United States ~$164 billion in GDP over a decade. We must #SaveTPS.", "The United States on Nov. 6 decided to end Nicaragua’s designation, effective in 2019. Honduras’ designation, set to expire Jan. 5, 2018, was extended until July 5, 2018, because the Department of Homeland Security said it needed more time \"to obtain and assess\" additional information.", "We wanted to know if Castro’s claim on gross domestic product losses was accurate.", "The Texas representative's tweet is based on a report from a left-leaning organization whose calculation included immigrants’ potential lost earnings and industry chain reactions. Another group’s estimates, without industry output calculations, found a lower GDP loss of $45.2 billion.", "Castro’s office told us the congressman’s claim stemmed from an October report from the Center for American Progress, a liberal public policy research and advocacy organization.", "The group supports the designation, which is currently in effect for 10 countries: El Salvador, Haiti, Honduras, Nepal, Nicaragua, Somalia, Sudan, South Sudan, Syria, and Yemen.", "Immigrants living in the United States illegally as well as individuals on a valid nonimmigrant visa may apply for Temporary Protected Status if they meet certain criteria. Receiving the protection allows them to get work permits and avoid deportation, but does not lead to lawful permanent resident status.", "The center focused on GDP losses tied to recipients from El Salvador, Honduras and Haiti, the countries with the most beneficiaries. TPS holders from those three countries \"are employed at high rates,\" and are \"key contributors\" to the industries of construction, restaurant and other food services, landscaping services, child care, and grocery stores, the report said.", "The group’s analysis is based on estimates from the Center for Migration Studies of New York of about 302,000 TPS beneficiaries from those three countries (estimated using recent census data).", "If an estimated 244,200 beneficiaries from El Salvador, Honduras and Haiti are removed from the workforce, the United States would lose $164 billion in GDP over the next decade, the Center for American Progress report said.", "The calculation derives from a broader, separate study on GDP loss resulting from the removal of unauthorized workers in the United States. The researchers multiplied the number of employed TPS recipients with the losses associated with each unauthorized worker.", "\"By both assuming that the skill distribution of the workforce with TPS reflects that of the broader unauthorized workforce and expressing data in 2013 dollars, this analysis reflects a conservative estimate,\" the report said.", "The only other estimate of the potential consequence of ending this program that we could find was even more conservative.", "An April report from the Immigrant Legal Resource Center estimated a much lower GDP loss over a decade — $45.2 billion — without the wages of an estimated 190,000 TPS individuals from El Salvador, Honduras and Haiti.", "Nicole Svajlenka, coauthor of the Center for American Progress analysis, said her team’s numbers are much higher because they considered \"all that goes into a GDP, which is beyond earnings.\"", "\"We take into account workers’ educational attainment, nativity, and work experience as well as the industry composition to determine what would change if that worker was removed,\" Svajlenka said. \"Basically, we’re simulating some chain reactions — without these workers, some industries would shrink, other workers would shift, etc.\"", "Several researchers we reached out to said they had not done their own, independent analysis on this issue, but did not challenge Center for American Progress’ findings.", "David Dyssegaard Kallick, director of immigration research at the Fiscal Policy Institute, said it is sound to look at industry output when thinking about GDP loss.", "\"GDP, after all, is about measuring total output in the economy,\" he said.", "The center’s GDP estimates can also be seen as conservative \"since they do not take into account impacts associated with the likely withdrawal of a significant number of U.S.-born children of TPS holders,\" said Raul Hinojosa-Ojeda, an associate professor in the UCLA Department of Chicana and Chicano Studies.", "He added that TPS workers are also supporting the people hiring them, helping them generate profits. Many TPS holders also bought houses and have mortgages, said Hinojosa-Ojeda.", "Castro tweeted, \"Ending #TPS and deporting legal workers would cost the United States ~$164 billion in GDP over a decade.\"", "Castro accurately cited GDP loss reported by the left-leaning Center for American Progress. But at least one other report pegged a GDP loss three times as small, $45.2 billion. The report Castro used calculated lost earnings and impact on industries, the other report only looked at lost wages.", "We rate Castro’s claim Half True.", "Twitter, @joaquincastrotx tweet, Nov. 1, 2017", "Email interview, Rep. Joaquin Castro’s press office, Nov. 7, 2017", "Email interview, Tyler Q. Houlton, acting press secretary at the U.S. Department of Homeland Security, Nov. 7, 2017", "U.S. Citizenship and Immigration Services, Temporary Protected Status, last reviewed/updated Nov. 6, 2017", "U.S. Department of Homeland Security, Acting Secretary Elaine Duke Announcement on Temporary Protected Status for Nicaragua And Honduras, Nov. 6, 2017", "Center for American Progress, TPS Holders Are Integral Members of the U.S. Economy and Society, October 20, 2017", "Email interview, Center for American Progress press office, Nov. 7, 2017", "Migration Policy Institute, Temporary Protected Status in the United States: A Grant of Humanitarian Relief that Is Less than Permanent, July 2, 2014", "Immigrant Legal Resource Center, Economic contributions by Salvadoran, Honduran and Haitian TPS holders, April 2017", "Center for Migration Studies of New York, A Statistical and Demographic Profile of the US Temporary Protected Status Populations from El Salvador, Honduras, and Haiti, originally published July 2017, revised August 2017", "Email interview, Pew Research Center press office, Nov. 8, 2017", "Email interview, Raul Hinojosa-Ojeda, an associate professor in the UCLA Department of Chicana and Chicano Studies, Nov. 9, 2017", "Email interview, David Dyssegaard Kallick, director of immigration research at Fiscal Policy Institute, Nov. 9, 2017", "Email interview, Jill H. Wilson, analyst in immigration policy at Congressional Research Service, Nov. 7, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]