["The video retweeted by Trump -- who said he used hydroxychloroquine and has repeatedly touted it -- is from a July 27, 2020 press conference held by a group calling themselves “America’s Frontline Doctors,” who stood wearing white lab coats but without social distancing or any form of facial covering in front of the US Supreme Court.", "The tweet is the latest example of Trump making or promoting questionable claims about the coronavirus, which has left more than 149,000 people dead in the United States as of July 29, and comes just days after the president struck a more sober tone on the pandemic.", "Referring to the doctor featured in the video he helped spread, Trump said at a July 28 briefing: “I thought her voice was an important voice, but I know nothing about her.”", "The roughly 40-minute press conference -- an event supported by a conservative political group -- repeatedly cited the alleged benefits of hydroxychloroquine, an anti-malarial drug that the World Health Organization (WHO) said in June could be ruled out as a treatment for hospitalized COVID-19 patients.", "The “America’s Frontline Doctors” website, which is now offline, said “American life has fallen casualty to a massive disinformation campaign” and warned that “if Americans continue to let so-called experts and media personalities make their decisions, the great American experiment of a Constitutional Republic with Representative Democracy, will cease.”", "Dr. Stella Immanuel, who can be seen in the preview of the since-removed video retweeted by Trump, said during the press conference that she had successfully treated more than 350 COVID-19 patients.", "“The result has been the same. I put them on hydroxychloroquine, I put them on zinc, I put them on Zithromax, and they are all well,” said Immanuel, a Houston-based physician who said she was familiar with hydroxychloroquine from treating malaria patients in Nigeria.", "“I came here to Washington, DC to tell America: Nobody needs to get sick. This virus has a cure. It is called hydroxychloroquine, zinc and Zithromax,” she said.", "No medical study backs up her claim of a cure. As of July 29, more than 662,000 people have died worldwide from COVID-19.", "Asked about Immanuel’s remarks, Dr. Julian Leibowitz, an expert in coronaviruses who is a professor of microbial pathogenesis and immunology at Texas A&M’s College of Medicine, told AFP by email that “multiple studies have shown this to be wrong.”", "Dr. Shelley Payne, director of the LaMontagne Center for Infectious Disease at the University of Texas at Austin, agreed.", "“These are not cures for the virus. There is no evidence that hydroxychloroquine is effective either as a treatment or prophylactic,” she said by email.", "And Dr. Benjamin Neuman, an expert in coronaviruses who chairs the Biological Sciences department at Texas A&M University-Texarkana, said via email that “Hydroxychloroquine and Azithromycin have, separately and together, done well in a few small studies that generated a lot of hope.”", "But “both clearly and reproducibly failed to work beyond a reasonable doubt in larger studies” needed to determine if they were in fact effective, he said.", "Immanuel however declared that “any study that says hydroxychloroquine doesn’t work is fake science,” and dismissed those calling for more extensive research on the subject as “fake doctors.”", "She also said that, “You don’t need (a) mask. There is a cure” -- contradicting advice from the US Centers for Disease Control and Prevention on the use of cloth face coverings to slow the spread of the coronavirus.", "The WHO says on its website that “there is currently no proof that hydroxychloroquine or any other drug can cure or prevent COVID-19,” and that “the misuse of hydroxychloroquine can cause serious side effects and illness and even lead to death.”", "And in June, the US Food and Drug Administration revoked the Emergency Use Authorization (EUA) allowing hydroxychloroquine and chloroquine from the Strategic National Stockpile to be used to treat hospitalized COVID-19 patients.", "The “FDA determined that chloroquine and hydroxychloroquine are unlikely to be effective in treating COVID-19 for the authorized uses in the EUA,” it said.", "“Additionally, in light of ongoing serious cardiac adverse events and other potential serious side effects, the known and potential benefits of chloroquine and hydroxychloroquine no longer outweigh the known and potential risks for the authorized use.”", "Despite this, another doctor at the press conference, ophthalmologist Richard Urso, said that “this drug is super safe -- it’s safer than aspirin, MOTRIN, Tylenol,” and that the issue in studies that found otherwise was that they used too high a dose.", "Neuman disputed that assertion. “These studies used a variety of doses including large doses in order to try to find some effect from hydroxychloroquine, but were unable to substantiate any positive effect,” he said.", "“It would be nice if hydroxychloroquine worked the way people want it to work, or if we could collectively will such a thing to happen, but as we have seen with COVID-19, the biology of infectious disease is not swayed by wishful thinking.”", "Not all claims made at the press conference centered on hydroxychloroquine.", "Dr. Bob Hamilton, a California pediatrician, urged a reopening of schools shuttered by the pandemic.", "“Our kids are not really the ones who are driving the infection, it is being driven by older individuals. And yes, we can send the kids back to school, I think, without fear,” he said.", "“We need to normalize the lives of our children. How do we do that? We do that by getting them back in the classroom,” Hamilton said, adding that “security measures” could be taken.", "But Payne said: “Children may not be the drivers, but they can be infected and some deaths have occurred in children. We don’t know if they will pass it on to their teachers, since schools have been closed since the early days of the pandemic.”", "And Neuman noted that “a rising number of infections among toddlers and young children has been reported across the US.”", "Dr. Simone Gold, who was listed as the founder of “America’s Frontline Doctors” on its website, questioned the importance of COVID-19 case statistics.", "“The only number that I think is worth paying any attention to, and even that number is not so helpful, is mortality, because that’s a hard and fast number,” she said in response to a question from a member of the small in-person audience about how people can get the “right information.”", "“So the case number is almost irrelevant, and that’s because there’s a lot of inaccuracies with the testing,” Gold said.", "This, however, is inaccurate.", "“It is important to know the number of infections and their distribution. This will help the epidemiologists determine how easily the disease spreads and whether we... will approach herd immunity in some areas, although it appears that we are far below that level of infection at this point,” said Payne.", "And “testing is becoming more widespread and is sufficiently accurate to diagnose most infections.”", "Regarding the testing claim, Neuman said: “I worry that we will see a drop in testing that is voluntary, spurred on by outdated and inaccurate statements like these that encourage people not to get tested.”", "Although speakers concentrated on medical issues, the press conference for the July 27-28 “America’s Frontline Doctors Summit” in Washington was ultimately a political event.", "The right-wing Tea Party Patriots Foundation funded and helped organize the summit, the overall theme of which was to “help ease the fears of Americans about reopening the economy and schools by highlighting treatment options, dispelling myths and lies, etc.”", "Tea Party Patriots co-founder Jenny Beth Martin spoke at the press conference, telling Americans that they should contact their elected representatives and say “that you want to know why you’re not able to get access to a drug that doctors are telling you will help end this and help us reduce the number of hospitalizations and reduce the number of deaths.”", "Hamilton meanwhile took aim at teachers’ unions in his remarks, saying: “The barrier to getting our kids back in school is not gonna be the science, it’s going to be the national unions” that “are gonna demand money.”", "And Urso said that the “political situation has driven the fear” of hydroxychloroquine.", "Representative Ralph Norman, a Republican congressman from South Carolina, spoke at the beginning of the press conference.", "“I appreciate these physicians taking the time to come out and tell us the truth about the cures and the things that we can do to lessen the pandemic,” he said in remarks primarily focused on reopening schools.", "Norman stressed in a statement on July 28 that he was “just there to talk about schools” and did not know what Immanuel planned to say.", "But he also decried the removal of footage of her remarks by social media companies, saying in the statement: “Don’t silence her just because what she said was objectionable! That’s un-American!”", "Social media companies are working to remove footage of the press conference from their platforms.", "Twitter said that “tweets with the video are in violation of our COVID-19 misinformation policy,” Facebook said it includes \"false information about cures and treatments for COVID-19,” and YouTube said: “We have removed the video for violating our COVID-19 misinformation policies.”", "But the footage is still circulating online despite these efforts -- something that also occurred with “Plandemic,” another video that peddled falsehoods about COVID-19, which AFP fact checked here.", "Zarine Kharazian of the Atlantic Council's Digital Forensic Research Lab, which focuses on identifying and exposing disinformation, said that social media platforms seem to have moved faster against the video of the press conference than they did with “Plandemic.”", "But “the video was already viewed at least 14 million times before it was removed, and copies are still circulating online,” she said by email.", "And “this video went more viral than Plandemic, in terms of pure views. Plandemic received about 8 million views over several days,” Kharazian said.", "AFP Fact Check has debunked more than 570 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]