["Then-Vice President Dick Cheney, right, administers the Senate oath to Vice President-elect Joe Biden during a ceremonial swearing-in, Jan. 6, 2009, on Capitol Hill. (AP)", "President-elect Joe Biden is reportedly planning to recruit Washington veterans to serve in his administration. Among the names that have been floated: Sen. Chris Coons and Rep. Karen Bass, both Democrats who have served in Congress for the past decade.", "But rumors spreading on social media suggest he’s stacking his cabinet with Republicans. We’ve already debunked a claim that Biden tapped Republican Sen. Mitt Romney for the Department of Health and Human Services. And we found no evidence that Biden is considering his Republican predecessor as vice president, Dick Cheney, for a different position.", "\"CNN just said Dick Cheney was advising Joe Biden,\" read one Facebook post.", "\"CNN says Dick Cheney will be advising Biden on foreign policy,\" another said.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Biden campaign didn’t respond to our questions about this post. But we found nothing on CNN’s website to suggest that Biden has asked Cheney to be a foreign policy adviser, or any kind of adviser. We found no other news coverage, either, that corroborates these Facebook posts.", "Biden has in the past expressed admiration for Cheney, saying, \"I actually like Dick Cheney, for real,\" and calling him \"a decent man.\" Former President George W. Bush, whom Cheney served with, is one of the few senior Republicans who have congratulated Biden on his victory.", "But there’s nothing to support the claims in these posts, and CNN hasn’t reported on Cheney joining the Biden team.", "We rate them False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Nov. 7, 2020", "Facebook post, Nov. 7, 2020", "The Associated Press, Biden eyes Washington veterans for key administration posts, Nov. 9, 2020", "Business Insider, Joe Biden’s past praise for Dick Cheney is suddenly getting attention one week into his 2020 campaign, May 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]