["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A BP gas station was destroyed in an arson fire during unrest in the Sherman Park neighborhood in Milwaukee following the fatal shooting of a man by Milwaukee police on Aug. 13, 2016. (Mike Sears photo)", "After a weekend of arsons and attacks on police in the Sherman Park neighborhood of her home city, U.S. Rep. Gwen Moore was interviewed Aug. 15, 2016 on MSNBC.", "There was this exchange between talk show host Lawrence O’Donnell and the Milwaukee Democrat:", "O’Donnell: One of the things that the history of this subject shows everywhere in the United States, is that when you get a violent community reaction like this, it is never for that one individual incident, it's always an accumulation of past grievances that have not been satisfactorily addressed in terms of the community's understanding of them, at least. Is that the case in Milwaukee?", "Moore: Oh, absolutely, Lawrence. You know, we have one of the youngest African-American populations in the country. And the dearth of resources for summer jobs, for economic well being, for basic things like the ability to pay rent for women and the high incarceration rate for black males. We have the highest incarceration rate among African-American men in the country. And it creates a powder keg.", "Similar claims were made by other Milwaukee Democrats, including state Sen. Lena Taylor on CNN, and have been reported by national media.", "So, does Milwaukee have the nation’s highest incarceration rate for black males?", "There is data to indicate that Milwaukee ranks very high.", "But there isn’t city-level data on a national level to know whether it ranks highest.", "Moore’s evidence", "To back Moore’s claim, her office cited a study from the University of Wisconsin-Milwaukee entitled \"Wisconsin’s Mass Incarceration of African American Males: Workforce Challenges for 2013.\" It has been widely cited, but its major finding is about Wisconsin, not Milwaukee, and it is dated.", "The study said that as of 2010, 12.8 percent of working-age African-American men were in state prisons or local jails -- the highest such rate in the country, with Oklahoma ranking second.", "The study also said that in Milwaukee County, over half of African-American men in their 30s and half in their early 40s had been incarcerated in state correctional facilities at some point in the past.", "Other experts", "Keith Humphreys, a Stanford University psychiatry professor who has written on the black incarceration rate, and Marc Mauer, executive director of The Sentencing Project, said the UWM study appears to be solid research. They also said both Milwaukee and Wisconsin have high rates of black male incarceration.", "But they and University of Wisconsin-Madison sociology professor Pamela Oliver,  whose research work includes the Wisconsin Racial Disparities Project, told us there simply isn’t city-level data nationally in order to rank Milwaukee.", "Oliver said it’s likely Milwaukee would rank high among larger U.S. cities with large black populations, but that \"many members of the general public incorrectly assume that because 70 percent of Wisconsin’s black people live in Milwaukee County that anything that is true about Wisconsin really refers to Milwaukee. It is more complicated than that.\"", "Mauer noted that his organization, which works to address racial disparities, reported in June 2016 that -- among black males and females -- Wisconsin has the second-highest rate of black incarceration in the nation, behind Oklahoma.", "(Unlike the UWM study, the Sentencing Project study didn’t include local jails. And no local-level data was reported.)", "Our rating", "Moore said: Milwaukee has \"the highest incarceration rate among African-American men in the country.\"", "There are indications that Milwaukee has a very high black male incarceration rate, including a 2016 study that ranks Wisconsin ranks second in the incarceration of black males and females in state prisons.", "But there are no local-level data on a national basis to determine exactly where Milwaukee ranks.", "For a statement that is partially accurate, our rating is Half True.", "TV News Archive, MSNBC interview of Gwen Moore, Aug. 15, 2016", "Email, Gwen Moore spokesman Eric Harris, Aug. 23, 2016", "University of Wisconsin-Milwaukee, \"Wisconsin’s Mass Incarceration of African American Males: Workforce Challenges for 2013,\" 2013", "YouTube, CNN interview of Lena Taylor (38:00), Aug. 14, 2016", "Mother Jones, \"These Stats Show Why Milwaukee Was Primed to Explode,\" Aug. 17, 2016", "Associated Press, \"By many measures, Milwaukee is toughest U.S. city for blacks,\" Aug. 16, 2016", "Interview, Stanford University psychiatry professor Keith Humphreys, Aug. 25, 2016", "Interview, University of Wisconsin-Madison sociology professor Pamela Oliver, Aug. 25, 2016", "Washington Post, \"There’s been a big decline in the black incarceration rate, and almost nobody’s paying attention,\" Feb. 10, 2016", "Email, The Sentencing Project executive director Marc Mauer, Aug. 25, 2016", "The Sentencing Project, \"The Color of Justice: Racial and Ethnic Disparity in State Prisons,\" June 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]