["About this rating", "On Nov. 23, 2019, the Daily World Update website published an article positing that House Speaker Nancy Pelosi had approved $4.8 million to be paid to the Clinton Foundation, a charity run by former President Bill and Secretary of State Hillary Clinton, for \"impeachment consulting fees\":", "Nancy Pelosi Approves $4.8 Million In ‘Impeachment Consulting Fees’ To Clinton Foundation", "As if the impeachment of President Trump weren’t already silly enough, reports from our DC insiders indicate that there’s one organization raking in a ton of cash from the operation: The Clinton Foundation. In department memos not released to the public, Nancy Pelosi is said to have more or less agreed to the consulting fees to the fake charity in the amount of nearly $5 million, because “they have specific knowledge of this area.", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical. See above if you’re still having an issue with that satire thing.", "The article was a play on impeachment proceedings then underway against President Donald Trump, as well as the fact that former President Clinton had been impeached by the U.S. House of Representatives in 1998. Trump was similarly impeached by the House on Dec. 18, 2019.", "For background, here is why we sometimes write about satire/humor.", "Eagleton, Flagg.   \"Nancy Pelosi Approves $4.8 Million in ‘Impeachment Consulting Fees’ to Clinton Foundation.\"\r\n    Daily World Update.   23 November 2019.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]