["The blog article -- “Tupac Shakur spotted in Lesotho as Thupa Maru Shakuru” -- has been shared more than 13,500 times on Facebook, according to statistics on CrowdTangle, a social media analysis tool.", "Comments on the article showed that some people appeared to take the claim seriously.", "The claim can be seen here and here on Facebook.", "It includes an image of what appears to be Shakur in Basotho dress, with an inset photograph of the rap maestro when he was alive.", "However, a Google reverse image search tells us Shakur’s resurrection as a resident of the Mountain Kingdom was purely a digital event.", "The original photograph shows no resemblance to Shakur and was taken on September 15, 2013, in Lesotho by Kelly Baetsen for the Netherlands travel magazine, Columbus Travel.", "Furthermore, the article comes from Rom Newz, a website that publishes both satirical and real news stories, and tags them accordingly.", "Shakur, or just Tupac to his fans, was shot several times in a drive-by shooting in Las Vegas on September 7, 1996. He died six days later on September 13, 1996. To this day his murder has never been solved.", "Despite this, several conspiracy theories about the famous rapper have been perpetuated in the years since. Last year, there were some who believed a grainy image was proof that he was alive in South Africa.", "Other theories claim he was smuggled to Cuba or that he was seen in a car in Somalia.", "And this recent Rolling Stone article discusses an upcoming film about the rapper escaping from the University Medical Center in Las Vegas and relocating to New Mexico.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]