["By Saranac Hale Spencer", "Posted on March 16, 2018", "Q: Are Coca-Cola and Nestlé preparing to privatize a major South American water source?", "A: No. The vast Guarani Aquifer is managed by the four countries that sit on top of it.", "One of the world’s largest underground water reserves is shared by the four countries that sit on top of it.", "Brazil, Paraguay, Uruguay and Argentina agreed in 2010 to a management plan that aims to conserve the 8 quadrillion gallons of water in the sprawling Guarani Aquifer.", "However, stories wrongly claiming that Coca-Cola and Nestlé are planning to “privatize” the reservoir have recently been circulating online. They’ve been shared more than 50,000 times on Facebook, and they’re not true.", "Some Facebook users rightly flagged them as potentially false, while others believed them and posted comments such as: “SATANIC CORPORATIONS DESTROYING OUR PLANET.”", "This isn’t the first time that rumors of privatization of the aquifer have erupted. Starting in 2008, there were baseless theories that the Bush family was trying to control the water source.", "The most recent round of unfounded claims appears to have started in February with a post on a website called Truth Theory. That story relied on a 2016 article from an alternative Brazilian newspaper as its only source.", "A few weeks after the Truth Theory story went up, a site called Mint Press News posted a story making the same claim about privatization even more forcefully, adding a sense of legitimacy to it by referring to Brazil’s conservative president, Michel Temer, and his recent appearance at the World Economic Forum in Davos, Switzerland.", "But the Mint Press story offered no evidence to support its claim, just vague statements such as: “The push to privatize the Guarani Aquifer comes amid an increased militarization of the region by the Pentagon.”", "Still, it was picked up and republished by several other websites.", "But, the fact is, the aquifer is so large — covering an area twice the size of France — that it would be physically impossible for a private company to control, experts told us. We talked to four.", "“It’s like saying someone could own one of the Great Lakes,” said Zachary Sugg, a fellow at Stanford Law School who wrote a paper in 2015 about the governance of the Guarani Aquifer.", "It covers such a vast area that it would be impossible for one corporation, or pair of corporations, to control, said Gabriel Eckstein, a law professor who runs the International Water Law Project. There are municipal water systems connected to it, as well as single farmers with hand-dug wells, he said.", "Also, the aquifer is shared by the four countries that have agreed to manage it.", "Following a six-year study of the aquifer — led by the World Bank — Brazil, Paraguay, Uruguay and Argentina agreed to a first-of-its-kind management plan governing the use of an aquifer by multiple countries that follows the principles set out in the United Nation’s Law of Transboundary Aquifers.", "So far, only Uruguay and Argentina have officially ratified the agreement, although Brazil moved closer to ratification when its Senate approved the plan in 2017. That said, all four countries have long-standing arrangements about water use, according to the United Nations.", "The countries would also be bound by existing international water law, said Maureen Walschot, a researcher at Institut des Sciences Politiques Louvain-Europe who studies transboundary hydropolitics.", "So, if one country were to sell a major share of the water to a private company, the other countries sitting on the aquifer could bring a case in the International Court of Justice, she said. For example, Chile filed a suit in 2016 against Bolivia over a long-simmering dispute about the use of an unrelated aquifer, the Silala River system.", "As it is now, Coca-Cola bottling plants draw from four taps in Brazil that connect to the Guarani Aquifer, company spokeswoman Mackenzie Anderson told us. There are approximately 2,000 major taps connected to the aquifer, according to the World Bank’s study.", "In a statement emailed to FactCheck.org, the beverage company denied claims that it is angling to “privatize” the aquifer, saying: “The Coca-Cola Company is not negotiating with the any government of any country to grant exploitation of the Guarani Aquifer.”", "Nestlé also refuted the allegation in an email to us that said: “Nestlé does not extract water from any part of the Guarani Aquifer in South America, including in Brazil. We have no plans to do so and neither are we discussing this matter with the Brazilian authorities. Suggestions to the contrary in stories online are incorrect.”", "Both companies emphasized their efforts to act responsibly in their treatment of water issues.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label false stories flagged by readers on the social media network.", "NASA. “Study: Third of Big Groundwater Basins in Distress.” Jet Propulsion Laboratory California Institute of Technology. 16 Jun 2015.", "Eriksson, John and Rogers, Peter. “Case Study of the Guarani Aquifer Project.” The World Bank. 2006.", "The World Bank. “IMPLEMENTATION COMPLETION AND RESULTS REPORT.” 31 Jul 2009.", "Froelich, Amanda. “Coca-Cola And Nestlé To Privatize The Largest Reserve Of Water In South America.” TruthTheory.com. 5 Feb 2018.", "Gabriel, Elliot. “Coke, Nestle Near Ownership of World’s Second Largest Aquifer.” MintPressNews.com. 26 Feb 2018.", "Romero, Simon. “New President of Brazil, Michel Temer, Signals More Conservative Shift.” The New York Times. 12 May 2016.", "Rodreigues, Vivianne. “Brazil’s Temer Appeals to Davos Elite.” Bloomberg. 24 Jan 2018.", "Sugg, Zachary, et al. “Transboundary groundwater governance in the Guarani Aquifer System: reflections from a survey of global and regional experts.” Routledge. 8 Jun 2015.", "United Nations Development Programme. “International Waters: Review of Legal and Institutional Frameworks.” 5 Apr 2011.", "The World Bank. “The Guarani Aquifer Initiative – Towards Realistic Groundwater Management in a Transboundary Context.” Nov 2009.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]