["A viral post shared on several websites claims to offer evidence that President Barack Obama benefited from voter fraud during his 2012 reelection race against Mitt Romney.", "Headlined \"Ever Wonder Why Republicans Want Voter ID?\" the post offers factoids that seem to point to voter fraud in critical states. We've rated the Florida claims Pants on Fire! PolitiFact is also looking at the claims about Pennsylvania and Ohio in separate fact-checks.", "For this item, we'll look at the \"fun fact\" at the end of the meme: \"Obama won in every state that did not require a photo ID and lost in every state that did require a photo ID in order to vote.\"", "It's clear from the context that the post is talking about the 2012 election, because it mentions Republican Mitt Romney twice.", "So did voter ID determine whether Obama won or lost in a state?", "Not at all.", "We checked with the National Conference of State Legislatures, the nonpartisan Washington-based organization that keeps track of which states have voter identification laws and rates the rigidity of those laws. The group made a tally of the mandatory photo ID laws in effect for the 2012 election.", "It's true that Obama lost in the states that had a strict photo-only ID requirement in 2012, but merely four states — Georgia, Indiana, Kansas and Tennessee — had that requirement, a salient fact the post neglects to mention. (A few more states have added a strict photo ID requirement that apply in the 2016 elections.)", "That a Democrat would lose in those states, regardless of a photo ID requirement, is not surprising.", "Georgia and Indiana have voted for Republican candidates in seven of the last eight presidential elections since 1984, Tennessee has done it in six out of eight, and Kansas has done it in eight out of eight.", "This trend pre-dated the photo ID laws, the first of which was implemented in 2008.", "The post is ridiculously wrong when it says Obama won in every state that did not require a photo ID.", "Obama lost in 20 of the 46 states without a strict photo ID requirement.", "If you include the seven additional states that asked for a photo ID but allowed other types of identification as well, such as a credit or debit card in the voter's name, Obama won four (Florida, Hawaii, Michigan and New Hampshire) and lost three (Idaho, Louisiana and South Dakota).", "The post does not identify who created it.", "Our ruling", "An anonymous, viral post claims that in 2012, \"Obama won in every state that did not require a photo ID and lost in every state that did require a photo ID in order to vote.\"", "Obama did lose in the four states that had such a law in effect in 2012, but those states historically vote Republican in presidential elections anyway. The post is flat wrong about Obama winning states that do not require a photo ID. He lost in 20 states that lacked the requirement.", "On the whole, we rate the statement False.", "https://www.sharethefacts.co/share/ae22eaa3-6b2d-4ae8-b909-e0b3d8f543fd", "National Conference of State Legislatures, \"Then and Now: How Voter ID has changed since 2012,\" June 6, 2016; \"Voter ID History,\" April 18, 2016; and the \"Then and Now: 2012 to 2016 comparisons\" section of \"NCSL's The Canvass,\" May 20, 2016", "Emails and interview, Wendy Underhill, program director for elections and redistricting, National Conference of State Legislatures, Aug. 8, 2016", "ProPublica, \"Everything You've Ever Wanted to Know About Voter ID Laws,\" updated March 9, 2016", "Brennan Center for Justice, \"Voting Law Changes in 2012,\" Oct. 3, 2011 and \"Election 2012: Voting Laws Roundup,\" Oct. 11, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]