["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On March 16, President Joe Biden was walking to an awaiting helicopter on the White House grounds when he stopped briefly to talk to a group of reporters, some holding boom mics.", "\"Do you have any plans to travel to the southern border?\" a reporter asked.", "\"Not at the moment,\" Biden said. He answers another question about COVID-19 vaccines and then walks on.", "The moment is unremarkable, unless you’ve been misled to believe the whole thing is a fraud — that the interview was fake and the president was acting in front of a green screen.", "A YouTube video that has been viewed more than half a million times is among the many social media posts to spread this false claim.", "Titled \"Biden fakes interview, green screen fails,\" the post alleges that \"the reporters were not there\" because of how Biden’s hands appear in relation to the microphones.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The YouTube video uses two clips of Biden talking to reporters. One clip is from The Hill and the other is from the Washington Post.", "Around the 9-second mark in The Hill’s video, Biden’s hands appear to move in front of the microphones as if they weren’t there. There’s no denying that it looks strange. But it doesn’t prove he’s talking in front of a green screen.", "Steve Herman, a Voice of America reporter who was holding one of the microphones, tweeted about the rumors on March 17.", "\"I was the one holding the lighter-colored fuzzy microphone and thus literally in front of @POTUS on the South Lawn,\" Herman wrote. \"It’s all real.\"", "Herman also shared a video created by Mick West, who writes about conspiracy theories. In the video, West explains that because the microphones were on long booms, which enable reporters to maintain physical distance from the president amid the coronavirus pandemic, they give the illusion that something is amiss.", "He recreated a similar scenario in his own yard and filmed it from different angles. The effect is the same.", "\"It does look weird, but once you understand what’s going on, it’s pretty obvious,\" he says in the video.", "Herman noted in an email to PolitiFact that, even when there's not a pandemic, the booms are regularly used during outdoor helicopter talks due to challenging acoustics.", "Other images from that day show the president, microphones and reporters from other angles.", "In this Reuters image, taken by photographer Tom Brenner, Biden can be seen from the side talking to reporters who are standing several feet away with their microphones extended forward. This Getty Images shot, by photographer Drew Angerer, shows Biden standing behind the microphones from below. This Washington Post video shows the interview from a different angle than the Hill video.", "And this clip, shared by FiveThirtyEight reporter Kaleigh Rogers, shows the different videos side by side.", "While the clip that’s being shared on social media may look odd, it’s not a hoax. It’s an optical illusion.", "We rate the claim that Biden faked this interview with reporters in front of a green screen Pants on Fire!", "YouTube video, March 17, 2021", "The Washington Post, Biden does not plan to travel to border amid migrant surge, March 16, 2021", "The Hill tweet, March 16, 2021", "Steve Herman tweet, March 17, 2021", "YouTube video, March 17, 2021", "The Peninsula, Biden to hold first news conference on March 25 - White House, March 17, 2021", "Politico, Biden to hold first news conference March 25, March 26, 2021", "Mashable, Conspiracy theorists think Joe Biden used a green screen to fake a recent appearance. (He did not.), March 17, 2021", "Kaleigh Rogers tweet, March 17, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]