["By Angelo Fichera", "Posted on June 5, 2018 | Updated on August 3, 2021", "Q: Is Nathan Larson — who has expressed support for pedophilia, rape and incest — a Republican candidate for Congress?", "A: No. Larson is running for a Virginia congressional seat as an independent.", "A Virginia man who admitted in a recent HuffPost interview to writing online in support of rape, incest and pedophilia is indeed running for Congress. But he is not representing the GOP, as one story claims.", "“Nathan Larson Is A Proud Pedophile — And Also A GOP Congressional Candidate” reads a June 1 headline that is circulating on Facebook.", "But Larson has filed to run as an independent candidate in the state’s 10th Congressional District, not as a Republican.", "Larson’s declaration of candidacy and petition of qualified voter forms show that he elected to run in the general election — and not in any party’s primary election.", "The story on Blue State Daily proceeds to link Larson’s candidacy with President Donald Trump’s endorsement of Republican Roy Moore, the former U.S. Senate candidate in Alabama accused of sexual misconduct and assault of young girls. Moore denied the accusations, which centered on alleged conduct years before he was a candidate.", "HuffPost detailed how Larson, a 37-year-old accountant, created websites that served as chat rooms for pedophiles and misogynists. There, according to HuffPost, he “wrote numerous posts endorsing child rape and other forms of sexual abuse.” He also has openly espoused such beliefs in other interviews and said he supports incest.", "Larson has a young daughter whom, according to what he told the Washington Post, he met only once during a supervised visit.", "Larson has described himself as a “quasi-neoreactionary libertarian.” The Libertarian Party of Virginia disavowed Larson and expelled him from the party in 2017, when he unsuccessfully ran for a seat in Virginia’s House of Delegates (on a campaign platform that included legalizing child pornography). He also ran for Congress as a libertarian in Virginia’s 1st Congressional District in 2008.", "That same year, court documents show, Larson was accused of sending an email to the Secret Service threatening to kill the president. He pleaded guilty in 2009, and was sentenced to 16 months in prison.", "He has not been criminally charged for any acts relating to his stated support for pedophilia, rape or incest.", "Update, Aug. 3, 2021: Two and a half years after the publication of this story, in December 2020, Larson was arrested in connection with allegations he kidnapped a 12-year-old girl from California. He was subsequently indicted on federal charges, including kidnapping, transportation of a minor with intent to engage in illegal sexual activity, and receipt and distribution of material involving the sexual exploitation of minors.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk false stories shared on the social media network.", "Cook, Jesselyn and Campbell, Andy. “Congressional Candidate In Virginia Admits He’s A Pedophile.” HuffPost. 31 May 2018.", "Guilty plea. United States of America v. Nathan Daniel Larson. United States District Court for the District of Colorado. 14 May 2009.", "Judgment. United States of America v. Nathan Daniel Larson. United States District Court for the District of Colorado. 9 Oct 2009.", "Larson, Nathan Daniel. Commonwealth of Virginia Declaration of Candidacy. 2 May 2018.", "Larson, Nathan Daniel. Commonwealth of Virginia Petition of Qualified Voters. 12 Feb 2018.", "“Libertarian Party of Virginia Censures Potential Candidate.” Press release. Libertarian Party of Virginia. 28 Feb 2017.", "“Nathan Larson Is A Proud Pedophile — And Also A GOP Congressional Candidate.” Blue State Daily. 1 Jun 2019.", "“November General HOD 2017 List of Candidates.” Virginia Department of Elections. Accessed 4 Jun 2018.", "Olivo, Antonio. “He threatened to kill the president. Now he is seeking public office.” The Washington Post. 8 Mar 2017.", "Virginia Department of Elections. “Elections Database.” Accessed 4 Jun 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]