["“FYI People in Texas FEMA is paying for hotels if you know anyone without heat or water call 1800 745 0243,” a screenshot included in a February 17, 2021 Facebook post says.", "Other examples of the claim can be found here and here.", "Texas is finally seeing above freezing temperatures after a cold snap that burst water pipes and led to blackouts. Utility companies struggled to restore power in the state, seven million people were told to boil water before consuming it, and authorities opened 300 emergency “warming centers.”", "But free hotel rooms are not part of FEMA’s response.", "When asked about the claim circulating on social media, FEMA directed AFP to a February 18, 2021 tweet by its official regional account.", "“There is a false phone number being shared with a message about FEMA paying for hotels for Texas Disaster Relief. This is a scam,” the tweet reads. “The best information on legitimate sources of help in your area will come from local officials & @TDEM (Texas Division of Emergency Management).”", "In a second tweet posted the same day, the agency also informed social media users that it was  providing generators to “support critical sites like hospitals,” as well as 729,000 liters of water and more than 50,000 cotton blankets.", "Carman Apple, District Coordinator for the Texas Division of Emergency Management, said by email that it had been made aware of the false claim circulating on social media.", "“We echo our partners at FEMA in saying that ‘This is a scam,’” she said.", "Similarly, Officer Daniel Segura of the Fort Worth Police Department said it had issued a warning about the scam on Facebook.", "George Fuller, mayor of the city of McKinney, issued a warning on February 18, and explained in a Facebook message that FEMA told him that “they do not directly interface with homeowners, etc. in that way.”", "Even though the phone number mentioned in the social media posts appears on FEMA’s website here, it is not currently linked to any form of emergency lodging programs.", "When called, the line connects the speaker to an automated menu to reach the “FEMA internet technical help desk.”", "The automated voice is then followed by a manually-recorded message: “FEMA is not currently providing assistance directly to individuals and families for the winter storm in Texas. If there is an emergency, please hang up and call 911. If you have other needs such as food or shelter, hang up and dial 211 for a referral to a voluntary organization that may be able to assist.”", "Through a Facebook search, AFP found that one of the first posts to share the claim, on February 17, linked to a CLC Lodging web page about the Emergency Lodging Assistance Program in designated disaster areas for FEMA qualified individuals.", "“FEMA is paying for hotels. If you know of anyone that needs it,” the Facebook post says.", "The web page describes an initiative in which FEMA contracts with CLC Lodging to pay hotel bills for survivors of disasters.", "The program manager at CLC Lodging, Dax Spencer, explained by email that “the Emergency Lodging Assistance Program is not active at this time. Therefore, no individual in any state or territory is staying under this particular program at this time.”", "Other posts, like those here and here, have also circulated since the storm, claiming FEMA is distributing $800 vouchers to Texans for food and citing the agency’s disaster assistance helpline and webpage as references.", "This is also incorrect. When called, the number mentioned in the posts starts with a warning to callers that “FEMA programs do not pay for fuel or food losses,” and to contact “2-1-1 for local resources.”", "On February 20, the agency also issued an official warning on its regional Twitter page that it was not providing “food vouchers” but was accepting “applications for assistance” for residents who live in designated areas.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]