["By Eugene Kiely, Lori Robertson and D'Angelo Gore", "Posted on October 3, 2019 | Updated on October 23, 2019", "President Donald Trump’s request that Ukrainian President Volodymyr Zelensky investigate Democratic presidential candidate Joe Biden and his son, Hunter, has triggered an impeachment inquiry. Since then, the president has made a series of inaccurate claims about his phone call with Zelensky, which he calls “perfect.”", "Here are some of the claims the president has made over the past two days about the phone call and the whistleblower’s complaint, which included an accurate account of the phone call:", "On Aug. 12, an anonymous intelligence community official filed a whistleblower complaint accusing the president of “using the power of his office to solicit interference from a foreign country in the 2020 U.S. election.” The complaint included a description of a July 25 phone call that Trump made to Zelensky, who was elected the president of Ukraine on April 21.", "On the call, “the President pressured Mr. Zelenskyy to … initiate or continue an investigation into the activities of former Vice President Joseph Biden and his son, Hunter Biden,” and assist a U.S. review of allegations that the “Russian interference in the 2016 U.S. presidential election originated in Ukraine,” according to the whistleblower’s complaint. Trump asked Zelensky to “meet or speak with two people the President named explicitly as his personal envoys on these matters, Mr. [Rudy] Giuliani and Attorney General [William] Barr,” the complaint said.", "That description was confirmed by a memo of the call, which the White House released on Sept. 25.", "“There’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great,” the memo says Trump told Zelensky. “Biden went around bragging that he stopped the prosecution so if you can look into it … It sounds horrible to me.”", "The memo of the call also showed Trump asked Zelensky to “find out what happened with this whole situation with Ukraine” and the 2016 presidential campaign, and urged him to speak with Barr and Giuliani, the president’s personal attorney.", "At a Sept. 26 House intelligence committee hearing, Rep. Joaquin Castro asked Maguire, the acting DNI, if the whistleblower’s complaint is “remarkably consistent” with the memo of the phone call that was released by the White House.", "“I would say that the whistleblower’s complaint is in alignment with what was released yesterday by the president,” Maguire said.", "Nevertheless, the president misstated Maguire’s answer when asked about it during an exchange with reporters in the Oval Office.", "Reporter, Oct. 2: But your own DNI said the call transcript was consistent with the complaint. So, should only whistleblowers —", "Trump: No, no, no, he didn’t say that. You have to take a look.", "Reporter: He did say that.", "Trump: No, no, no. He did not say that. And, in fact, if you look at what he said, he found everything to be very normal. He’s a good man, and — Joe. And he found it to be very normal.", "Maguire did not say he found the conversation to be “very normal.” Those words don’t appear in the CQ Transcriptions and C-SPAN transcripts of the hearing that we reviewed. Maguire wasn’t asked directly whether the call was appropriate or not, but he demurred several times when asked if the allegations in the complaint were concerning or illegal.", "In an exchange with Democratic Rep. Denny Heck, Maguire declined to say if soliciting foreign interference in a U.S. election is illegal. “I’m not a lawyer, sir. I don’t mean to be evasive, but I can’t answer,” Maguire said. But in response to a follow-up question, Maguire said outside foreign interference would be “unwanted” and “bad for the nation.”", "Heck, Sept. 26: Is it okay for a president to pressure — any president — to pressure a foreign government for help to win an election?", "Maguire: It is unwarranted. It is unwelcome. It is bad for the nation to have outside interference, any foreign power.", "Maguire repeatedly said the complaint was credible, and that it should be investigated. Asked if “someone should investigate this,” Maguire noted that he referred the complaint to the Department of Justice. “If I didn’t [think it should be investigated], I would not have referred it to the Justice Department and to the FBI.”", "But he also said he wouldn’t presume to tell the committee whether it should investigate the president or not, and he wouldn’t tell the president how to conduct foreign policy.", "In response to Democratic Rep. Michael Quigley, who asked if the complaint concerned him, Maguire said: “How the president of the United States wants to conduct diplomacy is his business, and it’s not whether or not I approve it or disapprove of it. That is the president’s business on how he wants to conduct that, sir.”", "Trump claimed on Oct. 2 that the White House-released memo on his July 25 phone call with Zelensky was “an exact word-for-word transcript of the conversation … taken by very talented stenographers.” That’s incorrect. The memo includes a “caution” note saying it “is not a verbatim transcript.”", "The president made the claim before a bilateral meeting with the president of Finland, Sauli Niinistö, and then repeated it later on Oct. 2 in a press conference. Trump said, “I had a transcript done by very, very talented people — word for word, comma for comma. Done by people that do it for a living. We had an exact transcript.”", "But the memo itself leaves no doubt that it is not an “exact transcript.” It is the “notes and recollections,” it said, of staff “assigned to listen and memorialize the conversation.”", "Here’s the full “caution” note that appears at the bottom of the first page of the White House’s memo on the phone call:", "Memo of July 25 Trump-Zelensky phone call: CAUTION: A Memorandum of a Telephone Conversation (TELCON) is not a verbatim transcript of a discussion. The text in this document records the notes and recollections of Situation Room Duty Officers and NSC policy staff assigned to listen and memorialize the conversation in written form as the conversation takes place. A number of factors can affect the accuracy of the record, including poor telecommunications connections and variations in accent and/or interpretation. The word “inaudible” is used to indicate portions of a conversation that the notetaker was unable to hear.", "Trump has made several claims about the memo refuting the whistleblower complaint, referring, falsely, at one point to the complaint as “total fiction.” The White House memo actually corroborates some of the whistleblower’s claims, which the inspector general of the intelligence community deemed an “‘urgent concern’ that ‘appears credible.’”", "In his Oct. 2 press conference, Trump talked about releasing the “exact transcript” (see above) and added, “And when we produced that transcript, they died. Because you look at the whistleblower statement, and it’s vicious.”", "On Oct. 3, he said, “The whistleblower never saw the conversation. He got his information, I guess, second and third hand. He wrote something that was total fiction, and now when people see that they’re not happy.”", "We’ll lay out what the whistleblower and the White House memo said about the July 25 phone call.", "The whistleblower complaint said that “[m]ultiple White House officials with direct knowledge of the call” said that Trump “sought to pressure the Ukrainian leader to take actions to help the President’s 2020 reelection bid.” It said that, according to these officials, Trump “pressured” Zelensky to do three things:", "Trump denies that he “pressured” Zelensky to do these things. But the White House memo of the call shows he asked for them, with the exception of explicitly asking for the servers to be turned over — though Trump asks about the DNC server. The memo is unclear on this point.", "The White House memo said Trump asked Zelensky:", "So, the White House memo backs up the whistleblower’s complaint on the three main asks Trump had of Zelensky in the phone call.", "The complaint also said: “The President also praised Ukraine’s Prosecutor General, Mr. Yuriy Lutsenko, and suggested that Mr. Zelenskyy might want to keep him in his position.”", "Trump twice praised a Ukrainian prosecutor general, saying, “Good because I heard you had a prosecutor who was very good and he was shut down and that’s really unfair,” according to the White House memo. “I heard the prosecutor was treated very badly and he was a very fair prosecutor.”", "Trump claimed that Republican Sen. Mitch McConnell “read my phone call” and “put out a statement that said that was the most innocent phone call he’s read.” “I spoke to him about it too,” Trump said.", "We don’t know what McConnell told Trump privately — his Senate office did not respond to a request for comment. But we did not find that McConnell used the “most innocent” language in his public remarks and press releases, or on social media.", "McConnell did release a statement to Politico for its Sept. 25 story about the Senate majority leader’s response to “Trump’s Ukraine scandal.” However, the statement does not support Trump’s claim.", "“I’ve read the summary of the call,” McConnell said, according to the story. “If this is the ‘launching point’ for House Democrats’ impeachment process, they’ve already overplayed their hand. It’s clear there is no quid pro quo that the Democrats were desperately praying for.”", "Politico reported that McConnell’s statement also said it is “laughable to think this is anywhere close to an impeachable offense.”", "McConnell’s statement clearly dismisses some of the criticism of Trump’s call with Zelensky, but he doesn’t describe the call as “innocent,” either.", "The White House did not provide any other statements from McConnell.", "Update, Oct. 23:  CBS News reporter Nancy Cordes asked McConnell on Oct. 22 if he told Trump that the president’s phone call with Zelensky was “perfect” and “innocent,” as Trump has claimed. McConnell said no. “We’ve not had any conversations on that subject,” McConnell said. “I don’t recall any conversations with the president about that phone call.”", "In his Oct. 2 press conference, Trump also claimed that Sen. Rick Scott of Florida described the call as “a perfect conversation.” Scott didn’t use those words.", "“I heard Rick Scott today say, ‘That was a perfect conversation. How can they impeach him on that conversation?’” Trump said.", "Scott didn’t say the call was “perfect”; he has actually said he would have said things differently than Trump. But he did say he didn’t see the call as an impeachable offense.", "“I still don’t see what the crime is,” Scott said in a Fox News interview earlier that day. “I keep saying, show me what the crime is. No one ever says that. They say he shouldn’t have done it. Well, all of us would do things differently than other people would do it but if we’re going to impeach somebody there ought to be something they did wrong.”", "“When you read the transcript, the president says things differently than I would say them but, again, what they’re talking about, is there a violation of law?” Scott said in an interview with a Spectrum News reporter the week prior. “And I didn’t see it. No one’s shown me a law that the president violated.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]