["The Facebook post has been shared more than 3,200 times and shows a woman being assaulted and heckled on a train station platform while a crowd watches the unfolding drama.", "The post draws attention to the fact that the woman is white and her assailants black.", "“I believe this incident happened somewhere on a platform in Bloemfontein? Help us find this poor woman and help her lay charges against this Racist ANC/EFF Government and claim the hell out of them. Also post this act of PURE RACISM AND COWARDICE BY THE BLACKS HERE - LET THE WORLD SEE WHAT IS REALLY HAPPENING BEHIND THE SCENES”, the caption reads.", "Bloemfontein is both the judicial capital of South Africa and capital city of Free State province, while the ANC (African National Congress) and EFF (Economic Freedom Fighters) are two of the country’s political parties, the former in power since 1994.", "The incident, however, did not happen in Bloemfontein, or anywhere in the country, for that matter.", "For starters, the people in the video are shouting in Portuguese, making it unlikely the video was recorded in South Africa.", "A keyword search of similarly-worded claims on Facebook found numerous posts about a woman having been attacked in a train station in Portugal.", "Several posts on Twitter and Facebook from early May (here, here and here) refer to the incident as having taken place in Portugal.", "A reply to one of the tweets includes another video which captures what is described as the first part of the altercation. Again, Portuguese can be heard, while the woman’s red top and leopard-print pants can be seen in both clips.", "Another reply links to a local news article about the incident. Dated May 2, 2020, the report (in Portuguese) details how a 35-year-old woman was arrested on April 30, after allegedly assaulting a Comboios de Portugal train employee on the Sintra Line at Mercês station, which is about an hour's ride west of Lisbon.", "Similar reports were carried in local articles here and here.", "Finally, we took a screenshot of a logo on the train in the background of the video published with the false claim and matched it to an image on the train company’s website, proving the altercation happened in Portugal.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]