["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Andrew Cuomo announced that higher risk sports, such as ice hockey, can resume. (John Hickey/Buffalo News)", "State lawmakers have been among those pushing the Cuomo administration to allow all high school sports to resume, even those the state deems \"higher risk\" such as wrestling, competitive cheerleading, basketball and hockey.", "In a news conference on Jan. 14, Assemblymember Colin Schmitt, a Republican who represents parts of Orange and Rockland counties, said neighboring states have allowed students to play and New York should follow suit.", "\"We have scientific data, from all different levels, but particularly from the high school sports levels, from numerous different states that shows that it is safe to play what New York is considering high-risk sports,\" he said.", "Last week, the New York State Department of Health announced those sports will be allowed to return Feb. 1.", "Now the question has become even more important to a lot of families whose children may want to play: Is Schmitt right? Does scientific data show it is safe to play amid a pandemic?", "We approached Schmitt’s office about his claim, and his chief of staff, Taylor Weyeneth, sent us information from several sources. He reiterated Schmitt’s statement that with Covid-19 safety measures in place, sports can resume without a high risk of transmission.", "A news story from earlier this month dealt with rapid testing of student athletes in Michigan. The 4,000-plus students who played football and volleyball and competed in swimming competitions took a test before they practiced or competed. The state found 99.6% of the tests came back negative since testing began Dec. 30.", "A University of Wisconsin study of Covid-19 and high school sports, published in October, was based on surveys of 207 high school athletic departments that had re-started sports. Those departments accounted for more than 30,000 students, 4,000 games and 16,000 practices during September. The sports included, but were not limited to, cheerleading, soccer and football. The survey showed 271 coronavirus cases reported among the students, with only one case traced back to school sports. The infection rate among high school student athletes was lower than the rate among the general population of their peers, the authors wrote.", "We asked the University of Wisconsin School of Medicine and Public Health about the study.", "The school’s dean, Dr. Robert N. Golden, said in a statement that the study does not represent the views of the school, and he cautioned the data came from high school athletic departments and that the study had not been peer-reviewed.", "\"High schools across the country are working to make the best decisions they can regarding the health and safety of their athletes, and we do not believe this report should play a major role in shaping their decisions,\" said Golden.", "A survey in Kentucky tracked responses from more than 12,000 high school football players and support staff. The survey, conducted by football coaches and reported on by the Cincinnati Enquirer, found that less than 1% of participants reported being infected with the coronavirus after two months of meetings and practices. None of the cases could be traced back to workouts. Not everyone was tested. The data was collected in an effort to persuade state officials to resume play, according to the Enquirer.", "We asked experts about the risk of Covid-19 spread among high school athletes allowed to play amid the pandemic.", "Dr. Chad Asplund, a primary care and sports medicine physician at the Mayo Clinic in Rochester, Minn., said from what is known, the majority of the infections do not occur during games, but through everything that goes with them: meals, travel and hanging out with teammates. \"But from the data available, it appears that there has not been a significant amount of transmission during athletic contests,\" Asplund said.", "As far as which sports are riskier, he said that those with more direct contact, such as wrestling, are more likely to transmit the virus between athletes, while outdoor sports are less likely. Indoor sports pose more risk, but some of that can be mitigated with improved ventilation and air flow. He also said spectators should be masked and socially distant, especially indoors in an enclosed space, such as a hockey rink.", "Ice hockey, considered \"higher risk\" in New York, has been deemed the source of several clusters or outbreaks around the country, including in Minnesota, Massachusetts, New Hampshire and Maine. During an amateur indoor hockey game between adults in Florida, 13 were infected, according to the Centers for Disease Control and Prevention.", "\"The indoor space and close contact between players during a hockey game increase infection risk for players and create potential for a superspreader event, especially with ongoing community COVID-19 transmission,\" CDC researchers wrote.", "The American Academy of Pediatrics says ice hockey in particular \"carries a higher relative risk.\"", "Regarding all youth sports, the academy cautions that the number of players, the frequency and duration of contact, and whether students are playing outside or inside can influence whether infection will be transmitted during school sports.", "\"Risk can be decreased but not eliminated by athletes, parents, coaches, and officials following safety protocols,\" according to the academy’s guidance from December.", "Dr. Donald Milton, a professor of environmental health at the University of Maryland School of Public Health, studies Covid-19 transmission. While his lab hasn’t studied this specific question, he said safe sporting events are doable with rapid tests before practices and games, twice-weekly PCR testing, contact tracing, air filtration, and proper mask wearing.", "Dr. Ingrid Ichesco, who specializes in pediatric sports medicine at Michigan Medicine C.S. Mott Children’s Hospital, said there’s many benefits with sports from a physical and mental standpoint, and those benefits have to be weighed against the risks.", "\"Obviously, anything where you’re in close proximity there’s a risk for Covid transmission,\" she said.", "Schmitt said scientific data shows it’s safe to play all sports while following health and safety protocols, even those considered \"high risk.\"", "But the data that Schmitt provided did not address all of the high-risk sports.", "There are indications that participation in certain sports does not lead to greater transmission of the virus. And the University of Maryland professor we talked to said he believes high school students can play sports safely by following the right precautions. But the key word in Schmitt's statement is \"scientific.\" Tallying survey results is not conclusive scientific evidence regarding all of the sports that Schmitt wanted to see resumed, such as wrestling and ice hockey.  Even the medical school dean at the University of Wisconsin advised against relying on a colleague's report because it wasn't peer reviewed and the data collection depended on the high schools. If Schmitt had said \"mounting evidence\" or \"early indications\" show playing high school sports is safe amid a pandemic, that would not have been false. But he said \"scientific data,\" which implies a more rigorous standard has been met. It hasn't.", "We rate Schmitt’s claim Mostly False.", "Facebook video of news conference about coronavirus and school sports, Assemblymember Colin Schmitt, Jan. 14, 2021. Accessed Jan. 15, 2021.", "News release, Assemblymember Colin Schmitt, \"Assemblyman Colin Schmitt Announces Legislation to Safely Resume All Interscholastic Sports Without Delay,\" Jan. 14, 2021. Accessed Jan. 15, 2021.", "Letter, Assemblymember Colin Schmitt, to Gov. Andrew Cuomo, et. al., Jan. 11, 2021, via Colin Schmitt Facebook page. Accessed Jan. 20, 2021.", "Email interview, Taylor Weyeneth, chief of staff, Assemblymember Colin Schmitt, Jan. 19, 2021.", "USA Today, op-ed, Jon Solomon, editorial director of the Aspen Institute's Sports and Society Program, Dec. 8, 2020. Accessed Jan. 19, 2021.", "Lohud.com, \"Department of Health provides a bleak outlook for high-risk winter sports,\" Jan. 7, 2021. Accessed Jan. 20, 2021.", "New York State Department of Health, \"Interim Guidance for Sports and Recreation During the Covid-19 Public Health Emergency,\" Jan. 22, 2021. Accessed Jan. 25, 2021.", "New York State Public High School Athletic Association, news release, \"NYSPHSAA Postpones Start Date for High Risk Winter Sports,\" Nov. 17, 2020. Accessed Jan. 20, 2021.", "MLive.com, \"Coronavirus tests for Michigan high school athletes has resulted in 99.6 percent negative results, state officials say,\" Jan. 11. 2021. Accessed Jan. 20, 2021.", "Centers for Disease Control and Prevention, Morbidity and Mortality Weekly Report, \"An Outbreak of COVID-19 Associated with a Recreational Hockey Game — Florida, June 2020,\" Oct. 16, 2020. Accessed Jan. 20, 2021.", "University of Wisconsin, \"COVID-19 in Wisconsin High School Athletics: Study Summary,\" October 2020. Accessed Jan. 22, 2021.", "American Academy of Pediatrics, Covid-19 Interim Guidance: Return to Sports, Dec. 17, 2020. Accessed Jan. 20, 2021.", "Washington Post, \"Youth sports have been hit with few coronavirus outbreaks so far. Why is ice hockey so different?,\" Dec. 4, 2020. Accessed Jan. 21, 2021.", "University of Wisconsin-Madison School of Medicine and Public Health, Department of Orthopedics and Rehabilitation, \"COVID-19 in Youth Soccer Study: Executive Summary,\" Dr. Andrew Watson, et. al., Sept. 27, 2020. Accessed Jan. 20, 2021.", "Centers for Disease Control and Prevention, \"Considerations for Youth Sports Administrators,\" Dec. 31, 2020. Accessed Jan. 22, 2021.", "Emailed statement, Dr. Robert N. Golden, dean, University of Wisconsin School of Medicine and Public Health and vice chancellor for medical affairs, Jan. 21, 2021.", "HighschoolOT.com, \"Physicians: High school sports can be safe with proper precautions,\" Oct. 28, 2020. Accessed Jan. 21, 2021.", "The Boston Globe, \"State guidelines pave the way for Massachusetts high schools to hold winter sports seasons,\" Nov. 6, 2020. Accessed Jan. 21, 2021.", "Fox61, \"CIAC high school winter sports practice begins today,\" Jan. 19, 2021. Accessed Jan. 21, 2021.", "Email interview, Dr. Donald Milton, principal investigator, Public Health Aerobiology, Virology, and Exhaled Biomarker Laboratory, University of Maryland School of Public Health, Jan. 21, 2021.", "Phone interview, Dr. Ingrid Ichesco, Michigan Medicine C.S. Mott Children’s Hospital, Jan. 22, 2020.", "Associated Press, \"UW study: High school sports have not spread the COVID-19 coronavirus,\" Oct. 23, 2020. Accessed Jan. 27, 2021.", "ABC News, \"As youth hockey emerges as coronavirus threat, families fight to stay in the game,\" Nov. 16, 2020. Accessed Jan. 22, 2021.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]