["About this rating", "In 1975, photographer Garry Gross took several nude photographs of a 10-year-old Brooke Shields that were later published in a Playboy publication called Sugar and Spice. This series of photographs has been the source for controversy for decades. But many internet users were blissfully unaware of the images until one appeared in a meme featuring a photograph of Playboy founder Hugh Hefner and passed around on social media:", "The girl in the background of this meme is indeed a naked 10-year-old Shields, and the photograph was truly published by Playboy. Although this meme may have given some viewers the impression that the image appeared in Playboy magazine itself, the picture was actually featured in the Playboy Press publication Sugar and Spice.", "The above-displayed photograph is one of many that Gross took with the consent of Shields' mother, Teri Shields, in 1975. In 1981, with Sugar and Spice out of print and Shields' profile on the rise, Shields sued Gross, arguing that the photographer should not be allowed to continue to profit from the images, and that the photographs would cause her irreparable harm.", "The lawsuit was dismissed in a 4-3 decision by the New York State Supreme Court. Justice Edward Greenfield stated that the pictures were \"not erotic or pornographic\" except to \"possibly perverse minds,\" and that while the images might cause Shields personal embarrassment, they did not constitute \"irreparable harm\" as Shields' profile had risen in the years since the photographs were taken.", "Greenfield also criticized Shields' mother for trying to \"have it both ways,\" saying the actress had starred in provocative roles in movies such as Blue Lagoon and Pretty Baby:", "Wed, Nov 11, 1981 – 6 · The News Leader (Staunton, Staunton, Virginia, United States of America) · Newspapers.com", "Here's an excerpt from a contemporaneous article published by the Washington Post:", "Washington Post: It was Mom who decided six years ago to let Gross take pictures of her nude daughter for a book, published the next year by Playboy Press, called \"Sugar and Spice.\" Then a funny thing happened to little Brooke: she burst out of her cocoon and turned into a great big star, just like that. Suddenly the pictures acquired a new and alluring value; and suddenly Brooke and Mom decided that, with the book out of print, Gross had no business peddling the pictures anywhere else, even though Mom had signed a release for them.", "So they went to court, where Justice Greenfield ruled against them. He said that the pictures were \"not erotic or pornographic\" and that Brooke would not suffer irreparable damage if they were republished; he ruled that Gross had not violated the terms of the release.", "And so long as he was at it, Justice Greenfield delivered himself of a tidy lecture on the subject of stage motherhood. He described Teri Shields as \"a concerned mother\"; he said she lived not merely \"for\" her daughter but also \"through\" her. He said that her behavior was \"maternally protective and exploitative,\" that she wanted \"to have it both ways\" by representing Brooke as \"sexually provocative and exciting while attempting to preserve her innocence.\"", "An appellate court overturned the decision, but in 1983 the original verdict was upheld.", "This wasn't the only time these nude images of Shields were at the center of a controversy. In 2009, artist Richard Prince, known for \"reproduction\" photography, used one of Gross' images of Shields for an artwork entitled \"Spiritual America.\" The photograph was set to be displayed at the Tate Modern Gallery, but it was removed after Scotland Yard suggested that it might violate London's obscenity laws.", "Associated Press.   \"Judge Lambasts Actress' Mother.\"\r\n    11 November 1981.", "Higgins, Charlotte and Vikram Dodd.   \"Tate Modern Removes Naked Brooke Shields Picture After Police Visit.\"\r\n    The Guardian.   30 September 2009.", "Yardley, Jonathan.   \"Sugar and Spice and Not Nice.\"\r\n    The Washington Post.   16 November 1981.", "Gambardello, Joseph.   \"Judge Scolds Brooke Shields' Mother for Exploiting Daughter.\"\r\n    UPI.   11 November 1981.", "Turner, Christopher   \"Sugar and Spice and All Things Not So Nice.\"\r\n    The Guardian.   2 October 2009.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]