["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On July 12, 2020, former game show host Chuck Woolery found himself in the spotlight after U.S. President Donald Trump retweeted a message from the \"Love Connection\" star in which he said that the Centers for Disease Control and Prevention (CDC), the media, Democrats, and doctors were all lying about the COVID-19 pandemic:", "A day later, a screenshot supposedly showing a second tweet from Woolery in which he announced that his son had tested positive for the virus started to go viral:", "Some social media users were skeptical that this second message was real. For starters, many people encountered this message as a screenshot, not on Woolery's timeline. Second, some suspected that the supposed \"karma\" of these messages was a bit too on the nose.", "This was a genuine tweet from Woolery, whose account, unfortunately, was deleted without explanation two days later on July 15. An archived version of that tweet is available here.", "Woolery has not provided any additional information about the condition of his son.", "Mangan, Dan.   \"Trump Retweets Game Show Host Chuck Woolery’s Baseless Claim That 'Everyone is Lying' About Coronavirus.\"\r\n    CBC.   13 July 2020.", "Update [15 July 2020]: Updated to report that Chuck Woolery's Twitter account was deleted.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]