["By Saranac Hale Spencer", "Posted on January 8, 2021", "Online posts falsely claim that there was fraud in the Senate runoff elections in Georgia, but the only evidence they offer are clips of election night newscasts that corrected two data-entry errors.", "Some of the same false claims that were aimed at undermining the Nov. 3 presidential election are now being launched at the Senate runoff elections that occurred in Georgia on Jan. 5.", "The claims, again, are false.", "Democrats Raphael Warnock and Jon Ossoff won both of the state’s U.S. Senate seats in the runoff elections, according to unofficial results from Georgia’s secretary of state. The Associated Press also has called the election for Warnock and Ossoff.", "But posts on social media falsely claim that news clips of election night reporting show that votes were taken away from Ossoff’s Republican opponent, incumbent David Perdue.", "No such thing happened. Rather, the clips show two data-entry errors that were quickly corrected.", "One of those errors was shown on both CNN and ABC. Clips from the networks have been circulating with the claim that they are evidence of election fraud, showing that votes had been subtracted from Perdue’s total.", "The scrolling statewide vote count at the bottom of the screen on both networks had shown Perdue’s tally at 774,723, before dropping to 742,323 — a difference of 32,400. “MORE ELECTION FRAUD: 32,400 Votes Removed from Senator Perdue’s Vote Tally Live on TV,” a Gateway Pundit headline said.", "That change, though, was actually a correction of faulty data for one county.", "Information from Bibb County had been logged in wrong by a data entry worker, explained Rob Farbman, executive vice president for Edison Research, which provides vote tabulation data to the networks.", "Shortly after 8 p.m. on Election Day, vote totals for Ossoff and Perdue were 27,986 and 12,496, respectively, Farbman wrote in an email to FactCheck.org. Less than 10 minutes later, the feed Edison uses reported that Ossoff’s vote total had remained the same and incorrectly reported that Perdue’s had increased by 32,400 to 44,896.", "“This error was obvious to our quality control team and corrected within 5 minutes. The initial error accounts for the brief additional 32k votes for Perdue. The vote drop reflected the correct vote,” Farbman wrote in the email.", "The next update from the state feed, about 20 minutes after the correction, reported 28,888 votes for Ossoff and 14,044 for Perdue, Farbman wrote.", "The unofficial results show that Perdue received a total of 23,695 votes in Bibb County, according to the secretary of state’s office. Ossoff received 39,439 votes.", "The other error was highlighted by major right-wing websites after being posted on social media.", "Those posts show Perdue’s statewide tally dropping by 5,000 during ABC News’ election night coverage.", "Similar to the other example, that was an error in the tally for one county.", "A data-entry worker in DeKalb County had mistaken the number “3” for the number “8,” leading to a 5,000-vote error, Farbman explained.", "That mistake was corrected less than five minutes later, he said.", "The same kind of short-lived, election night error was also used to fuel a conspiracy theory that a supercomputer had been used to switch votes away from President Donald Trump in the Nov. 3 election. We debunked that claim at the time.", "Data-entry errors on election night do occur, but they are not evidence of fraud. The fact that they were caught and corrected shows the system is working. Georgia’s runoff election results will become official after each county certifies its results and sends them to the secretary of state for statewide certification, which must be completed by Jan. 22.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Georgia Secretary of State. Runoff election results. Accessed 7 Jan 2021.", "Peoples, Steve, Bill Barrow and Russ Bynum. “Warnock, Ossoff win in Georgia, handing Dems Senate control.” Associated Press. 6 Jan 2021.", "Farbman, Rob. Executive vice president, Edison Research. Email to FactCheck.org. 6 Jan 2021.", "Fichera, Angelo and Saranac Hale Spencer. “Bogus Theory Claims Supercomputer Switched Votes in Election.” FactCheck.org. 13 Nov 2020.", "King, Michael. “When are votes certified in the state of Georgia?” WXIA-TV. Updated 7 Jan 2021.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]