["The 23-second video was published on Facebook here on November 7, 2019.", "The video’s caption states: “Pakistani flags appeared in Jalandhar, Indian Punjab today’s morning. Previously billboards were raised in Amritsar favoring PMIK.”", "Jalandhar and Amritsar are two towns in the northern Indian state of Punjab and PMIK is an acronym for Pakistan’s Prime Minister Imran Khan.", "“See this, this is Vijay Colony inside Jalandhar city and you can see Pakistani flags atop houses there,” a male voice can be heard saying in Punjabi language. “Not one, but eight to 10 flags can be seen there. It seems Jalandhar has also become a mini-Pakistan.”", "Below is a screenshot of the misleading Facebook post:", "The video was also published here and here on Facebook; here, here, here and here on Twitter -- alongside a similar claim.", "The claim is false; the flags are religious flags that were raised in Jalandhar ahead of a Muslim festival.", "Five flags appear in the first 14 seconds of the video, and afterwards, the video pans to the right and shows more flags.", "Below is screenshots of the flags in the video, with red circles and numbers added by AFP:", "The first flag -- the green flag positioned on the far left-hand side in the video -- can be found here in an online shop listing for “Eid-E-Miliad Flags”.", "The listing refers to Eid-e-Milad, the birthday of the Prophet Muhammad, which was celebrated on November 10 this year.", "Below is a comparison screenshot of the first flag in the misleading video (L) and the photo of the corresponding Eid-e-Miliad flag (R):", "The second flag corresponds with this online shop listing for an Islamic flag.", "The same flag can also be seen in this YouTube video of Muslims  celebrating Eid-e-Milad at a revered Sufi shrine in Delhi, starting at the 0:58 mark.", "Below is a screenshot comparison of the second flag in the misleading video (L) and the Islamic flag on the online shop (R):", "The seventh flag in the video also corresponds with the same Islamic flag.", "Below is a screenshot comparison between the seventh flag in the video (L) and the Islamic flag on the online shop (R):", "The fourth flag corresponds with another Islamic flag pictured here in a report published by Dainik Jagran, a Hindi-language daily, on November 5, 2019.", "Below is a screenshot comparison of the fourth flag in the video (L) and the image published by Dainik Jagran (R):", "The sixth flag in the video also corresponds with the same flag.", "Below is a screenshot comparison between the sixth flag in the video (L) and the flag in the Dainik Jagran photo (R):", "AFP could not locate the third flag and the fifth flag in the video, but it does not correspond with Pakistan’s national flag.", "Below are comparison screenshots of the third flag (top left), the fifth flag (top right) in the video, and an AFP photo of Pakistan’s national flag (bottom):", "This report about the flags in Jalandhar was published by Hindi-language daily Dainik Bhaskar on November 4, 2019.", "Below is a screenshot of the news report:", "“Ruckus over misconception of hoisting Pakistani flags, police first took them down and then put them on itself,” reads the headline. The second bullet point at the bottom of the image adds that “local people had decorated the area to celebrate the Prophet Muhammad’s birthday on November 10.”", "The misleading posts were also debunked by Indian fact-check site The Logical Indian here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]