["The claims have been shared more than 300 times on Facebook since September 27, 2020, including here and here.", "“Swaziland has passed into LAW the following TRADES with effect from 1st October 2020: NEW LAW ON BUSINESSES RESERVED 100% FOR Swaziland  CITIZENS ONLY FROM 01/10/2020 (All licenses for foreign owned businesses will NOT be renewed),” the post reads.", "According to the posts, the registration of businesses such as florists, mobile phone shops and cleaning services “shall be reserved for citizens or for companies WHOLLY owned by citizens”.", "There is no mention of the name of the purported law.", "A Google search with the keywords “new Eswatini law against foreign-owned business” finds articles about the government denying the claims.", "In a statement published on the government’s verified Facebook page, Minister of Commerce, Industry and Trade Manqoba Khumalo said the rumours were “malicious and damaging”.", "“No such law exists in the Kingdom of Eswatini, neither is there any move within parliament or elsewhere to introduce such a piece of legislation,” the statement read.", "“While it is true that certain businesses are reserved for Emaswati in terms of The Reservation of Certain Trades or Businesses for Swazi Citizens, Regulations, 2017, it is equally true that Eswatini encourages foreign direct investments hence our extensive investment drive across the globe. No new law has been passed since then to suggest otherwise.”", "According to news reports from December 2017, the law reserved ownership of 31 types of businesses for Eswatini citizens, including grocers, funeral parlours and street vendors. Reports at the time said the change only affected new applications for business licences, rather than pre-existing ones.", "A Google search using the headlines from the false claims reveals a Facebook post and a Twitter thread from May 2020 specifying similar measures in Botswana.", "AFP Fact Check found that the Eswatini posts were styled on Botswana government legislation published on May 20, 2020, announcing trade regulations under the Industrial Development Act that came into effect on June 1, 2020.", "Eswatini’s Prime Minister Ambrose Dlamini recently told AFP in August that the country was “open for business” and encouraged investors to “bring their money into the country” to boost the virus-hit economy.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]