["About this rating", "In 1861, the House and Senate expelled a combined total of 14 members for taking part in Southern secessionist efforts or supporting the Confederacy.", "None of the House and Senate motions to expel the 14 members cited their attitude toward Lincoln's election, which — since the men were attempting to secede from the Union — was of little relevance anyway. Comparisons with present-day political events were therefore stretched.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In December 2020, 126 Republican members of the U.S. House of Representatives signed on to an effort led by Texas Attorney General Ken Paxton to persuade the U.S. Supreme Court to suspend the certification of electoral college votes in four states where President-elect Joe Biden won — Georgia, Michigan, Pennsylvania, and Wisconsin.", "The Supreme Court declined to hear the case, marking the latest in a series of defeats for Republicans, supporters of outgoing President Donald Trump, and Trump's own campaign, which had sought to overturn Biden's victory through various state and federal courts, citing baseless claims of widespread and decisive electoral fraud.", "Despite the defeat of the Texas lawsuit, the fact that most Republican House members — including Minority Leader Kevin McCarthy and Minority Whip Steve Scalise — joined in the legally dubious effort to overturn the result of the election prompted outrage among some Democrats.", "U.S. Rep. Bill Pascrell, D-New Jersey, went so far as to call on the House to refuse to seat those 126 Republicans when the next Congress convenes in January 2021. On Dec. 11, he accused that cohort of having acted to \"tear the United States government apart\" and cited Section 3 of the 14th Amendment, a Civil War-era prohibition on holding public office by anyone who has \"engaged in insurrection or rebellion\" against the U.S. constitution.", "Against that background, University of Oklahoma Professor Keith Gaddie published a viral tweet that highlighted what he presented as a historical parallel and precedent for refusing to seat would-be members of Congress:", "\"As we play the Aliens & Seditions Game in Congress, a fun note: In 1861, 11 senators and 3 representatives were expelled for supporting the Confederacy and not acknowledging Lincoln's legitimate election. Have a good Friday.\"", "Gaddie's tweet was shared widely on Twitter as well as on Facebook, where users posted screenshots of it (as shown below), although Gaddie later deleted the tweet for reasons that are not clear.", "There was a significant degree of truth to Gaddie's claims. Exactly three members of the House and 11 Senators were indeed expelled from those chambers in 1861. All of them had joined or supported the Confederacy as Gaddie claimed. However, the contention that they had been expelled for \"not acknowledging Lincoln's election\" was misleading.", "The group of 14 were engaged in an effort by several Southern states to secede entirely from the Union, so the legitimacy of Lincoln's victory in the 1860 election was neither here nor there. As such, House and Senate motions calling for their expulsions made no mention of their purported attitude towards Lincoln's election but did indeed cite their participation in, and support for the Confederacy, as the reason for their expulsions.", "The three House members expelled in 1861 were: John Bullock Clark and John Reid of Missouri; and Henry Burnett of Kentucky. Burnett was expelled in December 1861 because of a motion that alleged he was \"in open rebellion against the government of the United States.\" Clark was expelled in July, for having \"held a commission in the Home Guard of Missouri\" (a pro-Confederacy militia) and for fighting with the Confederates at the Battle of Boonville. Reid was also expelled in December for \"having taken up arms against the government of the United States.\"", "In July 1861, 10 secessionist Senate members were expelled for being \"engaged in a conspiracy for the destruction of the Union and Government.\" They were: James Mason and Robert Hunter of Virginia; Thomas Clingman and Thomas Bragg of North Carolina; James Chesnut of South Carolina; Alfred Nicholson of Tennessee; William Sebastian and Charles Mitchel of Arkansas; John Hemphill and Louis Wigfall of Texas.", "In December, John Breckenridge of Kentucky was expelled because of a motion that declared he had \"joined the enemies of his country and is now in arms against the government he had sworn to support.\" Before Lincoln's election in 1860, Breckenridge had been vice president under James Buchanan, and went on to become a brigadier-general in the Confederate army.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]