["About this rating", "In December 2020, COVID-19 denialists, conspiracy theorists, and vaccine skeptics reacted in predictable fashion to news reports about the distribution of the first Pfizer/BioNTech vaccine doses in the United Kingdom on Dec. 8, 2020.", "Later that day, self-described conservative activist Mindy Robinson suggested misdeeds or deception were at work in the appearance of 90-year-old Margaret Keenan as the first person in the world to receive the vaccine since, according to Robinson, Keenan had appeared in a CNN report from two months earlier, suspiciously dressed in the exact same outfit.", "On Twitter, Robinson posted a screenshot from a Dec. 8 BBC News report that showed Keenan being attended to by a healthcare worker, along with the headline \"Covid-19 Vaccine: First Person Receives Pfizer Jab in UK\" alongside another screenshot taken from an Oct. 22 CNN article, which at first glance also appeared to be illustrated with a photograph of Keenan receiving a vaccination.", "Robinson wrote:", "Excuse me, but how is the exact same person who’s the “first to get vaccinated” today...also in a CNN photo wearing the exact same clothes, in the exact same chair, and getting a shot back in October? [Thinking face emoji] Which one of these lying stories did you want us to pretend is true?", "In reality, there was no deception, subterfuge, or conspiracy at work behind either the Dec. 8 BBC story, or the Oct. 22 CNN story. Keenan definitively did not appear in the earlier report, and Robinson hadn't ingeniously caught a shadowy cabal attempting to usher in a New World Order by secretly microchipping vaccine patients, or staging the vaccination campaign, or whatever specific wrongdoing or chicanery Robinson was alleging.", "In fact, the explanation was rather more mundane — either Robinson simply misunderstood a feature of CNN's website that causes new videos to be played on old webpages, or she knowingly misrepresented it.", "The screenshot of the BBC News report is authentic. The story can be read here. On Dec. 8, Margaret Keenan — originally from County Fermanagh in Northern Ireland but now living in Coventry, England — became the first person in the world to receive the Pfizer/BioNTech COVID-19 vaccine as part of an approved vaccination rollout.", "On the day, she wore a now-famous blue Christmas charity T-shirt and a gray cardigan, and she was given her vaccination by May Parsons, a matron at the University Hospital in Coventry, who is shown in photographs and videos alongside Keenan.", "The screenshot of the CNN story is more complicated. Some articles on the CNN website feature related embedded videos. Under those embedded videos, CNN places a \"reel\" of other video reports that are in some way related to the original one.", "So if a user navigates to the Oct. 22 CNN story in question — which carried the headline \"Faulty US Covid-19 response meant 130,000 to 210,000 avoidable deaths, report finds\" — the user should see the following video by default, and at the bottom of the screen, the \"reel\" of related videos:", "For readers accessing the October article after Dec. 8, one of those related videos had to do with Keenan and the other early recipients of the COVID-19 vaccine in the U.K. Readers can either deliberately choose one of the other videos from the reel, or simply do nothing — embedded videos on CNN have an \"autoplay next\" feature, meaning once a video ends, the site automatically starts up the next video in the reel.", "In this way, a reader could be on a web page that hosted an article from Oct. 22, while watching a video that was published much more recently, including the Dec. 8 video that featured Keenan receiving the COVID-19 vaccine. This is how that combination looked on CNN's desktop site:", "And for illustrative purposes, here's what it looks like when a different, unrelated video (this one about Rudy Giuliani) plays in the video embed frame on the Oct. 22 article:", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]