["-- Sri Lanka --", "A purported advisory about the Sri Lankan Air Force's plans to use helicopters to disinfect the country was published here on Facebook on March 24, 2020.", "It has been shared more than 1,000 times.", "Below is a screenshot of the misleading post:", "The Sinhala-language text superimposed on the image translates to English as: “No one should be outside after 11:30 PM tonight.", "Doors and windows must be kept shut as disinfectant is due to be sprayed into air to eradicate coronavirus from this country using helicopters.”", "COVID-19 was first detected in the Chinese city of Wuhan in December 2019. It has since killed more than 21,031 people and infected more than 465,915 others worldwide, according to data from the World Health Organization (WHO) on March 27, 2020.", "The claim was also shared among WhatsApp users and published on Facebook here, here, here and here.", "The claim is false.", "Sri Lanka's Government Information Department refuted the claims in a statement released on March 24, 2020.", "It states: “There is a false message circulating on social media that disinfectant will be sprayed by helicopters at 11.30 tonight to eradicate coronavirus and the Air Force Spokesperson notes that Sri Lanka Air Force is not involved in any such operation.\"", "Below is a screenshot of the original Sinhala media release:", "Sri Lanka’s Air Force Acting Director of Media, Group Captain Dushan Wijesinghe, also told Sri Lankan news site EconomyNext that the claim is “false” and that the Air Force “will not conduct any such operation.”", "-- The Philippines --", "An advisory claiming the Philippine Air Force will spray pesticide over the country in an effort to curb the spread of COVID-19 was published here on Facebook on March 21, 2020.", "Below is a screenshot of the misleading Facebook post, which has been shared almost 200 times:", "It states: \"Today, special military helicopters will spray pesticides against the Corona virus in the skies all over the country, so you must stay indoors after twelve o'clock at night. And remove all clothes which are outside . when you hear the sounds of airplanes at night, it is for you to know that it is related to this matter (COVID-19).\"", "A similar claim was also shared here, here, here and here on Facebook.", "This claim is also false; the Philippine Department of Health on March 21, 2020 denied the claim circulating online. It urged the public to source information from official accounts only.", "The Facebook statement reads, in part: \"Circulating news on PESTICIDE SPRAYING by military helicopters all over the country after 12 midnight to combat COVID-19 is NOT TRUE.", "\"DOH clarifies that there are no military helicopters or airplaine that will be deployed for spraying activities. The Department urges the public to source out information from official DOH channels. The public will also be notified on updates regarding the COVID-19 health event.\"", "Below is a screenshot of the Department of Health's release:", "The statement added that pesticides would not be effective in preventing COVID-19.", "It states: \"Pesticides work against pests, not viruses. COVID-19 is caused by a virus.\"", "According to this March 23, 2020 report by the state-run Philippine News Agency, the Philippine National Police also refuted the misleading claims.", "The report reads, in part: \"PNP spokesperson Brig. Gen. Bernard Banac denied the reports that the government, through the police and the military, will spray pesticides in the country using helicopters in the bid to kill the virus that causes Covid-19.", "“This is patently fake news and must be disregarded outright. The Inter-Agency Task Force for the Management of Emerging Infectious Diseases (IATF-EID) has denied any such flight operations,” Banac said in a statement.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]