["“मुसलमानों को वोट देने से रोक रहे है मोदी सरकार बीजेपी आरएसएस शिवसेना वाले बुड्ढे बच्चे और महिलाओं पर मारपीट कर रहे हैं इस वीडियो को मीडिया वाले शेयर नहीं करेगा इसलिए इस वीडियो को ज्यादा से ज्यादा शेयर करें और आर एस एस और मोदी के खिलाफ कार्रवाई होनी चाहिए. राजस्थान मै नागौर जिले के शहर नावा (Modi/RSS/Shiv Sena/BJP government are not allowing the members of the Muslim community to vote. Children, elders, and women are beaten. Media won’t share this video that’s why you have to share this video as much as you can. Action should be taken against the RSS and Modi. This incident happened in Nawa city of Nagaur district, Rajasthan -translated)”", "With the above message, a video of policemen lathicharging a group of people is being shared on social media. The message claims that the members of the Muslim community in Nagaur district, Rajasthan are not allowed to cast their vote. It accuses the BJP, RSS, Shiv Sena and Prime Minister Narendra Modi of being complicit in preventing the Muslim community from exercising their right to vote. The same video has been circulated with an identical claim without stating that it is from Rajasthan as can be seen in the tweet below.", "मुसलमानों को वोट देने से रोक रहे है मोदी सरकार बीजेपी आरएसएस शिवसेना वाले बुड्ढे बच्चे और महिलाओं पर मारपीट कर रहे हैं इस वीडियो को मीडिया वाले शेयर नहीं करेगा इसलिए इस वीडियो को ज्यादा से ज्यादा शेयर करें और आर एस एस और मोदी के खिलाफ कार्रवाई होनी चाहिए.", "Please verify this! pic.twitter.com/F1iUcOAJP4", "— 🚫CorruptBJP™CorruptRSS™©🚫🙈🙉🙊 (@BjpCorrupt) May 5, 2019", "Few more individuals on Twitter and Facebook have shared this video with an identical narrative.", "It is evident that the video is from Gujarat and not Rajasthan as the people can be heard speaking Gujarati. The fact that the video is from Gujarat is also corroborated by the multiple signboards written in Gujarati. “Deluxe Pan Parlour (translated)”, reads a Gujarati signboard in the screenshot posted below.", "Alt News investigated the video further with the help of a digital video verification tool Invid by breaking the video into multiple frames and running a reverse image search on one of the key frames. We were able to trace back the video to a tweet with the caption that suggested that the incident took place in a town in Gujarat called Viramgam.", "In Viramgam District of Ahmedabad, we can clearly see Police beating the minorities, while chowkidars are sleeping.@vijayrupanibjp @AhmedabadPolice pic.twitter.com/0lXyu6dp9b", "— Non-Polytikle Swaraj (@Polytikle) April 3, 2019", "A Google search with relevant Gujarati keywords led us to several news articles where this incident was reported. We came across an article published by a regional Gujarati news platform Akila News on April 1, 2019, with the title, “વિરમગામમાં કબ્રસ્‍તાનની દિવાલ બાબતે ઠાકોર-મુસ્‍લિમ વચ્‍ચે જૂથ અથડામણ (Group clashes between the Thakor-Muslim community on the wall of a cemetery in Viramgam -translated)”. The article by Akila News had multiple photographs of the said incident. We found that the individual photographs (labeled 1,2,3,4 in the screenshot below) matched the frames in the viral video.", "The Indian Express reported that at least six people were injured and 15 were detained in the aftermath of the clashes between two communities in Bhathipura area of Viramgam town. The incident happened when a woman was trying to hang washed clothes on the wall of a burial ground and some people took objection to it and this lead to a violent confrontation between two groups of people. “Six-seven persons were injured in the clash. An FIR was registered in the incident and when police personnel went to the spot to identify and arrest the accused, stones were pelted at police. Following this, another FIR was registered against the persons who pelted stones at police,” said a police officer in a statement given to The Indian Express.", "The video of an incident from Viramgam, Gujarat, which happened even before the elections started is being falsely shared as of Muslims being prevented from voting in the ongoing Lok Sabha polls.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]