["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As opioid deaths have risen in Ohio, the epidemic has become weaponized in political campaigns.", "Democrat Richard Cordray has cast some blame on his rival for governor, Republican Attorney General Mike DeWine.", "\"Mike DeWine has been a dismal failure as Ohio’s top cop. Opioid deaths have tripled on his watch and there have been cuts to funds for first responders and people in the community fighting the crisis,\" Cordray said in Springfield June 4.", "Cordray has previously pointed the finger saying DeWine and Republicans were \"asleep at the switch\" on opioids and that DeWine \"did nothing about it.\"", "Cordray’s statement is an overreach. Although Ohio is one of the hardest hit states by opioid overdoses, this is a national problem.", "Opioids (including prescription opioids, heroin, and fentanyl) killed more than 42,000 people in 2016, more than any year on record. About 40 percent of all opioid overdose deaths involve a prescription opioid. In October, President Donald Trump declared a national emergency. The over-prescribing of opioids began in the mid 1990s amid a marketing campaign telling doctors that they should prescribe more opioids to help ease patients’ pain.", "Dr. Andrew Kolodny, co-director of opioid policy research at Brandeis University, said it is \"silly\" to blame DeWine — or any other state attorney general — for the increase in overdose deaths.", "\"There are certain levers attorney generals can pull to impact opioids, but they would not have any short-term impact on opioid deaths,\" he said.", "Cordray's campaign cited state health data showing opioid overdose deaths tripled from 1,163 in 2011 to 3,495 in 2016, overlapping with DeWine’s tenure. Cordray was elected attorney general in November 2008 to fill a vacancy, and he lost his bid to keep the seat to DeWine in 2010.", "The data shows that one of the key reasons behind the spike in overdoses was the increase in deaths from fentanyl, which is up to 50 times more potent than heroin. These overdoses soared from 73 in 2011 to 2,357 in 2016.", "To tackle the epidemic, DeWine filed has lawsuits against drug manufacturers in 2017 and drug distributors in 2018. He has also devoted money to assist addicts and victims, added scientists and equipment to test drugs, sponsored training for law enforcement, formed a heroin unit and negotiated an agreement to reimburse local agencies that use Naloxone, a treatment to stop overdoses.", "But bringing the epidemic under control requires reducing the incidence of new people addicted and increasing access to treatment. Those goals are not under the purview of an attorney general.", "\"I do not think it makes sense to blame the attorney general,\" said Kolodny. \"I think there is a lot of blame to go around but pointing to a single state official is silly.\"", "Kolodny has criticized the federal response both under Trump and Barack Obama and called for more federal money.", "Orman Hall, who worked in Gov. John Kasich’s administration on the opioid epidemic, said he doesn’t believe law enforcement will solve this problem.", "DeWine effectively used his bully pulpit and put forth a good-faith effort to deal with the problem. However, as the attorney general, he doesn’t have access to funds to significantly impact treatment or the health care system.", "DeWine countered that it was Cordray \"who was asleep\" on the issue of opioids when he was attorney general, a position he held before DeWine.", "It’s also misguided to blame Cordray, because when he was attorney general the state didn’t yet fully understand the extent of the problem but was beginning to take action, Hall said.", "\"Everybody made a good faith effort,\" Hall said. \"Nobody has done anything very successful.\"", "Cordray’s campaign pointed to news reports about the state budget cutting money to local governments.", "Some of those cuts started before DeWine was attorney general and then were exacerbated amid a nearly $8 billion budget shortfall in 2011. Kasich initiated reductions to the state’s Local Government Fund, which is used by local governments for any purpose.", "The cuts by the state led to cuts for police, fire and other local services.", "Shelby County Sheriff John Lenhart, a Republican who endorsed Cordray, told PolitiFact that the cuts hurt law enforcement’s ability to investigate crimes, including crimes related to opioids.", "Cordray spokesman Mike Gwin said that DeWine \"failed in his responsibility to stand up for law enforcement - to fight for additional money in the state budget for badly-needed resources for the first responders, sheriffs, and police officers on the front lines of this fight.\"", "However, as attorney general, DeWine doesn’t oversee the state budget signed by Kasich and can’t be blamed for state budget cuts.", "Cordray said, \"Opioid deaths have tripled on (Mike DeWine’s) watch and there have been cuts to funds for first responders and people in the community fighting the crisis.\"", "Opioid deaths tripled between 2011 and 2016. However, there is no evidence that DeWine bears responsibility for the spike in overdoses, something that occurred nationally.", "The state budget did cut money to local governments but as attorney general, DeWine doesn’t set the overall state budget.", "There is a kernel of truth here in that the deaths did triple on DeWine’s watch and Kasich did sign state budgets that cut money to local governments, but Cordray has failed to provide evidence that as attorney general DeWine is to blame.", "We rate this claim Mostly False.", "Dayton Daily News, \"Medicaid expansion key in opioid abuse fight, Cordray says in Springfield,\" June 4, 2018", "Ohio Attorney General, \"Attorney General DeWine Releases Interim Report on Pilot Program Helping Families Overcome Substance Abuse Issues and Reducing Childhood Trauma,\" May 30, 2018", "Ohio Attorney General, \"Attorney General DeWine Files Lawsuit Against Opioid Distributors for Practices Fueling Opioid Diversion,\" Feb. 26, 2018", "Ohio Attorney General news release, \"Three Million in Grants for DART and QRT Teams to be Available to Address Opioid Epidemic,\" July 11, 2017", "Ohio Attorney General news release, \"Attorney General DeWine Files Lawsuit Against Opioid Manufacturers for Fraudulent Marketing; Fueling Opioid Epidemic,\" May 31, 2017", "Ohio Attorney General news release, Attorney General DeWine Announces Formation of New Heroin Unit, Nov. 18, 2013", "Ohio Attorney General, News releases about pill mills, 2012-2013", "Ohio Attorney General news release, \"Overdose Prevention Task Force Issues Recommendations,\" April 16, 2015", "Ohio Attorney General news release, \"Public Interest Price for Adapt Pharma Naloxone to Freeze for One Year in Ohio,\" Nov. 25, 2016", "Henry J. Kaiser Family Foundation, Medicaid’s Role in Ohio, July 7, 2017", "U.S. Drug Enforcement Administration, FAQ’s-Fentanyl and Fentanyl-Related Substances, Accessed June 7, 2018", "Governor’s Cabinet Opioid Action Team, Combating the Opiate Crisis in Ohio, August 2017", "Ohio Department of Health, Fentanyl and Related Drugs Like Carfentanil as well as Cocaine Drove Increase in Overdose Deaths, 2016", "U.S. Centers for Disease Control and Prevention, Increases in Fentanyl-Related Overdose Deaths — Florida and Ohio, 2013–2015", "Mike DeWine campaign, Recovery Ohio, Accessed June 7, 2018", "Cleveland Plain Dealer, \"Have opioid deaths in Northeast Ohio finally crested? Evidence suggests yes,\" May 21, 2018", "Cleveland Plain Dealer, \"Mike DeWine and Mary Taylor debate, sort of, during match up of Ohio Republican governor candidates,\" April 6, 2018", "Cleveland Plain Dealer editorial board, \"Ohio budget signed by Gov. Kasich shorts cities - again: editorial,\" July 12, 2017", "Ohio Mayors Alliance, \"Op-ed: Heroin crisis demands emergency response from Ohio,\" Aug. 30, 2017", "Governing, \"With Less State Aid, Localities Look for Ways to Cope,\"February 2017", "Columbus Dispatch, \"First responders want state to restore local-government funding,\" May 31, 2013", "Dayton Daily News, \"Many cry foul over cuts to budget,\" (Accessed in Nexis) July 26, 2015", "Springfield News-Sun, \"Ohio first responders' overtime may be slashed by $100K,\" Dec. 7, 2017", "Dayton Daily News, \"DeWine: Opioid crisis is hurting the state’s economy,\" Nov. 15, 2017", "Columbus Dispatch, \"DRUG EPIDEMIC; Ohio suing distributors over opioid explosion,\" (Accessed in Nexis) Feb. 27, 2018", "Associated Press, \"Democrat Cordray would declare opioid emergency as governor,\" (Accessed in Nexis) March 26, 2018", "The Times Reporter (New Philadelphia, Ohio) \"Cordray rips GOP, DeWine for lack of action on opioids,\" (Accessed in Nexis) March 27, 2018", "The Cincinnati Enquirer, \"Curing the drug crisis,\" (Accessed in Nexis) May 4, 2018", "Columbus Dispatch, \"Cordray, DeWine spar over drug crisis,\" (Accessed in Nexis) May 19, 2018", "Cleveland Plain Dealer, \"Cordray attacks DeWine on response to opioids Ohio governor’s race,\" May 19, 2018", "AP, \"Democrat running for governor focuses on Ohio opioid crisis,\" June 4, 2018", "PolitiFact, \"Cordray on point about increase in firearm deaths in Ohio,\" April 12, 2018", "PolitiFact, \"Sherrod Brown credits Obamacare for helping pay for opioid treatment,\" April 20, 2018", "PolitiFact, \"Donald Trump declares public health emergency over opioid crisis. Here’s what that means,\" Oct. 30, 2017", "Interview, Russ Kennedy, Ohio Department of Health spokesman, June 6, 2018", "Interview, Mike Gwin, Richard Cordray spokesman, June 7, 2018", "Interview, Dan Tierney, spokesman for Attorney General Mike DeWine, June 7, 2018", "Interview, Joshua Eck, spokesman for Mike DeWine’s campaign, June 7, 2018", "Interview, Richard Frank, Professor of Health Economics in the Department of Health Care Policy at Harvard Medical School, June 7, 2018", "Interview, Sherry Glied, Dean of New York University’s Robert F. Wagner Graduate School of Public Service, June 7, 2018", "Interview, Andrew Kolodny,  Co-Director of Opioid Policy Research at the Heller School for Social Policy and Management, June 7, 2018", "Interview, Orman Hall, former director of Gov. John Kasich’s Cabinet opioid action team and former director of the Ohio Department of Alcohol and Drug Addiction Services, June 7, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]