["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Will Hsu (from left), Gov. Scott Walker, Foxconn chairman Terry Gou and Hsu's father, Paul Hsu, posed for a photo when Walker and Gou signed an agreement in which Foxconn says it will build a manufacturing plant in Wisconsin. (Courtesy Will Hsu)", "Critics of Wisconsin’s $3 billion-for-13,000 jobs deal with Foxconn keep bringing up Pennsylvania.", "In 2013, the Taiwanese manufacturer promised a $30 million factory in the Harrisburg area that would employ 500 people. There were big headlines, but the factory was never built.", "Asked by a reporter on July 28, 2017 why Foxconn wouldn't do the same to Wisconsin, Gov. Scott Walker responded by saying the difference is simple:", "\"Pennsylvania changed governors.\"", "The Republican governor has since repeated that explanation in at least three other interviews -- with Wisconsin reporters, on conservative talk radio in Milwaukee and on the Fox Business Network.", "\"Our understanding from the company is that Pennsylvania wanted to change the deal\" with Foxconn\" after a new governor was elected,\" Walker spokesman Tom Evenson told us when we asked for information to back Walker’s statement.\n\nPennsylvania did replace a Republican governor with a Democrat.", "But that election occurred a year after the factory announcement -- and in that time, virtually no progress on the factory had been reported under the GOP governor.", "After Foxconn made its announcement, \"it was very, very quiet, then it just kind of faded away,\" recalled Jay Pagni, who was a spokesman for then-Republican Gov. Tom Corbett.", "We heard the same from Nathan Benefield, chief operating officer at the Commonwealth Foundation in Pennsylvania, which monitors government incentive packages to businesses. And we heard it from local news reporters and others.", "Steven Kratz, who was spokesman for the Pennsylvania Department of Community and Economic Development under Corbett, told us that when Corbett left office in January 2015, the state and Foxconn were continuing to have talks about the proposed plant.", "But no site had been chosen and no agreement had been made on any incentives the state might offer, he said.", "And for its part, Foxconn has given different explanations for not building the Pennsylvania plant.", "In short, the explanation isn’t as simple as Walker makes it, as the following review shows.", "Foxconn-Pennsylvania timeline", "Nov. 2013", "Announcement: Foxconn and Corbett announce Foxconn plans to invest $30 million in a factory that would employ up to 500.", "Jan. 2014", "Initial plans: Pennsylvania Department of Community and Economic Development spokesman says he expects Foxconn to do aggressive site search, starting in January 2014.", "Feb. 2014", "Questions arise: Weeks later, news reports say only that Foxconn might invest in Pennsylvania; and that there was intense competition among states for a Foxconn plant.", "Nov. 2014", "Change in governors: Businessman Tom Wolf, a Democrat, defeats Corbett to win election as governor. Wolf takes office in January 2015.", "Jan. 2017", "Sites had been scouted: Reflecting on the 2013 announcement, a Pennsylvania Department of Community and Economic Development spokeswoman in the Wolf administration says department officials had met with Foxconn representatives on various occasions after the 2013 announcement and showed them potential locations for the planned site, but the project didn’t materialize. (The department confirmed to us it worked with Foxconn under both the Corbett and Wolf administrations.)", "Mar. 2017", "Foxconn takes responsibility: The Washington Post reports that, according to a Harrisburg-area official, the project \"just seemed to fade to black\" after it was announced. \"It was the start of a mystery, created by a chief executive known to promise projects all over the world that never quite pan out,\" according to the Post. Foxconn attributes the failure to build the factory to \"material changes to the business and operating climate at that time.\"", "Aug. 2017", "Foxconn blames Pennsylvania: The China Post reports that Foxconn chairman Terry Gou has said the plant wasn’t built because, in the Post’s words, Pennsylvania \"elected a new governor who refused to honor the deal.\"", "Our rating", "Walker says Foxconn didn't keep a promise to build a plant in Pennsylvania because \"Pennsylvania changed governors.\"", "But the record indicates that by the time the Democratic administration took over, little progress had been made more than a year after Foxconn and the GOP governor announced Foxconn’s plans. It's not as though there was a deal in place that fell apart after the election.", "Foxconn, meanwhile, has given explanations ranging from \"material changes to the business and operating climate at that time,\" to Pennsylvania not making an economically viable to proposal to, reportedly, blaming Pennsylvania’s change in governors.", "In short, Walker’s statement contains an element of truth, but leaves out critical facts that would give a different impression -- our definition of Mostly False.", "5 fact checks on Foxconn and Wisconsin's $3 billion deal", "Wisconsin Public Radio, \"Walker Says Foxconn Critics 'Can Go Suck Lemons,’\" July 28, 2017", "Email, Gov. Scott Walker press secretary Tom Evenson, Aug. 22, 2017", "Email, Foxconn Technology Group spokeswoman Ellin Choy, Aug. 24, 2017", "Wisconsin Radio Network, \"Walker suggests he’s needed to complete Foxconn deal,\" Aug. 10, 2017", "Philadelphia Inquirer, \"Wolf defeats Corbett,\" Nov. 5, 2014", "Fox Business Channel, Scott Walker interview (6:00), Aug. 9, 2017", "Pittsburgh Post-Gazette, \"Foxconn could still invest in Pa.,\" Aug. 4, 2017", "MacIver Institute, \"Walker Takes Aim At Foxconn Pennsylvania Spin,\" Aug. 16, 2017", "WISN-AM, Scott Walker interview, Aug. 15, 2017", "The Morning Call, \"Lehigh Valley makes pitch for $7B iPhone assembly plant with up to 50K jobs,\" Jan. 25, 2017", "Interview, former Pennsylvania Department of Community and Economic Development spokesman Steven Kratz, Aug. 23, 2017", "China Post, \"Can Terry Gou fulfill his American dream?\" Aug. 3, 2017", "Wall Street Journal, \"Wisconsin Governor Defends Foxconn Deal Amid Growing Concerns,\" Aug. 10, 2017", "CNN, \"Foxconn invests in Wisconsin: Workers 'should be wary,’\" July 27, 2017", "Washington Post, \"How Foxconn’s broken pledges in Pennsylvania cast doubt on Trump’s jobs plan,\" March 3, 2017", "MarketWatch, \"Foxconn’s history of broken promises casts a shadow on Wisconsin news,\" July 31, 2017", "Central Penn Business Journal, Foxconn article, Feb. 7, 2014", "Interview, Pennsylvania Manufacturers Association president David Taylor, Aug. 24, 2017", "Interview, Nathan Benefield, chief operating officer at the Commonwealth Foundation, Aug. 24, 2017", "Interview, former Gov. Tom Corbett spokesman Jay Pagni, Aug. 23, 2017", "Pennsylvania Department of Community and Economic Development, news release, Nov. 22, 2013", "Email, Pennsylvania Department of Community and Economic Development director of communications David Smith, Aug. 24, 2017", "Interview, Lyndsay Kensinger, spokeswoman for Pennsylvania Gov. Tom Wolf and for former Pennsylvania Gov. Tom Corbett, Aug. 25, 2017", "Newsworks, \"Foxconn set to scout Pa. sites for $30 million plant,\" Jan. 5, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]