["About this rating", "On 30 January 2018, Joseph Mercola — the doctor behind the pseudoscientific alternative health and supplement empire Mercola.com — published a story with a factually incorrect claim characteristic of the site’s dubious commitment to accuracy:", "FDA Declares Homeopathic Drugs Illegal, Plans to Ramp Up Enforcement Actions", "The document cited in support of this claim is a December 2017 draft of an FDA guidance statement that a.) changes no laws and creates or alters no existing regulations; and b.) is still in the public review stage and therefore not even a finalized form of a non-legally binding document. That document contains this disclaimer:", "This draft guidance, when finalized, will represent the current thinking of the Food and Drug Administration (FDA or Agency) on this topic. It does not establish any rights for any person and is not binding on FDA or the public.", "FDA guidance documents, as described by federal law, are documents that have been prepared \"for FDA staff, applicants/sponsors, and the public that describe the agency's interpretation of or policy on a regulatory issue.\"", "True to form, this draft proposes an updated interpretation of the the agency’s handling of over the counter products branded as homeopathic, a specific alternative health modality that relies on discredited 18th century pseudoscience requiring — among other things — a belief in the scientifically baseless concept that water retains a \"memory\" of chemicals it no longer contains:", "Under U.S. law, homeopathic drugs are required to meet the same approval rules as other drugs. But under a policy adopted in 1988, the agency has used “enforcement discretion” to allow the items to be manufactured and distributed without FDA approval. Agency officials don't plan to begin requiring that homeopathic products get approval — officials say that would be impractical —  but they are signaling stepped-up scrutiny for items deemed a possible health threat. [...]", "Under its planned approach, many products won't be considered high risk and will remain available to consumers, Janet Woodcock, director of the FDA's Center for Drug Evaluation and Research, told reporters during a teleconference. But she said, the agency would “go after” products that cause — or might cause — “overt harm.”", "Since 1988, it has been the de facto policy of the FDA to treat homeopathic remedies listed in the Homeopathic Pharmacopeia of the United States (a collection of homeopathic ingredients and practices continually updated since 1897), as safe and legal to market — so long as that marketing does not meet the FDA's definition of making fraudulent claims. In March 2015, the FDA proposed a re-evaluation of its regulatory approach to over-the-counter homeopathic remedies in light of the fact that the industry and the products and ingredients it promotes have greatly expanded since 1988.", "The draft guidance issued by the Food and Drug Administration in December 2017 is a result of those 2015 discussions, and it would serve, primarily, as a notice to those marketing homeopathic products that the informal policy of treating homeopathic remedies as exempt from new drug regulations — an expensive process requiring a scientific study of the safety and efficacy of a product — will not apply necessarily apply to homeopathic products that may present a risk to public health. Since no homeopathic remedies have gone through any new drug approval process, any homeopathic remedy would theoretically be susceptible to this higher bar of scrutiny.", "However, as stated in their draft guidance document, the Food and Drug Administration has always had this authority, and this therefore represents no legal change in regulation:", "Nothing in the [United States Federal Food, Drug, and Cosmetic Act, FD&C] exempts drugs labeled as homeopathic from any of the requirements related to approval, adulteration, and misbranding, including labeling requirements. If a drug labeled as homeopathic is a new drug under the FD&C Act, it is subject to the same premarket approval requirements and the same standards for safety and efficacy as all new drugs.", "Because reassessing the entire pharmacopoeia of homeopathic remedies is not plausible or feasible, the agency has said that it will focus its attention on those products that fall into one of six \"high risk\" categories:", "This interpretation of existing law would not have any effect on a vast majority of homeopathic products currently available in the United States, making Mercola’s headline claim (\"All Homeopathic Products Now Illegal?\") false.", "Homeopathy should not be confused with other alternative, holistic, or natural remedies. It refers specifically to a scientifically discredited practice invented in 1796, which was and is based on the belief that chemicals that cause symptoms in healthy people can, in an absurdly diluted form, cure sick individuals of those same symptoms. Proponents of the practice claim that the more dilute the chemical, the more powerful its healing abilities, making it statistically likely that many homeopathic preparations are so diluted that they contain not a single atom of the chemical in question. This is not an issue for proponents of the practice, because according to its guiding theories, water \"remembers\" what was in it.", "In an effort to suggest that the medical experts are opposed to regulation of homeopathy, and to conflate homeopathy with other alternative health practices to generate maximum outrage and thus clicking and sharing potential, Mercola cites quotes given by Dr. Lee Hieb, the director of the \"Association of American Physicians and Surgeons,\" to a fringe conspiracy web site:", "“I’m not here to tout any particular over-the-counter remedy, but who gave the FDA total ability to limit what we can take into our bodies, while virtually forcing us to be given what they prescribe? It’s none of their business whether a ‘homeopathic remedy’ is worthless.", "That’s an issue of commerce and truth in advertising. I, for one, want the freedom to research and decide for myself what supplements to take, even if my supplements ultimately do me no good.", "The \"Association of American Physicians and Surgeons\" is a far-right political (not medical) organization that in no way represents any consensus view of medical professionals in the United States. Their official publications have espoused pseudoscientific claims, including the notion that being gay reduces life expectancy, that HIV does not cause AIDS, that there is a link between abortion and breast cancer, and that there is a proven causal connection between autism and vaccines.", "In terms of homeopathy being an issue of truth in advertising, the United States Federal Trade Commission agrees. In 2016, the FTC issued a new policy regarding the marketing and promotion of over-the-counter homeopathic remedies, stating that such products would be deemed deceptively advertised if they did not include language indicating that there is no scientific proof that homeopathy works.", "Because the FDA document cited by Mercola represents no change in law, however, we rank the claim that the FDA has recently deemed all of them illegal as false.", "Mercola, Joseph.   \"All Homeopathic Products Now Illegal?\"\r\n    Mercola.com.   30 January 2018.", "U.S. Food and Drug Administration.   \"Drug Products Labeled as Homeopathic Guidance for FDA Staff and Industry (Draft Guidance).\"\r\n    December 2017.", "U.S. Code of Federal Regulations.   \"Title 21, Chapter I, Subchapter A, Sec. 10.115.\"\r\n    Accessed 1 February 2018.", "McGinley, Laurie.   \"FDA Takes More Aggressive Stance Toward Homeopathic Drugs.\"\r\n    Washington Post.   18 December 2017.", "U.S. Food and Drug Administration.   \"CPG Sec. 400.400 Conditions Under Which Homeopathic Drugs May be Marketed.\"\r\n    Accessed 1 February 2018.", "Regulations.gov.   \"Homeopathic Product Regulation: Evaluating the Food and Drug Administration’s Regulatory Framework After a Quarter-Century; Public Hearing.\"\r\n    Accessed 27 March 2015.", "Ernst, E.   \"A Systematic Review of Systematic Reviews of Homeopathy.\"\r\n    British Journal of Clinical Pharmacology.   17 December 2002.", "Des Moines Register.   \"Meet the Candidate: Iowa Governor: Lee Deakins Hieb, Libertarian Party.\"\r\n    4 October 2014.", "Goldstein, Amy.   \"Tom Price Belongs to a Doctors Group With Unorthodox Views on Government and Health Care.\"\r\n    Washington Post.   9 February 2017.", "U.S. Federal Trade Commission.   \"Enforcement Policy Statement on Marketing Claims for OTC Homeopathic Drugs.\"\r\n    Accessed 15 November 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]