["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi, D-Calif., tears her copy of President Donald Trump's State of the Union address after he delivered it to Congress on Feb. 4, 2020, in Washington. (AP/Semansky)", "The statute in question is meant to prevent people from destroying records in official government repositories such as the National Archives.", "Pelosi ripped up her own copy of Trump’s address, not the official version sent to the National Archives under the separate Presidential Records Act.", "President Donald Trump repeated a false claim about House Speaker Nancy Pelosi, D-Calif., telling reporters on the White House lawn that Pelosi \"broke the law\" when she ripped up her copy of his State of the Union address.", "\"I thought it was a terrible thing when she ripped up the speech,\" Trump said. \"First of all, it's an official document. You're not allowed. It's illegal what she did. She broke the law.\"", "\"It’s so disrespectful to our country,\" he added. \"And actually, very illegal, what she did.\"", "President Trump: \"I thought it was a terrible thing when she ripped up the speech. First of all, it's an official document. You're not allowed. It's illegal what she did. She broke the law.\" pic.twitter.com/Co1j7ljpGU", "We fact-checked a similar claim when Turning Point USA founder Charlie Kirk first floated it on Twitter. Legal experts told us Pelosi was in the clear. The papers she tore up were not the official record of Trump’s speech, nor were they the only copy in existence.", "\"I take it that this is a printout of the Trump speech, in which case it is absurd to suggest that Pelosi can be prosecuted for doing with it whatever she pleases,\" said Heidi Kitrosser, professor of law at University of Minnesota.", "Since our fact-check of Kirk, Snopes and other news outlets have also concluded that Pelosi did not violate the law. So has Jonathan Turley, the George Washington University law professor who testified against impeaching Trump in the House Judiciary Committee.", "Even Fox News host Laura Ingraham, whose on-air commentary is typically pro-Trump, knocked the idea in an interview with Rep. Matt Gaetz, R-Fla., who filed an ethics complaint against Pelosi.", "The federal statute in question sets a penalty for anyone who \"conceals, removes, mutilates, obliterates, or destroys\" any government record \"filed or deposited with any clerk or officer of any court of the United States, or in any public office, or with any judicial or public officer of the United States.\"", "The statute also says that any person with \"custody\" of a government record cannot \"willfully and unlawfully\" conceal, remove, mutilate, obliterate, falsify or destroy it.", "\"The point of the statute is to prevent people from destroying records in official repositories like the National Archives or in courts,\" said Georgetown Law professor Victoria Nourse.", "Experts told us Pelosi’s move was not illegal because her copy of Trump’s speech wasn’t the official government record that would need to be preserved. The State of the Union text was never \"filed or deposited\" with her, nor did she have \"custody\" of it in the legal sense.", "Trump handed her and Vice President Mike Pence copies before he began speaking.", "President Donald Trump hands copies of his State of the Union address to House Speaker Nancy Pelosi and Vice President Mike Pence before delivering it to Congress on Feb. 4, 2020, in Washington. (AP)", "\"Her copy of the State of the Union address is not a government record or government property at all,\" Douglas Cox, professor of law at the City University of New York School of Law and an expert in the laws on the preservation of government records, told us. \"It is personal property.\"", "Under House rules, members of Congress are encouraged to preserve their records or donate them to a research institution for historical study, Cox said. Unlike congressional committees, members are not legally required to hold onto their office’s files.", "\"They can keep them private, they can destroy them, or they can rip them up,\" he said.", "RELATED: No evidence Pelosi planned to tear Trump’s State of the Union speech at start", "This is in contrast to presidential records, which have been considered government property since the Presidential Records Act of 1978 and are supposed to be stored with the National Archives for safekeeping.", "\"The State of the Union is a presidential record, which must go to the National Archives under the Presidential Records Act,\" Nourse said \"(Pelosi) did not mutilate the record that is filed with the Archives.\"", "There are probably countless copies of Trump’s address, such as the version the White House posted online. Pelosi’s action did not preclude future generations from accessing one.", "\"If the statute were not read this way, then any copy of the State of the Union held by anyone could never be destroyed,\" Nourse said.", "The White House did not immediately respond to a request for comment.", "Trump said Pelosi \"broke the law\" by ripping her copy of his speech.", "That’s not how the law in question works. The copy Pelosi tore was not the official document that would be shipped to the National Archives for preservation.", "We rate this statement Pants on Fire!", "C-Span on Twitter, Feb. 7, 2020", "Jonathan Turley, \"No, Nancy Pelosi Did Not Violate Federal Law . . . Just Decades Of Tradition,\" Feb. 6, 2020", "Snopes, \"Was Ripping Up the SOTU Speech Illegal? Legal Experts Say No,\" Feb. 6, 2020", "KHOU11, \"VERIFY: Did Speaker Pelosi break the law when she ripped President Trump's speech?\" Feb. 5, 2020", "Fox News on YouTube, \"Gaetz announces plan to file ethics probe against Pelosi,\" Feb. 6, 2020", "Rep. Matt Gaetz on Twitter, Feb. 5, 2020", "PolitiFact, \"Charlie Kirk wrongly suggests Pelosi broke law by ripping Trump State of the Union speech,\" Feb. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]