["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "On Oct. 31 2020, The New York Times reported that the Trump Campaign's fundraising landing page was \"now automatically checking a box to create recurring weekly donations from supporters until mid-December.\" This is true, though the \"automatically checked box\" development is fairly old news. The Trump Campaign's primary fundraising platform — WinRed — changed the landing page to automatically check the monthly recurring donation option in March 2020. The shift to soliciting for weekly donations occurred in mid-September 2020, with that option also appearing as pre-checked.", "The more recent development is the change in when those weekly contributions would stop. Earlier solicitations committed people to donations that would stop automatically recurring on Election Day, Nov. 3 2020. In late October, the text was changed to read \"make this a recurring donation until 12/14.\" It bears mentioning that well before any returns came in on Nov. 3, the campaign encouraged donations as a way to \"keep fighting after election day\" because \"there will be voter fraud like you've never seen.\"", "Speaking to the Times, Trump campaign spokesperson Tim Murtaugh said that no one would receive a “recurring charge without their knowledge” and donors could opt out at any time. He argued that funds were needed because \"this race will be very close, and it is possible that multiple states will require recounts and potential additional spending from our campaign.”", "From a factual standpoint, there is no guarantee that the money goes to fight election-related lawsuits. Some of the money goes to resolving Trump Campaign debt, much of the rest goes to the Republican National Committees' general operating account.  Because the Trump Campaign is indeed accepting recurring donations until Dec. 12, and because that option is auto-checked on the campaign's primary fundraising platform, we rank this claim \"True.\"", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]