["About this rating", "On Aug. 29, 2020, a video supposedly showing Kyle Rittenhouse — the 17-year-old accused of shooting and killing two people and injuring another during a protest related to the shooting of a Black man named Jacob Blake by police officers in Kenosha, Wisconsin — punching a woman. The video was widely circulated on social media:", "While we can't say definitively that this person is Rittenhouse, there is plenty of circumstantial evidence to support this claim.", "Before we examine the origins of this footage, it should be noted that rumors often circulate in the wake of deadly incidents in an apparent attempt to sway public opinion. In the days following the shooting of Blake — who is paralyzed from the waist down as a result of the shooting — we encountered rumors concerning his alleged criminal history. We also encountered rumors about Rittenhouse, including the claim that he attended a January rally for U.S. President Donald Trump.", "Then, on Aug. 29, 2020, two videos started circulating on social media that supposedly showed Rittenhouse involved in a fight in Kenosha, Wisconsin. The videos were originally shared by Reese Granville and CJ Wakefield, two residents of Kenosha, and shows an altercation that took place about two months prior on July 1. Rittenhouse did not live in Kenosha, but he did live about 20 miles away in Antioch, Illinois.", "Kenosha News reports:", "At that point, the males filming — identified on Facebook as Reese Granville and Cj Wakefield, both of Kenosha — and several others jump out of their respective vehicles and run in.", "Granville confirmed to The Journal Times the date and location of the fight. Videos on Facebook show that Wakefield also was at protests in Downtown Kenosha this past week. Both Granville and Wakefield have said, based on what they witnessed and recorded, that the person throwing punches in their videos is Rittenhouse.", "Both of the individuals who posted videos of this fight identified the person in the red and blue shorts as Rittenhouse. However, it doesn't appear that these individuals recognized Rittenhouse at the time, and only noticed the similarities when Rittenhouse made headlines following the shooting on Aug. 25, 2020. Granville, for example, told The Journal Times that he started filming when he noticed an altercation as he was driving by, and that he didn't know what caused the fight:", "Granville told The Journal Times in a message that he doesn't know what led to the fight. He said he was just driving past, saw what was going on and started recording.", "The individuals who recorded this footage, as well as a number of social media users, did highlight some circumstantial evidence that the man in the video was indeed Rittenhouse. For instance, social media users pointed to a photograph of Rittenhouse holding a gun and wearing American flag clogs, the same shoes that can apparently be seen in the video:", "Comparing visuals from the video and known photographs of Rittenhouse also seems to show that this is the same person. Of course, more than one person can own the same style of shoe, and identifying a person based solely on visual comparisons isn't always accurate.", "To sum things up, videos taken in July 2020 appear to show Rittenhouse punching a woman during an altercation in Kenosha, Wisconsin. Both videographers identified Rittenhouse as the man in the red and blue shorts. However, this identification appears to be based on visual comparisons and circumstantial evidence, so while this video most likely shows Rittenhouse, we can't say with certainty that this isn't another person who resembles the 17-year-old accused of shooting and killing two people at a protest.", "Murphy, Paul; Chaves, Nicole.   \"Kenosha Shooting Suspect Faces More Homicide Charges.\"\r\n    CNN.   27 August 2020.", "Rogan, Adam.   \"WATCH NOW: Videos Reportedly Show Kyle Rittenhouse Involved in Fight, Punching Female Last Month in Kenosha.\"\r\n    Kenosha News.   30 August 2020.", "Barton, Gina.   \"Witnesses Describe the Night Kyle Rittenhouse Opened Fire During Protests in Kenosha.\"\r\n    USA Today.   31 August 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]