["Speakers at the Democratic National Convention made clear their disdain for GOP presidential nominee Donald Trump. Former Vermont Gov. Howard Dean did just that but also managed to attack Trump's running mate, Mike Pence, on his health policy record.", "In the speech, Dean said that Trump would \"rip up Obamacare.\" He continued by saying, \"His vice presidential pick is no better. Mike Pence voted against expanding the Children’s Health Insurance Program, which Hillary helped to start,\" among other claims about Pence's health care policy positions.", "We decided to look into Dean's statement about Pence and the Children's Health Insurance Program, called CHIP. Is Dean's statement accurate?", "Pence on the Children’s Health Insurance Program", "The Children’s Health Insurance Program, or CHIP, was first created by the Balanced Budget Act of 1997 under Bill Clinton’s administration. According to Medicaid, it has insured over 8 million low-income children who could not afford private coverage.", "The Hillary Clinton campaign has touted her role in passing the legislation. While she did play a significant part from the White House, others were pivotal in moving it through the Republican-controlled Congress, notably the late Sen. Ted Kennedy. We've rated the statement that she helped get the program \"done\" as Mostly True.", "So, did Pence vote against the legislation?", "Pence served in Congress from 2001 to 2012. During that time, there were four major roll call votes directly affecting CHIP.", "Although Pence did not vote in favor of the reauthorization proposals in 2007 or 2009, he did offer statements on the legislation.", "In an editorial for the Star Press in Indiana, Pence wrote that while he supports expanding health insurance for poor children, the Democratic legislation \"represented a massive expansion of this anti-poverty program into the middle class.\"", "Instead of the CHIP reauthorizations, Pence had supported other bills like the More Children, More Choices Act of 2007, which expand coverage but use tax credits.", "Dean’s assertion that Pence voted against CHIP is accurate, though Pence did support Republican legislation to get health care to low-income children.", "Pence in Indiana", "We should note that Pence's health care record isn't entirely against the Democratic policy agenda. While Dean attacked Pence’s congressional record, Pence’s most notable healthcare-related policies have come during his time as governor of Indiana.", "The state is known for the Healthy Indiana Plan (HIP), which many have called a compromise between Obamacare and conservative health policy ideas. HIP expanded the state’s Medicaid coverage by using federal dollars, which is now optional for states since a 2012 Supreme Court ruling.", "While adopting provisions of the Affordable Care Act, Indiana expanded Medicaid through a waiver plan, allowing the state to add additional stipulations and restrictions. Particularly contentious is HIP’s premium contribution requirement, which forces Medicaid recipients to pay a small premium each month. If people fail to pay, they are locked out of benefits for six months.", "Sherry Glied, professor of public service at New York University with an extensive background in health policy, notes that the benefits of Indiana’s Medicaid expansion \"include the same essential benefits required under Obamacare for all individual market and Medicaid plans, among them mental health and substance use benefits.\"", "So, although Dean is largely correct about Pence’s voting record on CHIP in Congress, Pence’s policies as governor have added other benefits at the state level.", "Our ruling", "Dean criticized Pence’s health policy record, saying, \"Mike Pence voted against expanding the Children’s Health Insurance program,which Hillary helped to start.\"", "That claim is largely accurate. Pence voted against CHIP when he was in Congress, and Clinton did have a role in starting the program when she was First Lady. But it is important to note that Pence has supported health policy as governor of Indiana that was in line with health policies that Dean and other Democrats support. We rate the statement Mostly True.", "Howard Dean, speech at DNC, July 26, 2016", "National Conference of State Legislatures, \"Children’s Health Insurance Program Overview,\" April 17, 2015", "Medicaid, \"Children’s Health Insurance Program (CHIP)\"", "PolitiFact, \"Clinton promoted children’s health care,\" Jan. 6, 2008", "Email interview, Josh Schwerin, national spokesman for Clinton campaign, Aug. 3, 2016", "Library of Congress, \"H.R.976 - Children's Health Insurance Program Reauthorization Act of 2007\"", "Library of Congress, \"Final Vote Results For Roll Call 906\"", "Library of Congress, \"Final Vote Results for Roll Call 982\"", "Library of Congress, \"H.R.2 - Children's Health Insurance Program Reauthorization Act of 2009\"", "Library of Congress, \"Final Vote Results for Roll Call 50\"", "Medicaid, \"CHIPRA\"", "Library of Congress, \"H.R.3590 - Patient Protection and Affordable Care Act\"", "Library of Congress, \"H.R.4872 - Health Care and Education Reconciliation Act of 2010\"", "Library of Congress, \"Final Vote Results for Roll Call 167\"", "Library of Congress, \"Final Vote Results for Roll Call 194\"", "The Baltimore Sun, \"Historic Health Bill Passes; Most Sweeping Change to Federal-backed Care in 4 Decades Likely Headed To Obama’s Desk,\" March 22, 2010, accessed via Nexis", "Mike Pence, \"Kid's insurance program should be instituted responsibly,\" Oct. 30, 2007, accessed via Nexis", "Mike Pence, \"Pence Supports Responsible Childrens Health Insurance Plan,\" Oct. 18, 2007, accessed via Nexis", "GovTrack, \"S. 2193 (110th): More Children, More Choices Act of 2007\"", "United States Department of Labor, \"The Mental Health Parity and Addiction Equity Act of 2008 (MHPAEA),\" Jan. 29, 2010", "Library of Congress, \"Final Vote Results for Roll Call 625\"", "Office of the Assistant Secretary for Planning and Evaluation, \"Affordable Care Act Expands Mental Health And Substance Use Disorder Benefits And Federal Parity Protections For 62 Million Americans,\" Feb. 20, 2013", "New York Times, \"House Approves Bill on Mental Health Parity,\" March 6, 2008", "Library of Congress, \"Final Vote Results for Roll Call 277\"", "Library of Congress, \"Final Vote Results for Roll Call 151\"", "PolitiFact, \"Do Mitt Romney and Paul Ryan want to turn Medicare into a voucher program?\" August 16, 2012", "PolitiFact, \"Barack Obama ad says Paul Ryan’s Medicare plan could raise costs for Medicare beneficiaries by $6,000 each,\" Aug. 23, 2012", "PolitiFact, \"Sen. Ron Johnson voted for Paul Ryan plans to make Medicare a voucher program, Democratic Party says,\" June 10, 2016", "Email Interview, Henry J. Aaron, a Senior Fellow in the Economic Studies program at the Brookings Institute, Aug. 4, 2016", "State of Indiana, \"Healthy Indiana Plan\"", "Huffington Post, \"Indiana Gov. Mike Pence Expands Medicaid Under Obamacare,\" Jan. 27, 2015", "Kaiser Family Foundation, \"The ACA and Medicaid Expansion Waivers,\" Nov. 20, 2015", "Politico, \"How Mike Pence Embraced Obamacare,\" July 15, 2016", "Modern Healthcare, \"Success of Pence’s Medicaid expansion far from settled,\" July 25, 2016", "Center on Budget and Policy  Priorities, \"Evaluation Needed Before Allowing Replication of Indiana’s Medicaid Waiver,\" April 14, 2016", "Email interview, Sherry Glied, public service professor at New York University, Aug. 4, 2016", "Email interview, Rena Conti, PhD, an expert on the financing, regulation and organization of medical care at the University of Chicago, Aug. 4, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]