["Presidential candidate Jeb Bush takes questions during a campaign event in Atlantic, Iowa, on Nov. 11, 2015.", "During a campaign stop in Atlantic, Iowa, on Nov. 11, Republican presidential candidate Jeb Bush told a very detailed and specific story to underscore Democratic President Barack Obama’s alleged unwillingness to work with Republicans in the U.S. Senate.", "Here's what he said:", "\"The story I tell all the time is about a Republican senator that was invited by the White House to have dinner with the president. And so he’s going up the rickety elevator to go up to the residence, the second floor, and the eager aide to President Obama says with great excitement, ‘Senator, you’re the first Republican he’s had dinner with in the residence since he’s been president.’ And that’s the fifth year.\"", "Obama is so unwilling to work with Senate Republicans, Bush alleges, that he didn't even invite one to dine at the White House until his fifth year in office. But is it true? Did Obama really wait until 2013 to host a Republican for dinner at the White House?", "Bush’s campaign declined to provide more information or sources for the anecdote. (Instead, a spokeswoman issued a statement saying the president has pursued \"a policy of divide and conquer\" and refused to work with Republicans.)", "The White House, meanwhile, referred us to the official White House Visitor Access Records, which are posted online in a series of spreadsheets.", "The Visitor Access Records contain extremely detailed – albeit inconsistently organized – entries for hundreds of thousands of White House visits. The 2012 database, for example, included more than 930,000 separate records.", "To vet Bush’s statement, we filtered these voluminous results first to show only visits in which \"POTUS\" – that is, the president of the United States – was listed as the \"visitee.\" Then we filtered them further to capture visits to the \"Residence\" and other White House rooms in which it’s conceivable that a private dinner could occur.", "Among that filtered database, we searched for Democratic and Republican U.S. senators. Here’s what we found. When possible, we paired the results found in the database with news reports or White House statements concerning the meeting or a concurrent event.", "2009", "U.S. Sen. Richard Lugar. R-Ind., visited the residence area of the White House on Sept. 1, 2009, for an evening event. The day and time corresponds to a dinner celebrating Ramadan that included numerous guests.", "2010", "There appear to be no dinners or other events involving the president and members of the Senate in 2010.", "It should be noted, though, that Obama did invite Republican Sens. Mitch McConnell of Kentucky and Jon Kyl of Arizona, along with top Republicans from the House and Democratic leaders from both chambers, to a dinner following the midterm elections that November. That meal-time meeting was dubbed the \"Slurpee Summit\" after Obama promised to serve the drinks for dessert, but Republicans declined to attend, and the dinner was canceled.", "2011", "Obama hosted a dinner in the East Room of the White House (which is on the State Floor in the residence) attended by both Democrats and Republicans on May 2, 2011. McConnell was among those present.", "U.S. Sens. Rob Portman, R-Ohio, and Mark Udall, D-Colo., visited the White House residence with a larger group during a state dinner for German Chancellor Angela Merkel on June 7, 2011.", "U.S. Sen. Patty Murray, D-Washington, visited the White House residence on Nov. 11, 2011, with a larger group. That same day, Obama called Murray to discuss budget and deficit reduction negotiations that were occurring at that time.", "2012", "McConnell attended a lunch with the president on Feb. 29, 2012, in a room labeled \"POTUS dini\" in the White House logs. Also at the table were House Speaker John Boehner, R-Ohio, Senate Majority Leader Harry Reid, D-Nev., and House Minority Leader Nancy Pelosi, D-Calif.", "Lugar visited the White House residence during a state dinner for British Prime Minister David Cameron on March 14, 2012. Democratic Sens. Daniel Inouye of Hawaii, John Kerry of Massachusetts, Claire McCaskill of Missouri and Charles Schumer of New York also visited the residence at that time.", "Democratic Sens. Kerry, Richard Blumenthal of Connecticut, Sherrod Brown of Ohio, Ben Cardin of Maryland, Bob Casey of Pennsylvania, Richard Durbin of Illinois, Tom Harkin of Iowa, Patrick Leahy of Vermont, Robert Menendez of New Jersey, Jeanne Shaheen of New Hampshire and Jon Tester of Montana visited the White House residence during a St. Patrick’s Day reception on March 20, 2012.", "Democratic Sen. Kay Hagan of North Carolina was among 706 guests to visit the White House Residence on Dec. 12, 2012, during what appears to be a White House Christmas party.", "2013", "Democratic Sens. Casey, Durbin, Kerry, McCaskill, Michael Bennet of Colorado and Tim Kaine of Virginia, visited the White House residence on Inauguration Day in 2013.", "Obama hosted a bipartisan dinner for women senators on April 23, 2013.", "U.S. Sen. John Boozman, R-Ark., visited the White House residence during a ceremony honoring Presidential Medal of Freedom recipients on Nov. 20, 2013. Democratic Sens. Durbin, Leahy, Joe Donnelly of Indiana, Barbara Mikulski of Maryland, Mark Pryor of Arkansas and Brian Schatz of Hawaii also attended.", "U.S. Reps. Paul Ryan, R-Wisc., and Chris Van Hollen, D-Maryland, attended a lunch with the president in a room labeled \"Private Di\" in the White House logs on March 7, 2013.", "Obama dined with two large groups of Republican senators on March 6, 2013, and again on April 10. The first dinner took place at the Jefferson Hotel, while the second was held in the Old Family Dining Room on the State Floor of the White House.", "Ten Republican and 21 Democratic senators were among 878 guests to the White House residence on Dec. 12, 2013, during what appears to be a White House Christmas party.", "Our ruling", "Based on our review of visitor logs, there are a handful of instances in which Republican U.S. senators visited the White House residence between 2009 and 2012, including a 2011 dinner attended by Senate GOP Leader Mitch McConnell.", "There’s also that high-profile 2010 case in which Obama invited two Republican senators to dinner – the famous Slurpee Summit – only to be publicly snubbed.", "And it’s worth noting, too, that the records indicate that Obama hasn’t dined privately with Democratic senators all that often either – suggesting that private evening meals just aren’t part of Obama’s congressional relations strategy.", "We rate this claim False.", "Email correspondence with Allie Brandenberger, spokeswoman for Jeb Bush campaign, Nov. 16-20, 2015", "Email correspondence with Kaelan Richards, White House regional communications director, Nov. 16-20, 2015", "White House Visitor Access Records, 2009-2013", "USA Today, \"White House dates: The president celebrates Ramadan and American Muslims,\" Sept. 2, 2009", "CNN, \"Obama plans 'Slurpee summit' with dinner,\" Nov. 4, 2010", "Huffington Post, \"McConnell Skips Obama Dinner, Eats With Federalist Society,\" Nov. 18, 2010", "The White House, \"The German State Dinner,\" June 7, 2011", "The White House, \"Readout of the President's Calls with Senator Patty Murray and Representative Jeb Hensarling,\" Nov. 11, 2011", "Politico, \"Obama lunches with Hill leaders,\" Feb. 29, 2012", "The White House, \"State Dinner,\" March 14, 2012", "The White House, \"President Obama meets with Irish Prime Minister Enda Kenny,\" March 20, 2012", "The White House, \"President Obama Honors Presidential Medal of Freedom Recipients,\" Nov. 20, 2013", "The New York Times, \"Obama Continues Congressional Outreach With White House Lunch,\" March 7, 2013", "The New York Times, \"G.O.P. Senators Give Obama Dinner Thumbs Up,\" March 6, 2013", "USA Today, \"Obama hosts 12 Republican senators for dinner,\" April 11, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]