["By Angelo Fichera", "Posted on May 31, 2019", "A fabricated quotation about guns attributed to California Sen. Dianne Feinstein has circulated online for years and is again being shared by thousands on Facebook.", "Thousands of Facebook users have helped to once again disseminate a long-circulating comment about gun control falsely attributed to Sen. Dianne Feinstein.", "“When the gunman realizes that nobody else is armed, he will lay down his weapons and turn himself in….that’s just human nature,” the quotation reads underneath a photo of the California Democrat. Text below that refers to her as “stupid.”", "The falsehood has existed for years, despite repeated efforts by fellow fact-checking organizations to debunk it.", "“It’s been proven fake over and over,” a Feinstein spokesman told us in an email.", "The latest version to go viral was posted in March, by a Facebook group called “Liberalism is a Mental Illness,” and users breathed new life into it this week — bringing its total shares to more than 15,000.", "The “quotation” was originally published by a now-defunct illegitimate news website, the Palookaville Post, in a February 2013 story headlined: “Feinstein and Boxer Ask Californians to Lay Down Their Weapons During Statewide Manhunt.”", "The made-up story focuses on Feinstein and then-Sen. Barbara Boxer. It is premised on the actual news of a former Los Angeles police officer who shot and killed three people in 2013 and then fled, launching a manhunt. (The officer shot himself days later.)", "The listed “reporter” of the story — “Jimmy Olsentwins” — makes clear the author’s humorous intention. Jimmy Olsen is a fictional character who worked as photojournalist at the Daily Planet with Clark Kent, also known as Superman. And “Olsentwins” refers to actresses Mary-Kate and Ashley Olsen.", "The piece did not attribute the remark about guns to Feinstein. Instead, it attributed the quotation to an “intern.”", "“Throughout the day, Senators Feinstein and Boxer made desperate pleas for their California constituents to turn in their guns and not confront the crazed gunman because this would be a perfect test of their anti-gun proposals,” the made-up story reads.", "It then quotes a “Senate communications intern” as saying: “The Senators feel the best course of action is to remove all weapons from law enforcement and private citizens so no one else gets hurt. When the gunman realizes that nobody else is armed, he will lay down his weapons and turn himself in…. that’s just human nature.”", "Feinstein has indeed advocated for gun control measures, including the Assault Weapons Ban of 2019. But the statement long attributed to her on social media is imagined.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "“Feinstein and Boxer Ask Californians to Lay Down Their Weapons During Statewide Manhunt.” PalookavillePost.com. 7 Feb 2013.", "Mentzer, Tom. Spokesman, U.S. Sen. Dianne Feinstein. Email to FactCheck.org. 30 May 2019.", "“Mountain manhunt for ex-LAPD cop accused of killing 3.” CBS News. 7 Feb 2013.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]