["On November 4, the Signature bridge was inaugurated by the Delhi government amid ruckus. The 675 metre long bridge, constructed across the Yamuna river connecting Wazirabad to the inner city, has been touted as a stellar achievement of the Delhi government. The Aam Aadmi Party on November 3 had posted pictures of the bridge, purportedly shot at night, on its official Twitter account.", "It did not take long for political opponents and social media users to point out that out of the three photographs posted by the party, the first one was NOT of the Signature bridge to be inaugurated in the national capital. It may be noted here that the other two photos are not in dispute.", "The photograph which has been disputed was posted by Ankit Lal, the social media coordinator of the Aam Aadmi Party.", "Tajinder Pal Bagga, Delhi BJP spokesperson was quick to latch on to this faux pas, pointing out that the photograph represented the Erasmus bridge in the Netherlands.", ". @ArvindKejriwal साहब विकास कर लिया होता तो नीदरलैंड के इरास्मस ब्रिज की फोटो चुराने की जरूरत नही पड़ती । ये रहा उसका लिंक जहाँ से आपने तस्वीर चुराई खैर चोरी/घोटाला तो आपकी फितरत में हैhttps://t.co/edwphH9ubn pic.twitter.com/w9Z8xHSkWc", "— Tajinder Pal Singh Bagga (@TajinderBagga) November 4, 2018", "Bagga also tweeted a link to a YouTube video, titled ‘Illumination of the Erasmus bridge in Rotterdam’. The video is posted below. The frame at 0:26 minutes nearly matches the photograph of the bridge posted by Aam Aadmi Party.", "Alt News independently verified that the bridge in question is indeed the Erasmus bridge in Rotterdam, Netherlands. Named after Desiderius Erasmus, the 16th century Christian scholar and humanist, the bridge is 139 metres tall and over 800 metres long. Like the newly inaugurated Signature bridge in Delhi, it is a long-cable suspension bridge.", "All political parties without exception portray infrastructural accomplishments as hallmarks of development and in the process, they sometimes go overboard. Recently, Chhattisgarh BJP had passed off pictures of roads in Gujarat and abroad to showcase improved highways in its tenure. Despite the similarity in the structure of the two bridges, AAP’s gaffe did not go unnoticed.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]