["About this rating", "Harley-Davidson has announced the closure of at least one of their U.S. factories and also announced that they would be opening a manufacturing plant in Thailand.", "These decisions were both made before President Trump imposed tariffs on imported steel, and Harley-Davidson did not shut down their Wisconsin plant nor stop building motorcycles in the United States.", "Motorcycle manufacturer Harley-Davidson could face new challenges in the wake of President Donald Trump's sudden decision to impose tariffs on steel and aluminum in March 2018.", "However, a subsequent viral Facebook post exaggerated these challenges, appearing to conflate the announcement with old news stories about Harley-Davidson's past business decisions:", "** BREAKING NEWS ** today March 9 ........ HARLEY DAVIDSON SAID TRUMP ISN'T LOYAL . HE PROMISED AND LIED .. Plant in Wisconsin Closing ENTIRELY, moving to Thailand. CHEAPER TO BUILD Harleys there .. STEEL TARIFF SCREWED THESE WORKERS .. . And these men in Kansas City said *** TRUMP PROMISED TO SHIELD US ***** ALL are getting \" Laid off \" at their Harley Factory along with 800 more employees..", "you won't see this in FOX NEWS.. of course not!!", "This Facebook post is largely based on a 9 March 2018 MSNBC segment that featured reporter Garrett Haake speaking with employees at a Harley Davidson plant in Kansas City, Missouri. Some viewers, including the above Facebook poster, may have been confused by the segment, as it did not clearly state that Harley-Davidson first announced that this plant would be closing in January 2018 — more than a month before Trump made his tariff decision.", "It is true that some American companies have expressed concern about how new tariffs may affect their business going forward. It is also true that Harley-Davidson will soon be closing a plant in Kansas City, Missouri.", "However, these items are not directly related. In fact, Harley has planned on consolidating production at the Kansas City plant since 2015, before Trump was even in office; when the company made the announcement, it said that it was due to slowing motorcycle sales:", "Harley-Davidson's sales fell sharply in 2017 and the company will move ahead with a plan to consolidate manufacturing operations, including the closure of its Kansas City, Mo. plant.", "The world's largest maker of heavyweight motorcycles has struggled to reverse a four-year sales slide, with growth overseas somewhat helping offset a decline in the U.S. bike market.", "Additionally, Harley-Davidson announced in 2017 that it would be opening a manufacturing plant in Thailand. However, Harley said at the time that the decision was made to better serve the burgeoning market in southeast Asia, and that the decision would not affect manufacturing in the United States:", "The Thailand facility “will allow us to be more responsive and competitive in the ASEAN region and China,” Harley-Davidson public relations manager Katie Whitmore said.", "“Increased access and affordability for our customers in the region is key to growth for the company in total,” she said. “There is no intent to reduce H-D U.S. manufacturing due to this expansion.”", "The plant would let Milwaukee-based Harley-Davidson avoid Thailand’s up to 60 percent tariff on imported motorcycles and help it get tax breaks when exporting to Thailand’s neighbors, thanks to a trade arrangement among members of the Association of Southeast Asian Nation (ASEAN).", "Harley opened a plant in India in 2011. It also assembles motorcycles at a plant in Brazil.", "The company released a statement in March 2018 saying that these tariffs, as well as tariffs imposed in retaliation by the European Union, could directly hurt their business:", "“We support free and fair trade,” the company said in a statement. “Import tariffs on steel and aluminum will drive up costs for all products made with these raw materials, regardless of their origin. Additionally, a punitive, retaliatory tariff on Harley-Davidson motorcycles in any market would have a significant impact on our sales, our dealers, their suppliers and our customers in those markets.”", "Bhattarai, Abha.   \"U.S. Makers of Blue Jeans, Motorcycles and Other Goods Urge Caution on Tariffs.\"\r\n    The Washington Post.   6 March 2018.", "Barrett, Rick.   \"Harley-Davidson Closing Kansas City Plant as Motorcycle Sales Fall.\"\r\n    Milwaukee Journal-Sentinel.   30 January 2018.", "Barrett, Rick.   \"Harley-Davidson Closing Kansas City Plant as Motorcycle Sales Fall.\"\r\n    Milwaukee Journal-Sentinel.   30 January 2018.", "Bogen, Julie.   \"What’s the Deal with Steel?\"\r\n    Vox.   6 March 2018.", "Helmore, Edward.   \"Harley-Davidson: Trump's Tariffs Pose Grave Threat to Famous American Name.\"\r\n    The Guardian.   10 March 2018.", "Reuters.   \"Harley-Davidson Plans a Thailand Factory to Serve SE Asian Market.\"\r\n    24 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]