["Three people lost their lives in violence that erupted in Bengaluru on Tuesday night after a mob attacked the residence of Congress MLA Akhanda Srinivasa Murthy over a defamatory Facebook post allegedly made by his nephew against a religion. The riots saw arson, vandalism and stone-pelting targetting the politician’s house and police stations at DJ Halli and KG Halli.", "Reporting on the events from last night, Hindustan Times (HT) cited an ‘eyewitness’ account and published an article claiming “60,000-strong mob” had pelted stones at the police. “An eyewitness said on Wednesday there was a strong mob of 50,000 to 60,000, which pelted stones at police personnel and damaged property at a police station during the violence on Tuesday night in Bengaluru,” reported HT identifying the eyewitness as Sharif, who was part of the civil defence team aiding the police to pacify the crowd.", "HT has now altered its report, however, without stating any reason for the same.", "But the outlet seems to have overlooked its Bangla report which continues to put the strength of the mob at 60,000 as of this writing.", "Another Bangla website Kolkata Tribune also claimed that Bengaluru violence witnessed a mob of 60,000.", "Similar reports were carried by Swarajya, The Free Press Journal (FPJ) and OpIndia. All of them cited Hindustan Times as the source but none of them updated their reports as of this writing.", "This slideshow requires JavaScript.", "The eyewitness who was cited by the above-mentioned reports was questioned by the press on Wednesday morning. “Who all were involved?” a reporter asked Sharif who is a part of a civil defence team at DG Halli police station. “We can’t name the people involved,” he responded. “How much [large] was the crowd?” he was questioned next. “Somewhere around 50,000-60,000,” he claimed adding that the “police department has suffered many losses…We are from the police department, we have to support them. I am from DG Halli so this is like my temple, my masjid.” This can be watched starting 28 seconds in the video below.", "#WATCH Bengaluru: Sharif, belonging to Civil Defence & an eye-witness to DJ Halli Police Station’s vandalisation, comes to record his statement; says, “We’re from Civil Defence & had come to protect Police. It was public’s fault. This (Police Station) is like my temple,my masjid” pic.twitter.com/XeVyaK5Z1O", "— ANI (@ANI) August 12, 2020", "MLA Akhanda Srinivas Murthy claimed that a mob of 4,000 attacked his residence, as per a report in Deccan Herald which also says that a crowd of 600 attacked KG Halli police station. Mirror Now, however, puts the strength of the crowd outside Murthy’s residence at 1,500.", "None of the reports that Alt News came across put the strength of the crowd even close to 60,000.", "“There were basically two attacks. One at DG Halli which spilt over to KG Halli and the second on the residences of Congress MLA Murthy and his nephew Naveen who made the Facebook post. Their houses are about 800 metres apart,” Arun Dev, Karnataka Bureau Chief at The Quint, told Alt News.", "Dev gave a chronological account of Tuesday night’s violence in his report published by The Quint the next day. According to his report, Social Democratic Party of India (SDPI) leader Muzammil Pasha visited DG Halli police station at around 7:45 PM to file a complaint against Naveen. Pasha was accompanied by a crowd of 150. The police filed an FIR but Naveen was yet to be arrested. This agitated the crowd, leading to violence.", "The mob, which had sprouted to at least 800 by 10:30 PM, attacked DG Halli police station. “This is according to the police’s account. The residents’ accounts claim about 1,000 people had gathered in the area,” said Dev.", "The outnumbered cops retaliated with tear gas shells. At around midnight, they fired in the air and also open fired at the crowd. One person was killed on the spot and two others were injured who later succumbed to death.", "A section of the crowd outside DG Halli police station moved toward KG Halli police station and was joined by others.", "According to The Quint report, around the same time as the attack outside DJ Halli police station, another mob moved towards the Congress MLA’s house in the same locality. Naveen’s father, T Pavan Kumar, claimed that a mob of 500-800 passed by his house at 8:30 PM. Within minutes, Naveen’s house was also vandalised. In an effort to locate him, the crowd then moved to other houses in the area and also burnt down a local bar. “The strength of the crowd that I got from Naveen’s father who was in the house when the attack happened was close to 500-800,” said Dev.", "Dev added that as per his understanding the total strength of the crowd was 2,000-2,500.", "Prajwal Bhat from The News Minute, who was reporting from the area during the violence, gave a similar account to Alt News. He too said that the total strength of the mob was around 2,000, and so did CNN News18 journalist DP Satish. A report published by The News Minute on August 12, penned by Bhat, says that the police account claims there were more than 1,500 rioters outside DG Halli police station. The report adds that over 200 rioters had gathered outside Naveen’s residence.", "An inaccurate account was, therefore, carried by Hindustan Times. While the outlet subsequently altered its report, the figure was picked up by several other organisations. Reports were published in English, Hindi and Bangla without verifying or corroborating the figure. At a time when social media posts lead to violence, unverified media reports can have worse ramifications.", "[Update: Hindustan Times altered its Bangla report after this fact-check was published. However, the report does not carry any clarification for removing the ‘60,000’ figure.]", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]