["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "former NAACP leader Rachel Dolezal appears on the \"Today\" show during an interview with co-host Matt Lauer, June 16, 2015. (NBC News via AP)", "White or black? By now, most of you have probably heard about the controversy surrounding former NAACP leader Rachel Dolezal, who self-identifies as black but has white parents.", "Dolezal’s \"passing\" for black unleashed criticism that Dolezal used her racial identity as it suited her, a tool for progressing her own goals. One CNN article reported that some people felt that Dolezal had \"diminished the real struggles of African-Americans by claiming she had suffered hurtful racism like them.\"", "Count Michael Skolnik, Russell Simmons’ political director and the president of GlobalGrind.com, among that group.", "Dolezal \"took the space of a black woman, who could have been a leader of (the NAACP). ... Black people in this country don’t have that convenience,\" Skolnik said in a June 16 interview with CNN's Brooke Baldwin. \"In fact, for most black people in the history of this country who passed, it was illegal to pass as a white person. You were actually put in jail if you tried to pass. For black people, passing was about survival, it wasn’t about acceptance.\"", "Leaving aside the question of Dolezal’s actions, PunditFact was struck by Skolnik’s statement that \"it was illegal to pass as a white person (and) you were actually put in jail if you tried to pass.\" Was it illegal to pass as a white person? And was jail the consequence?", "The short answer is that experts say there were never laws explicity saying African-Americans could not pass a white person. But if discovered, those people passing as white would be subject to laws on the books for African-Americans, many of which could include jail time.", "Passing as white", "First, we have to address the question of what it meant to be black in the United States in the 19th and 20th centuries. In his book Who is Black? One Nation’s Definition, author F. James Davis stated that \"the nation's answer to the question 'Who is black?\" has long been that a black is any person with any known African black ancestry … In the South it became known as the ‘one-drop rule,’ meaning that a single drop of ‘black blood’ makes a person a black.\"", "Using this rule, a person who identified as white could be accused of being black if any information or documents surfaced claiming that he or she had a black ancestor. Virginia's Bureau of Vital Statistics registrar Walter Plecker, for instance, became infamous in Virginia during the 20th century for using birth and death certificates, data from the U.S. Census Bureau and the Confederate War Department, as well as other sources to determine who had any \"colored\" blood.", "Because of this, fair-skinned individuals who could pass for white would be legally identified as black.", "Skolnik told us he was referring specifically to slave times. \"If a slave tried to pass for white and was caught, they were oftentimes jailed and sent back to their slave masters,\" Skolnik said.", "That’s true, though not because they passed as white, but because they were declared someone else's property. Under the Fugitive Slave Acts in place until the Civil War, citizens and local governments were under the obligation to capture and return slaves to their owners. Failure to do so would result in penalties.", "Jail and other consequences", "After the Civil War came the rise of black codes and Jim Crow laws. While these laws were designed to create different sets of rules for blacks and whites on everything from marriage to education to the use of public facilities, they didn't target blacks specifically for passing as white.", "Evelyn Brooks Higginbotham is a Harvard University professor of history and African American studies.", "\"I don’t believe that passing itself, although it remained the focus of numerous court cases, ended generally in imprisonment unless attached to another illegal practice, such as interracial marriage, theft, etc.,\" Higginbotham said. \"The consequences of being exposed were usually being put out of a school, losing one’s job, sued for divorce, denied access to public accommodations, and disgraced in one’s former social circles.\"", "Martha S. Jones, associate chair of the Department of Afroamerican and African Studies at the University of Michigan, agreed. \"The consequences for attempting to ‘pass’ were that one might be denied a license to marry, or … one might be denied entry into the United States or naturalization as a citizen if discovered to be passing,\" Jones said.", "In Florida, for example, it was illegal for a black man or woman to cohabitate with a white man or woman, and the punishment included up to one year in prison. But the crime wasn't passing as white.", "Elizabeth Smith-Pryor, a history professor at Kent State University, explained one such case for us. Under Alabama law, people could be imprisoned if found to be married to someone of the other race. In 1935, in the case of Keith vs. Commonwealth, Keith was accused of having a black ancestor -- and therefore being black -- making his marriage to a white woman illegal. The court ultimately ruled there was not enough evidence to convict.", "Our ruling", "Skolnik said that \"for most black people in the history of this country who passed, it was illegal to pass as a white person. You were actually put in jail if you tried to pass.\"", "Skolnik said he was referring to the Fugitive Slave Acts, which could result in prison time for runaway slaves until they were returned to their owner. But those acts had nothing to do with passing as white, as slaves were considered property.", "Post-Civil War Jim Crow laws did not include passing as white as a crime that could send someone to jail. However, blacks exposed as passing as white would be treated like other blacks under the law. And that, depending on the crime, could result in imprisonment.", "Skolnik’s statement is partially accurate. We rate it Half True.", "CNN, \"Ex-NAACP leader Rachel Dolezal: 'I identify as black',\" June 17, 2015", "Today Show, \"Rachel Dolezal breaks her silence on TODAY: 'I identify as black',\" June 16, 2015", "Twitter, Interview with Michael Skolnik and Sunny Hostin, June 16, 2015", "Who is Black? One Nation’s Definition, \"The One-Drop Rule Defined,\" October 2, 2001", "What Comes Naturally: Miscegenation Law and the Making of Race in America, \"The Virginia Racial Integrity Act,\" January 16, 2009", "Email interview with Michael Skolnik, President and editor-in-chief of GlobalGrind.com and political director to Russel Simmons, June 17, 2015", "Email interview with Martha S. Jones, University of Michigan professor of history and Afroamerican and African studies, June 16, 2015", "Email interview with Elizabeth Smith-Pryor, Kent State University professor of history, June 17, 2015", "Google Scholar, \"Keith v. Commonwealth, 165 Va. 705 - Va: Supreme Court 1935,\" accessed June 17, 2015", "Central Piedmont Community College, \"Black Code and Jim Crow Law examples,\" accessed June 17, 2015", "History Channel, \"Fugitive Slave Acts,\" accessed June 18, 2015", "Property Rites: The Rhinelander Trial, Passing, and the Protection of Whiteness, \"‘Poor Little Cupid’ and the Marriage Contract,\" April 30, 2009", "Email interview with Evelyn Brooks Higginbotham, Harvard University, June 18, 2015", "States' Laws on Race and Color, edited by Pauli Murray", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]