["A Facebook post with a picture of former Vice President Joe Biden kneeling at his childhood home in Scranton, Pennsylvania, has gone viral for claiming that he kneeled because he saw an American flag nearby.", "The caption on the post reads, “Joe Biden takes a knee after spotting an American flag near his childhood home in Pennsylvania.”", "The poster, Renee Hudson Perfecto, also added this comment to the post: “And he wants to be President of this great Country? If he will bend a knee to our flag for the mob, what will he also bend for with foreign envisions (sic) and other Countries? Wow! Never vote for someone this weak!\"", "USA TODAY has reached out to the poster for comment.", "Outrage over systemic racism has led to many athletes kneeling during the national anthem. The post appears to tie Biden to that movement.", "But Biden was actually kneeling to speak to a child at eye level outside his boyhood home in, while on a visit to Scranton.", "Fact check:Viral photo shows Obama, Fauci visiting NIH lab in 2014, not a 'Wuhan lab' in 2015", "This view from C-SPAN shows that Biden is simply speaking to a young child. “How old are you? This many,” Biden asked while holding up four fingers.", "This view from DailyMail.com shows a nearby house did have an American flag hanging outside the home, but Biden’s attention was not on the house, nor the flag, but rather the conversation he was having with the child.", "Further, the photo, taken by Matt Slocum for the Associated Press, has this caption: \"Democratic presidential candidate, former Vice President Joe Biden kneels to talk with a child during a visit to Biden's childhood home in Scranton, Pa., on Thursday, July 9, 2020.\"", "We rate this claim FALSE because it is not supported by our research. Biden was kneeling to speak at eye level with a child.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]