["About this rating", "On 16 February 2016, a blog called Two Droplets appeared and became a social media sensation. Its author claimed to be the wife of a man who had unwittingly fallen victim to a bizarre and unexpected medical anomaly stemming from two droplets of drain cleaner.", "The blog's writer was anonymous (as was her spouse), and her story began:", "In June of 2010 my husband was a perfectly healthy 26 year old man. We were living life with our almost 3 year old daughter and our one year old triplets (two boys and girl). Life was as normal as it could be for a family with that sort of dynamic. On another one of our ordinary days, the bathroom sink became clogged. My husband used a widely sold drain cleaner in an attempt to fix the issue. He poured the chemical into a funnel placed in the pipe under the sink and that’s when it happened. Two droplets. The funnel burped and two droplets of the chemical hit the back of his hand. We had no clue at that moment our lives would never be the same.", "The chemical began to eat away at the skin. We lived 5 minutes from a local hospital, so I snapped a photo of the ingredients on the bottle and we headed off to the emergency room. The hospital called poison control and proceeded to follow protocol in treating the chemical burn. He ended up having a skin graft performed to cover the wound area which was not much larger than a quarter. Done, right? End of story? Not even close. It was only the beginning.", "The narrative advanced to describe an escalation of unexpected damage due to the \"two droplets\" incident:", "To keep a story so long I could create a page count to rival War & Peace short, he ended up having 27 surgeries in total to try and remedy the issue. He had grafts and flaps and even had his hand sewn into his stomach for three weeks. None of it worked. His body has served as harvesting ground for his hand. Both of his upper legs, an upper arm, his groin area, and his abdomen are covered with scars from donor sites. Oddly, those sites have all healed and never experienced the dreaded necrosis. His hand, however, kept relentlessly dying. It got to the point that he was spending as much time in the hospital as he was at home. The flares were getting closer together and more aggressive.", "According to the author, the condition progressed so severely that amputation was the only available choice.  Even then, she said, her husband failed to improve:", "On December 15, 2015 my husband made the difficult decision to have an amputation performed. It had been suggested by a few doctors in the last couple of years and was considered the heavy end game to the awful journey of trying to save the limb. He decided that he had done everything and couldn’t take it anymore. He decided he was through suffering, and he was through watching his wife and children suffer. It became clear that quality of life with one hand would be superior to the quality of life that came with a dead, diseased, and painful hand. It was time ... On February 12, 2016, just shy of 2 months post-amputation, the familiar, awful, life shattering ache returned. Shortly thereafter, so had the mysterious necrosis, spreading across the end of his newly healed stump. That stump represented the fact that he literally gave his right hand in exchange for a better life, and now the end of it wears a taunting badge of the dead flesh we thought had been removed from our lives for good. What a tremendous slap in the face. This “thing” with no face and no name has returned to destroy our lives and our dreams of a normal future without constant pain and suffering.", "The single post on the blog concluded with three objectives: First, to remind readers to be grateful for what they had in life, lest a chance encounter with drain cleaner slowly rob them of their health and sanity.", "The second was a plea for anyone with medical expertise to contact the anonymous family in the hopes of resolving the persistent health issue.", "The third was an apparent attempt at humor, urging people with plumbing problems to call a plumber rather than use chemical drain cleaners.", "The ambiguity and lack of clear purpose presented by the post was puzzling.  The author stated outright that she sought no \"handouts\" for her family's troubles. The only visible comment on the post was attributed to the original author, and she stated her resolve not to name the chemical by which her spouse was purportedly injured (despite the value such a disclosure would present to anyone interested in helping with the medical mystery):", "I want to go ahead and leave a comment here to address the most common questions/suggestions I am receiving: No, I do not want to put out the name of the drain cleaner due to the fact that the statute of limitations for product liability has passed. We have not sued and that ship has sailed. I am no legal expert, but I fear blasting the company on the internet would land me in some legal trouble so I will keep the brand name to myself. Next, it is not necrotizing faciitis. That was ruled out. We have also explored the possibility of pyoderma gangrenosum at length with no success. My husband has been to wound care centers and has undergone a ton of hyberbaric chamber treatments, so our answer does not lie there. I have received an enormous response, far beyond what I ever dreamed, and I appreciate the kindness of every single person that has taken the time to pray for us and offer suggestions. I will spend the coming days sorting through e-mails and comments and get back to everyone I feel will be of help to us. If you are sharing this and/or taking the time to offer resources and suggestions I thank you from the depths of my heart. I am humbled beyond words. Please keep sharing. ♥", "The blog post had seven images, none of which led to a hit on a reverse image search engine. If the photographs (1, 2, 3, 4, 5, 6, 7) appeared on the internet prior to the \"Two Droplets\" blog, they were neither widely distributed nor associated with any other injury or accident.", "A Facebook and Twitter user shared a link to the post multiple times alongside a claim that the poster was a personal friend, but that user also provided no identifying information:", "Shamelessly sharing this again. The Wordpress page has already received over 160,000+ views in just one day. My friend...", "Posted by Marlana Weber on Tuesday, February 16, 2016", "It wasn't long before the post was shared Reddit's r/medicine (a subreddit for medical professionals). One poster pointed out that the story felt incomplete:", "None of the story adds up. He had far more than a few drops of a chemical agent on his skin, either has underlying vascular issues to that hand, had an infected skin graft that wasn't treated properly, delayed treatment far beyond what she described, etc.", "Another observed that help would be unlikely to materialize, given the vagueness of the claim:", "I'm highly skeptical of this story, but I'll take it at face value.", "It seems fairly apparent to me that the best chance at finding some answers would of been to send the bottle of drain-cleaner to a laboratory for analysis; either A) those chemicals were not your standard drain-cleaners, or B) the bottle had been contaminated with something.", "After that, a biopsy of the diseased tissue to look for any hints as to the underlying mechanisms actually inducing the necrosis.", "Honestly, if she wants real help, she'll have to post as much relevant information for the public to see as possible.", "Prior to the appearance of Two Droplets, we were unable to find any previous reports of this incident. If either the affected husband or worried wife sought help, their odd tale didn't receive much attention prior to the blog's creation.", "On 18 February 2016, the author of the above-embedded Facebook post contacted us about the claim. We responded to that individual and received a reply from the blog's purported author, including a photo of the injury. However, that reply included no verified or verifiable information helpful to documenting this report as true.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]