["This video has been viewed more than one million times after it was published on February 15, 2018, on YouTube.", "The two-minute five-second clip shows Sultan of Brunei, Hassanal Bolkiah, giving a speech.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language title translates to English as: “The Sultan of Brunei Darussalam’s sharp criticism of Jokowi”.", "“Jokowi” is the nickname of Indonesian President Joko Widodo.", "The YouTube video has been shared with the same claim on Twitter here, here, here and here.", "The claim is false; the video actually shows the sultan giving advice to Brunei’s new ministers in 2018.", "A reverse image search and a subsequent keyword search on Google found this February 7, 2018, news video by Brunei state broadcaster Radio Televisyen Brunei (RTB) on its official YouTube channel.", "The RTB news video, which is 43 minutes and 41 seconds in length, starts with two news hosts presenting a segment about the sultan’s speech.", "The video’s Malay-language title translates to English as: “Prime News February 7, 2018”.", "The clip in the misleading YouTube post starts at the 15-minute 51-second mark in the RTB video. In this section, the sultan can be heard giving advice to the new ministers about the need to uphold the country’s state ideology principles.", "The sultan's comments in Malay translate to English as: “If you want to become a good leader, strongly uphold these principles. And do not become a leader who is hungry for power, who is doing something for personal benefits rather than for the interests of the nation. Among the characteristics of a power-hungry leader are: sly, making a plan or strategy for personal gains, such as committing cronyism and nepotism to strengthen his position and power. I am sure these acts will not bring anything good but bad things to the nation. And we cannot let them prevail.”", "Below is a screenshot of the video in the misleading post (L) and the RTB video from the 15-minute 51-second mark (R):", "The Prime Minister’s Office published this transcript of the sultan’s speech on February 7, 2018.", "Below is a screenshot showing a part of the lengthy transcript; AFP has highlighted sentences spoken in the misleading clip in blue:", "The Indonesian president, Joko Widodo, is not mentioned anywhere in the video or the transcript.", "Brunei’s state newspaper, Pelita Brunei, published this report about the sultan’s speech on its front page on February 10, 2018.", "Below is a screenshot of the newspaper:", "The Malay-language report's main headline translates to English as: “Do your job for the nation”.", "The front page also carries a photo of the sultan delivering speech. The photo’s background matches the background seen in the misleading clip and the original footage.", "The misleading YouTube post was previously debunked by Indonesian news outlet Tempo here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]