["About this rating", "On 20 May 2019, U.S. President Donald Trump held a rally at the Energy Aviation Hangar in the Pennsylvania borough of Montoursville. Early on in his speech, the president encountered difficulties with the lighting in the hangar glaring in his eyes and asked that the lights be turned down, saying: \"You know, I thought that was the sun in my eyes; it's these stupid lights, these people ... I mean what are they doing? Is there any way they can turn these lights down, folks?\"", "Trump then offered some additional words about the sun before resuming his speech, words that prompted reactions ranging from confusion to the creation of derisive memes:", "The full statement uttered by Trump was often cited as the following:", "\"You know, I thought that was the sun in my eyes; it's these stupid lights, these people ... I mean what are they doing? Is there any way they can turn these lights down, folks? Crazy. You've got a thing called the sun; we like the sun better than the artificial non-sun.\"", "However, some reports of the speech did not present Trump as saying anything about a \"non-sun\" (or \"not sun\"), but rather exclaiming that \"we like the sun better than the artificial nonsense.\" The event was captured on video, but no consensus seems to exist among viewers about what the president said — some hear \"non-sun\" while others hear \"nonsense\":", "The White House did not immediately respond to our request to verify exactly what Trump said.", "Re, Gregg.   \"Trump, At Raucous Pennsylvania Rally, Slams Scranton-Born Biden: 'He Deserted You.'\"\r\n    Fox News.   21 May 2019.", "Diamond, Jeremy.   \"Trump Knocks Biden As He Ramps Up Reelection Bid with Pennsylvania Rally.\"\r\n    CNN.   20 May 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]