["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Donald Trump has promoted a \"big protest\" in Washington, D.C., on Jan. 6, when Congress is scheduled to certify President-elect Joe Biden’s victory in the 2020 election.", "But an image being spread online is not a sign that the president is calling for a revolution.", "\"1776 flag flying over White House!\" reads the headline on a Jan. 4 blog post on the Hal Turner Radio Show website. \"REVOLUTION SIGNAL.\"", "The post goes on to say that \"the 1776 flag is presently flying atop the White House in Washington, DC. It is the signal of REVOLUTION from our President! The time is here. The storm is upon us. Rise-up, America. Rise up against the fraudulent election.\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The flag in the photo is washed out, but the blog post seems to be referring to the 13-star flag, the first official U.S. flag to fly after the country’s founding in 1776.", "However, the photo isn’t recent. Dan Scavino, the White House deputy chief of staff, posted it on Instagram on June 1, 2019.", "We didn’t find any media coverage about the White House flying the 13-star flag around that time, and it was in the news. Nike pulled Fourth of July sneakers featuring the flag over concerns that it was a symbol for racism.", "We also found no evidence that such a flag is currently flying over the White House.", "But in any case, the image that purportedly shows an older flag that Trump raised to rally an uprising is more than a year old.", "We rate this blog post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Hal Turner Radio Show, 1776 flag flying over White House! Revolution signal, Jan. 4, 2021", "Donald Trump tweet, Dec. 19, 2020", "The Washington Post, Pro-Trump forums erupt with violent threats ahead of Wednesday’s rally against the 2020 election, Jan. 5, 2021", "USA Today, The Stars and Stripes: Here are the 27 different US flags and their histories, July 3, 2019", "Dan Scavino tweet, June 1, 2019", "WUSA9, Patriotic or offensive? Historian gives context to the Betsy Ross flag controversy, July 3, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]