["About this rating", "Between 2013 and 2018, Turner suffered a series of major health setbacks beginning with a stroke and followed by bouts of intestinal cancer and kidney disease. She underwent successful operations in 2016 and 2017 to remove a cancerous section of her colon and to receive a kidney transplant. As of March 2019, she was still under medical treatment related to the transplant and her body's rejection of the organ.", "As of March 2019, there were no reliable reports of Turner suffering a recurrence of either stroke or cancer, and she was in good enough health to travel abroad, make public appearances, and conduct on-camera interviews.", "This report reflects facts as of May 2, 2019. Years later, on May 24, 2023, multiple reputable news organizations reported Tina Turner had died at the age of 83.", "Tina Turner is a multiple-Grammy-winning singer-songwriter who has enjoyed a long and storied career in show business. Born in 1939 in Nutbush, Tenn., she began performing at the age of 19 and racked up a string of hit recordings with musician Ike Turner (whom she eventually married) in the 1960s and '70s.", "Turner retired after a record-breaking international \"farewell tour\" in 2000, but never strayed far from the public eye, popping up in 2008 for a Grammy Awards show duet with Beyoncé and embarking soon thereafter on a highly acclaimed 50th anniversary tour throughout the U.S. and Europe.", "Turner suffered some serious health setbacks between 2013 and 2018, but bounced back to help mount a theatrical production based on her life and music (Tina: The Tina Turner Musical, which opened in London in April 2018), and pen a best-selling autobiography (Tina Turner: My Love Story, published in October 2018).", "The public was largely unaware of Turner's health problems until she spoke of them in her memoir, revealing that she suffered a stroke in 2013 from which she was still recovering when she was diagnosed with early-stage intestinal cancer and kidney failure. The cancer was successfully treated by the removal of part of her colon, but by that time her kidney disease had progressed to the point where a transplant was required and she would have to go on dialysis until a kidney donor was found.", "At that point, Turner wrote, the future looked so bleak to her that she considered requesting assisted suicide:", "I began to think about death. If my kidneys were going, and it was time for me to die, I could accept that. It was OK. When it's time, it's really time. I didn't mind the thought of dying, but I was concerned about how I would go.", "One of the benefits of living in Switzerland is that assisted suicide is legal, though the patient has to inject the lethal drug herself.", "There are several organizations that facilitate the process, including Exit and Dignitas. I signed up to be a member of Exit, just in case.", "Turner's current husband, record producer Erwin Bach, came to the rescue by offering to donate one of his own kidneys. In a further stroke of good fortune, their blood types matched, and a transplant was performed in April 2017, followed by a long process of recovery. \"My body keeps trying to reject the new kidney, which is not uncommon after a transplant,\" Turner wrote. \"This means I have to take strong doses of immuno-suppressants to weaken my antibodies and prevent them from attacking an organ they don't recognize.\" Even so, she felt that the operation had quite literally given her a new lease on life.", "\"After a transplant, it seems that there's always another test, another doctor's appointment or biopsy to get through,\" Turner wrote. \"But I'm still here. We're both still here, closer than we ever imagined — and that's cause for celebration.\"", "Those words were written in 2018, a year that would bring even more ups and downs in Turner's life and career. While still battling transplant rejection, Turner helped mount and open a successful stage show, Tina: The Tina Turner Musical, which premiered in London in April 2018 (almost exactly year after her surgery). Then, in June, her eldest son, Craig, took his own life by shooting himself. In October, her autobiography was published. It included a heartfelt tribute to her son.", "None of the attendant press coverage over the course of that year reported new or recurring health problems on Turner's part except for her ongoing treatments related to the transplant. In November, she told London's Daily Express that overall she was doing well: \"I'm in good shape now,\" she said, \"I've adjusted to the reality that doctors and check-ups will always be a part of my life. Fortunately, I have really nice doctors.\"", "Nevertheless, rumors began to circulate, and continued to circulate well into 2019, to the effect that Turner was \"gravely ill\" and \"near death\" due to any number of alleged ailments. Some of the illnesses named in these rumors were stroke, stomach cancer, intestinal cancer, and the rejection of a kidney or liver transplant.", "The earliest of them appeared to be a side-effect of the extensive press coverage her book had received. Despite the fact that Turner's stroke had occurred five years earlier (and no subsequent instances had been reported), we began receiving inquiries from readers in October 2018 (the month the autobiography came out) asking if it was true that she had just suffered a stroke. Similarly, although Turner stated in the book that tests showed no recurrence of her cancer after she underwent surgery in 2016, readers were still asking us in early 2019 if it was true that she was dying of intestinal or stomach cancer.", "The public was also misled by erroneous reporting from tabloid newspapers and gossip websites. For example, in October 2018, a number of these sites repeated \"unconfirmed reports\" that Turner was \"fighting stomach cancer.\" In November, National Enquirer , Radar Online, and other unreliable sources claimed that Turner was so close to death that she was \"planning her own funeral.\" (The same sources played up an alleged rivalry between Turner and the late Aretha Franklin, saying Turner wanted her funeral to be bigger than Franklin's.)", "But three months later, in a February 2019 interview with The Sunday Post, Turner sounded upbeat and optimistic. \"I don't have any big plans but I don't like to rule out any possibilities either,\" she said. \"I still love my music and some days I feel like performing again. I'll be around for a while yet and who knows what might happen. We'll see but in the meantime keep the music in your life. I've gotta say it – music is simply the best.\"", "On 3 March 2019, Tina Turner was photographed onstage with the cast of Tina: The Tina Turner Musical at the show's German premiere in Hamburg. Please note that she looks neither \"gravely ill\" nor \"near death\" in the photo below or in video of the occasion.", "Georg Wendt / Getty Images", "Unfortunately, Turner's management declined to answer questions about the state of the singer's health when we reached out to them for comment, but based on the evidence, rumors of Tina Turner's imminent demise appear unfounded.", "B., Elle.   \"Tina Turner Allegedly Fighting Stomach Cancer?\"     CelebrityXO.com.   30 October 2018.", "Bale, Bernard.   \"Simply the Best Way of Avoiding the Blues Is to Love Live, Says Iconic Singer Tina Turner.\"    The Sunday Post.   16 February 2019.", "Hautman, Nicholas.   \"Tina Turner Opens Up About Her Son's Final Days Before His Suicide.\"    MSN.com.   19 October 2018.", "Power, Vicki.   \"Tina Turner: 'I've Had More Lives than a Cat.'\"    The Daily Express.   23 November 2018.", "Stephens, Stephanie.   \"Simply the Best. Tina Turner Talks Life, Love, Optimism and David Bowie.\"    Parade.   26 November 2018.", "Turner, Tina.   My Love Story.    New York: Atria Books, 2018.   ISBN 1501198246.", "National Enquirer.   \"Tina Turner Taking Her Aretha Feud to the Grave.\"   14 November 2018.", "Radar Online.   \"Tina Turner Allegedly Plans Own Funeral to Upstage Aretha Franklin's Final Farewell!\"    7 November 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]