["An image of House Speaker Nancy Pelosi, D-Calif., that shows her leaving a building is being used on social media to claim that she had been escorted out of a restaurant after a few drinks.", "\"Looks like Crazy Nancy had a liquid lunch,\" reads the caption of a Facebook post that has been shared over 53,000 times.", "The viral photo shows Pelosi walking on a sidewalk with help from a woman and a man in a suit behind her.", "The claim first appeared in January and was debunked by PolitiFact. However, the claim persists and has been shared widely by users across Facebook. And some people suggested the image was taken recently, questioning why the House speaker wasn't wearing a mask in public.", "USA TODAY reached out to the users for comment.", "Fact check:False claim that Pelosi drunk in 2016 photo with Obama", "The image is genuine. However, the photo is from Sept. 16, 2016, when Pelosi visited a clothing store in Hartford, Connecticut, prior to a fundraising event.", "The photo was captured by local news anchor Dennis House and was shared as a blog post, \"Nancy Pelosi Shops in Hartford.\"", "\"Pelosi was greeted by store owner Jody Morneault and later escorted to a waiting SUV by Morneault and a government security detail. The two hugged before Pelosi was whisked away,\" House reported.", "Pelosi was exiting one of Connecticut's oldest stores, Stackpole, Moore and Tyron, which she first visited in 2013 and again in 2014, according to Connecticut Magazine.", "The blog post includes other photos from that day, including Pelosi greeting people near the SUV, opening the door of the shop with the store owner as well as an image of her security detail waiting outside for her.", "Fact check:Congressman did not 'just' submit resolution calling for Pelosi's expulsion", "This is not the first time the House speaker has been falsely accused of being drunk in a photograph.", "USA TODAY recently fact-checked a similar image claiming to be a \"drunken photo\" of Pelosi with then-President Barack Obama. Drew Hammill, Pelosi's deputy chief of staff, confirmed the House speaker does not drink.", "Numerous fact-checking organizations, including USA TODAY, have repeatedly debunked false claims that target Pelosi and attempt to make her appear intoxicated.", "The claims range from manipulated videos that make her appear to be slurring her words during a press conference to false claims that she was removed from the House floor for \"drunken and disorderly conduct.\"", "Fact check:Video of Speaker Nancy Pelosi altered, selectively edited", "The image does not show Pelosi leaving a restaurant after drinking and it was not taken recently. The photo is from a shopping outing in 2016. A spokesman for Pelosi has previously confirmed to USA TODAY that she does not drink alcohol. We rate this claim as FALSE, based on our research", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]