["In a chaotic debate with plenty of crosstalk, there was also plenty to fact-check.", "By FactCheck.org", "Posted on September 30, 2020 | Corrected on October 1, 2020", "Note: This story has been corrected. Read more.", "President Donald Trump and former Vice President Joe Biden met on the debate stage for the first time and stretched or mangled facts on several topics:", "And there were more claims on topics including veterans, the economy and preexisting conditions.", "The two presidential candidates debated on Sept. 29 in Cleveland. Fox News’ Chris Wallace was the moderator.", "Making his case that mail-in voting has already resulted in large scale “fraud,” Trump cited two examples that are not evidence of fraud at all.", "“There’s fraud,” Trump said. “They found them in creeks. … They sent two in a Democrat area. They sent out a thousand ballots, everybody got two. This is going to be fraud like you’ve never seen.”", "In recent days, Trump has referred to ballots found in a ditch or a riverbed or, as he did during the debate, “in creeks.” Law enforcement officials in Wisconsin reported that three trays of mail were found Sept. 21 along the side of a road and in a ditch next to a highway in Greenville. Officials there said the batch of mail included “several” absentee ballots, though a Postal Service spokesman would not comment on whether those were completed ballots, or blank ones being sent to voters, according to the Post Crescent. The paper quoted the county clerk saying election officials started to mail out ballots to voters on Sept. 17.", "As for the claim about a thousand people being sent two ballots, that’s true. As NBC4 in Washington reported, election officials in Fairfax County, Virginia, believe up to 1,000 people who requested mail-in ballots may have gotten two by mistake. But it’s not evidence of fraud. Those people who got two ballots won’t be able to vote twice.", "Fairfax County Registrar Gary Scott said that when every ballot is returned, “we make an entry into their voter record that they have returned a ballot. So if something else shows up, the ballot has already been returned. We can’t count that ballot.”", "And despite Trump’s repeated warning about large-scale fraud with mail-in voting, as we have noted, while the instances of voter fraud via mail-in or absentee ballots are more common than in-person voting fraud, the number of known cases is relatively rare.", "Trump interrupted Biden’s discussion of his health plan to falsely claim that Biden supports Sen. Bernie Sanders’ Medicare for All plan. The president wrongly claimed that the two rivals for the Democratic nomination agreed to it in the Biden-Sanders Unity Task Force Recommendations report.", "Trump: Joe, you agree with Bernie Sanders — who’s far left — on the manifesto, we call it, and that gives you socialized medicine. Are you saying you didn’t agree?", "Biden does not agree with Sanders’ plan. The task force report reflected Biden’s health care plan — which he unveiled in July 2019 during his primary fight with Sanders and others.", "Biden’s plan, among other things, offers a Medicare-style public health insurance option as a choice and increases tax credits for individuals purchasing insurance on the exchanges created by the Affordable Care Act. His website says his plan to “build on the Affordable Care Act” will “insure more than an estimated 97% of Americans.”", "Here’s what the task force report says: “Democrats believe we need to protect, strengthen, and build upon our bedrock health care programs, including the Affordable Care Act, Medicare, Medicaid, and the Veterans Affairs system. Private insurers need real competition to ensure they have incentive to provide affordable, quality coverage to every American. To achieve that objective, we will give all Americans the choice to select a high-quality, affordable public option through the Affordable Care Act marketplace.”", "Trump also said “you’re going to extinguish 180 million people with their private health care,” another reference to Medicare for All. Again, Biden doesn’t support that plan.", "Biden was wrong when he said there was “less violence” during his time as vice president than there is “today.”", "Biden: When we were in office there were 15% less violence in America than there is today.", "It’s true that the number of all violent crimes per 100,000 people declined 15.7% during the Obama-Biden years (even taking into consideration a 6.5% jump in their final two years). That may have been the point  Biden wanted to make.", "But the same FBI figures contradict Biden’s claim that there was less violence then than “today.” Annual figures show that last year’s violent crime rate was 5.1% lower than in 2016. Furthermore, the decline seems to have continued into the first half of 2020 according to “preliminary” semiannual FBI figures, despite an alarming 14.8% increase in the number of homicides, compared with the same six months in 2019.", "Near the end of the debate, Wallace asked whether the candidates would urge their supporters to refrain from civil unrest and also pledge to withhold declaring victory until the election results are certified.", "Trump said he was “urging my supporters to go into the polls and watch very carefully” and then said: “As you know today there was a big problem. In Philadelphia, they went in to watch — they’re called poll watchers. It’s a very safe, very nice thing. They were thrown out. They weren’t allowed to watch. You know why? Because bad things happen in Philadelphia, bad things.”", "The day marked the first day that the city opened satellite elections offices — where residents can register to vote, or request and return mail-in ballots — and at least one woman who reportedly claimed to be a poll watcher for the Trump campaign was barred from entering a satellite office in an elementary school.", "But the Trump campaign doesn’t have any approved poll watchers in the city, elections officials told the Philadelphia Inquirer, and the satellite offices in operation are not the same as Election Day polling locations — so poll watchers don’t have the same privileges.", "Al Schmidt, a Republican and a city commissioner who oversees elections, told the Inquirer: “We don’t give someone a poll watcher certificate to … watch somebody fill out their ballot at their kitchen table.”", "Nick Custodio, a Philadelphia deputy commissioner, said in a statement to NBC News that the “Satellite Offices are not Polling Places. Poll watcher certificates have not been issued for any individuals for anything other than poll watching activities on Election Day at Polling Places.”", "“Individuals who are not seeking to receive services from a Satellite Office are not permitted to be there for other purposes,” the statement said. “This is particularly important in the current environment as City buildings and offices remain closed to the public due to COVID-19.”", "Trump touted his support from law enforcement organizations, but he was wrong to claim the support of a Portland, Oregon, official. He also went too far in claiming that Biden got no similar endorsements.", "“Excuse me, Portland, the sheriff just came out today and he said, ‘I support President Trump,’” Trump said, looking across the stage at Biden. “I don’t think you have any law enforcement. You can’t even say ‘law enforcement.’”", "Both of those things are wrong.", "The sheriff in Multnomah County, which includes the city of Portland, took to Twitter to clarify that he has not endorsed Trump.", "“In tonight’s presidential debate the President said the ‘Portland Sheriff’ supports him. As the Multnomah County Sheriff I have never supported Donald Trump and will never support him,” Sheriff Michael Reese tweeted.", "Portland rose to national prominence after federal agents arrived there this summer as protests against police brutality and racism boiled following the death of George Floyd, a Black man who died in police custody in May. At the end of July, federal agents agreed to step back and local authorities took over. Reese had expressed concern about the conduct of the federal agents at the time.", "Trump has, however, received the endorsement of another sheriff in an area that’s recently gotten national attention — David Beth, the sheriff in Kenosha, Wisconsin, is supporting the president’s reelection bid. Kenosha drew protests following the police shooting of Jacob Blake in August.", "As for the suggestion that Biden has garnered no support from law enforcement officials, that’s false. The former vice president is backed by more than 175 current and former law enforcement officials.", "Biden and Trump sparred over manufacturing jobs, but neither gave an accurate account.", "Trump: I brought back 700,000 [manufacturing] jobs; they brought back nothing.", "Biden: Even before COVID … manufacturing went into a hole.", "The fact is, 237,000 manufacturing jobs have been lost between the time Trump took office and August, the most recent month for which figures are available.", "To be sure, there was a gain of 499,000 (but not 700,000) between Trump’s inauguration and November of last year, when the number peaked a few months prior to the COVID-19 pandemic’s arrival.", "From there they slipped a bit but didn’t exactly go “into a hole,” as Biden claimed — declining by only 62,000 by the time Trump declared a national COVID-19 emergency in March. That was followed by a two-month plunge of nearly 1.1 million manufacturing jobs, fewer than half of which have since been regained.", "Furthermore, Trump was wrong when he said Obama-Biden “brought back nothing.” Yes, 578,000 jobs were lost during their first four-year term, which included the Great Recession that had begun in 2007 and raged for months after they took office. But 386,000 jobs were in fact “brought back” in their second term.", "In an exchange with Wallace, Trump reluctantly acknowledged that greenhouse gases warm the planet “to an extent” but insisted that better forest management could solve California’s wildfire problem.", "In fact, scientists’ best estimate is that human activities, including human-produced greenhouse gases, are responsible for more than 100% of the observed warming of the Earth. And while improved forest management techniques can help reduce the risk of some wildfires, climate change and other factors, including humans living in wildfire-prone areas, are also important.", "When Wallace asked the president what he believed about climate change, Trump sidestepped the question, saying, “I believe that we have to do everything we can to have immaculate air, immaculate water, and do whatever else we can that’s good.”", "When pressed again on whether he thinks greenhouse gases contribute to the global warming of the planet, Trump said, “I think a lot of things do, but I think to an extent, yes.”", "He added, “But I also think that we have to do better on forest management of our forests,” explaining that he gets calls about wildfires in California every year, and that “if you had good forest management, you wouldn’t be getting those calls.”", "Trump then went on to point to Europe’s “forest cities,” saying that those places avoid fires because they maintain their forests, while California burns “down because of a lack of management.”", "As we’ve written, Trump is wrong to say that fires only occur because of poor management and to suggest that human-sourced greenhouse gases are only a small component of warming.", "As University of California, Los Angeles climate scientist Daniel Swain told us earlier this month, the Earth “is warming due to the increased atmospheric concentration of greenhouse gases resulting from human activities.” Climate change, he said, “is acting as a pervasive force across the landscape and is increasing the severity of wildfire across a wide range of vegetation types–meaning that climate change is an important factor in understanding the severity of *all* of the fires currently burning.”", "As he has before, Trump exaggerated the best estimates for when a COVID-19 vaccine will be made available to the American public, claiming that the vaccine companies “can go faster” than the time frames previously provided by government officials.", "“Well, I’ve spoken to the companies and we can have it a lot sooner,” Trump said in response to Wallace’s point that both Centers for Disease Control and Prevention Director Dr. Robert Redfield and Operation Warp Speed chief adviser Moncef Slaoui have said that a vaccine might not be widely available to the general public until the summer.", "The president went on to suggest, without evidence, that any delay would be political.", "“They can go faster than that by a lot,” Trump said of the vaccine companies, adding that “we’re going to deliver [vaccines] right away” when Wallace clarified that he was talking about a vaccine for the general public.", "Trump is correct that the government plans on shipping vaccines within 24 hours of an authorization by the Food and Drug Administration, but that doesn’t mean all doses would be immediately available to non-prioritized Americans.", "Assuming one or more shots are found safe and effective, initial doses for prioritized groups may be available by the end of the year or in early 2021, with members of the general public getting doses after that.", "“We may have enough vaccine by the end of the year to immunize probably, I would say, between 20 and 25 million people,” Slaoui told NPR earlier this month. “And then we will ramp up the manufacturing of vaccine doses to be able to, based on our plans, have enough vaccine to immunize the U.S. population by the middle of 2021.”", "Biden wasn’t specific about which groups he had in mind when he gave his expected time table for vaccine distribution, but his description left out the possibility of some people receiving shots in 2020.", "“Every serious company is talking about maybe having a vaccine done by the end of the year,” he said. “But the distribution of that vaccine will not occur until sometime beginning or the middle of next year to get it out.”", "Again, if a vaccine passes FDA muster, it is plausible a subset of the prioritized population could be immunized this year.", "Biden and Trump disagreed on whether former White House Counselor Kellyanne Conway said “riots and chaos and violence” happening in certain cities “helps” Trump. Conway did say something along those lines, as Biden said.", "Biden: You know his own former spokesperson said, you know, riots and chaos and violence help his cause. That’s what this is about.", "Trump: I don’t know who said that.", "Biden: I do.", "Trump: Who?", "Biden: Kellyanne Conway.", "Trump: I don’t think she said that.", "Biden was referring to comments Conway made during an Aug. 27 appearance on “Fox & Friends.”", "One of the show’s hosts asked Conway if protests for racial justice that turned violent in several cities, including Kenosha, Wisconsin, were all “Donald Trump’s fault,” as some had suggested, including Pete Buttigieg, the former mayor of South Bend, Indiana.", "Conway said “no,” and added that Trump was the one “trying to get law and order restored.”", "She later said she had seen a quote that day from an unnamed restauranteur in Wisconsin who asked, “Are you protestors trying to get Donald Trump reelected?”", "“He knows full stop, and I guess Mayor Pete knows full stop, that the more chaos and anarchy and vandalism and violence reigns, the better it is for the very clear choice on who’s best on public safety and law and order,” Conway said, indicating Trump was the “clear choice.”", "Biden said that 10 million Americans lost their employer-based insurance coverage during the COVID-19 recession. A study did find that, but it also said most would regain insurance from another source, leaving 3.5 million of them uninsured.", "Biden: He is not for any help for people needing health care because, he, in fact, already has cost 10 million people their health care that they had from their employers because of his recession.", "That figure comes from an Urban Institute study, though the study said most of those 10 million would regain insurance from another source.", "The Urban Institute estimated that job losses would cause 10.1 million people to lose their employer-sponsored coverage from April through December. But many would switch to insurance through another family member, Medicaid or the individual market, leaving 3.5 million uninsured in the end.", "Urban Institute, July 13, 2020: We find that 48 million people will live in families with a worker who experiences a COVID-19-related job loss in the last three quarters of 2020. Of them, 10.1 million lose employer coverage tied to that job. We estimate 32 percent of these people switch to another source of employer coverage through a family member, 28 percent enroll in Medicaid, and 6 percent enroll in the nongroup market, mainly in marketplace coverage with premium tax credits. Still, we estimate 3.5 million people in this group become uninsured.", "The study also said about 500,000 people who were uninsured before the economic impacts of the coronavirus would become eligible for Medicaid and enroll. That would result in a net 2.9 million uninsured.", "Other estimates give higher figures for the uninsured. Families USA, which advocates for “health care consumers,” estimated that 5.4 million laid-off workers had lost health insurance between February and May, adding that the estimate didn’t include family members of those workers who also would have lost coverage.", "The Kaiser Family Foundation estimated that 26.8 million could lose employer insurance as of May 2. The vast majority of those — 79% — would be eligible for subsidized coverage, either through Medicaid or tax credits to help purchase coverage on the Affordable Care Act marketplaces. But KKF said it “did not estimate take-up or enrollment in coverage options but rather only looked at eligibility for coverage.”", "Trump said during the Obama-Biden administration, “you had 308,000 military people dying because you couldn’t provide them proper health care in the military.”", "But the Trump campaign said that is based on a 2015 report from the Veterans Affairs Office of the Inspector General that didn’t say those were all deaths of people who applied for VA health care, or that the deaths all occurred when Biden was vice president.", "The report, titled “Veterans Health Administration: Review of Alleged Mismanagement at the Health Eligibility Center,” said that, as of Sept. 30, 2014, 307,173 of nearly 867,000 “pending” applications for VA health care belonged to individuals who had died, according to the Social Security Administration.", "But, as we’ve written before, the report also said that poor record-keeping and data limitations made it impossible to say how many of those individuals died while waiting for care, how many of them had applied for care, or even how many of them were military veterans.", "Furthermore, the report said 84%, or 258,367, of individuals who died with a “pending” application, died more than four years before September 2014, including some who died even before 1998, when the VA established its enrollment database. Former President Barack Obama and Biden took office Jan. 20, 2009.", "The president claimed to support the manufacture and sale of electric vehicles during a portion of the debate on climate change, saying, “I’ve given big incentives for electric cars.”", "But his record doesn’t reflect that.", "A 2019 report from the Congressional Research Service identified three federal programs that incentivize the manufacture or purchase of electric vehicles — the Advanced Technology Vehicles Manufacturing Loan Program, which supports production of fuel-efficient vehicles; the Corporate Average Fuel Economy (CAFE) standards, which are aimed at increasing fuel efficiency; and the Plug-In Electric Drive Vehicle tax credit, which gives tax credits to purchasers of electric vehicles.", "All three programs predate the Trump administration, and the president has proposed eliminating two of them.", "In his budget for fiscal year 2020, Trump proposed eliminating the Plug-In Electric Drive Motor Vehicle Tax Credit, which had been introduced in 2008. The following year, Trump sought to eliminate the Advanced Technology Vehicles Manufacturing Loan Program in his 2021 budget proposal. That program had been established in 2007.", "Biden falsely charged that the Trump administration did not try to send experts to Wuhan, China — where the novel coronavirus outbreak emerged late last year — during the early stages of the pandemic.", "Biden: He knew all the way back in February how serious this crisis was, he knew it was a deadly disease … we were insisting that the people we had on the ground in China should be able to go to Wuhan and determine for themselves how dangerous this was. He did not even ask [President] Xi to do that. … He said we owe him a debt of gratitude for being so transparent with us.", "The former vice president has made similar inaccurate claims before. “[W]hen we were talking … early on in this crisis, we said — I said, among others, that, you know, you should get into China, get our experts there, we have the best in the world, get them in so we know what’s actually happening,” Biden said at a CNN virtual town hall on March 27. “There was no effort to do that.”", "In fact, the U.S. Centers for Disease Control and Prevention tried to get CDC personnel to the scene just one week after China reported the outbreak to the World Health Organization on Dec. 31, 2019, as we have written.", "“On January 6, we offered to send a CDC team to China that could assist with these public health efforts,” Health and Human Services Secretary Alex Azar said at a Jan. 28 press conference. “I reiterated that offer when I spoke to China’s Minister of Health on Monday, and it was reiterated again via the World Health Organization today. We are urging China: More cooperation and transparency are the most important steps you can take toward a more effective response.”", "More than a week later, Azar said again at a Feb. 7 press conference that “our longstanding offer to send world-class experts to China to assist remains on the table.”", "In mid-February a World Health Organization team including two Americans visited China, including Wuhan. The 25-member team, which visited China for nine days from Feb. 16 to Feb. 24, included one official from the CDC and another from the National Institutes of Health. The team issued a 40-page report on Feb. 28 — about two weeks before the WHO declared the outbreak a pandemic.", "At a briefing of the White House coronavirus task force in March, Trump said that he brought the issue up with Chinese President Xi Jinping personally.", "Trump, March 22: And I did ask him whether or not we could send some people, and they didn’t want that — out of pride. I think, really, out of pride. They don’t want — they don’t want us sending people into China, to help them. You know, China is a strong country. They have — they have their scientists and they have their doctors — very smart. A lot of people.", "And, you know, but I did discuss that about sending our people in. And, they didn’t really respond. We went again; they didn’t respond.", "Biden said Trump was “in the Supreme Court right now trying to get rid of the Affordable Care Act” and that “there’s a 100 million people who have preexisting conditions and they’ll be taken away as well, those preexisting conditions, insurance companies are going to love this.” Trump replied: “There aren’t 100 million people with preexisting conditions.”", "There are 100 million people with preexisting conditions, not including those with Medicare or Medicaid coverage, according to one estimate from the consulting firm Avalere. It’s unclear what Biden meant when he said “they’ll be taken away as well,” but if the ACA were nullified, they would lose the preexisting condition protections in that law. But only those who seek coverage on the individual market — where those without employer or public insurance buy plans – would be at risk of being denied insurance.", "As we’ve written before, the Trump administration has backed a lawsuit to invalidate the ACA, which instituted sweeping protections for those with preexisting conditions. The ACA prohibited insurers, in any market, from denying coverage, charging more or excluding coverage of certain conditions based on health status.", "Before the ACA, those buying plans on the individual market could face denials or higher premiums based on their health. But only 6% of the population gets coverage on the individual market.", "Employer-based coverage — where 49% of the population gets insurance — couldn’t deny insurance, before the ACA. But those plans could decline coverage for some preexisting conditions for a limited period, if a new employee had a lapse in coverage.", "It’s unclear what preexisting condition protections would be implemented under the Trump administration in lieu of the ACA, but Trump signed an executive order on Sept. 24 that said “access to health insurance despite underlying health conditions should be maintained” even if the ACA were struck down in court.", "Biden also said that if the Trump-backed lawsuit were successful, it “will strip 20 million people from having insurance.” That’s a reference to the number who gained insurance under the ACA, according to a few estimates.", "The Congressional Budget Office estimated in 2017 that if the ACA were repealed and not replaced with new legislation, the uninsured would increase by 32 million over 10 years. (However, “some people would choose not to have insurance,” CBO said, because they had coverage in order to avoid a penalty. That penalty was eliminated effective in 2019.)", "Biden said Trump’s Supreme Court nominee — Judge Amy Coney Barrett — has “written … that she thinks the Affordable Care Act is not constitutional.” Not quite, though she faulted a 2012 opinion upholding the law.", "Barrett did criticize Chief Justice John Roberts’ opinion in NFIB v. Sebelius, which upheld the ACA but found states couldn’t be forced to expand Medicaid under the law. Writing in January 2017 in the Notre Dame Law School journal, Barrett reviewed a book by Randy Barnett. She said: “In NFIB v. Sebelius, the inspiration for Barnett’s book, Chief Justice Roberts pushed the Affordable Care Act beyond its plausible meaning to save the statute. He construed the penalty imposed on those without health insurance as a tax, which permitted him to sustain the statute as a valid exercise of the taxing power; had he treated the payment as the statute did—as a penalty—he would have had to invalidate the statute as lying beyond Congress’s commerce power. … Barnett is surely right that deference to a democratic majority should not supersede a judge’s duty to apply clear text. … If the majority did not enact a ‘tax,’ interpreting the statute to impose a tax lacks democratic legitimacy.”", "That’s clearly a critique of Roberts’ opinion. But some legal scholars have said the writing doesn’t indicate how Barrett might rule on the ACA case now before the court: California v. Texas. That case concerns whether the elimination of the ACA tax penalty under the 2017 GOP tax law makes the individual mandate (the requirement for most people to have insurance) unconstitutional — and if without the mandate, the entire law must be struck down.", "Nicholas Bagley, a professor at the University of Michigan Law School, told NBC News Barrett’s journal article “doesn’t tell us anything about how she’d rule in a case that’s significantly weaker.” He said that “ACA supporters should be concerned” but “[n]ot panicked.”", "Trump said: “I’m cutting drug prices. I’m going with favored nations. … Drug prices will be coming down 80 or 90%.” Trump signed four executive orders on drug prices in late July, but it remains to be seen how the orders will be implemented and whether they will result in large reductions in prices.", "As we’ve explained, the orders, which largely revive past administration proposals, require the Health and Human Services secretary to take various actions, such as moving through the federal rule-making process.", "Two of the orders pertain to Medicare beneficiaries. Another order concerns insulin and epinephrine for low-income individuals, and the fourth involves allowing the importation of some drugs.", "Trump’s reference to “favored nations” concerns an updated executive order signed Sept. 13. It calls on the HHS secretary to test payment models to tie Medicare drug prices to the lowest price among comparable countries that are members of the Organization for Economic Cooperation and Development.", "An HHS spokesperson told us in July that Medicare “currently pays roughly 80% more than other countries” for Part B drugs, which are outpatient drugs administered by a physician. But again, whether this policy could lead to an 80% reduction for those drugs remains to be seen.", "On the topic of face masks, Biden wrongly claimed Trump’s “own head of the CDC said … if everybody wore masks and social distanced between now and January, we’d probably save up to 100,000 lives.”", "That was a projection from the University of Washington’s Institute for Health Metrics and Evaluation — not Dr. Robert Redfield.", "On Sept. 3, IHME said its model projected there would be 410,000 cumulative U.S. deaths from COVID-19 by January 2021, and that 122,000 of those deaths could be prevented with increased mask use. As of Sept. 24, the model downgraded its estimate to a total death toll of 372,000 in the U.S., 97,000 of which could be avoided with near-universal masking.", "Redfield, though, did say in congressional testimony on Sept. 16 that face masks “are the most important, powerful public health tool we have” against COVID-19.", "“I will continue to appeal for all Americans, all individuals in our country, to embrace these face coverings,” he said. “I’ve said it, if we did it for six, eight, 10, 12 weeks we’d bring this pandemic under control. … We have clear scientific evidence they work and they are our best defense. I might even go so far as to say that this face mask is more guaranteed to protect me against COVID than when I take a COVID vaccine.”", "Later that day, on Twitter, he added: “The best defense we currently have against this virus are the important mitigation efforts of wearing a mask, washing your hands, social distancing and being careful about crowds.”", "But that’s not the same as saying “100,000 lives” could be saved by wearing masks.", "Biden at one point made reference to a recent story by the Atlantic that, citing anonymous sources, reported that Trump privately denigrated fallen soldiers as “losers” and “suckers.” Trump later returned to the point by denying the claim and suggested it was actually Biden who spoke ill of the military.", "“What he did, was he said — he called the military stupid bastards,” Trump said.", "“I did not say that,” Biden responded.", "“And he said it on tape,” Trump continued.", "Biden did use those words during a trip to Abu Dhabi in March 2016, and it is on tape. But the full context of the video suggests that Biden was joking, which his campaign has maintained.", "After Biden referenced “the incredible sacrifices you make for our country,” he went on to tell the crowd that he has “incredibly good judgment.” He mentions marrying his wife, Jill, then refers to having nominated Lt. Karen Johnson to attend the U.S. Air Force Academy years earlier. Johnson was on stage.", "“One, I married Jill. And two, I appointed Johnson to the academy. I just want you to know that,” he said. “Clap for that, you stupid bastards.” He then jokingly called the group a “dull bunch.”", "Biden “was jokingly encouraging the audience to clap for an airwoman on the stage,” his campaign said in a recent statement to the Daily Beast.", "Trump distorted the context of comments Biden made in 2019 to claim that Biden wrongly said he attended college at Delaware State University, one of the nation’s historically Black colleges and universities, when he actually went to the University of Delaware.", "“You said you went to Delaware State but you forgot the name of your college,” Trump said. “You didn’t go to Delaware State.”", "The origin of Trump’s claim is a story in the Washington Times, which included a clip of Biden at a town hall event in Florence, South Carolina, on Oct. 26, 2019, in which he said, when discussing funding for HBCUs, “I got started out of an HBCU, Delaware State.” The paper stated that while Biden “declared last year on the campaign trail that he began his academic career at Delaware State University,” a university official confirmed he was never a student there.", "That official, Carlos Holmes, the university’s director of news services, says his response was used in a ”dishonest light.”", "“Watched in full context, it is clear that Biden was discussing his long association with Historically Black Colleges and Universities, not making a claim that he had attended Delaware State University,” Holmes told Delaware State News. “He ‘got his start’ when he announced his first run for the US Senate on our campus in 1972 with then-Delaware State College President Luna Mishoe at his side. For three decades, first as US Senator and then as Vice President, Joe Biden has been our advocate and partner to such a critical extent that in 2003 the University awarded him an honorary doctorate.”", "Trump repeatedly claimed that when Biden was spearheading the 1994 crime bill, he called African Americans “super-predators, and they’ve never forgotten it.” Actually, that was a phrase famously uttered by Hillary Clinton — not Biden.", "“I never said it,” Biden responded, but Trump continued to insist he did.", "We looked into this when Trump made a similar claim in a Fox News interview a month ago, and we couldn’t find any evidence that Biden has used that term.", "As then-chairman of the Senate Judiciary Committee, Biden did spearhead the Violent Crime Control and Law Enforcement Act of 1994. Although the bill received bipartisan support at the time, it has been criticized for some of its provisions, such as mandatory minimum sentencing, and its impact on mass incarceration, particularly of Black men. As we have written, the trend of increasing imprisonment began well before 1994, but experts told us the 1994 law exacerbated the issue.", "As we said, it was actually Hillary Clinton who used the phrase “super-predator” in a 1996 speech at New Hampshire’s Keene State College in support of the 1994 crime bill, which was signed by her husband, then-President Bill Clinton.", "“They are not just gangs of kids anymore,” Clinton said. “They are often the kinds of kids that are called ‘superpredators.’ No conscience, no empathy. We can talk about why they ended up that way, but first we have to bring them to heel.”", "Interestingly, Trump often criticized Clinton during her 2016 presidential bid for using that term, and Clinton has since acknowledged, “Looking back, I shouldn’t have used those words, and I wouldn’t use them today.”", "In criticizing the Obama administration’s handling of the 2009 H1N1 flu, Trump told Biden “you were a disaster — your own chief of staff said you were a disaster.”", "Ron Klain, Biden’s former chief of staff, last year said the Obama administration “did every possible thing wrong,” but he said he was talking about delays in the production of a vaccine — not the administration’s overall response. The record supports Klain.", "At a May 14, 2019, Pandemic and Biosecurity Policy Summit, Klain said the administration has “a bunch of really talented, really great people working on it and we did every possible thing wrong.” Klain’s comments following that assessment focused solely on the rollout of vaccines.", "“What did that [the experience in 2009] tell us? It told us that the vaccine will arrive late,” Klain said at the pandemic policy summit. “It told us that if it’s not prepared in advance, it will arrive late. If we don’t have the answer before, we’re not going to get the answer in time. And it told us that our systems for deciding how to distribute and administer a vaccine in the time of crisis are going to be badly, badly tested.”", "On the subject of reopening businesses that were closed due to the coronavirus pandemic, Trump said several times that Biden “wants to shut down the country.”", "We don’t know what Biden wants to do, but he did say last month that he’d be willing to shut down the economy if scientists said it was necessary. He has since said he doesn’t think that will be necessary.", "In an Aug. 21 interview with ABC News, Biden was asked: “If you’re sworn in come January, and we have coronavirus and the flu combining, which many scientists have said is a real possibility, would you be prepared to shut this country down again?”", "Biden said, “I will be prepared to do whatever it takes to save lives because we cannot get the country moving until we control the virus.”", "When asked for clarification, he responded, “I would shut it down, I would listen to the scientists.”", "In a press conference more than a week later, Biden said another shutdown would likely not be needed if certain steps were taken.", "“There’s going to be no need, in my view, to be able to shut down the whole economy,” Biden told reporters Sept. 2. “I got asked by David Muir a question, if I was asked to shut everything down. I took that as a generic question if — am I going to follow the science? I am going to insist — and I insist now, without any authority, that every responsible person in this country, when they’re out in public or not with the cohort that they have lived with because they know they haven’t spread it to their husband, wife, etc., that they wear a mask and keep socially distanced.”", "Trump falsely said that Biden had opposed the travel restrictions the president imposed on China on Jan. 31 in an effort to combat the spread of the novel coronavirus. Biden did not say he opposed them at the time. And he later said he endorsed them.", "Trump also said that if he had listened to Biden and not imposed the restrictions, millions of Americans would have died rather than 200,000. There is no evidence to support the claim that the travel restrictions saved so many lives.", "Trump: If we would have listened to you, the country would have been left wide open. Millions of people would have died, not 200,000. … I closed it and you said he’s xenophobic, he’s a racist and he’s xenophobic. Because you didn’t think we should have closed our country.", "As we have written, Biden’s campaign said on April 3 that Biden backed Trump’s decision to impose travel restrictions on China. “Joe Biden supports travel bans that are guided by medical experts, advocated by public health officials, and backed by a full strategy,” Kate Bedingfield, Biden’s deputy campaign manager, told CNN. “Science supported this ban, therefore he did too.”", "Trump has frequently said, as he did at the debate, that Biden called him “xenophobic” for imposing the restrictions. Trump is right that Biden called him xenophobic. But Biden didn’t make clear why he said that. The Biden campaign has said that was not in connection with the China travel restrictions.", "As we have written, on the day the White House announced the restrictions, Biden said at a campaign event in Iowa that as the pandemic unfolds, Americans “need to have a president who they can trust what he says about it, that he is going to act rationally about it.” He added, “This is no time for Donald Trump’s record of hysteria and xenophobia – hysterical xenophobia – and fearmongering to lead the way instead of science.” The Biden campaign said Biden’s “reference to xenophobia was about Trump’s long record of scapegoating others at a time when the virus was emerging from China,” and that he was not talking about the travel rules.", "As for whether the restrictions saved millions of lives, as we reported, there is no evidence to support this, and the White House has provided none. The few studies that have been done estimate travel restrictions the United States and other countries enacted on China had modest impacts, slowing the initial spread outside of China but not containing the coronavirus pandemic. Past studies also have found travel restrictions could delay the path of the spread of diseases, but do little to contain them.", "Finally, Trump didn’t “close” the country. The restrictions, which went into effect Feb. 2, barred certain non-U.S. citizens who had traveled to China within the previous two weeks from entering the United States. But U.S. citizens and permanent residents and their immediate families were exempt from the restrictions.", "A New York Times story on April 4 found that nearly 40,000 people had flown on direct flights from China to the United States in the two months after the restrictions went into effect. So this was hardly a closure.", "Biden said that Trump “has an answer for hurricanes, he said maybe we should drop a nuclear weapon on them.” The president shot back, “I never said that at all. He made it up.”", "The back story: Axios reported on April 25, 2019, that Trump had proposed just that. Its story said, “President Trump has suggested multiple times to senior Homeland Security and national security officials that they explore using nuclear bombs to stop hurricanes from hitting the United States, according to sources who have heard the president’s private remarks and been briefed on a National Security Council memorandum that recorded those comments.”", "Trump denounced the story in a tweet at the time as “FAKE NEWS.”", "One of the story’s authors, Jonathan Swan, tweeted back that he stood by the story, adding that the president “said this in at least two meetings during the first year and a bit of the presidency, and one of the conversations was memorialized.”", "The issue has not been authoritatively settled.", "Biden wrongly claimed that the United States has “a higher deficit with China now than we did before” in talking about trade. That was the case two years ago, but not now.", "According to the Bureau of Economic Analysis, the trade deficit in goods and services with China hit a record amount at $380 billion nominal dollars in 2018. But the trade deficit fell in 2019 to $308 billion — which is slightly below the $310 billion trade deficit in Barack Obama’s last year in office in 2016.", "Figures from the past 12 months (ending in June) show a deficit of $273.3 billion, 12% less than what it was in 2016.", "When Wallace asked Trump why he had relaxed fuel economy standards for vehicles “that are going to create more pollution from cars and trucks,” Trump responded, “Well, not really, because what’s happening is that the car is much less expensive and it’s a much safer car and you’re talking about a tiny difference.”", "“And then what would happen, because of the cost of the car, you would have at least double and triple the number of cars purchased,” he added. “We have the old slugs out there, that are 10, 12 years old. If you did that, the car would be safer, it would be much cheaper, by $3,500.”", "Trump is referring to his administration’s Safer Affordable Fuel-Efficient Vehicles rule, which replaced the Obama administration’s stricter set of fuel economy standards. At the core of the policy is the idea that by reducing fuel standards, that would make new cars cheaper, allowing people to replace older and potentially less safe vehicles.", "But as we’ve explained before, the administration’s analyses that underpinned that argument were widely viewed as faulty and contrary to the basic principles of economics.", "Trump’s $3,500 figure is incorrect, even by the administration’s own analysis. According to the final rule, which calls for increasing fuel efficiency by 1.5% every year instead of 5%, the cost of a new vehicle is estimated to be $977 to $1,083 lower, on average — a good deal less than $3,500.", "While Trump also claims the difference to the environment is “tiny,” the government estimates that around 1.9 to 2.0 additional barrels of fuel will be consumed, or the equivalent of 867 to 923 additional million metric tons of carbon dioxide. That’s around half a year’s worth of greenhouse gas emissions from the nation’s entire transportation sector.", "Trump falsely stated multiple times that his administration “built the greatest economy in history” prior to the COVID-19 pandemic. As we reported before, that’s not true.", "The real (inflation-adjusted) gross domestic product grew 2.2% in 2019  — down from 3% in 2018. Over the last 39 years — dating to Ronald Reagan’s presidency — the nation’s real economic growth has reached or exceeded Trump’s peak year of 3% a total of 17 times.", "Biden claimed the Trump administration “decided no, couldn’t [give schools masks] because it’s not a national emergency.” As we wrote earlier this month, while the Federal Emergency Management Agency stopped reimbursing states for the costs of masks, the Department of Health and Human Services has said it would provide schools with 125 million cloth masks.", "Correction, Oct. 1: We have removed a section of this article, “Billionaires During Pandemic,” that we originally wrote based on this statement by Biden: “The billionaires have gotten much more wealthy, by a tune of over $300 to $400 billion more, just since COVID.”", "We were wrong when we wrote that Biden was likely referring to a May 21 study by two liberal advocacy groups, Americans for Tax Fairness and the Institute for Policy Studies. The campaign told us Biden was referring to its own analysis of the Bloomberg Billionaires Index, which we found supports his statement.", "The campaign website says the top 100 U.S. billionaires “have made $334 billion during the COVID-19 crisis,” as of Sept. 8, citing the Bloomberg Billionaires Index. Using the same source, we found that the top 100 billionaires from Jan. 1 through Sept. 30 have seen a gain in total net worth of $369 billion — which is within the $300 billion to $400 billion range given by the former vice president in the debate.", "We regret the error.", "Correction, Sept. 30: We fixed a minor error in Trump’s quote in the bullet points about ballots “found … in creeks.” We originally quoted him as saying “found in a creek.”", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Rushing, Ellie, et. al. “‘Bad things happen in Philadelphia,’ Trump says at debate, renewing false claim about poll watchers.” Philadelphia Inquirer. 29 Sep 2020.", "“Philadelphia City Commissioners Vote to Open Satellite Election Offices On A Rolling Basis.” Press release, Office of the Philadelphia City Commissioners. 23 Sep 2020.", "“Joe Biden’s Speech At UAE In 2016: ‘Clap For That, You Stupid Bastards.’” Washington Examiner. YouTube. 26 Sep 2020.", "Trudo, Hanna and Will Sommer. “Team Biden Says ‘Stupid Bastards’ Comment Was Made in Jest.” Daily Beast. 25 Sep 2020.", "Miller, Frank. “Biden, wife visit troops in Southwest Asia.” 380th Air Expeditionary Wing Public Affairs. U.S. Air Force. 8 Mar 2016.", "Institute for Health Metrics and Evaluation. “COVID-19 Results Briefing: United States of America.” Healthdata.org. 3 Sep 2020", "Redfield, Robert. Testimony before the Senate Subcommittee on Labor, Health and Human Services, Education, and Related Agencies. ” 16 Sep 2016.", "Redfield, Robert. @CDCDirector. “The best defense we currently have against this virus are the important mitigation efforts of wearing a mask, washing your hands, social distancing and being careful about crowds. #COVID19.” Twitter. 16 Sep 2020.", "Internet Archive. “Fox & Friends.” Transcript. Archive.org. 27 Aug 2020.", "McDonald, Jessica. “Trump Repeatedly Errs on California Wildfires.” FactCheck.org. 20 Nov 2018.", "Hausfather, Zeke. “Analysis: Why scientists think 100% of global warming is due to humans.” CarbonBrief. 13 Dec 2017.", "McDonald, Jessica. “Trump Bucks Climate Science in Wildfire Briefing.” FactCheck.org. 15 Sep 2020.", "McDonald, Jessica. “Trump Exaggerates Progress, Credit on Future COVID-19 Vaccine.” FactCheck.org. 11 Sep 2020.", "McDonald, Jessica. “Trump Again Overstates Speed of COVID-19 Vaccine Rollout.” FactCheck.org. 18 Sep 2020.", "Sun, Lena H. “Top health official says states need about $6 billion from Congress to distribute coronavirus vaccine.” Washington Post. 16 Sep 2020.", "“Operation Warp Speed Top Adviser On The Status Of A Coronavirus Vaccine.” NPR. 3 Sep 2020.", "McDonald, Jessica. “The Facts on Fuel Economy Standards.” FactCheck.org. 3 May 2019.", "“The Safer Affordable Fuel-Efficient ‘SAFE’ Vehicles Rule.” NHTSA. Accessed  20 Sep 2020.", "“The Safer Affordable Fuel-Efficient (SAFE) Vehicles Rule for Model Years 2021–2026 Passenger Cars and Light Trucks,” final rule. Federal Register.  Vol. 85, No. 84. 30 Apr 2020.", "“Sources of Greenhouse Gas Emissions.” EPA. Accessed 20 Sep 2020.", "Reese, Michael (@SheriffReese). “In tonight’s presidential debate the President said the ‘Portland Sheriff’ supports him. As the Multnomah County Sheriff I have never supported Donald Trump and will never support him.” Twitter. 29 Sep 2020.", "Fox 12 staff. “Sheriff Reese voices concerns about federal officers, looks to future of policing in Portland in 1-on-1 interview.” KPTV – FOX 12. 21 Jul 2020.", "Kaplan, Talia. “Kenosha County Sheriff explains why he is endorsing President Trump.” Fox News. 29 Sep 2020.", "Singman, Brooke. “More than 175 current, former law enforcement officials endorse Joe Biden, slam Trump as ‘lawless’ president.” Fox News. 4 Sep 2020.", "Transcript, CNN. Joe Biden Town Hall. 27 Mar 2020.", "Rieder, Rem. “Trump’s Misleading Comments on Biden and the Coronavirus.” FactCheck.org. 15 July 2020.", "Remarks at Coronavirus Press Briefing. 28 Jan 2020.", "Remarks at Coronavirus Press Briefing. 7 Feb 2020.", "Jaipragas, Bhavan and Zheng, Sarah. “WHO coronavirus team at ground zero in Wuhan to work out next containment step.” 22 Feb 2020.", "Report of the WHO-China Joint Mission on Coronavirus Disease 2019 (COVID-19). 16-24 Feb 2020.", "Remarks by President Trump, Vice President Pence, and Members of the Coronavirus Task Force in Press Briefing. 22 Mar 2020.", "Farley, Robert. “Trump, Biden Spin China Travel Restrictions.” FactCheck.org. 4 May 2020.", "Tapper, Jake. “Biden campaign says he backs Trump’s China travel ban.” CNN.com. 3 Apr 2020.", "Robertson, Lori. “Trump’s Snowballing China Travel Claim.” FactCheck.org. 15 Apr 2020.", "Eder, Steve et al. “430,000 People Have Traveled From China to U.S. Since Coronavirus Surfaced.” New York Times. 4 Apr 2020.", "Swan, Jonathan and Talev, Margaret. “Trump suggested nuking hurricanes to stop them from hitting U.S.” Axios. 25 Aug 2019.", "Richardson, Valerie. “Biden’s claim about attending historically Black Delaware State refuted by university.” Washington Times. 25 Sep 2020.", "Delaware State News. “Delaware State University brought up during first presidential debate.” 29 Sep 2020.", "Rieder, Rem. “FactChecking Trump’s Fox News Interview.” FactCheck.org. 02 Sep 2020.", "Congress.gov. H.R.3355 – Violent Crime Control and Law Enforcement Act of 1994.", "Farley, Robert. “Bill Clinton and the 1994 Crime Bill.” FactCheck.org. 12 Apr 2016.", "Capehart, Jonathan. “Hillary Clinton on ‘superpredator’ remarks: ‘I shouldn’t have used those words’.” Washington Post. 25 Feb 2016.", "Robertson, Lori. “FactChecking Trump’s Weekend Claims.” FactCheck.org. 28 Sep 2020.", "WBAY. “Absentee ballots among mail found along Outagamie County highway.” 24 Sep., 2020.", "Prinsen, Jake, and Brophy, Natalie. “U.S. Postal Service investigates mail, including absentee ballots, found along road in Outagamie County.” Post Crescent. 24 Sep 2020.", "Carey, Julie. “Some Fairfax County Voters Received 2 Mail-in Ballots.” NBC4 Washington. 24 Sep 2020.", "Farley, Robert. “Trump’s Latest Voter Fraud Misinformation.” FactCheck.org. 10 Apr 2020.", "White House website. “Proclamation on Declaring a National Emergency Concerning the Novel Coronavirus Disease (COVID-19) Outbreak.” 13 Mar 2020.", "Kinder, Molly and Ross, Martha. “Reopening America: Low-wage workers have suffered badly from COVID-19 so policymakers should focus on equity.” Brookings. 23 Jun 2020.", "Bureau of Labor Statistics. “Labor Force Statistics from the Current Population Survey; All employees, thousands, manufacturing, seasonally adjusted.” Data extracted 30 Sep 2020.", "Federal Bureau of Investigation. “Crime in the United States 2019,” Table 1. 28 Sep 2020.", "Federal Bureau of Investigation. “Overview of Preliminary Uniform Crime Report, January–June, 2020.” Press release. 15 Sep 2020.", "“Biden-Sanders Unity Task Force Recommendations.” Joebiden.com. Accessed 29 Sep 2020.", "“Health Care.” Joebiden.com. Accessed 29 Sep 2020.", "Banthin, Jessica et al. “Changes in Health Insurance Coverage Due to the COVID-19 Recession.” Urban Institute. 13 Jul 2020.", "Dorn, Stan. “The COVID-19 Pandemic And Resulting Economic Crash Have Caused The Greatest Health Insurance Losses In American History.” USA Families. 13 Jul 2020.", "Garfield, Rachel et al. “Eligibility for ACA Health Coverage Following Job Loss.” Kaiser Family Foundation. 13 May 2020.", "Korecki, Natasha. “Biden has fought a pandemic before. It did not go smoothly.” Politico. 4 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]