["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Housing and Urban Development Sec. Ben Carson speaks during a trip to Baltimore, July 31, 2019. (AP Photo)", "President Donald Trump’s housing czar Ben Carson visited Baltimore in the wake of a weekend Twitter fusillade that saw the president disparage the city as \"a rat and rodent infested mess.\"", "Speaking before a block of dilapidated row houses, Carson sought to strike a balance between affirming Trump’s critique of Baltimore’s blight — albeit in more diplomatic tones — while sounding a note of optimism about Charm City’s future.", "Carson, who completed his neurosurgery residency at Baltimore’s Johns Hopkins Hospital and practiced there for years, said that with the right mix of smart policy and grit, American urban centers can be revitalized, citing an example from the Eastern Hemisphere.", "\"You look at the homelessness situation,\" Carson, the Department of Housing and Urban Development secretary, told reporters July 31. \"Take a city like Tokyo, which has more people than New York City. There's no homelessness there.\"", "Really?", "That’s an exaggeration, of course. But if you crunch the numbers about Tokyo and its homeless population, you’ll see Carson isn’t that far off.", "Japan’s government estimates Tokyo’s homeless population is around 1,200 people, according to 2018 data. That’s 0.0092 percent of the city’s population or just under one homeless person for every 10,000 residents.", "By contrast, New York City’s homeless population is around 79,000 of its 8.6 million residents, a rate of nearly 92 homeless people for every 10,000 people, which, like Tokyo, is also less than 1 percent.", "This chart illustrates the disparity.", "Of Baltimore’s roughly 600,000 residents, some 2,500 are homeless, which is less than 1 percent of the overall population and translates to a rate of around 42 homeless people per 10,000 residents.", "Nationwide, the Japanese government said that just under 5,000 are homeless in the entire country of 126 million.", "That’s just 0.0039 percent of the overall population. A HUD spokesman said Carson \"was talking about homelessness in Japan being functionally at zero.\"", "When Japan released its data last year, the government’s welfare ministry said the tally represents a 15-year low. The ministry credited government programs, including counseling, for the reduction, according to The Japan Times.", "Experts say Japan's outreach to its homeless population is among a combination of factors that explain the large disparity in homelessness rates of Japan and the United States.", "\"The Tokyo government has made a concerted push to reduce numbers and provide shelter to more than before,\" said Jeffrey Kingston of Temple University’s Japan campus. \"More counseling and outreach — as in going to places homeless people congregate and offering support and counseling — have helped reduce numbers a great deal. Efforts to win trust and provide care have helped.\"", "Kingston said some Japanese homeless people, who might prefer to live on the street and are reluctant to accept aid, increasingly lean on government support as they age and health problems accumulate.", "\"They have had to stop ‘living rough’ even though many prefer this,\" said Kingston, invoking a common euphemism for Japan’s homeless population.", "Tokyo has acknowledged its official tally of the homeless population may be an undercount. The government reached its figure by surveying the number of people dwelling in public spaces like riverbeds and parks. The methodology has received some criticism because it likely overlooks less visible segments of the homeless population, including those engaged in the well-documented practice of taking shelter in internet cafes or saunas. (For the record: Advocates in the United States say we also likely undercount the homeless population.)", "Carson said there is no homelessness in Tokyo.", "Carson would have been better saying virtually no homeless. But his overall point is correct. Tokyo’s government puts the homeless population at roughly 1,200. In a city of roughly 13.5 million, that’s around 0.0092 percent of the population.", "We rate his claim Mostly True.", "NBC’s Baltimore affiliate WBAL 11, \"Carson discusses Baltimore opportunity zones, addresses Trump tweets,\" July 31, 2019", "Japan Times, \"Japan's homeless ranks down to 15-year low under 5,000, survey says,\" July 14, 2018", "Tokyo Metropolitan Government, \"Tokyo’s History, Geography, And Population,\" accessed July 31, 2019", "Department of Housing and Urban Development, \"The 2018 Annual Homeless Assessment Report,\" Dec. 2018", "UPI, \"Controversy over the amount of homeless people in Tokyo,\" Oct. 27, 2014", "Japan Times, \" 'No one wants to be homeless': A glimpse at life on the streets of Tokyo,\" March 2, 2019", "Email interview with spokesman for the Department of Housing and Urban Development, July 31, 2019", "Email interview with Jeffrey Kingston of Temple University, the director of Asian Studies at Temple University Japan, July 31, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]