["About this rating", "Much of what makes a car go remains an arcane mystery to the average person. Automobiles are large and complex, and as any car owner quickly discovers, malfunction of even the smallest and most seemingly unimportant automotive part can be all that it takes to render them inoperative.", "Tidbits of whispered wisdom therefore prove popular among the less than automotively inclined, who look to keep their vehicles running even if they're not quite sure exactly how to go about that.", "One bit of whispered wisdom dictates that a car's battery must never be stored on a concrete or cement floor. The reasons given for this prohibition vary depending on whom one hears the admonition from. Acid leaking from the battery will ruin the floor, say some. Or a battery left sitting on such surface will never again properly hold a charge. Or those particular surfaces will cause a battery to lose some of its charge. Look at this email we received in May 2002, for example:", "Recently, I needed some work done on my car. My brother, who is a fair mechanic, offered to help me (I am pushed to my limit just changing a headlight). When we removed the battery from the car, I set it on the floor of the garage. My brother told me to pick up the battery and place it on a couple of 2-by-4s because \"putting it on the floor will ruin it\".", "Apparently, he is under the impression that putting a car battery on a concrete floor would drain it! Not only that, but that the battery would not \"take a charge\" after this occurred.", "Oddly, the reality behind this peculiar automotive belief somewhat mirrors the long-standing urban legend about a mysterious and seemingly nonsensical cooking practice handed down through three generations: just as there was once something to Grandma's oddball cooking secret, so too was there a time when storing car batteries on concrete or cement floors was a lousy thing to do. However (and again just like the \"cooking secret\" legend), whereas at one time there was good reason for the practice, those days have long since passed.", "Car batteries used to be encased in hard rubber, a substance that was porous enough that battery acid could seep through it  and create a conductive path through the damp concrete, draining the battery. The cases of today’s batteries, however, are made of sturdier stuff that far better contains their contents than those of yesteryear. As well, time has brought  technological improvements to the seals around the posts and the vent systems.", "These days, the problem of car battery electrolyte seepage and migration has been all but eliminated. Says battery manufacturer Yuasa, \"Nowadays, containers are made from a solid plastic that does not allow any current to flow through it, so the batteries do not discharge, even if they sit in a few inches of water.\"", "Interestingly, some experts (including Car Talk's Click and Clack) believe that storing car batteries on concrete floors might actually be a better idea than keeping them on shelves or other surfaces because the cold of the floor works to slow the self-discharge (leakage) rate.", "You can learn more about how car batteries work here.", "Magliozzi, Tom and Ray.   \"Click and Clack: Car Talk.\"\n     The Dallas Morning News.   7 April 1999   (p. C3).", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]