["By Saranac Hale Spencer", "Posted on October 22, 2018", "Q: Were “charges filed” against U.S. Senate candidate Beto O’Rourke of Texas for accepting an “illegal $10 million campaign donation” from CNN?", "A: No. A Libertarian opponent filed a complaint with the Federal Election Commission, claiming CNN’s town hall event with O’Rourke was worth $10 million.", "Beto O’Rourke, the Texas Democrat challenging Sen. Ted Cruz for his seat in the U.S. Senate, appeared in an hourlong town hall event on CNN on Oct. 18.", "Prior to the town hall, a false headline started circulating on Facebook saying: “CHARGES FILED AGAINST BETO O’ROURKE FOR ACCEPTING ILLEGAL $10 MILLION CONTRIBUTION.”", "There were no “charges” filed, but a complaint was filed with the Federal Election Commission about the CNN town hall with O’Rourke.", "Here’s what happened:", "On Oct. 11, CNN announced its lineup of political specials for the midterm elections. Among them was a town hall moderated by CNN’s Dana Bash with O’Rourke taking questions from the audience. A spokeswoman for CNN told FactCheck.org that the network had invited Cruz to appear in his own town hall program, but he declined.", "Cruz’s campaign manager, Jeff Roe, confirmed in a tweet that Cruz was “unable to participate” in “back to back town halls.” But, Roe added, “the Cruz campaign proposed that @CNN host one of the Cruz-O’Rourke debates. The O’Rourke campaign declined.”", "Following CNN’s programming announcement, Neal Dikeman, the third candidate in the race who is seeking the seat on the Libertarian line, wrote an open letter to CNN asking to be included in the televised town hall.", "Dikeman later filed a complaint with the FEC against CNN and O’Rourke, claiming that the town hall event would amount to an illegal $10 million campaign contribution if it aired as scheduled.", "In response, CNN attorney David C. Vigilante wrote a letter to Dikeman saying Cruz and O’Rourke are the “only two viable candidates,” based on polling, and that the CNN town hall was within the “press exemption” of campaign finance laws. Vigilante cited a case from 2009 that made similar allegations, which the FEC dismissed.", "So, while it’s true that the FEC has gotten a complaint about the town hall program with O’Rourke, no “charges” have been filed against the candidate. And it’s far from certain that the town hall could be considered an “illegal $10 million contribution” since the FEC hasn’t yet ruled on the complaint.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network. FactCheck.org also collaborates with CNN’s “State of the Union” on fact-checking videos hosted by “State of the Union” anchor Jake Tapper.", "“CHARGES FILED AGAINST BETO O’ROURKE FOR ACCEPTING ILLEGAL $10 MILLION CONTRIBUTION.” iamatexan.com. 16 Oct 2018.", "Ventresca, Rachel. “CNN to host prime-time political events ahead of midterm elections.” CNN. 11 Oct 2018.", "Dikeman, Neal. Complaint to the Federal Election Commission. 15 Oct 2018.", "Vigilante, David. CNN Senior Vice President — legal department. Response to Neal Dikeman’s complaint. 17 Oct 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]