["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In 2012, PolitiFact twice rated True claims that President Barack Obama failed to keep a promise to cut federal deficits in half by the end of his first term.", "At that point, the budget gap topped a trillion bucks and Republican congressmen called out Obama because the deficit had been reduced by just 15 percent.", "But there was the president at Laborfest 2014 in Milwaukee proclaiming \"we cut our deficits by more than half.\"", "In his Sept. 1, 2014 speech, the president ticked off for union supporters a list of major policy decisions he contends helped boost the economy and improve the government’s bottom line.", "We can’t cover all of those here, but the deficit claim grabbed our attention.", "Has it really been cut in half?", "The White House Office of Management and Budget pointed us to a chart prepared by that office in 2013 as proof of Obama's claim.", "It compares the yearly deficits under Obama, expressed -- as they often are -- as a share of the nation’s entire economy, which is measured by the Gross Domestic Product.", "At the start of Obama’s term, the chart showed, the figure was 9.2 percent. The latest figure was 4.1 percent.", "That appears to back Obama's statement.", "But let's examine this in detail.", "To do that, we reviewed figures published by the Congressional Budget Office as well as the White House’s Office of Management and Budget. We also consulted with independent fiscal experts.", "The baseline year for comparison is fiscal year 2009, which ended Sept. 30 of that year. This was the last budget from President George W. Bush, as Obama took office in January of that year.", "The most recent complete fiscal year is 2013.", "Those are the same years Obama's chart showed.", "Our analysis showed the drop easily topped 50 percent, and was actually somewhat higher than Obama's chart would indicate.", "As a share of the economy, we found -- and our experts confirmed -- the drop was from 9.8 percent in 2009 to 4.1 percent in 2013.", "Obama’s chart actually reflects a lower deficit figure for 2009, and therefore a lower share of GDP, 9.2%.", "That’s because instead of using the actual 2009 deficit of $1.4 trillion, Obama lowers it by the $200 billion in increased deficit spending that he -- not Bush -- pushed through in the stimulus plan to address the crisis that became the Great Recession. That resulting figure is what Obama calls the deficit he \"inherited\" from Bush.", "But no matter which figure is used, the deficit as a share of the economy still fell by more than half.", "Show me the money", "There's another way to look at this.", "That is, in raw dollars -- the way attendees at the union event probably would. Indeed, deficits are often expressed that way as well.", "The White House and CBO figures each show that in 2009 the deficit reached $1.4 trillion.", "As a share of GDP, it easily topped any year since World War II, said Steve", "Ellis, vice president of the nonpartisan Taxpayers for Common Sense.", "By the end of fiscal year 2013, the deficit figure had fallen to $679.5 billion in dollars unadjusted for inflation.", "That’s a 52 percent drop.", "Here’s the year-by-year trend in 2009 dollars:", "Fiscal year", "Deficit", "Deficit as share of GDP", "2009", "1,412,688,000,000", "9.8 percent", "2010", "1,294,373,000,000", "8.8 percent", "2011", "1,299,593,000,000", "8.4 percent", "2012", "1,086,963,000,000", "6.8 percent", "2013", "679,502,000,000", "4.1 percent", "There is one wrinkle.", "When you use Obama's methodology to compare the deficit Obama inherited -- the 2009 result minus the stimulus package to that in 2013 --  the drop in the deficit is slightly under half, at 48%.", "Ellis and Marc Goldwein, senior policy director at the nonpartisan Committee for a Responsible Federal Budget, both included an additional year, the 2014 fiscal year, which is just a month from completion.", "The Aug. 27, 2014 CBO estimate for this year’s budget, fiscal year 2014, is a continued shrinking of the deficit to $506 billion, or 2.9 percent of GDP.", "Those figures would put Obama's claim over the top no matter the number-crunching method.", "Looking ahead", "Ellis cautioned that talking about deficit amounts in raw dollars doesn’t really give a good sense of the scale: \"A $400 billion deficit in a $10 trillion economy is a lot bigger than a $400 billion deficit in $17 trillion economy.\"", "And he and Goldwein emphasized that while the deficit has been halved, it’s been halved from a skyscraping peak.", "In the decade before deficits exploded in 2008 and 2009, they averaged just over 1 percent of GDP, including three years of surpluses, we calculated.", "As of 2013, that figure was at 4.1 percent.", "The growth in the deficit from 2007 to 2009 was due mainly to factors related to the Great Recession, said Goldwein. Tax collections fell as people lost jobs and corporate profits dropped; spending on food stamps and other aid programs rose with increased need; stimulus and tax break legislation passed, as did bailouts of financial firms.", "\"The economic recovery, wind-down of stimulus, reversal of TARP/Fannie transactions, and lower interest rates are really what has caused our deficit to fall so much,\" Goldwein told us. He mentioned cuts in discretionary spending as well.", "Looking ahead, the CBO warns that later in the next decade deficits as a share of the economy will grow and federal debt will climb without changes in current policies.", "But Obama, it’s fair to say, was speaking of the change during his presidency.", "And his claim dovetails with one PolitiFact National checked in July 2013, rating True Obama’s claim that the deficit is falling at the fastest rate in 60 years.", "Our rating", "At a union rally on Labor Day, Obama declared \"We cut our deficits by more than half.\"", "The numbers back up Obama’s claim:  Thanks to income tax revenues rising and spending on emergency assistance dropping, America’s deficit has fallen by more than 50 percent", "from its highest point since World War II to a level $733 billion lower.", "We rate the claim True.", "President Obama speech transcript, Milwaukee, Sept. 1, 2014", "Emails with Steve Ellis, vice president, Taxpayers for Common Sense, Sept. 2, 2014", "Emails with Emily Cain, press secretary, Office of Management & Budget, Sept. 2, 2014", "Congressional Budget Office, \"The Budget and Economic Outlook: Fiscal Years 2013 to 2023,\" Feb. 5, 2013", "Congressional Budget Office, \"An Update to the Budget and Economic Outlook: 2014 to 2024,\" August 2014", "Congressional Budget Office, \"The Budget and Economic Outlook: Fiscal Years 2010 to 2020,\" Jan. 16, 2010", "Office of Management and Budget, Historical Tables, accessed Sept. 2, 2014", "PolitiFact New Jersey, Truth-O-Meter item, Oct. 21, 2012", "PolitiFact Florida, Truth-O-Meter, March 8, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]