["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A week before the primary vote, when Republican Gov. Scott Walker didn’t know which opponent he would face in the Nov. 6, 2018 general election, he tweeted this claim:", "\"A number of Democrats running for governor want to cut the prison population by 50%\" and \"that would require the release of thousands of violent felons.\"", "Our rating was Half True. There was no evidence to back up the \"require\" part of Walker’s claim, particularly if a 50 percent reduction were done over a period of years, rather than swiftly.", "A new, similar Walker attack  — zeroing in on Tony Evers  — has a similar problem.", "All our fact checks in the governor’s race.", "On Sept. 12, 2018, a month after Evers, the state schools superintendent, emerged from the primary as the Democratic nominee, Walker elevated his attack to a television ad.", "The governor’s spot begins with a narrator portraying Evers as putting the public at risk, saying he \"failed to remove abusive teachers from our schools.\"", "Then the narrator asserts that Evers \"wants to cut Wisconsin's prison population in half, a dangerous plan that today would mean releasing thousands of violent criminals back into our communities.\"", "Walker’s use of the word today aims to avoid the problem that the word require caused in his previous fact check.", "That is, a 50 percent reduction \"today\" — rather than say, over a period of years — would require the release of thousands of inmates convicted of violent crimes.", "There are currently about 23,000 inmates, two-thirds of whom have committed a violent offense, according to the state Department of Corrections. That two-thirds portion includes inmates being held for a violent-crime conviction; and it includes those who served their time behind bars for that original offense, but were returned to prison for violating conditions of probation or extended supervision that was also part of the sentence for the original offense. Violent offenses include crimes such as murder, rape and robbery, as well as crimes such as assault, extortion and hit-and-run with bodily injury.", "But Evers has not put a time frame on how he would achieve a 50 percent reduction.", "And it’s important to keep in mind that releasing half the inmates who are in prison isn’t the only way to cut the prison population in half.", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "On the day Walker’s TV ad was released, Evers reacted by telling reporters: \"That’s a lie. I never said that. We will not release violent criminals. We’re not going to get in the gutter with Scott Walker.\"", "(Walker has also made a claim similar to the one in his TV ad in a private telephone poll of voters done by his campaign.)", "To back the first part of Walker’s claim — that Evers supports a 50 percent cut -- Walker’s campaign cites an exchange during a July 12, 2018 debate  between Democrats who were running for governor. A reference was made to the group Milwaukee Inner-City Congregations Allied for Hope.", "Moderator: The multi-racial interfaith organization MICAH launched a campaign in 2011 to cut the state prison population by half, from 22,000 to 11,000. It now sits at 23,000. Do you support that original goal, and how would you balance reducing the prison population  —", "Evers: Absolutely, and that's a goal that’s worth accomplishing … We have to stop people incarcerating people for non-violent crimes.", "The Walker campaign argues that Evers’ response means he is committing to a 50 percent reduction over four years because MICAH’s website refers to a campaign in 2011 to get the 50 percent cut by 2015.", "But neither the question to Evers, nor his response, mentions four years.", "And we found no evidence that Evers has committed to any time frame.", "Evers has said Wisconsin should cut parole revocations and expand drug courts as ways of reducing the number of people being sent to prison.", "He has also said he would consider releasing some inmates early; treating 17-year-olds as juveniles instead of adults for criminal charges; and overhauling truth-in-sentencing so prisoners could be released for good behavior.", "Kenneth Streit, a clinical professor of law emeritus at the University of Wisconsin Law School, told us it’s possible to achieve a 50 percent cut without releasing inmates convicted of violent crimes — or at least not thousands of them.", "Streit has studied corrections policy since 1990 and has assisted the Legislature and the Department of Corrections in developing and evaluating adult community corrections programs. He said the population could be reduced by about 5 percent annually over the next decade through steps such as changing sentencing guidelines and tripling funding for treatment-based probation that would reduce the number of people going back to prison for probation revocations.", "Whether a 10-year time frame, or longer, would be acceptable to advocates for the 50 percent reduction is unclear; many want a quicker turnaround.", "But, despite Walker’s claim, it’s also not clear that Evers would seek a 50 percent cut over a period that would force the release of thousands of inmates convicted of violent crimes.", "One more point before we close:", "Ryan King, research director at the nonprofit Justice Policy Institute, who formerly did studies for the Urban Institute and the Pew Research Center, said research shows that people who are in prison for violence are less likely to be rearrested after release than people sentenced for other offenses.", "Walker says Evers \"wants to cut Wisconsin's prison population in half, a dangerous plan that today would mean releasing thousands of violent criminals back into our communities.\"", "Evers has stated that a 50 percent reduction is a goal. But he has not put a time frame on achieving that — a crucial factor in determining whether inmates of convicted of violent crimes would have to be released.", "Experts say a 50 percent reduction over a relatively short period, say a few years, would require the release of inmates convicted of violent crimes. But some say it’s possible to cut the population in half, perhaps over 10 years, without the release of any violent offenders, or at least not thousands of them.\n\nFor a statement that is partially accurate, our rating is Half True.", "YouTube, Scott Walker ad, Sept. 12, 2018", "Email, Scott Walker campaign spokesman Austin Altenburg, Sept. 14, 2018", "Email, Tony Evers campaign spokeswoman Britt Cudaback, Sept. 14, 2018", "Email, Wisconsin Department of Corrections spokesman Tristan Cook, Sept. 20, 2018", "PolitiFact Wisconsin, \"Cutting Wisconsin prison population 50% wouldn't 'require' release of thousands of violent felons,\" Aug. 9, 2018", "Scott Walker campaign, news release, Aug. 7, 2018", "Milwaukee Journal Sentinel, \"Democrats running for governor call for slashing prison population,\" July 5, 2018", "Milwaukee Journal Sentinel, \"Scott Walker says Democrats would make Wisconsin more dangerous,\" Aug. 9, 2018", "Milwaukee Journal Sentinel, \"Tony Evers calls Scott Walker a liar after ad says Evers would release rapists,\" Sept. 14, 2018", "Milwaukee Journal Sentinel, \"Scott Walker says he's running a positive campaign and defends ad against Tony Evers on prisons,\" Sept. 13, 2018", "Associated Press, \"AP Fact Check: Walker right on Wisconsin prison population,\" Aug. 11, 2018", "MICAH, \"MICAH’s ROC Wisconsin Task Force,\" accessed Sept. 18, 2018", "Interview, University of Minnesota sociology professor Michelle Phelps, expert in incarceration, Sept. 18, 2018", "YouTube, Democratic gubernatorial candidates debate (33:40), July 12, 2018", "Email, Justice Policy Institute director of research and policy Ryan King, Sept. 18, 2018", "Email, Kenneth Streit, a clinical professor of law emeritus at the University of Wisconsin Law School who is a corrections policy expert who has has assisted the Legislature and the Department of Corrections in developing and evaluating adult community corrections programs, Sept. 17, 2018", "Wisconsin Department of Corrections, \"Wisconsin DOC Offense Categorization,\" accessed Sept. 20, 2018", "Wisconsin Department of Corrections, \"Inmate profile 2017,\" May 2018", "Wisconsin Department of Corrections, \"Offenders under control,\" Sept. 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]