["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and former Vice-President Joe Biden, left, and Sen. Kamala Harris, D-Calif., spar during the Democratic primary debate in Miami. Sen. Bernie Sanders, I-Vt., is in the center. (AP Photo/Wilfredo Lee)", "California Sen. Kamala Harris won a breakout moment in last week’s Democratic presidential debate when she attacked Joe Biden’s record opposing busing to desegregate schools in the 1970s.", "But her critique of the former vice president also placed a spotlight on her claim that she was \"part of the second class to integrate her public schools\" through a busing program in Berkeley.", "Some on social media have questioned her claim’s accuracy.", "Harris, 54, repeated her statement twice during her exchange with Biden, right after pointing out that he opposed busing.", "\"There was a little girl in California who was part of the second class to integrate her public schools, and she was bused to school every day. And that little girl was me.\"", "\"I was part of the second class to integrate Berkeley, California, public schools almost two decades after Brown v. Board of Education.\"", "Harris referred to the landmark 1954 U.S. Supreme Court ruling that racial segregation in public schools was unconstitutional.", "Given the attention on this topic, we wanted to know whether Harris’ \"second class to integrate\" claim was biographical fact or fiction.", "Our research", "To examine Harris’ statement, we spoke with officials from Berkeley Unified School District, a historian who studied the city’s busing integration program, reviewed news articles and Harris’ biography.", "Here’s what we found:", "Harris was born in Oakland on Oct. 20, 1964.", "She grew up in a black middle-class neighborhood in west Berkeley.", "Harris was three years old when Berkeley Unified’s school board voted in January 1968 to desegregate the district’s elementary schools, starting that fall, through a unique two-way busing program.", "Children from the city’s more diverse western neighborhoods were bused to elementary schools in Berkeley’s eastern hills, a more affluent and whiter area. Meanwhile, children from the hills were bused to schools in the more diverse neighborhoods.", "Kamala Harris (left) in 1970 with her sister, Maya Harris, and mother, Shyamala Gopalan. Kamala Harris was part of one of the first classes to integrate Berkeley, Calif., elementary schools through a pioneering busing program that started in 1968. (Courtesy of Kamala Harris)", "Natasha Beery, director of community relations at Berkeley Unified School District, told us Harris’ claim was \"absolutely\" accurate. She said Harris attended Thousand Oaks Elementary school, on the city’s northeast side.", "\"She would be part of that second class that integrated our schools through our two-way busing program,\" Beery added. \"It began in 1968. And she joined a group that had started kindergarten the following year in 1969 and so her description is correct.\"", "A spokesman for the senator’s campaign told us Harris joined the second class to integrate in first grade in 1970. She had attended a private school for kindergarten the year before. Altogether, that’s about 16 years after the Brown v. Board decision, which loosely fits with Harris’ statement of \"almost two decades after Brown v. Board of Education.\"", "After the debate, Berkeley Unified published a statement on its website explaining the history of its integration program and Harris’ experience.", "‘The two girls took the bus up the hill’", "Carole Porter, a former neighbor and elementary school classmate of Harris, corroborated the senator’s statement in a recent New York Times article.", "\"The two girls took the bus up the hill from the middle-class Berkeley flats where they lived to Thousand Oaks, a school in the white, more affluent Berkeley hills,\" the article said. \"Ms. Porter recalled that the ride took about 40 minutes. Ms. Harris attended a Montessori school for kindergarten and joined Ms. Porter at Thousand Oaks in first grade.\"", "A mural celebrating women leaders at Thousand Oaks Elementary school in Berkeley, Calif. includes an image of Sen. Kamala Harris, who attended the school. The others (from left to right) include Ruth Asawa, Dolores Huerta, Malala Yousafzai, Serena Williams and Anne Frank. (Courtesy Sen. Harris's Twitter page)", "Questions about Harris’ claim surfaced, in part, after Gateway Pundit published a misleading article. The conservative website alleged the senator fabricated her story, citing Berkeley High School yearbook photos that show diverse classes before Harris was born.", "But school district officials, and a city historian, say that allegation ignores a key fact: \"Berkeley has only one high school, so it was always integrated or at least desegregated,\" said Charles Wollenberg, author of \"Berkeley: A City in History.\"", "Integration at the city’s junior high schools started in 1964, Wollenberg said. It took place without busing, \"as ‘Busing’ was still an unwelcome word in Berkeley,\" at the time, according to a report the school district published last year marking the 50th anniversary of the busing system.", "\"The bottom line,\" Wollenberg added, \"is that she was telling a simplified but basically accurate version of the truth.\"", "We asked for Harris’ position on using busing to integrate schools today. Her spokesman said: \"Senator Harris supports federal measures to increase school diversity, including resources for busing,\" such as the Strength in Diversity Act proposed by Sen. Chris Murphy, D-CT, and Rep. Marcia Fudge, D-OH.", "It would authorize $120 million in grants for \"voluntary community-driven strategies to increase diversity in schools,\" including expanding busing.", "Our rating", "Sen. Kamala Harris claimed she was \"part of the second class to integrate her public schools\" and was bused to school in Berkeley, Calif.", "We found Harris was bused to school, and joined the second class of a pioneering elementary school integration program in Berkeley. She was a first grader when she joined in 1970.", "Her statement could have used the clarification that the city’s junior high schools had already integrated several years earlier in 1964, though not through a busing program.", "It’s also noteworthy that Berkeley’s high school was integrated years before Harris started school, but, again, not because of busing. Instead, the high school was racially diverse because it was the only comprehensive public high school in the city, drawing students from all backgrounds.", "Even with these clarifications, Harris’ statement is generally correct, given the context of her exchange with Biden on busing. It was supported by her school district, a city historian and recent news articles.", "We rate her claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Kamala Harris, Democratic presidential debate, July 27, 2019", "Ian Sams, Harris campaign spokesman, email exchange July 1, 2019", "Charles Wollenberg, historian and author of \"Berkeley: A City in History,\" email exchange July 1, 2019", "Natasha Beery, director of community relations, Berkeley Unified School District, phone interview July 2, 2019", "Berkeley Unified School District, The History of Integration in Berkeley Elementary Schools and Senator Harris, June 28, 2019", "Berkeley Unified School District, 50th Anniversary of Berkeley’s Pioneering Busing Plan for School Integration, December 17, 2018", "Factcheck.org, Sen. Harris Didn’t ‘Lie’ About Integration, July 13, 2018", "United States Courts, Background - Mendez v. Westminster Re-Enactment, No date", "Constitutional Rights Foundation, BRIA 23 2 c Mendez v Westminster: Paving the Way to School Desegregation, Summer 2007", "American Immigration Council, The Lasting Impact of Mendez v. Westminster in the Struggle for Desegregation, March 25, 2010", "The Phi Delta Kappan, A Landmark in School Racial Integration: Berkeley, California, May 1969", "University of California Berkeley Law School, IntegratIon Defended:", "Berkeley Unified’s Strategy to Maintain School Diversity, September 2009", "Gateway Pundit, Kamala Harris Says Schools in Berkeley Weren’t Integrated When She Was a Kid — But Yearbook Pictures Prove She’s Lying, July 10, 2018", "U.S. Supreme Court, Brown v. Board of Education of Topeka, 1954", "U.S. Supreme Court, Brown v. Board of Education of Topeka, 1955", "PolitiFact, Who is Kamala Harris? A bio of the presidential candidate, June 14, 2019", "CNN, Fact check: Kamala Harris was correct on integration in Berkeley, school district confirms, June 29, 2019", "Snopes, Did Kamala Harris ‘Lie’ About Being in the Second Integrated Class in Berkeley?, June 28, 2019", "The New York Times, Kamala Harris and Classmates Were Bused Across Berkeley. The Experience Changed Them., June 30, 2019", "Mercury-News, How Berkeley’s busing program changed Kamala Harris’ life — and the presidential race, June 28, 2019", "The San Francisco Chronicle, Kamala Harris rode the buses that integrated Berkeley schools, June 29, 2019", "Los Angeles Times, School busing in Berkeley during Kamala Harris’ childhood was both voluntary and volatile, June 30, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]