["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic vice presidential candidate Sen. Kamala Harris, D-Calif., responds to Vice President Mike Pence during the vice presidential debate on Oct. 7, 2020, at Kingsbury Hall on the campus of the University of Utah in Salt Lake City. (AP)", "Biden’s official campaign platform says his administration would not defund police departments.", "Harris’ press secretary said she does not support defunding the police. Her former presidential campaign platform did not mention it.", "In media appearances, Harris has called for “reimagining” public safety across the country. But she hasn’t explicitly said she supports defunding police departments, and Harris has said she doesn’t want to get rid of law enforcement.", "Democratic Sen. Kamala Harris is the former attorney general of California. She has called herself the state’s \"top cop.\" But Vice President Mike Pence said she would defund the police if Joe Biden is elected president.", "\"As vice president, Kamala Harris would: defund, dismantle, and dissolve police departments,\" says a Facebook ad published by Pence’s Facebook page Oct. 8, the day after the vice presidential debate in Salt Lake City.", "\"Americans can’t afford the radical left’s agenda,\" reads a message at the bottom, which links to a fundraising page for President Donald Trump’s re-election campaign.", "The ad stands in contrast to some of the Trump campaign’s other messaging on Harris, which has criticized her as an overzealous prosecutor. We reached out to Pence’s press office, as well as the Trump campaign, for evidence or a comment, but we haven’t heard back.", "Setting aside whether Harris could, as vice president, single-handedly dismantle police departments, is it true that she supports defunding the police? We took a closer look.", "(Screenshot from the Facebook Ad Library)", "Pence’s ad is wrong. The Biden campaign says his administration would not work to defund the police, and Harris has not explicitly said she supports those calls.", "The official Biden campaign platform does not support defunding or dismantling police departments. Harris’ former presidential campaign platform doesn’t mention it.", "Following the death of George Floyd, a Black man, in Minneapolis police custody in May, activists protesting against police brutality started to call for defunding the police. While some activists said they wanted to eliminate police departments entirely, others said lawmakers should reroute some of their funding toward other community services.", "Biden says in his platform that, if he were elected, he \"will not defund the police.\" We’ve previously rated several claims False for saying the opposite.", "Biden says he would invest more money in local law enforcement.", "\"He will condition federal funding on departments undertaking reforms,\" the platform says. \"And, he will invest an additional $300 million in community-oriented policing, so officers can get out of their cruisers and get to know the communities they serve.\"", "Harris, who co-sponsored a Senate bill that calls for criminal justice reform, also hasn’t said she wants to dismantle or dissolve police departments.", "When Harris was a candidate for the Democratic presidential nomination, her criminal justice platform did not mention defunding or dismantling police departments. Her plan called for increasing funding for things like body cameras, mental health professionals, and \"officer safety and wellness.\"", "\"Joe Biden and Kamala Harris do not support defunding the police, and it is a lie to suggest otherwise,\" said Sabrina Singh, Harris’ press secretary. \"Throughout her career, Sen. Harris has supported increasing funding to police departments and boosting funding for community policing.\"", "While Harris has called for \"reimagining\" public safety in the United States, she has not said she supports defunding police departments.", "In an early June episode of \"The View,\" host Meghan McCain asked Harris:\"Are you for defunding the police?\"", "After some back-and-forth about the definition, Harris demurred.", "\"We need to reimagine how we are achieving public safety in America,\" she said. \"To have cities where one-thrid of their entire budget is going to policing, but yet there is a dire need in those same cities for mental health resources, for resources going into public schools, for resources going into job training and job creation — come on. We have to be honest about this.\"", "Harris has reiterated those talking points in several media appearances:", "On June 8, she said: \"We don’t want police officers to be dealing with the homeless issue. We don’t want police officers to be dealing with substance abuse and mental health. No — we should be putting those resources into our public health systems, we should be looking at our budgets and asking, ‘Are we getting the best return on our investment as taxpayers?’\"", "On June 25, she said: \"For far too long, the status quo thinking has been to believe that by putting more police on the street, you’re going to have more safety — and that’s just wrong.\"", "On Sept. 6, she said: \"I want to make sure that if a woman is raped, a child is molested, one human being murders another human being, that there will be a police officer that responds to that case and that there will be accountability and consequence for the offender.\"", "RELATED: ‘Defund the police’ movement: What do activists mean by that?", "While Harris has alluded to some key points of the \"defund the police\" movement, she hasn’t offered her support. The Hill reported in June that, before she joined the Biden campaign, Harris was trying to \"straddle the divide on the left over police reform.\"", "Pence said in a Facebook ad that, as vice president, Harris would \"defund, dismantle, and dissolve police departments.\"", "That’s wrong.", "Biden’s official campaign platform says his administration would not defund police departments. Harris’ press secretary said she does not support defunding the police. Her former presidential campaign platform did not mention it.", "In media appearances, Harris has called for \"reimagining\" public safety across the country. But she hasn’t explicitly said she supports defunding police departments, and Harris has said she doesn’t want to get rid of law enforcement.", "Pence’s ad is inaccurate. We rate it False.", "CNN transcripts, Sept. 6, 2020", "Congress.gov, S.3912 - Justice in Policing Act of 2020", "Email from Sabrina Singh, press secretary for Sen. Kamala Harris, Oct. 8, 2020", "Facebook ad from Vice President Mike Pence, Oct. 8, 2020", "The Hill, \"Harris grapples with defund the police movement amid veep talk,\" June 11, 2020", "JoeBiden.com, \"JOE BIDEN AND THE ARAB AMERICAN COMMUNITY: A PLAN FOR PARTNERSHIP,\" accessed Oct. 8, 2020", "KamalaHarris.org, \"CRIMINAL JUSTICE REFORM | FULL POLICY,\" archived Dec. 3, 2019", "MSNBC, \"Sen. Harris says police reform bill is all about ‘accountability and consequence,’\" June 8, 2020", "PolitiFact, \"Biden says Trump wants to cut local law enforcement aid. That’s correct,\" Aug. 25, 2020", "PolitiFact, \"‘Defund the police’ movement: What do activists mean by that?\" June 9, 2020", "PolitiFact, \"Fact-checking the 2020 vice presidential debate, Kamala Harris vs. Mike Pence,\" Oct. 8, 2020", "PolitiFact, \"Joe Biden says he doesn’t want to defund police,\" June 9, 2020", "PolitiFact, \"No, Joe Biden isn’t 'on board with defunding police,’\" Aug. 5, 2020", "The Washington Examiner, \"Trump campaign tiptoes around ‘Kamala is a cop,’\" Aug. 12, 2020", "The Washington Post, \"Trump and allies struggle to find a focused attack on Harris,\" Aug. 12, 2020", "YouTube video from \"Good Morning America,\" June 9, 2020", "YouTube video from \"The View,\" June 8, 2020", "YouTube video from \"Watch What Happens Live,\" June 25, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]