["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Senate candidate Kamala Harris tweeted the image and statement above on Aug. 22, 2016.", "During her run for U.S. Senate, California Attorney General Kamala Harris has touted a \"smart on crime\" approach that focuses on the most violent offenders and reducing recidivism.", "Harris believes this strategy is key to slowing what she claims is a dramatic rise in the nation’s prison population.", "\"Over the last 40 years, this country’s prison population has grown by 500 percent,\" Harris said on her campaign website, and in a recent tweet that included a stark black and white picture of prison bars.", "\"We have a responsibility to ensure agencies focus on preventing crime -- not just fighting crime after the fact,\" Harris added in the tweet.", "Harris is competing with U.S. Rep. Loretta Sanchez to replace retiring Sen. Barbara Boxer in November’s election. All three are Democrats.", "We decided to check whether Harris stretched the truth in her claim about the rapid rise in America’s prison population.", "Our research", "We relied on data from the Sentencing Project. The criminal justice advocacy group is considered a credible source for incarceration figures. Its data was cited by the national PolitiFact team in a recent fact check on a similar claim.", "The Sentencing Project’s data show there are 2.2 million people in the nation’s federal and state prisons and local jails -- a 500 percent increase over the past 40 years. For comparison, the overall United States population has increased just 51 percent during that period.", "Available numbers from the U.S. Justice Department’s Bureau of Justice Statistics agree with those from the Sentencing Project.", "Harris’ claim is slightly different in that it cites the nation’s spike in \"prison population\" rather than a combined increase in prisons and jail figures.", "Some might read her statement as including both prison and jail inmates, but there’s a significant difference between the two.", "To assess Harris’ more limited claim, we examined the rise of the prison population alone.", "The Sentencing Project’s data show the nation’s prison population grew from 218,466 in 1974 to 1,508,636 in 2014, which is a nearly 600 percent increase.", "Unlike most politicians, it appears Harris understated her legitimate point.", "More background", "Harris’ claim and stance on prison reform is significant given California’s overcrowded prisons.", "At nearly 600,000 people, California has the second largest correctional population among states, behind only Texas’ nearly 700,000, according to the U.S. Justice Department. Those figures include prison and jail inmates and people on probation and parole.", "Source: U.S. Justice Department", "Harris’ claim centers on the rise of prison inmates over the past four decades. Over the past few years, however, America has seen a decline in prisoners. The nationwide total dropped about 100,000 from 2009 to 2014, according to the Sentencing Project.", "Reforms in California account for much of that drop, as the state has reduced its prison population by about 50,000 following a 2009 federal court order to do so, according to a report by the Public Policy Institute of California.", "In November, Californians will vote on Proposition 57, a measure proposed by Gov. Jerry Brown designed to ease the state’s prison overcrowding. It would allow some offenders to be considered for parole earlier than now possible.", "A campaign spokesman said Harris has declined to take a position on Prop 57, or any ballot measure, because as attorney general she is charged with writing an independent summary and title for each measure.", "The spokesman pointed to data from the Sentencing Project and other academic reports to back up Harris’ claim about the prison population.", "Our ruling", "U.S. Senate candidate Kamala Harris recently said \"Over the last 40 years, this country’s prison population has grown 500 percent.\"", "Data show the nation’s combined prison and jail population has grown 500 percent over this period.", "But when isolating just the prison population, the data shows that group has soared by nearly 600 percent.", "No matter how you crunch the numbers, they show a dramatic rise in incarceration -- one that actually exceeds what Harris stated.", "Her statement is on the right track, but needs this clarification.", "We rate it Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/da79554e-4177-4b1f-a88b-0a25ee20818e", "Kamala Harris, campaign website and tweet, Aug. 22, 2016", "PolitiFact, How the war on drugs affected incarceration rates, July 10, 2016", "Sentencing Project, \"Criminal Justice Facts,\" accessed September 2016", "Sentencing Project, \"Trends in U.S. Corrections,\" January 2016", "Bureau of Justice Statistics, \"Historical Corrections Statistics in the United States, 1850- 1984,\" December 1986", "Bureau of Justice Statistics, \"Correctional Populations in the United States, 2014,\" December 2015", "Public Policy Institute of California, How California Reduced Its Prison Population, February 6, 2016", "Interview, Nathan Click, campaign spokesman for Kamala Harris, Sept.13, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]