["A collage of images is circulating on social media with the claim it depicts the recent forest fires in Uttarakhand. “Uttarakhand is burning since 4 days but why isn’t anyone talking about our own devabhoomi burning? We prayed for Australia and Amazon, how can we be so ignorant about of own devabhoomi?” tweeted one Bhumika Dogra on May 26.", "Facebook pages United Against Pseudosecular and Dehradun Wale posted this collage with the same claim.", "Indian National Congress’s national convenor Hasiba Amin posted the same on May 27, 2020. The official handle of National Students Union of India (NSUI), the student’s wing Congress, too tweeted the same image. A tweet by Telugu actor Sai Dharam Tej which carried this collage garnered more than 400 retweets so far.", "With the help of reverse image search on Google and Russian search engine Yandex, Alt News was able to trace back some of the images. We found that at least three out of seven images were old. In the course of this article, we will fact-check each image separately in no particular order.", "Image 1", "While this image is claimed to be a recent image from Uttarakhand’s Chamoli district, it was traced back to Getty Images which credited the shot to photographer Anoop Negi. The caption of the image stated that the content in unverified. However, it is certain the image is at least eight years old as per the date of creation mentioned on Getty Images. “Shimla Hills are Burning – More Forest Fires.” reads its title.", "Image 2", "This image was traced back to an article on Hindustan Times which in turn credited it to news agency Press Trust of India (PTI). The article was published on May 3, 2016. “A major fire in the forests at Ahirikot in Srinagar, Uttarakhand on Monday,” reads the description of the image. Thus, it is more than four years old.", "We were able to trace this image back to a blog post by photographer Anoop Negi. The blog post is dated June 4, 2012. “More Fires in the Himalayas – Solan Rajgarh HIlls,” reads the title of the same image posted by Negi on the photo-sharing platform Flickr. According to the platform, the image was clicked on May 30, 2012.", "Several other old images are circulating on social media with the claim that they depict the recent forest fires in Uttarakhand. Chief conservator of forests at Uttarakhand forest department Parag Madhukar Dhakate said, “Uttarakhand Forest Department is using satellite information to douse the fire wherever reported. No massive and serious incident has been reported yet.”", "Dr Parag Madhukar, Conservator, Forest Dept says there are no massive forest fires in Uttarakhand, many old and wrong visuals are being shared on social media. Please be careful. FYI it rained in some parts of the state today #PrayForUttarakhand pic.twitter.com/Pk7yVTKCB2", "— Gargi Rawat (@GargiRawat) May 27, 2020", "While comparing last year’s forest fires in Uttarakhand with recent incidents, the state’s principal chief conservator of forest, Jai Raj, said, “Last year many forest fire incidents took place. Hence last year till this time, around 1600 hectares [of land] was burnt. In comparison to that, now it’s 81 hectares. According to this [data], the situation is in much better control.”", "Please go through the graph below, do not fall prey to misinformation. Forest fires have come down a lot this season. Partly due to less anthropogenic activity and partly due to rains. Go through this news item as well…https://t.co/ozCDqG2Lej pic.twitter.com/7RckGRJu2z", "— PIB in Uttarakhand (@PIBDehradun) May 26, 2020", "He further added, “The important thing to understand is that here the forest fire moves on the ground. They move on the surface. Some grass burns, some bushes burn, that is the kind of damage. Here, fire incidents where full trees get burnt, which we call a crown fire, such incident are close to none. Such forest fires take place in the United States, Canada and Australia.”", "Furthermore, Dhakate tweeted a map of the state showing active forest fire points as of May 26, 2020, at 4:30 PM.", "The Forest Fire’s in Uttarakhand are being handled diligently with active forest fire point tracking and dousing work is on by forest crew’s, kindly refer to this map which shows the active forest fire points (red dots) as on 26-05-2020, 4:30 PM pic.twitter.com/ToJmxM5MW8", "— Dr. PM Dhakate (@paragenetics) May 26, 2020", "While we are unable to trace back the origin of four images in the collage, it is certain that three of the images were old and unrelated to the recent forest fires in Uttarakhand.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]