["About this rating", "In November 2016, a viral meme circulated on social media in the wake of the announcement that Ben Carson was being considered for the job of President-elect Trump’s Education Secretary (which he allegedly declined), suggesting that the former Republican presidential candidate didn’t believe in the Big Bang theory because it would have destroyed Earth.", "Ben Carson, as far as we can tell, never actually made this statement. While Ben Carson has gone on the record as doubting the validity of the Big Bang, his logic is completely different from the more overtly incorrect logic presented in the meme. In a 2012 speech to a collection of Seventh Day Adventists titled “Celebration of Creation”, Carson suggested his doubt in the Big Bang stemmed from the fact that it contradicts the second law of thermodynamics:", "You have all these highfalutin scientists, and they’re saying that there was this gigantic explosion and everything came into perfect order. Now, these are the same scientists who go around touting the second law of thermodynamics, which is entropy, which says that things move toward a state of disorganization. So, now you’re going to have this big explosion, and everything becomes perfectly organized. When you ask them about it, they say, “Well we can explain this based on probability theory, because if there’s enough big explosions, over a long enough period of time, billions and billions of years, one of them will be the perfect explosion”. [...] What you’re telling me is, if I blow a hurricane through a junkyard enough times, over billions and billions of years, eventually, after one of those hurricanes, there will be a 747 fully loaded and ready to fly.", "As physicist and author Brian Greene explained in 2015, this is a tortured reading of both cosmological theory and thermodynamics. Greene uses the act of cleaning a messy room as an example:", "How do you take a messy room and make it ordered? That would seem to be decreasing the disorder – it was a mess, now it’s not a mess. It was disordered, now it’s ordered. How could anybody do that? It seems to violate the second law of thermodynamics!", "But the answer is: you have to take into account all of the sources of order and disorder, including the body of the human who is cleaning up the room, the heat that they are generating, the fat that’s being burned as they undertake this exercise. And when you take into account everything – the molecules of air that get excited by the sweat forming on the brow of the individual doing the cleaning – when you take into account all of these features, the amount of disorder generated overly compensates – always – for the amount of order that’s being created in the room.", "The empirical verification of this concept on a cosmological scale, which predicted (with remarkable precision) a specific frequency of background radiation left over from the Big Bang, is considered both one of the crowning achievements in science and the strongest validation yet of the Big Bang model of the universe’s origins.", "With respect to Carson’s claims about probability and multiple Big Bangs, Greene also takes umbrage:", "That is not an accurate reflection of the Big Bang theory. Though some theories of the origin of the universe suggest that the Big Bang was only one of many such explosions, these theories do not state that the currently ordered existence is a spontaneous result of one of these repeated Big Bangs. Greene called this a “red herring,” and said the concept of multiple Big Bangs has nothing to do with how stars and planets form in this current universe. Instead, those theories involve the idea that the universe goes through cycles over many billions of years: Big Bang, expansion, contraction, “Big Crunch,” followed by another Big Bang. How the stars and planets form between each of those bangs and crunches is a separate issue.", "Ultimately, and certainly ironically, the viral meme accusing Ben Carson of a flawed reading of cosmology appears to stem from an equally flawed reading of Ben Carson’s own flawed reading of science.", "science.nasa.gov.   \"The Big Bang.\"", "Levitan, Dave.   \"Carson Rewrites Laws of Thermodynamics.\"\r\n    Factcheck.org.   24 September 2015.", "Kaczynski, Andrew, and Ward, Molly.   \"Ben Carson: Big Bang A Fairy Tale, Theory Of Evolution Encouraged By The Devil.\"\r\n    BuzzFeed News.   22 September 2015.", "Henderson, Nia-Malika, and Diamond, Jeremy.   \"Aide: Carson Declined Cabinet Position Offer from Trump.\"\r\n    CNN.com.   15 November 2016.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]