["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Turing CEO Martin Shkreli. (Screengrab)", "The CEO of Turing Pharmaceuticals, the company that jacked up the cost of a life-saving drug from $13.50 to $750 essentially overnight, says the new price tag is still below market value.", "Martin Shkreli, a 32-year-old former hedge fund manager, was singled out as the man behind Turing’s controversial decision. So Shkreli took to the airwaves to defend himself, insisting that the price hike was altruistic or, at the very least, not unique.", "\"You only need less than 100 pills so at the end of the day, the price for treatment – to save your life – was only $1,000,\" Shkreli told Bloomberg TV on Sept. 21, 2015. \"These days, in modern pharmaceuticals, cancer drugs can cost $100,000 or more, rare disease drugs can cost half a million dollars. Daraprim is still underpriced, relative to its peers.\"", "Daraprim is used to treat a parasitic infection known as toxoplasmosis, which the Centers for Disease Control and Prevention considers a leading cause of death attributed to food-borne illnesses.  The Toxoplasma parasite can be transmitted through contaminated food,  water, and kitchen utensils as well as contact with infected cat feces. While 60 million Americans carry the parasite with no symptoms, it can become deadly for those with weakened immune systems.", "We were curious about Shkreli’s claim that Daraprim’s new price was comparable to \"its peers.\" (Shkreli has since said that he would lower the price amid the outrage, but he did not reveal the new price.)", "Neither Shkreli nor Turing Pharmaceuticals got back to us for this fact-check, but we found that while other treatments are certainly expensive, Shkreli is committing a false equivalence when he compares them to Daraprim.", "Shkreli is right that other treatments can cost hundreds of thousands of dollars: for example, the cancer drug Revlimid can cost $150,000 per year while Kalydeco, a drug for cystic fibrosis, can cost $300,000 a year, according to the New York Times.", "By Shkreli’s calculations, the new price of treatment –100 pills of Daraprim for $750 a pop – is $75,000. But that’s a low estimate, according to the Infectious Disease Societies of America. It estimated a new annual cost of $336,000 to $634,000, depending on dosage.", "Beyond cancer and rare disease treatments, few drugs cost more than $100,000, said David Howard, a professor of health policy and management at Emory University. So the high price Shkreli cited \"isn’t a good benchmark for deciding whether a drug is underpriced,\" he said.", "Numbers aside, experts told us the real problem with Shkreli’s claim is Daraprim and cancer drugs shouldn’t be compared to each other.", "\"They're not peers,\" said Amir Attaran, a professor of health law and policy at the University of Ottawa. \"He could have said, ‘A bar of gold cost $1 million, so Daraprim is underpriced.’ He's comparing fish and fowl.\"", "Simply put, cancer and rare disease drugs are almost always under patent, while Daraprim’s expired in 1953. And unlike Daraprim, those drugs are the products of expensive, recent research.", "\"The comparison is irrelevant. Cancer drugs were developed by companies that invested hundreds of millions of dollars, billions of dollars in research and development,\" said John Lamattina, a former senior vice president at pharmaceutical giant Pfizer Inc., who currently writes about the industry for Forbes.", "Daraprim, meanwhile, \"is generic drug. There’s no research and development they had to do,\" said Gerard Anderson, a professor of health economics and finance at Johns Hopkins University.", "The research and development for Daraprim happened long before Shkreli bought the rights. It’s the trade name for pyrimethamine, a drug created by Nobel Prize-winning scientist Gertrude Elion that can be used to treat malaria as well as toxoplasmosis.", "Though no generic drug company has taken up manufacturing Daraprim (there are only about 2,000 U.S. patients who use the drug every year), it’s been available for reproduction for more than 60 years. That means its peers should be other generic drugs like ibuprofen, penicillin, and antibiotics, experts told us.", "The proposed 5,000 percent price increase on Daraprim is indicative of a larger trend among more niche generic drugs. A joint House and Senate investigation, partly led by Democratic candidate Sen. Bernie Sanders of Vermont, found that the annual cost hikes for 10 generic drugs ranged from 390 to 8,200 percent.", "This \"anarchy pricing\" can be attributed to the failure of the free market and a lack of government regulation, says Alan Sager, a professor of health policy and management at Boston University.", "\"Essentially, this is an example of where the drug pricing system for generic drugs has totally failed,\" Anderson said. \"In the past, generic drugs have prices that are low because of competition. Anyone can make it with FDA approval. The only thing you can compete on is price. (Shkreli’s) found something where there's no competitors.\"", "Anyone can legally make Daraprim, but for the time being, Turing’s monopoly gives it free reign to impose very high prices. As for Shkreli’s claims that the profits will go to research for a better version of Daraprim, experts aren’t buying it.", "\"Turing has not got a single clinical trial underway. Shkreli’s not testing new drugs of any kind for toxoplasmosis. He's got nothing registered,\" Attaran said. \"No one needs a new drug for toxoplasmosis anyways. It works so well bloody well.\"", "Our ruling", "Shkreli, the CEO of Turing Pharmaceuticals, said, \"Daraprim is still underpriced, relative to its peers.\"", "By his own estimates, Daraprim is cheaper than cancer and rare disease drugs, which he considers Daraprim’s \"peers.\" By others, Daraprim costs about the same, if not more.", "Yet experts told us cancer and rare disease drugs are not Daraprim’s peers. Daraprim’s patent expired more than six decades ago and is a niche generic drug. The same cannot be said of cancer treatments.", "We rate his claim False.", "Correction: An earlier version of this fact-check misspelled Martin Shkreli's name.", "Bloomberg, \"Drug Goes From $13.50 to $750 Overnight,\" Sept. 21, 2015", "CBS, \"CEO: 5,000-percent drug price hike ‘not excessive at all,’\" Sept. 22, 2015", "NBC, \"Drug CEO Will Lower Price of Daraprim After Hike Sparked Outrage,\" Sept. 23, 2015", "Journal of Oncology Practice, \"High Cancer Drug Prices in the United States: Reasons and Proposed Solutions,\" May 6, 2014", "New York Times, \"Drug Prices Soar, Prompting Calls for Justification,\" July 23, 2015", "Infectious Diseases Society of America, Letter to Turing Pharmaceuticals, Sept. 8, 2015", "Email interview with David Howard, professor of health policy and management at Emory University, Sept. 22, 2015", "Interview with Amir Attaran, professor of health law and policy at the University of Ottawa, Sept. 22, 2015", "Interview with John Lamattina, former Senior Vice President at Pfizer Inc., Sept. 22, 2015", "Interview with Gerard Anderson, professor of health economics and finance at Johns Hopkins University, Sept. 22, 2015", "Email interview with Alan Sager,  professor of health policy and management at Boston University, Sept. 23, 2015", "Mayo Clinic, \"Pyrimethanine,\" accessed Sept. 22, 2015", "New York Times, \"Gertrude Elion, Drug Developer, Dies at 81,\" Feb. 23, 1999", "Senator Bernie Sanders of Vermont, \"Ranking Member Cummings and Chairman Sanders Investigate Staggering Price Increases for Generic Drugs,\" Oct. 2, 2014", "New York Times, \"Big Price Increase for Tuberculosis Drug Is Rescinded,\" Sept. 22, 2015", "New York Times, \"Drug Goes From $13.50 a Tablet to $750, Overnight,\" Sept. 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]