["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Gov. Rick Perry appeared on CNN's \"State of the Union\" on Aug. 3, 2014.", "Texas Gov. Rick Perry says the border needs more protection against a record-high number of illegal immigrants coming from terrorist havens, but the figures don’t match Perry’s rhetoric.", "With Congress scrambling to address illegal immigration before the start of their summer recess this past Friday, it’s no surprise that the issue was a main topic on the Aug. 3, 2014, talk shows.", "Perry, who is considering a 2016 presidential run, appeared on CNN’s State of the Union to talk about President Barack Obama’s response to the crisis in Israel and the situation along the U.S.-Mexico border. Perry defended his recent decision to ramp up state spending on border operations following a massive influx of children from Central American countries.", "\"I'm the governor of the state of Texas. My citizens' safety is what is foremost here. And it hasn't got anything to do with anything other than those numbers of individuals who are coming across the border. And when you think about the idea that some of them are from countries that have substantial terrorist ties, whether it's Pakistan or Afghanistan or Syria, we are at historic record highs with individuals being apprehended from those countries,\" Perry said.", "The claim about illegal immigrants coming from countries with terrorist ties caught our attention.", "PolitiFact Texas checked two similar Perry claims in June. Perry said there was a record number of border apprehensions of people from countries other than Mexico, which PolitiFact Texas found to be True. But Perry also said of the surge in apprehensions, \"These are people that are coming from states like Syria that have substantial connections back to terrorist regimes and terrorist operations.\"", "PolitiFact Texas found that less than 5 percent of the \"other than Mexico\" apprehensions in 2012 (the most recent available data) involved people from countries that the United States designates as terrorist states or safe havens. For that, PolitiFact Texas rated Perry’s claim Pants on Fire.", "Is it possible, though, that the small number of apprehensions of individuals from those countries in 2012 could be a record?", "By the numbers", "We asked Perry’s office for evidence, but they did not get back to us.", "We found the most recent and comprehensive breakdown of apprehensions by country and year in the Department of Homeland Security’s 2012 Yearbook of Immigration Statistics (table 34), released July 2013. The document has data from the past 10 years. Here are the number of apprehensions for Afghanistan, Pakistan and Syria:", "Year", "Afghanistan", "Pakistan", "Syria", "2003", "61", "4,083", "369", "2004", "57", "641", "106", "2005", "55", "792", "113", "2006", "53", "721", "151", "2007", "28", "654", "101", "2008*", "74", "654", "101", "2009", "74", "575", "87", "2010", "88", "592", "95", "2011", "106", "525", "108", "2012", "95", "458", "56", "*Note: Data from 2008 and on includes Immigration and Customs Enforcement enforcement and removal operations.", "Based on the DHS data, there were not record apprehensions in 2012 for individuals from the three countries Perry mentioned, nor are apprehensions trending up. In fact, 2012 was the lowest year out of these 10 for Pakistan and Syria.", "To cover our bases, we also looked the DHS yearbook’s data for about a dozen other countries designated by the State Department to be terrorist safe havens or state sponsors of terrorism. The list includes Afghanistan, Colombia, Cuba, Iran, Iraq, Lebanon, Libya, Mali, Somalia, Sudan, Syria, Venezuela and Yemen.", "We found that none of these countries had record highs in 2012. Afghanistan, Libya and Somalia hit their record in 2011, though there is no discernible upward trend.", "The numbers of apprehensions of individuals from these countries is also incredibly low compared to the primary sources of illegal immigrants. In 2012, DHS apprehended nearly 450,000 Mexicans, 55,000 Guatemalans and 50,000 Hondurans. In contrast, officials apprehended 95 Afghanis, 458 Pakistanis and 56 Syrians.", "Justification", "It’s important to note that while Perry was using this statement to justify bringing more resources to the Texas-Mexico border, an apprehension and other enforcement measures can happen at the border, in the country’s interior or at designated places outside of the United States, according to the DHS document.", "Historically, only an extremely small number of people from the Middle East or South Asia who try to enter the United States illegally do so by crossing a land border, said Stephen Kelly, former deputy chief of mission for the United States in both Mexico and Canada.", "\"People from those areas are more likely to try to enter via an airport, perhaps with false documents,\" said Kelly, now a public policy professor at Duke University.", "And many people coming from these countries without a valid visa apply for asylum as soon as they enter the United States, so they are essentially turning themselves in.", "This has been an argument against increasing the number of border patrol agents in response to the influx of Central American children because they come to the country actively seeking officials rather than trying to evade them. This is because the current law, passed under former President George W. Bush to combat child trafficking, allows children from countries that don’t border the United States to stay in the country. Policymakers are now contemplating changing the law.", "Our ruling", "Perry said the United States is at \"historic record highs\" of individuals being apprehended on the border from countries with terrorist ties such as \"Pakistan or Afghanistan or Syria.\"", "The most recent data does not show record apprehensions of individuals from Pakistan, Afghanistan, Syria or any other designated terrorist countries, nor does it show an upward trend in apprehensions of individuals from those areas. Even if it did, many apprehensions of people from these areas happen at airports rather than land borders.", "We rate Perry’s claim Pants on Fire.", "CNN State of the Union, transcript, Aug. 3, 2014", "Austin American-Statesman, \"Texas leaders call for state law enforcement to secure the border,\" June 18, 2014", "PolitiFact Texas, \"Rick Perry correct that record number of immigrants not from Mexico are being apprehended at border,\" June 18, 2014", "PolitiFact Texas, \"Rick Perry airs ridiculous unsupported claim about all non-Mexicans apprehended at border hailing from terrorist states like Syria,\" June 18, 2014", "U.S. Department of Homeland Security, 2012 Yearbook of Immigration Statistics, July 2013", "U.S. Department of Homeland Security, 2013 Country Reports on Terrorism: Chapter 5, April 2014", "Email interview, Stephen Kelly, public policy professor at Duke University and former diplomat, Aug. 3, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]