["“The Post Office advises never send cash in the mail. It’s not secure. Vote by mail?” reads an August 16, 2020 post shared 10,000 times on Facebook.", "More examples of posts with the claim are available on Facebook here, here and here.", "The post office scrutiny comes with millions of US voters expected to turn to mail-in ballots for the 2020 presidential election on November 3. It is a safer alternative to in-person voting for Americans fearful of the novel coronavirus, which has killed more than 173,000 people in the US, the highest toll of any country.", "President Donald Trump has repeatedly claimed mail-in voting leads to fraud, an assertion contested by many election experts.", "The president has also opposed efforts to give the cash-strapped agency more money as part of a new virus-related stimulus package, even as changes there have been blamed for causing delays in mail delivery.", "David Partenheimer, a spokesman for USPS, told AFP by email: “Regarding sending cash in the mail, no, we do not prohibit it and continue to advise customers about the options they have.”", "He noted: “It is advisable to send money via a personal or certified check or money order, as these are traceable and a stop payment can be put on a check if it doesn’t arrive at its destination.”", "Partenheimer also said that cash sent through the mail can be insured for up to $15, or up to $50,000 for Registered Mail.", "Anyone sending significant amounts of cash should check with their local post office first, to make sure it is properly insured, and “verify that it is packaged securely enough to protect a high value item from being harmed during regular mail processing,” he said.", "The United States Postal Inspection Service, the post office’s law enforcement arm, does however say sending money by mail can be risky.", "“Be careful about what you send. Don’t risk sending cash in the mail,” it says.", "AFP Fact Check has debunked other claims related to the US Postal Service, including an image that appeared to show a postal union message against fascism.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]