["About this rating", "Justice Sonia Sotomayor talked about race and gender during a 2001 speech in which she argued for more diversity on the Supreme Court.", "Sotomayor did not say that a woman or person of color would ignore the merits of a case and give a biased ruling.", "In June 2016, several pundits misquoted, paraphrased, or presented incomplete or inaccurate versions of a 2001 speech delivered by Sonia Sotomayor at the University of California in an attempt to defend Republican Presidential candidate Donald Trump's recent comments about U.S. District Court Judge Gonzalo Curiel.", "In an interview with CNN, Trump said that Curiel should recuse himself from a case he's overseeing against the now-defunct Trump University, since he may not be able to give him a fair trial due to his Mexican heritage:", "The presumptive GOP nominee claims that his plan to build a massive wall along the U.S. border with Mexico has resulted in a conflict of interest for Curiel in the case over Trump’s for-profit university.\n\n“He’s proud of his heritage, OK? I’m building a wall,” Trump told Tapper. “He’s a Mexican. We’re building a wall between here and Mexico,” he added.\n\nTapper, however, pointed out that Curiel was born in Indiana.\n\n“We live in a society that’s very pro-Mexico, and that’s fine. That’s all fine,” Trump said at another point in the interview. “But I think he should recuse himself.”\n\n“Because he’s a Latino?” Tapper asked.\n\n“I’m building a wall,” Trump maintained.", "While several Republicans have denounced Trump's statements (House Speaker Paul Ryan called it \"textbook racism\"), others have used Sotomayor's speech to come to his defense. For instance, television personality Eric Bolling equated Sotomayor's comments with the comments made by Trump:", "Justice Sotomayor said, ‘I would hope that a wise Latina woman with the richness of her experiences would often make, often more than not reach a better conclusion than a white male who hasn’t lived that life.’ Better conclusion, not a different conclusion, a better conclusion. She went on to say that our gender and national origins may and will make a difference in our judging. She’s basically saying her heritage will determine how she will find cases, not the merits of the case, but what her experiences are.", "Pundit Ann Coulter bashed Paul Ryan on Twitter, questioning why the House Speaker did not call Sotomayor a \"textbook racist\":", "In 2001, Sonia Sotomayor delivered the annual \"Olmos Memorial Lecture\" at the UC Berkeley School of Law.  Sotomayor (who was at that point an appeals court judge) took issue with a quote attributed to Justice Sandra Day O'Connor:", "Whether born from experience or inherent physiological or cultural differences, a possibility I abhor less or discount less than my colleague Judge Cedarbaum, our gender and national origins may and will make a difference in our judging. Justice O'Connor has often been cited as saying that a wise old man and wise old woman will reach the same conclusion in deciding cases. I am not so sure Justice O'Connor is the author of that line since Professor Resnik attributes that line to Supreme Court Justice Coyle. I am also not so sure that I agree with the statement. First, as Professor Martha Minnow has noted, there can never be a universal definition of wise. Second, I would hope that a wise Latina woman with the richness of her experiences would more often than not reach a better conclusion than a white male who hasn't lived that life.", "While Sotomayor's speech was centered on the idea that her experiences as a Latina woman influenced her thought process, she never said (as insinuated by Bolling) that her heritage — rather than the merits of the case — would determine her decisions. Instead, Sotomayor said that her heritage does not limit her ability to understand the values or needs of people from different backgrounds:", "I, like Professor Carter, believe that we should not be so myopic as to believe that others of different experiences or backgrounds are incapable of understanding the values and needs of people from a different group. Many are so capable. As Judge Cedarbaum pointed out to me, nine white men on the Supreme Court in the past have done so on many occasions and on many issues including Brown.", "However, to understand takes time and effort, something that not all people are willing to give. For others, their experiences limit their ability to understand the experiences of others. Other simply do not care. Hence, one must accept the proposition that a difference there will be by the presence of women and people of color on the bench. Personal experiences affect the facts that judges choose to see. My hope is that I will take the good from my experiences and extrapolate them further into areas with which I am unfamiliar. I simply do not know exactly what that difference will be in my judging. But I accept there will be some based on my gender and my Latina heritage.", "This is not the first time that Sotomayor's 2001 speech has been scrutinized. In 2009, during Sotomayor's confirmation hearings to the Supreme Court, the soon-to-be justice clarified her comments:", "\"I was trying to inspire (students) to believe their experiences would enrich the legal system,\" Sotomayor said Tuesday. \"I was also trying to inspire them to believe they could become anything they wanted to become, just as I have.\"", "She said the context of her words created a misunderstanding.", "\"I want to state upfront, unequivocally and without doubt: I do not believe that any ethnic, racial or gender group has an advantage in sound judging,\" she said. \"I do believe every person has an equal opportunity to be a good and wise judge, regardless of their background or life experience.\"", "Supreme Court Justice Sonia Sotomayor did deliver a speech in 2001 in which she talked about how her experience as a Latina woman could influence her thought process, as everyone has different life experiences to draw from. However, unlike the sentiment expressed by Donald Trump in his comments about Judge Gonzalo Curiel, Sotomayor argued that diversity was essential to the progress of law.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]