["“This is good to know no matter which side of the fence you are standing on. Your vote is right on the outside of the envelope. It is not kept private. It is hidden in plain sight. Do not vote by mail,” warns a Facebook user who posted a video of two envelopes for mail-in ballots on August 15, 2020.", "The claims come as President Donald Trump, trailing Democratic challenger Joe Biden in opinion polls, continues to cast doubt on the integrity of mail-in voting, which millions of voters are expected to rely on rather than risk exposure to COVID-19 at polling places.", "Each envelope bears the name of a different person, one Republican and one Democrat, according to the woman speaking in the video.", "On the back of the ballots to be sent through the mail, a series of numbers ends in “D” for the Democrat, and “R” for the Republican, leading the narrator to fear that “a postal person could see this, if they’re a Democrat and say ‘oh, that’s an R, let’s toss it’.”", "The video was subsequently shared by other Facebook users, until its core information was made into a one-sentence post shared thousands of times without the video of the ballots.", "In the comments that accompany various iterations of the posts, fears of vote tampering are evident. “So if a Postal Worker sees it he or she xan just toss it into a dumpster and that vote goes uncounted,” one wrote.", "The ballots in the video are real, but do not reflect how mail-in voting will take place for the November elections.", "They are from the southeastern US state of Florida’s Palm Beach County. The front of the envelope, briefly visible when the narrator flips it, bears the name of the election board.", "Blaine Moss, a spokesman for the Palm Beach County Supervisor of Elections Office, told AFP by email that the ballot was from the August 18 primary election, in which voters registered within a political party chose the candidate that will represent them in the November election.", "“The ballots in that video are primary ballots. The numbers that can be seen below the bar code are there for the purposes of the canvassing board,” Blaine said, adding: “The alternative would be to open the envelope and look at the ballot itself to ensure that the voter voted the proper party and precinct style. We want to maintain ballot confidentiality, so those numbers are on the outside.”", "Because these primaries consist of Republicans voting for Republicans, and Democrats for Democrats, nothing would be gained by getting rid of votes from one party or another.", "Blaine specified that, “All ballots for the general election in November will look exactly the same,” and “there would be no way to tell the party affiliation of a voter based on their vote-by-mail envelope for the general election.”", "The Palm Beach County Supervisor of Elections is aware of the confusion created by the video, and posted this information on Twitter and Facebook to dispel voters’ concerns.", "Elections in the United States are conducted locally, which the National Conference of State Legislatures says “makes it extremely difficult, if not impossible, to rig US elections at the national level.”", "In the 2016 general election, 2.7 million registered voters, amounting to 28.7 percent of the 9.6 million Floridians who turned out to vote, did so by mail, according to the American Civil Liberties Union. Twenty-eight thousand vote-by-mail ballots were rejected that year, it said.", "Trump has repeatedly questioned the reliability of mail-in voting and the integrity of the election. On May 26, 2020, for example, he said on Twitter that “There is NO WAY (ZERO!) that Mail-IN Ballots will be anything less than substantially fraudulent,” despite many experts including a US Federal Election Commissioner dismissing such claims as false.", "On August 21, 2020, Trump-appointed US Postmaster General Louis DeJoy testified before a US Senate committee on his now-suspended reforms, which are accused of undermining the US Postal Service’s capacity to carry out vote-by-mail in November.", "DeJoy denied that mail was being slowed down and committed to on-time election delivery.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]