["About this rating", "David Hogg opined that a school requirement for students to carry clear backpacks was \"essentially\" a First Amendment violation and that he supports \"common sense gun reform.\"", "David Hogg did not say that he wants to abolish the Second Amendment.", "After seventeen people were killed during a mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida on 14 February 2018, several of its survivors have created a massive gun-control movement. In the weeks following the murders, the youth determined not to let the Parkland shooting become \"just another mass shooting\" have become recognizable faces of what is now known as the #NeverAgain movement.", "With that fame, however, comes a price: heavy scrutiny and a series of attempted smear campaigns against the small group of high school students who lived through a mass shooting.", "Various memes appearing on social media have attempted to contrast the purported views of Parkland school shooting survivor David Hogg on a school requirement for students to carry clear backpacks and gun ownership rights, the objective being to highlight that Hogg's stance on the First Amendment is supposedly at odds with his stance on the Second Amendment:", "David Hogg: Let’s abolish the 2nd amendment!!", "Interviewer: How about requiring clear backpacks?", "David Hogg: Absolutely not, that infringes on students rights!!!", "Folks, you can’t fake stupid...", "— The Trump Train ?? (@The_Trump_Train) March 25, 2018", "Such memes appeared to be based on an exchange between Hogg and an interviewer from Axios, during which Hogg was asked about a school rule involving clear backpacks. In response to the question, he opined that students are \"having ... their First Amendment rights infringed upon\" and that the policy was inconsiderate to female students in particular:", "Interviewer: \"You mentioned your backpack. What did they do with your backpacks?\"", "David Hogg: \"I think after we come back from spring break they're requiring all of us to have clear backpacks. One of the other important things to realize is many students want their privacy. There are many, for example, females in our school that when they go through their menstrual cycle, they don’t want people to see their tampons and stuff. It's unnecessary, it's embarrassing for a lot of the students and it makes them feel isolated and separated from the rest of American school culture where they're having essentially their First Amendment rights infringed upon because they can't freely wear whatever backpack they want regardless of what it is. It has to be a clear backpack. What we should have is just more policies that make sure that these students are feeling safe and secure in their schools and not like they’re being fought against like it's a prison.\"", "Most versions of this form of meme juxtaposed Hogg's dismay at infringement of First Amendment rights to his purported approval of trampling on Second Amendment rights. Although the now internationally-famous high school student has been outspoken about wanting to see the passage of \"common sense gun reform\" legislation, he has also stated that he is \"not against the Second Amendment\" and does not seek to \"abolish\" it:", "What a lot of the media and especially Fox News has messed up with me is they've made it seem like I'm trying to take away people's guns, that I'm against the Second Amendment. My father is a retired FBI agent. I have guns in my house. I’m not against the Second Amendment... I'm trying to push for common sense gun reform and mental illness reform so we can make sure that these individuals that have a criminal background that are mentally unstable and have a history of domestic violence are no longer able to get a gun...", "I don’t understand what's so hard to understand about this. We simply want to save lives and democracy, please stand with us.", "Reports dating back to the days after the 14 February 2018 Parkland school shooting reflect that Hogg's position on the Second Amendment has not changed:", "In [an] interview, David denied wanting to repeal the second amendment, which allows Americans the right to bear arms.", "He stated that Americans should have the right to own weapons, provided they are \"not going to go out and commit these atrocities\".", "\"We have a right to live just as we have a right to bear arms,\" he said.", "What does Hogg want?", "Universal background checks, raising the age requirement to purchase a gun to 21, and laws blocking anyone with a history of mental health disorders or a criminal background or history or domestic violence from getting a firearm.", "“I believe everybody should have their Second Amendment right to own a gun. I'm not trying to take that away. I am trying to put limitations on the Second Amendment in the same way that we have limitations on the First,” Hogg said.", "“I’m not anti-Second Amendment,” David Hogg emphasized to The Daily Beast.", "He said he thinks every person who is not mentally unbalanced and does not have a criminal record and is not bent on a terrorist attack should be able to purchase and own a firearm.", "“That’s their Second Amendment right,” David Hogg said.", "He also addressed the National Rifle Association and the belief that more people have to have guns in order to be safe.", "\"I would say that it's good to have your Second Amendment rights,\" Hogg said. \"It's good to believe that you can protect yourself and protect those around you, but I want people to acknowledge the fact that we do have a major gun violence problem in this country one that's not going away.\"", "“These people keep saying that I am anti-Second Amendment, I’m not.” Hogg told [Anderson] Cooper. “I do not want to take away the constitutional rights of American citizens.”", "David Hogg did say that schools requiring clear backpacks \"essentially... infringed\" on students' First Amendment rights, but he also stated multiple times that he supports the Second Amendment and does not want to eliminate private ownership of firearms or \"abolish\" the Second Amendment.", "His stance on the larger issues at hand might best be summed up by his statement that \"I am trying to put limitations on the Second Amendment in the same way that we have limitations on the First.\"", "Daly, Michael.   \"Parkland Teen Survivor David Hogg Welcomes the Conspiracy Theories.\"\r\n    The Daily Beast.   21 February 2018.", "Fitzgerald, Sandy.   \"David Hogg: Fight for 'Sensible' Gun Control a 'Generational Thing'.\"\r\n    NewsMax.   26 February 2018.", "Levine, Jon.   \"Florida Shooting Survivor David Hogg Strikes Back at Right-Wing Trolls: ‘I Am Not a Crisis Actor.\"\"\r\n    The Wrap.   21 February 2018.", "Mannarino, Dan.   \"Parkland School Shooting Survivor David Hogg Outlines His Gun-Reform Goals.\"\r\n    WPIX.   28 February 2018.", "C-SPAN.   \"Gun Policy And Safety.\"\r\n    23 March 2018.", "BBC News.   \"Florida Shooting: Student David Hogg Denies 'Actor' Claim.\"\r\n    21 February 2018.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]