["By Saranac Hale Spencer", "Posted on July 25, 2019", "President Donald Trump was awarded the Ellis Island Medal of Honor in 1986, but it wasn’t given for his “work within the black community,” as a popular meme circulating on social media claims.", "A claim circulating on social media misrepresents an award given to President Donald Trump in 1986. He was not honored for his “work within the black community.”", "Instead, the Ellis Island Medal of Honor was given to Trump, who was a real estate developer at the time, for his contributions to the city of New York through his development projects, said Otto Coca, spokesman for the Ellis Island Honors Society. That’s the group that gives the award.", "The year Trump was honored was the first year the award was given, Coca said, and Trump was one of 86 people to receive a medal. Between 90 and 100 people are honored each year, Coca told us.", "This year, the singer Paula Abdul and Democratic Rep. Adam Schiff were among the honorees.", "According to the Ellis Island Honors Society’s website, the medals are given to those “whose accomplishments in their field and inspired service to our nation are cause for celebration.”", "Despite the actual meaning behind the award, the fabricated claim that Trump was honored for his “work within the black community” has been shared widely on Facebook and Twitter, where it appears to have originated on a pro-Trump account.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Coca, Otto. Spokesman, Ellis Island Honors Society. Interview with FactCheck.org. 23 Jul 2019.", "The Ellis Island Medals of Honor. Ellis Island Honors Society. Eihonors.org. Accessed 23 Jul 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]