["About this rating", "In mid-August 2020, Snopes readers asked whether a comment made by U.S. President Donald Trump, which was widely interpreted to mean that he might seek a third term, was real. During a campaign speech, Trump appeared to suggest that if he's reelected in 2020, he should be granted yet another four years as a \"redo\" of his first term.", "Trump, who is up for reelection on Nov. 3, 2020, to a second term, did indeed make the comment during a campaign rally in Oshkosh, Wisconsin, held on Aug. 17. Video of the comment, in which he stated, \"We should get a redo of four years,\" was posted to Twitter by Vox Reporter Aaron Rupar.", "Trump brought the issue up again on Aug. 18, 2020, at campaign event in Yuma, Arizona:", "Trump's reference to \"spying\" related to a federal investigation into contacts between his campaign officials and Russian government operatives in the lead-up to the 2016 election.", "The \"re-do\" comment wasn't the first time Trump appeared to suggest a violation of constitutionally mandated election norms.", "On July 30, 2020, Trump posted a tweet that seemed to suggest delaying the November 2020 general election, sparking pushback even from his own supporters. In previous instances, Trump has stated that his comments about extending his time in office beyond the two-term limit are jokes.", "Nelson, Casey.   \"Trump Addresses Economy, Other Hot Topics During Oshkosh Visit.\"\r\n    WHBL.   17 August 2020.", "Palma, Bethania.   \"If the US General Election Is Delayed, Does Pelosi Become President?\"\r\n    Snopes.com. 31 July 2020.", "Calabresi, Steven G. \"Trump Might Try to Postpone the Election. That’s Unconstitutional.\"\r\n    The New York Times.   30 July 2020.", "Evon, Dan.   \"Does a Failed Impeachment Nullify Presidential Term, Allow Extra Reelection?\"\r\n    Snopes.com.   1 October 2019.", "Kessler, Glenn.   \"What’s the Evidence for 'Spying' on Trump’s Campaign? Here’s Your Guide.\"\r\n    Washington Post. 6 March 2019.", "KEZI.   \"Bipartisan Senate Report Details Trump Campaign Contacts With Russia In 2016, Adding to Mueller Findings.\"\r\n    18 August 2020.", "Cranley, Ellen.   \"Trump Said He 'Only Jokes' About Trying to Serve a Third Term.\"\r\n    Business Insider.   23 June 2019.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]