["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, as conspiracy theories swirled about former Microsoft CEO Bill Gates' alleged connections to the COVID-19 coronavirus disease pandemic, images supposedly showing an eerie quote ostensibly uttered by him circulated on social media.", "Text from a February 1997 issue of George magazine was presented in such a way that suggested Gates had said an \"over-populated planet\" would be \"choked to extinction by a lung-attacking virus\":", "Practically the only thing connecting Gates to the quote in this image is the neon green line drawn between them.", "The above-displayed images are both genuine and both come from the February 1997 issue of George, a magazine founded by John F. Kennedy, Jr. and published between 1995 and 2001. Although this issue does feature a lengthy interview with Gates, the quote featured here comes from an entirely different article.", "The February 1997 issue of George magazine included a \"Survival Guide to the Future\" that featured various commentators describing how the world was \"now\" and providing their thoughts on what the world would be like in 2020. The actual article, titled \"A Nation's Future Foretold,\" was divided into themed sections such as transportation, education, environment, crime, warfare, and food. The quote shown in the viral image comes from the disease section of this article. Here's a screenshot from a digital copy of the magazine, which more clearly shows the author of this text:", "The end of the article comes after a page break, where you can read the pull-quote in context:", "Gates did not write that an \"over-populated planet\" would be \"choked to extinction by a lung-attacking virus.\" This article was actually written by poet and science writer Arno Karlen.", "However, social media users did find an actual quote from Gates in this issue of George that they presented as equally controversial as the \"lung-attacking virus\" quote.  A second image showing an excerpt from this issue appears to show Gates talking about \"funding population control\":", "This, again, is a genuine image from the February 1997 issue of George magazine. And this time, it is a genuine quote from Gates. He made this comment shortly after he was asked about how he keeps his personal opinions separate from his business decisions:", "While this quote is often shared as if it revealed some secret and nefarious plot from the former Microsoft CEO, the truth is a bit more mundane.", "This quote was widely circulated by those who adhere to the idea that Gates was using the COVID-19 pandemic to give himself an opportunity to microchip the population via vaccines. The above-displayed quote shows, according to proponents of this conspiracy theory, that Gates has long been planning to take control of the global population. We took a deeper look into the \"ID2020\" conspiracy theory here.", "However, the term \"population control\" isn't as literal as it may seem in this context. This term was widely used in the 1970s and '80s, but it fell out of fashion in the '90s and was replaced by terms such as \"reproductive health,\" \"family planning,\" and \"women's empowerment.\"", "In writing about the United Nations International Conference on Population and Development in 1994, the Christian Science Monitor noted a major philosophical difference between that year's conference and conferences from years past:", "If there is a major philosophical difference in the 1994 version of the once-a-decade international conference on population, it is the shift from \"population control\" to \"women's empowerment\" — especially in areas of reproductive health, education, and economic opportunities, which planners of the UN conference see as closely linked to fertility rates.", "\"Economic growth and improvement of quality of life have been fastest in those areas where women have higher status, and slowest where they face the greatest disadvantages,\" states the draft \"Programme of Action\" now being debated in New York.", "Gates' quote in this 1997 interview may have been a bit outdated, but it was not indicative of a nefarious plot to enslave humankind. Rather, Gates was noting his charitable work with global organizations that support reproductive health programs.", "For example, in 1997, the year this interview was published, the Gates Foundation awarded a $2.2 million grant to Johns Hopkins University to \"support the Institute for Population and Reproductive Health to strengthen leadership and institutions in the developing countries.\" Two years later in 1999, Bill and Melinda Gates donated $2.2 billion to United Nations Population Fund (UNFPA).", "Forbes explored Gates' thinking on \"population control\" in a 2011 profile:", "That same epiphany for his public health philanthropy came even earlier. Bill’s dad had set up a dinner at Seattle’s posh Columbia Tower Club with the Program for Appropriate Technology in Health (PATH). While the meeting started with birth control — among other efforts, PATH taught Chinese condom makers to test their products before shipping them — Gates began consuming data that startled him. In society after society, he saw, when the mortality rate falls — specifically, below 10 deaths per 1,000 people — the birth rate follows, and population growth stabilizes. \"It goes against common sense,\" Gates says. Most parents don’t choose to have eight children because they want to have big families, it turns out, but because they know many of their children will die.", "\"If a mother and father know their child is going to live to adulthood, they start to naturally reduce their population size,\" says Melinda.", "In terms of giving, Gates did a 180-degree turn. Rather than prevent births, he would aim his billions at saving the kids already born. “We moved pretty heavily into vaccines once we understood that,” says Gates.", "Knickerbrocker, Brad.   \"Managing Population Growth.\"\r\n    6 April 1994.", "Leonard, Andrew.   \"Is Bill Gates a Closet Liberal?\"\r\n    Salon.   February 1999.", "Bill & Melinda Gates Foundation.   \"UN Population Fund Hails Bill and Melinda Gates' $2.2 Billion Donation to Fund Population and Health Activities Worldwide.\"\r\n    February 1999.", "Herper, Matthew.   \"With Vaccines, Bill Gates Changes The World Again.\"\r\n    Forbes.   2 November 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]