["As part of its effort to curb high prescription drug costs, the Trump administration is considering an experiment that has triggered strong opposition from Americans for Tax Reform, Grover Norquist’s powerful conservative organization, which the president typically counts among his supporters.", "One of the most visible elements of the group’s battle plan is a nationwide commercial, on which it has spent almost half a million dollars, according to estimates by ad tracker iSpot.tv. It has been on the air since May.", "The Americans for Tax Reform’s ad begins with President Donald Trump saying, \"America will never be a socialist country.\"", "It then quickly pivots to take aim at the administration.", "\"You're right, Mr. President,\" the ad continues. \"But the Department of Health and Human Services is considering a plan to adopt socialist price controls from foreign countries.\"", "That led us to wonder if the organization’s take is an accurate description.", "The ad is referring to an initiative being considered by the administration that would be part of the president’s promise to curb high drug prices. Though not expected to launch until 2020 at the earliest, it would test-drive the effectiveness of setting price limits on what the federal government pays for prescription drugs. It would tie some payments in Medicare Part B — which covers hospital and physician-administered drugs — to prices charged in other countries, mostly in Europe. The trial would be limited to brand-name medicines that are responsible for a high percentage of Part B spending.", "We contacted Americans for Tax Reform to find out the basis for this claim. John Kartch, a spokesman, said, \"Price controls themselves are socialist\" and argued that they constitute a \"fundamental building block of state control of the economy.\"", "But independent experts we spoke to said this characterization, while politically powerful, is misleading.", "\"Socialism,\" as defined by Merriam-Webster, involves \"collective or governmental ownership and administration of the means of production and distribution of goods.\" In this case, the label doesn’t accurately reflect distinctions in how different countries handle drug pricing and neglects to consider important context about the American pharmaceutical market.", "HHS is still deciding which countries it might include in its \"international pricing index,\" or IPI. Under consideration are Austria, Belgium, Canada, the Czech Republic, Denmark, Finland, France, Germany, Greece, Ireland, Italy, Japan, the Netherlands and the United Kingdom.", "Some of those nations may use strategies that could be termed \"socialist.\" Also on the list, though, are countries that use market-based approaches, experts said.", "\"Each of these countries has a complex set of decision points, and they’re not the same,\" said Stacie Dusetzina, associate professor of health policy at Vanderbilt University.", "In Germany, for instance, the first year a drug is on the market, the manufacturer can set its own price. After that, an independent board assesses the drug’s added clinical value, which is used to determine what the country’s nonprofit insurance plans – known as sickness funds – will pay. That, drug pricing experts said, is hardly \"socialism.\"", "Even the \"price control\" phrasing is suspect, some argued.", "That’s because, while the IPI countries vary in strategy, many do not dictate what a pharmaceutical company charges for a drug, said Rachel Sachs, an associate professor of law at Washington University in St. Louis, who studies drug pricing. Rather, she said, they are simply saying what the national insurance plan will pay.", "Some of the countries in question also maintain private insurance systems beyond the government plan. For instance, in Canada, people have options, depending on the province where they live, of various forms of public and private prescription drug coverage, which differ in generosity. Therefore, what the government pays for a drug doesn’t necessarily dictate arrangements negotiated between drug companies and other insurers.", "Plus, experts said, the advertisement’s framing ignores the role the U.S. government already plays in shaping the pharmaceutical market.", "Currently, Medicare Part B cannot negotiate lower prices, and it is required to cover drugs that come to market. Drug patents, meanwhile, give manufacturers monopolies over their products for a certain amount of time – and the power to charge higher prices. Together, that means the government has no bargaining power, while drugmakers can set the prices where they want.", "\"We really need to take a look at our own system, and it’s quite far removed from a free market,\" said Ameet Sarpatwari, an epidemiologist and lawyer at Harvard Medical School, who studies drug-pricing regulations.", "Some argued that incorporating the IPI into Medicare Part B payments might actually inject more, not less, competition into the current payment system. The administration has made this argument, too. For instance, when we contacted HHS for comment, a spokeswoman directed us to this speech by Secretary Alex Azar as well as this  December blog post, both of which outline how this approach would strengthen the U.S. bargaining position by setting Medicare's rates more in line with those of other nations.", "Finally, there’s the issue of whether the United States would actually be \"adopting\" strategies used by other countries. Using their prices as a reference point isn’t the same thing as importing their regulatory system.", "The \"socialist price control\" label is one of a few commonly deployed arguments against efforts to curb drug prices – one that’s \"effective but misleading,\" Sarpatwari argued.", "Other claims in the advertisement – that HHS’ proposal would reduce pharmaceutical innovation and limit access to life-saving medical treatments – are also popular attack lines.", "There isn’t a good body of research to suggest this would happen. Sachs suggested that, if prices come down, there would likely be some impact on either drug access or innovation. Assessing the magnitude of those changes is difficult at best, though. And, she said, it would be balanced against people who are, under the changed system, newly able to afford treatment.", "There are other issues, experts noted. One challenge: getting accurate data about what other countries pay for drugs. Another: finding a strategy to force manufacturers to accept the lower price.", "But those aren’t concerns Americans for Tax Reform chose to emphasize. Given the experimental nature of what the administration is considering, they’re also issues HHS could learn from and address based on how things go, Dusetzina said.", "The advertisement in question claims that HHS \"is considering a plan to adopt socialist price controls from foreign countries.\"", "HHS is weighing a strategy that would take into account prices paid in other countries to set amounts paid by the Medicare program. But the advertisement’s language – in particular, the phrase \"adopt socialist price controls\" – is reductive, inaccurate and misleading, experts said. These strategies do not necessarily constitute \"price controls.\" And while some could conceivably be viewed as \"socialist,\" it is inaccurate to suggest all of them are.", "Furthermore, the claim ignores important context about the American drug-pricing market.", "This claim contains an element of truth but ignores critical facts, and is in some cases actively misleading. We rate it Mostly False.", "\"HHS Plan,\" TV advertisement.", "Department of Health and Human Services, \"International Pricing Index Model for Medicare Part B Drugs,\" Oct. 25, 2018.", "Department of Health and Human Services, \"How the IPI Model Would Introduce New Market Competition to Medicare Drug Spending,\" Dec. 6, 2018.", "Commonwealth Fund, \"International Health Care System Profiles,\" July 11, 2019.", "Kaiser Health News, \"Trump Adds A Global Pricing Plan To Wide Attack On Drug Prices, But Doubts Persist,\" Oct. 26, 2018.", "The Los Angeles Times, \"German Patients Get The Latest Drugs For Just $11. Can Such A Model Work In The U.S.?\" June 19, 2019.", "Speech by HHS Secretary Alex Azar, Jan. 15, 2019.", "Email interview with John Kartch, vice president of communications at Americans for Tax Reform, July 12, 2019.", "Telephone interview with Stacie Dusetzina, associate professor of health policy at Vanderbilt University, July 12, 2019.", "Telephone interview with Robin Osborn, vice president and director of The Commonwealth Fund's International Health Policy and Practice Innovations program, July 12, 2019.", "Telephone interview with Rachel Sachs, associate professor of law at Washington University in St. Louis, July 12, 2019.", "Telephone interview with Ameet Sarpatwari, instructor at Harvard Medical School, July 11, 2019.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]