["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The \"horse girl\" stereotype includes such traits as a waist-length french braid and an affection for collecting a stable of plastic horse figurines. Horse girls are supposed to love horses, not misinformation. But it’s perhaps a big-hearted penchant for ponies that has led us to this moment: social media users indiscriminately amplifying a post that wrongly claims dozens of horses need to be saved from imminent death.", "\"ANYONE WITH A FARM WANT FREE HORSES,\" begins a message that is being widely shared on Facebook. \"FREE HORSES!!!! 52 thoroughbred horses need homes. Will go to Sugarcreek this Sat. for slaughter. Gentleman died due to COVID-19 and his son wants nothing to do with them. Most broodmares are broke and some are in foal weanling, yearlings, 2 yrs. and 3 yrs. old most are gelded. FREE and papered. Friend of the deceased is trying to find homes. (XXX) XXX-XXXX in Texas. Please copy and paste this on your status. I would hate to see all these horses put down. PLEASE someone help they are FREE and papered!!!!!!!!!\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Please don’t call the number listed in the Facebook post. We’ve replaced it with Xes here, but it might not matter. Other versions of the message are appearing on Facebook with the same promise of 52 thoroughbred horses who need homes but with different phone numbers and locations. This one claims they’re in Fairhill, Md. In 2012, a version of this post claimed the horses were in the United Kingdom.", "Yes, 2012! Well before the coronavirus pandemic. COVID-19 didn’t exist when Snopes fact-checked what was already an out-of-date plea about the horses that originated after a longtime horse breeder in Ohio died in January 2011. His friend used Facebook to rehome the animals.", "We rate this Facebook post False.", "Facebook post, June 14, 2020", "Facebook post, June 6, 2020", "Mashable, Let’s take a moment to appreciate people with horse girl energy, July 27, 2018", "Snopes, Did 52 thoroughbred horses need new homes to escape slaughter, Feb. 3, 2011", "DRF, Daniel Sterms, Ohio racing fixture, dead, Jan. 28, 2011", "The Horse, 52 thoroughbreds find homes via Facebook, Feb. 3, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]