["Multiple Facebook posts including this one, which has been viewed more than 160,000 times and shared more than 11,000 times since it was published on November 9, 2018, contain a 4 min 13 sec video.", "The clip shows a group of women in black headscarves playing instruments and singing a religious song whose words mention the Hindu god Ram.", "The post’s caption says, in Hindi: “Muslim women in Dubai sang Hindu religious songs inside a mosque and their sheikh husbands clapped their efforts and participated with them.”", "Below is a screenshot of the misleading Facebook post:", "The video with the same caption has been shared elsewhere on Facebook, for example here and here, on Twitter here and on YouTube here.", "A reverse image search found that the original video was shot on July 10, 2012 in the southern Indian village of Puttaparthi, at the ashram of an influential Hindu guru called Sathya Sai Baba, who died in 2011.", "Here is the spiritual leader’s website and here is an AFP report on his death.", "The clip in the misleading post appears from 43:58 in a longer YouTube video published here on Radiosai.org, the website of Sathya Sai Baba’s official media channel.", "Below is the full video of the performance:", "The original video contains a title that says, in English: “Sarva Dharma Swarupa Sai. Music concert by the pilgrims from MIDDLE EAST & GULF. 10 July 2012”.", "Both the misleading clip and the original video have a white watermark in the bottom-left corner which says: “radiosai.org”.", "Below is an image comparing screenshots of the misleading Facebook post (L) with the original video (R):", "The original video’s caption on Radio Sai’s YouTube channel says, in part: “Devotees from Bahrain, Iran, Kuwait, Oman, Qatar, Saudi Arabia, Syria, Turkey and United Arab Emirates, provided an Arabic flavour in Prasanthi Nilayam”.", "Prasanthi Nilayam refers to the ashram in Puttaparthi, located here on Google Maps.", "AFP published images from the same ashram in Puttaparthi at Sathya Sai Baba’s funeral in April 2011, for example here and here on AFP’s image forum site.", "By analysing multiple AFP images from different angles, architectural features can be identified that match the misleading video.", "Examples of these features include the golden chandeliers, a square pattern on the ceiling, the pink decorative top of the columns and the translucent awning on the side of the hall.", "These similarities are highlighted in the image below, which compares screenshots from the misleading video (L) with AFP images (R):", "A news website run by Sathya Sai Baba’s ashram also reported here that a group from the Middle East and Gulf visited the site and played a concert on July 10, 2012.", "Below is a screenshot of the report:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]