["“COVID regulations have been declared illegal across Canada,” a September 8, 2020 Facebook post claims. “It is now a crime to impose masking, social distancing, quarantines, mandatory testing and vaccinating,” it continues.", "Nearly identical claims were made in posts shared thousands of times, including here and here. The claim was also shared in Spanish, including here.", "The posts include references to the Republic of Kanata, and some link to a YouTube video featuring a man who identifies himself as Kevin Annett.", "Annett describes himself as one of the three national conveners of the Republic of Kanata. A former pastor in the United Church, Annett was removed from the ministry in 1997.", "Asked about Annett, Stephane Shank, a media relations officer with the Canadian government, told AFP in an email: “‘Republic of Kanata’ is not a legitimate government or lawmaking body.”", "Shank also affirmed: “The Government of Canada, provincial and territorial governments, as well as municipalities may introduce measures to reduce the spread of Covid-19, as appropriate within their area of jurisdiction.”", "Although provinces and territories are gradually reopening, Health Canada continues to recommend that people practice social distancing and wear non-medical masks or cloth face coverings to help slow the spread of the novel coronavirus which has killed more than 9,100 people nationwide.", "According to a search using the social media monitoring tool CrowdTangle, Annett had earlier claimed to have nullified Covid-19 regulations in the city of Parksville and Qualicum Beach in the province of British Columbia.", "On August 25, posts such as this one shared more than 2,500 times, said: “In an historic act of direct democracy last night, the Oceanside Common Law Assembly (OCLA) passed a Public Safety Bylaw that prohibits COVID restrictions and mandatory distancing, masking, quarantines, and vaccinations anywhere in the communities of Parksville and Qualicum Beach on Canada’s west coast.”", "These posts circulated in several Canadian anti-government Facebook groups.", "Deb Tardiff, the manager of communications for the city of Parksville, said by email, “There is absolutely no truth to this information.”", "“A public safety bylaw was not put in place in Parksville,” she said. “Working with the RCMP, the City of Parksville has indicated there is no such organization as the OCLA, it does not exist.”", "Tardiff said Parksville follows the Covid-19 guidance put out by British Columbia’s provincial health officer.", "This topic was also fact-checked by Lead Stories and Politifact.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]