["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Iowa Republicans have forged ahead with efforts to dramatically change education policy in the state, while Democrats and some education leaders and teachers argue a school choice proposal from Gov. Kim Reynolds would divert money from public school systems that need it now more than ever.", "The push comes after Reynolds highlighted school choice in January during her Condition of the State Address. She argued that parents need flexibility when deciding where their children go to school, especially during a pandemic, but also because available services might vary dramatically from one public school district to another.", "\"School choice shouldn’t be limited to those who have the financial means or are lucky to live in a district that’s confident enough to allow open enrollment,\" Reynolds said during her Jan. 12 address.", "Republicans quickly announced their support and the Iowa Senate passed SF 159 on Thursday, Jan. 28. The Iowa State Education Association, a prominent Iowa teachers’ union, launched a campaignagainst the bill and the Iowa-Nebraska NAACP argued that it disproportionately would disadvantage low-income families of color while hampering desegregation efforts.", "Another opponent was Christina Blackcloud, a Democratic activist from Tama, Iowa, who lost a bid last fall to unseat state Rep. Dean Fisher (R-Montour). Blackcloud tweeted on Jan. 23:", "\"Can I be blunt? The school voucher bill that Republicans are trying to ram through the Iowa Legislature would give your education tax dollars to corporations in the hopes they will magically fix education…\"", "The tweet had been retweeted 190 times and liked by more than 700 people as February started, but would tax dollars usually sent to public schools be sent to corporations? To answer that, we followed the money.", "The Iowa bill would give financial aid for private school tuition and other education costs to a student who otherwise would attend a public school determined by the federal Every Student Succeeds Act as needing \"comprehensive support and improvement.\" The private school also would have to accept the student for enrollment.", "The financial aid would come from a Student First Scholarship Program that the bill would establish. That program would be funded by depositing into an account created for a student opting to attend a private school a portion of the per-pupil state funding that youth’s school district would have received to educate the student.", "A report from the state’s Legislative Services Agency estimates that Iowa’s public school districts would lose $2.1 million that is diverted to private schools in 2023 if the governor’s plan passes.", "The state money is raised through a combination of sources, including property taxes. The bill limits spending that money to \"qualified educational expenses,\" which include tuition but also fees for tests such as advanced placement exams.", "Students opting out of their local public school could use state money to attend either private schools or charter schools. But those schools may or may not be considered corporations.", "Technically, corporations are a group of individuals legally allowed to act as a single entity, and both public school districts and public charter schools are referred to as corporations in Iowa law. But that’s not the common understanding of what a corporation represents.", "In an email exchange with PolitiFact, Blackcloud expressed concern that for-profit education service providers would be allowed to manage charter schools under Reynolds’ plan. She declined to clarify what she meant when describing private and charter schools as \"corporations.\"", "Charter schools are privately run, publicly funded schools. Many are managed by outside organizations, which the Iowa bill calls \"education service providers,\" that can be both for-profit and not-for-profit. SF 159 mandates that charter schools form as not-for-profit education organizations but says nothing about whether the education service providers the schools contract with must be for-profit or not-for-profit.", "The National Alliance for Public Charter Schools reported in 2019 that 12 percent of U.S. charter schools are managed by for-profit companies and 23 percent are managed by not-for-profit companies. The other 65 percent are independently managed.", "In general, though, there’s no indication of how many charter schools in Iowa would be run by for-profit companies if Reynolds’ plan passes, especially as the plan would make forming charter schools much easier. That holds true for private schools as well.", "Blackcloud said, \"The school voucher bill that Republicans are trying to ram through the Iowa Legislature would give your education tax dollars to corporations in the hopes they will magically fix education.\" In its current form, SF 159 reallocates money that normally would be spent in public school systems, instead supporting students attending nonpublic schools. That money would be handed over to schools that, under Iowa law, are considered corporations. But, other not-for-profit options will exist, too, for nonpublic schooling. We rate Blackcloud’s claim as Mostly True.", "Iowa Legislature bill, SF 159", "Tweet from Christina Blackcloud", "Christina Blackcloud’s campaign website", "Iowa law, Chapter 274", "Iowa Gov. Kim Reynolds, Condition of the State Address, Jan. 12, 2021", "Charter Schools, The Iowa Department of Education website", "The Iowa State Education Association, Vouchers Toolkit", "The Iowa-Nebraska NAACP Facebook Page", "Merriam Webster, definition of corporations", "Iowa Public Radio News, \"Iowa Senate passes Reynolds’ education bill,\" by Grant Gerlock, Jan. 29, 2021.", "Des Moines Register, \"Gov. Kim Reynolds released her sweeping ‘school choice’ bill. Here’s what it would do,\" by Ian Richardson, Stephen Gruber-Miller and Samantha Hernandez. Jan. 24, 2021.", "National Alliance for Public Charter Schools’ blog, \"Are charter schools for profit?\" by Kat Sullivan. Jan. 16, 2019.", "National Charter School Resource Center, \"What is a Charter School?\"", "Legislative Services Agency, state of Iowa, fiscal note, SF 159", "Federal law, Every Student Succeeds Act", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]