["The screenshot of the purported newspaper article was published in this post on December 1, 2020.", "It features an image of Sri Lankan Opposition Leader Sajith Premadasa.", "It has been shared more than 360 times.", "The Sinhala-language news item is titled: “We have no faith in the indigenous medicine developed in relation to Covid - Sajith Premadasa”.", "The Sinhala-language text superimposed on the image reads: “When a white man says a cure has been found, these betrayers will accept it with open arms...", "“When a Sinhalese says a local medicine has been found, they complain!!", "“Ill breeding is to blame!!”", "In December 2020, Sri Lankan media reported that a doctor of traditional medicine had found a “cure” for Covid-19, stating clinical tests had found it has a 100% success rate. The medicine was also tried by Sri Lankan Health Minister Pavithra Wanniarachchi, Sri Lankan media site Newswire reported here.", "Sri Lanka Health Promotion Bureau statistics shows that as of December 3, 2020 the total number of  patients who tested positive for Covid-19 in Sri Lanka stood at 25,410.", "The misleading posts criticise Premadasa for allegedly suggesting the purported medicine is not a real cure for Covid-19.", "The image was shared alongside a similar claim on Facebook here, here, here, here and here.", "However, the claim is misleading; the newspaper article has been doctored.", "Closer examination of the purported newspaper article screenshot found the masthead shows the logo of Sinhala daily Lankadeepa. The dateline reads November 30, 2020.", "In response to the misleading posts, a newspaper spokesperson said no such article quoting Premadasa was published in its November 30, 2020 edition.", "“A closer look of the screenshot will also reveal that it is different to the Lankadeepa layout,” the spokesperson said by phone on December 1, 2020.", "A search of the November 30, 2020 edition of Lankadeepa found no article quoting Opposition Leader Sajith Premadasa on purported Covid-19 cure.", "As of December 3, 2020, there is no “cure” for Covid-19 that is recognised by international health bodies.", "Dozens of companies, from biotech start-ups to Big Pharma, are in the race to develop a safe and effective coronavirus vaccine, AFP reported here on December 2.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]