["The image was published on Facebook here on August 29, 2016. The post’s caption reads: “Khalistan airlines.”", "Khalistan is a Sikh political ideology that calls for an independent homeland for Indian Sikhs. The image also shows Khandas, which is a prominent Sikh symbol, on the plane's vertical tail and engines.", "The photo has been circulating on Facebook since at least 2015, including here, here, and here.", "The image was also sent to AFP through its WhatsApp tipline in January 2021 by a user who asked if the photo genuinely showed a Sikh airline that was launched during ongoing protests by predominantly Sikh farmers against new agriculture laws in India.", "The image, however, has been doctored.", "A reverse image search on Google found that the “Khalistan” text and the Sikh symbols have been digitally inserted.", "A similar photo was published here by the Australian Broadcasting Corporation (ABC). The photo shows a Singapore Airlines plane with no Sikh branding.", "The photo is credited to the image hosting website Flickr and is captioned: “Singapore Airlines pilot fails random blood alcohol test in Melbourne.”", "Below is a screenshot comparison of the doctored image (L) and ABC news photo (R)", "A keyword search for “Khalistan Airlines” on flightradar24.com, a live flight tracker and airlines website, also showed there is no such airline.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]