["On December 20, HW News Hindi broadcasted the 7th episode of its daily ‘The Vinod Dua show’ titled – “Nitin Gadkari and options to PM Modi”. In the segment, journalist Vinod Dua claimed that Union Minister of Road Transport and Highway Nitin Gadkari held the BJP government responsible for stalled projects and rising NPAs in the sector.", "This ORIGINAL interview clip exposes Vinod Dua’s Propaganda U Tube video (paid news) against Shri Nitin Gadkari. Please compare the two video clips Propaganda vs Reality.", "Vinod Dua has doctored the interview to make it appear as if the stalled projects and NPA were in Ganga related projects and the fault was of the Modi Government. Where as Shri Gadkari has clearly stated in the interview that all the stalled Projects were road and highway projects caused by the UPA government.", "Posted by Office of Nitin Gadkari on Saturday, 22 December 2018", "Gadkari had given an interview to HW News, which Dua was analysing on his show. Among other aspects, the show carried a clipping of the interview where the BJP MP explained how he revived his sector.", "Based on the clipping used in ‘The Vinod Dua Show’, the journalist inferred, “When he (Nitin Gadkari) was made the minister of a department that was earlier held by Uma Bharti, more than 400 projects were stalled. There were also many loans that were on the verge of turning into NPAs. And he (Nitin Gadkari) believes that the government was also at fault here.”", "“It is clear that resistance has started arising from within the BJP. Till now Yashwant Sinha, Shatrughan Sinha and Arun Shourie raised their voices, but now a leader associated with the RSS is also saying that if the BJP wants to win the next elections, it can no longer just show Prime Minister Modi’s face. They cannot win based on his rallies, you have to bring forward Nitin Gadkari. Nitin Gadkari himself hinted this to our editor Akhilesh Bhargava (translated),” he continued. In the video below, Dua can be heard making the statements up till 1:34 minutes.", "This portrayed Gadkari as holding the BJP government responsible for the stalling of over 400 projects and rising NPAs. The episode is now deleted but an archive of its cached version can be viewed here.", "If one watches the entire interview uploaded by HW News, it is apparent that a clipped portion was used on ‘The Vinod Dua Show’. Gadkari was, in fact, blaming the UPA government for the poor performance of the infrastructure sector.", "HW News had uploaded the video of the Union Minister on December 21 where he was interviewed by the organisation’s Business Editor Akhilesh Bhargava. Gadkari was posed with the question, “When you started out, things were not easy. Work had closed down, over 400 projects were stalled and NPAs were plentiful. In fact, even now the infrastructure sector accounts for 1/4th of the country’s NPAs. How did you revive this sector? (translated)”", "To this, he answered, “When I became in-charge of my department, there were 403 stalled projects…some bank accounts had turned into NPAs and some were about to turn into NPAs…the situation was dire (translated).”", "Gadkari further added, “If I speak honestly, it is true that 75% of the projects that were stalled were because of the government (translated)…” This statement was picked up on ‘The Vinod Dua Show’ to conclude that the BJP minister held his own party responsible for the shortcomings of the infrastructure department.", "However, Gadkari was actually blaming the UPA government, which was in power preceding 2014. His above-mentioned statement was immediately followed by, “The government during that time, the UPA government, did not get environment forest clearances for any project in 2.5 years. If you don’t get environment forest clearance, how will one work? Land acquisition was at 5%. They gave work order but the land was not acquired, encroachment was not removed…and people took projects (translated).” He can be heard making these statements 3:20 minutes onward.", "After HW News aired ‘The Vinod Dua Show’ episode 7, Nitin Gadkari’s official Facebook page shared a video highlighting the errors made by the outlet.", "The union minister also took to Twitter to say that in the last few days he has noticed his statements being twisted in the media. He claimed that this was done to create a wedge between him and the BJP government.", "Let me make it clear once and for all that conspiracies to create a wedge between me and the BJP leadership will never succeed.", "I have been clarifying my position at various forums and shall continue to do so and expose these nefarious designs of our detractors.", "— Nitin Gadkari (@nitin_gadkari) December 23, 2018", "On December 23, HW News took down the episode and put out a clarification saying – “That clip was erroneously sent incomplete to Mr Dua, based on which Mr. Vinod Dua conveyed his comments. Mr Dua sends his anchor links from Delhi and insertions of clips and graphics etc is done in Mumbai.” The outlet added that a corrected version will soon be uploaded.", "A portion of the full interview with Nitin Gadkari was clipped and used in ‘The Vinod Dua Show’ aired by HW News. As the Union Minister’s statements were placed out of context, he seemed to have been speaking against his own party when, in fact, he was he was talking about the UPA government.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]