["About this rating", "“First ever” marijuana death stories are popular, but almost universally misreported. Adding to this voluminous genre was a story published in November 2017 in the Reno Gazette Journal which, after copious aggregation and sharing, was reported under a Fox News byline on the New York Post website as:", "Baby boy is reportedly first pot overdose death.", "The claim originated from a March 2017 case report about a Colorado infant who died in 2015 from myocarditis, an inflammation of heart tissue that can in some cases lead to cardiac arrest.The infant, forensic tests showed, had been exposed to marijuana at some point two to six days prior to his death.", "Case reports like this are, by their nature, descriptive accounts of phenomena seen by practicing doctors which they then deem novel enough to report to the broader scientific community. They are not in-depth scientific investigations that could be used to provide an official cause of death.", "Despite this, when the Reno Gazette Journal first reported on the case study on 16 November 2017, they inaccurately suggested that the doctors 1) had claimed to prove a causal relationship between marijuana and the boy's death; and 2) that the doctors claimed that this was the first ever reported case of a marijuana overdose:", "Two poison control doctors claim to have documented the first known case of death by marijuana overdose, sparking a medical debate over what killed an 11-month-old baby in Colorado two years ago.", "Neither assertion is true. The authors do not claim to have documented the first “pot overdose death” but instead is proposed this case to be the first infant death associated with cannabis exposure:", "As of this writing, this is the first reported pediatric death associated with cannabis exposure.", "The authors were not claiming to document cause, only an association, and their literature review regarding death from cannabis exposure was necessarily limited to infants.", "Claims of the \"first ever\" death from marijuana are frequently made by scientists or doctors regarding adults, heavily reported on by media, and often rejected by the larger scientific community.", "This doctors behind this case report did not make such a bold claim, they merely wrote a narrative account of a boy who died within a window of time plausibly related to marijuana ingestion, and made a note of it for the scientific community so that, should similar accounts emerge, further study can be justified:", "Given two rare occurrences with a clear temporal relationship – the recent exposure to cannabis and the myocarditis-associated cardiac arrest – we believe there exists a plausible relationship that justifies further research into cannabis-associated cardiotoxicity and related practice adjustments.", "As we have written about in detail, there have been a number of case studies and reviews suggesting that marijuana — which causes an increase in blood pressure among other things — has triggered, or could be associated with, increased risk of heart attacks in adults with other known risk factors. Death from direct cannabis toxicity is widely considered to be impossible, and the U.S. Drug Enforcement Agency (and other foreign health organizations) says that there have been no official documented cases of marijuana overdose.", "Speaking to the Washington Post, Thomas Nappe, an author of the case study who is now the director of medical toxicology at St. Luke’s University Health Network in Bethlehem, Pennsylvania, said their work was fatally misinterpreted:", "“We are absolutely not saying that marijuana killed that child.” [...]", "Nappe [...] explained that the doctors simply observed this unusual sequence of events, documented it and alerted the medical community that it is worth studying a possible relationship between cannabis and the child’s cause of death, myocarditis, or inflammation of the heart muscle.", "Because the assertions made by the scientists in the case study do not align in anyway with the study's more sensationalized coverage, we rank the claim that this paper conclusively attributed a Colorado infants death to cannabis for the first time as false.", "Rittiman, Brandon.   \"Colorado Doctors Claim Baby Boy Is First Marijuana Overdose Death.\"\r\n    Reno Gazette Journal.   16 November 2017.", "Nappe, Thomas M., and Hoyte, Christopher, O.   \"Pediatric Death Due to Myocarditis After Exposure to Cannabis.\"\r\n    Clinical Practice and Cases in Emergency Medicine.   16 March 2017.", "Gonenc, Kocabay, et al.   \"Acute Inferior Myocardial Infarction Due to Cannabis Smoking in a Young Man.\"\r\n    Journal of Cardiovascular Medicine.   September 2009.", "Mukamal, Kenneth J., et al.   \"An Exploratory Prospective Study of Marijuana Use and Mortality Following Acute Myocardial Infarction.\"\r\n    American Heart Journal.   March 2008.", "Mittleman, Murray A., et al.   \"Triggering Myocardial Infarction by Marijuana.\"\r\n    Circulation.   12 June 2001.", "Lindsay, Alistair C., et al.   \"Cannabis as a Precipitant of Cardiovascular Emergencies.\"\r\n    International Journal of Cardiology.   20 September 2005.", "Salkeld, Luke.   \"Devout Christian Mother-of-three, 31, Becomes First Woman in Britain to Die from Cannabis Poisoning After Smoking a Joint in Bed to Help Her Sleep.\"\r\n    Daily Mail.   30 January 2014.", "Rahhal, Natalie.   \"First Ever Fatal Marijuana Overdose Reported in Colorado: Doctors Claim the Drug Killed an Infant Who Ate Some of His Parent's Stash.\"\r\n    Daily Mail.   16 November 2017.", "UK Department of Health.   “A Summary of the Health Harms of Drugs.\"\r\n    August 2011.", "US Drug Enforcement Agency.   “Drug Fact Sheet: Marijuana.\"\r\n    Accessed 17 November 2017.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]