["About this rating", "Among the many controversies that have swirled around the administration of President Donald Trump since its inception are its characterization of inaccurate information as \"alternative facts\" and the engagement of Trump's daughter Ivanka as a presidential adviser despite her lack of experience in government and politics.", "Those two controversies coalesced in a meme holding that Ivanka Trump had once proclaimed that \"perception is more important than reality\" and then had amplified that remark by saying, \"If someone perceives something to be true, it is more important than if it is in fact true. This doesn't mean you should be duplicitous or deceitful, but don't go our of your way to correct a false assumption if it plays to your advantage\":", "The meme attributes these words to The Trump Card: Playing to Win in Work and Life, a 2009 \"self-help book aimed at helping women achieve success in work and life,\" by Ivanka Trump  (written well before her father was elected president).  That passage does in fact appear in the book, as illustrated below:", "Authorship of The Trump Card is credited solely to Ivanka Trump, but given the prevalent use of uncredited ghostwriters and co-authors in the publishing industry for works from celebrities, we can't say for certain whether Trump herself wrote this statement exactly as presented.  Nonetheless, it is accurate to say that those words are correctly attributed to her.", "Trump, Ivanka.   The Trump Card: Playing to Win in Work and Life.\r\n    Touchstone, 2009.   ISBN 978-1439140017.", "Merica, Dan et al.   \"Ivanka Trump Is Making Her White House Job Official.\"\r\n    CNN.   30 March 2017.", "Mayer, Jane.   \"Donald Trump's Ghostwriter Tells All.\"\r\n    The New Yorker.    18 July 2016.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]