["About this rating", "In June 2017, according to The New York Times, a Kenyan villager spotted a white giraffe while herding animals near the Ishaqbini Hirola Conservancy in northeast Kenya. Conservationists and rangers, following up on reports of this sighting, later discovered the completely white female giraffe and her pale calf. Video of the encounter produced what was thought to be the “first known video footage of white giraffes” and went viral in September 2017:", "Later, a male white giraffe was discovered with the pair. The animals’ coloring, scientists say, came not from albinism — a condition that prevents pigmentation of the skin, other soft tissues, and eyes — but from leucism, a similar condition that leaves eyes unaffected.", "Mohammed Ahmednoor, manager of the reserve that contained the white giraffes, told CNN that the exceedingly rare giraffes were valuable not only because of the draw they had with tourists, but because of what could be learned from them about this rare condition scientifically.", "On March 10, 2020, the Ishaqbini Hirola Conservancy where the giraffes made their home announced on Twitter that both the female and her calf had been killed, apparently by poachers:", "Kenya's only female white giraffe and her calf have been confirmed dead in Ora, Gaiissa County. Her death was confirmed today by community members and rangers of Ishaqbini Hirola Community Conservancy.", "According to images sent in by the community, the giraffe was in a skeletal state after being killed by armed poachers.", "Wildlife officials said that giraffes hadn’t been seen for some time and they estimated the remains had been in place for at least four months, according to CNN. The Conservancy reported that only one white giraffe, the male, remained after the attack:", "Her calf was the second birth reported in August last year, resulting in a family of three white giraffes. After this incident, only a lone bull remains.", "Because the organization that monitors these animals announced it themselves, we rate the claim that poachers killed the only female white giraffe and her calf in Kenya as “True.”", "Joseph, Yonette.   \"Rare White Giraffes Cause a Stir in Kenya.\"\r\n    The New York Times.   16 September 2017.", "Fleck, K., et al.   \"From Single Nucleotide Substitutions up to Chromosomal Deletions: Genetic Pause of Leucism-Associated Disorders in Animals.\"\r\n    Berl Munch Tierarztl Wochenschr..   July 2016.", "Guzman, Francisco, and Brian Ries.   \"Rare White Giraffes Killed by Poachers at Kenyan Wildlife Sanctuary.\"\r\n    CNN.   10 March 2020.", "Ishaqbini Hirola Community Conservancy.   \"Kenya’s White Giraffe and Calf Confirmed Dead.\"\r\n    10 March 2020.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]