["The one-minute 24-second video was published on Facebook here on May 30, 2020.", "The video features two women and a man speaking in Hindi. They can be heard criticising the hospital's management of the COVID-19 ward.", "GRAPHIC", "Show", "Hide", "The post’s Hindi-language caption translates to English as: “Have a little shame, Kejiriwal. This is crossing the limit now. Let us know if you can not handle it, we will request for the president's rule then.”", "Kejriwal refers to Delhi’s Chief Minister Arvind Kejriwal.", "The video was also shared alongside a similar claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "The claim is misleading.", "At the end of the footage, one of the women names the facility as KEM, the acronym for the government-run King Edward Memorial Hospital in Mumbai.", "Further keyword searches found that the same video was widely circulated in media reports -- for example, here, here and here -- about alleged mismanagement inside KEM’s COVID-19 ward.", "Local politicians also took notice of the situation after the video was shared prominently online.", "Sachin Sawant -- a local spokesperson for the Indian National Congress, the political party in power in Mumbai -- said on Twitter that the footage was recorded during a sudden strike of KEM employees.", "“Please check the background of the video posted here. If the people's representatives will start questioning the administration and making allegations, there will be panic among the people. At the same time, such efforts would weaken the morale of doctors, nurses, and other staff who risk their lives. But who will understand this?,” Sawant said.", "Sawant's tweet included a screenshot of a statement addressing the footage from the Brihanmumbai Municipal Corporation, Mumbai’s civic body, that was released on May 27, 2020.", "The tweet was posted in response to queries raised here on Twitter by Ram Kadam, a local politician in the opposition Bharatiya Janata Party.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]