["“तिबत में बादल जमीन पर आके रुक गया।अद्भुत नजारा। (Clouds stopped in the middle of the road in Tibet.)” – is a message viral on social media along with a video. Among those who shared it is the editor-in-chief of Newstrack, Yogesh Mishra, who also used the hashtag #Kashmir.", "तिबत में बादल जमीन पर आके रुक गया।अद्भुत नजारा।#Kashmir #mausam #Ymblog pic.twitter.com/B7dN2AvWaX", "— Yogesh Mishra (@iYogeshMishra) November 1, 2019", "The claim is viral on both Facebook and Twitter.", "A few users have also shared the video using a caption in English – “Cloud sitting on road at Tibet.”", "Entertainment website Latestly had written an article on the video in September 2018, also claiming that it shows ‘clouds’.", "American TV host Ken Rutkowski was among those who shared the video in 2018, tweeting, “This natural phenomenon is very rare.”", "The clouds in Xinjiang China fell to the ground! The truck drivers are afraid to move forward(due to the water vapor in the cloud being too heavy).This natural phenomenon is very rare pic.twitter.com/B3alndxMkG", "— Ken Rutkowski (@kenradio) September 26, 2018", "Upon reverse-searching one of the frames on Yandex, Alt News was redirected to a Croatian website according to the which the video shows a desert storm. This article was published on July 4, 2016, and claims that the event took place in China.", "While Alt News was unable to independently verify the location, a close look at the video makes it evident that the mass is not made of clouds. There’s a distinct difference in the shade of the clouds visible in the sky and the mass on the road, which is wheatish brown in colour.", "Furthermore, there are several such videos of sandstorms available on YouTube.", "The phenomenon has also been reported in the media where similar images can be seen.", "Wall of sand as high as 100 meters roars through Inner Mongolia Monday for over 40 min; visibility less than 10 m pic.twitter.com/zUNxWxIBIG", "— China Xinhua News (@XHNews) May 24, 2016", "The misinformation was debunked by ABP News in 2018 when the channel spoke with Mahesh Palawat, meteorologist at Skymet Weather Services. “When clouds descend to the ground, the phenomenon is called ‘Cloud Resting on Ground’ or fog. But this is a sandstorm,” he informed.", "The video viral on social media does not show cloud cover on the road but sandstorm.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]