["A campaign flyer attacking Rep. Ron Saunders, front.", "Nothing says kiss of death in a Democratic primary like a candidate looking cozy with Republican Gov. Rick Scott. And that’s what a recent mailer attacking state Rep. Ron Saunders does in a competitive South Florida state Senate battle.\n\nThe mailer shows a cartoon image of Saunders, the House’s Democratic minority leader from Key West, grinning and shaking hands with Scott as if they are best buds.\n\n\"As a state representative, Ron Saunders made the choice to stand with Rick Scott. Now he’s asking you to send him back to Tallahassee as your state senator. When you see Ron Saunders, tell him that supporting Rick Scott was the wrong choice.\"\n\nThe mailer also states that Saunders \"has helped\" Scott to:\n\n• \"Take money from public schools by expanding vouchers\"\n\n• \"Make college less accessible by restricting Bright Futures scholarships\"\n\n• \"Give extra tax breaks to the wealthiest Floridians while so many families are struggling\"\n\nSaunders is running in a crowded Democratic state Senate primary that includes state Rep. Dwight Bullard of Miami. Bullard comes from a political dynasty: His mother Larcenia Bullard is a state senator and his dad Edward is a former state legislator. The newly drawn District 39 spans Miami-Dade, Monroe, Collier and Hendry counties.\n\nThe mailer was sent by Tomorrow’s Vision of Florida, an electioneering communication organization formed by Edward and Larcenia Bullard in July. We made multiple attempts to reach Dwight, Edward and Larcenia Bullard and did not hear back.\n\nFor this article, we will check if Saunders voted as the mailer claims. And we will also explore whether those votes mean Saunders \"made the choice to stand with Rick Scott.\"\n\n\"Take money from public schools by expanding vouchers\"\n\nThe mailer cites two votes for this claim.\n\n• SB 2126: This 2010 bill made changes to Florida’s Tax Credit Scholarship program, which allows corporate donors to fund private-school scholarships for poor children in return for tax breaks. It passed the House 95-23 on April 8, 2010 -- months before Scott was elected governor. Saunders voted with the majority in favor, while Rep. Dwight Bullard voted against it. Gov. Charlie Crist approved the bill, which expanded the program by increasing the pool of eligible families and raising the cap on tax credits.\n\n• HB 859: This 2012 bill also made some changes to the same tax credit program, by again increasing the cap and removing the requirement that foster care students meet certain income requirements. Saunders voted in favor with the majority when it passed the house 92-24 on March 7, 2012, and it became law.\n\nRep. Dwight Bullard voted no on this bill. A note of irony here: Sen. Larcenia Bullard voted yes in the majority when this passed the Senate. She’s now vice president of the committee criticizing Saunders for voting the same way.\n\nWith the tax credits, the state doesn’t technically write the check: A business writes a check to a nonprofit for the scholarship and then the business gets a tax credit -- money that would have otherwise gone to state coffers, including some for education.\n\nSaunders said the scholarships, which he supports, cost less than the per pupil funding for public schools, so he argues that it saves money. The Collins Center for Public Policy concluded in a 2007 report that the tax credit program \"did not have a negative impact upon K-12 General Fund Revenues for public education\" and saved the difference between the value of the scholarship and the value of K-12 per pupil revenue.\n\n\"Make college less accessible by restricting Bright Futures scholarships\"\n\nThe mailer cites one vote, on HB 5201. This postsecondary education funding bill included several changes for Bright Futures, the college scholarships designed to keep students at Florida schools.\n\nAmong the changes were reducing the scholarship by $1 per credit hour and tightening eligibility requirements in an effort to save money amid a budget shortfall. The bill passed the house 93-26 on April 30, 2010 -- a few months before Scott was elected governor. It passed the Senate and Crist approved it. But here’s the interesting part: Both Saunders and Bullard voted no.\n\n\"Give extra tax breaks to the wealthiest Floridians while so many families are struggling\"\n\nThe mailer cites two votes:\n\n• HB 913: This bill passed April 6, 2010, a few months before Scott was elected governor. This bill gave a tax break for the purchase of airplanes by fractional owners. There were approximately 385 Florida owners of fractional airplane interests in 2006. This passed the House 109-7 with Saunders voting \"yes\" with the majority, and Rep. Dwight Bullard voting no. What made it into law was an economic development bill, SB 1752, that included the aircraft provision and that passed the House and Senate unanimously.\n\n• HB 7185: This vote made some changes related to corporate income taxes. It passed the Senate unanimously on May 3, 2011, and then two days later passed the house 110-5. Saunders voted in the majority -- as did Bullard. (About a week earlier they split their vote on a version of the bill, with Saunders voting yes and Bullard no.) The bill updates the Florida Income Tax Code to reflect changes made by Congress. Florida businesses with taxable income of less than $25,000 will not have to pay any tax, staff analysis stated. The Tampa Bay Times wrote that the bill resulted in a tax break of $1,100 a year on average for 15,000 small businesses as first step in effort to cut the state's annual $2 billion corporate tax.\n\nNeither of these bills were partisan in nature or unique to Scott’s agenda; both passed with overwhelming majorities in both chambers.\n\nSaunders response\n\nThe biggest weapon in this mailer is the overall theme of telling Democratic primary voters that Saunders stands with Scott and helped him achieve legislative victories.\n\nThat message isn’t true, Saunders argued. As the Democratic leader, it's Saunders job to bash Scott’s proposals, as he did in his responses to Scott’s State of the State addresses in 2011 and 2012.\n\nSaunders also said that he -- and Bullard -- were recognized by the liberal group Progress Florida as being among the 27 \"middle class champions\" in 2012. These champions voted against bills that would hurt the middle class including \"Gov. Scott's anti-middle class budget (which) continues to dramatically underfund Florida's public schools,\" Progress Florida wrote.\n\n Our ruling\n\nAn electioneering communication organization headed by state Rep. Dwight Bullard’s father said that one of his son’s opponents, State Rep. Ron Saunders \"has helped Gov. Rick Scott.\" Let’s review their evidence for each one:\n\n\"Take money from public schools by expanding vouchers\": This is the only part of the mailer that comes anywhere close to truth. The mailer cites two votes Saunders took to expand tax credits. But the mailer omits any explanation about the minimal impact on public school funding.\n\n \"Make college less accessible by restricting Bright Futures scholarships\": The mailer cites a vote that trimmed Bright Futures, which Saunders voted against. So the mailer fails to support this argument.\n\n \"Give extra tax breaks to the wealthiest Floridians while so many families are struggling\": Saunders voted to provide a tax credit for people who share airplanes, but this was a very narrow tax break for a tiny group of people. He also voted to reduce the state’s corporate income taxes.\n\nWhat is most misleading about this ad is the broader message that Saunders made a choice to \"stand\" with Scott. Did Saunders vote for some bills that Scott signed into law? Yep -- but that doesn’t mean he supports Scott’s overall agenda. It’s a ridiculous idea that the Democratic minority leader is \"supporting\" Scott and \"helped\" the Republican governor in any concrete way.\n\nIt is that overall message here and the images of Saunders and Scott shaking hands -- not the nitty gritty votes in small print -- that will catch voters’ eyes. For that misleading characterization, and the criticisms we noted about the bills cited, we rate this claim False.", "Tomorrow’s Vision of Florida, Mailer, August 2012\n\nFlorida Division of Elections,Tomorrow’s Vision of Florida documents, July 2012\n\nFlorida House, Senate Bill 2126 Florida Tax Credit Scholarship Program and House vote, April 8, 2010\n\nFlorida House, House Bill 859, Florida Tax Credit Scholarship Program and House vote on March 7, 2012 and Senate voteon March 9, 2012\n\nFlorida House, House Bill 913 Tax on sales, use and other transactions and House vote, April 6, 2010\n\nFlorida House, Senate Bill 1752 Economic development and House vote, April 30, 2010\n\nFlorida House, House Bill 1785 Corporate income tax House vote, May 5, 2011\n\nFlorida House, House Bill 965 Florida Tax Credit Scholarship Program House vote, May 2, 2011\n\nCollins Center for Public Policy, \"Florida’s Corporate Income Tax Credit Scholarship Program: Updated fiscal analysis,\"February 2007\n\nStep Up For Students, Links to reports by other entities about fiscal impact of tax credit program, 2002-2012\n\nHouse Democratic leader state Rep. Ron Saunders, Response to Gov. Rick Scott’s State of the State address, March 8, 2011\n\nTampa Bay Times The Buzz blog, \"House Democrats respond to Scott’s speech,\" Jan. 10, 2012\n\nProgress Florida, Middle Class Champions, 2012\n\nProgress Florida, Middle Class Champions, 2011\n\nPolitiFact, \"Group claims Gelber is against scholarships for Jewish schools,\"Oct. 29, 2010\n\nTampa Bay Times,\"Legislation runs deeper than SB 6,\" May 3, 2010\n\nTampa Bay Times, \"Tax goodies bill carries jobs label,\" Accessed in Nexis, April 28, 2010\n\nMiami Herald, \"No tax hikes, but some cuts,\" March 11, 2012\n\nMiami Herald, \"Senate senate race becomes a rematch between the Bullards and Saunders,\" Aug. 6, 2012\n\nInterview, Jon East, spokesman for Step Up for Students, Aug. 8, 2012\n\nInterview, Cheryl Etters, spokeswoman for the Florida Department of Education, Aug. 8, 2012\n\nInterview, Mark Hollis, spokesman for Florida House Democrats, Aug. 8, 2012\n\nInterview, Damien Filer, political director for Progress Florida, Aug. 8, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]