["About this rating", "On 11 March 2016 a schedule Chicago rally for Republican presidential candidate Donald Trump was canceled after a spate of protests, and a few days later Trump took to Twitter to pin blame for the unrest on supporters of Democratic candidate Bernie Sanders. That tweet supposedly prompted a scathing retort from Sanders himself:", "Bernie Sanders is lying when he says his disruptors aren't told to go to my events. Be careful Bernie, or my supporters will go to yours!", "— Donald J. Trump (@realDonaldTrump) March 13, 2016", "Not long after Trump sent the controversial tweet Twitter and Facebook were awash in shares of what appeared to be a clever retort from Sen. Sanders, reproduced above. In response to Trump's accusation, Sanders purportedly said:", "Send them. They deserve to see what a real honest politician sounds like.", "On initial inspection, the image of these tweets as presented was suspect. The tweets exhibited slight variations that wouldn't have appeared in genuine screenshots, namely that Sanders' name appeared in bolder print, and the \"Verified\" checkmark in his tweet was not to scale when compared with the Trump tweet. The alleged reply tweet also didn't appear on Sanders' \"with replies\" Twitter timeline, and the first relevant reference to the controversy wasn't published on that feed until several hours after the 10:30 AM timestamp shown on the image:", "Trump should tone down his rhetoric and condemn the violence of some of his supporters. pic.twitter.com/HfYL3hoMqk — Bernie Sanders (@BernieSanders) March 13, 2016", "On 14 March 2016, Sanders tweeted a less specific jab at Republicans, and Trump in particular:", "If you want a candidate who will defeat Trump or some other Republican, you are looking at him. pic.twitter.com/KYDuadpfa5", "— Bernie Sanders (@BernieSanders) March 14, 2016", "So, while the first part of this political meme reproduced a genuine Donald Trump tweet, the purported response from Sanders was fabricated. The senator from Vermont indeed chastised Trump for both his tone and the accusation, but not in a tweet challenging Trump to \"send [his supporters]\" to Sanders' rallies. On 12 March 2016, Sanders released an official statement via his web site about the matter:", "As is the case virtually every day, Donald Trump is showing the American people that he is a pathological liar. Obviously, while I appreciate that we had supporters at Trump’s rally in Chicago, our campaign did not organize the protests. What caused the protests at Trump’s rally is a candidate that has promoted hatred and division against Latinos, Muslims, women, and people with disabilities, and his birther attacks against the legitimacy of President Obama. What caused the violence at Trump’s rally is a campaign whose words and actions have encouraged it on the part of his supporters. He recently said of a protester, ‘I want to punch him in the face.’ Another time Trump yearned for the old days when the protester would have been punched and 'carried out on a stretcher.’ Then just a few days ago a female reporter apparently was assaulted by his campaign manager. When that is what the Trump campaign is doing, we should not be surprised that there is a response. What Donald Trump must do now is stop provoking violence and make it clear to his supporters that people who attend his rallies or protest should not be assaulted, should not be punched, should not be kicked. In America people have a right to attend a political rally without fear of physical harm.", "On 15 March 2016, a reader forwarded us what was likely the original source of the meme, which issued  from a Twitter account associated with Sanders supporters but not the official Sanders campaign:", "@realDonaldTrump Send them. They deserve to see what an honest politician sounds like.", "— Millennials 4 Bernie (@Bernlennials) March 13, 2016", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]