["About this rating", "A technology known as thermoradiative photovoltaics could one day harvest electrical energy from the night sky in much the same way that solar panels tap energy from the sky, according to research published in a 2020 concept paper.", "At the time of this writing, such technology does not exist on the market, nor has it been made available to the public for broader energy production. Published work describing the “anti-solar panels” was purely theoretical in nature.", "A new technology touted as having the ability to harvest energy from the night sky may some day bridge gaps left by solar energy.", "That's according to researchers at the University of California Davis who designed so-called “anti-solar panels” and described them in a 2020 concept in the peer-reviewed scientific journal ACS Photonics. The idea took steam again on the internet on Feb. 20, 2021, when British internet media company Unilad published an article describing the “anti-solar panels” that could “generate power at night.”", "Traditional solar panels are made up of small photovoltaic, or solar, cells. These electrical components generate electricity through the absorption of light. By taking this technology and flipping it, the researchers said the potential exists to generate about 50 watts of power per square meter — about a quarter of that generated by a conventional solar panel in the daytime.", "Ultimately, small photovoltaic cells in a solar panel deliver power because the radiation source, the sun, is very hot and the solar cell, in comparison, is cool. The solar panel thus attracts energy from the sun to convert it into electrical power. But photovoltaics can only generate electricity during daylight hours. So, how can solar technology be deployed to produce electrical power after the sun has set?", "It's a new field known as radiative cooling, and the technology was described in a concept paper, so it's important to note that it is theoretical in nature. But under this theory, an object that is hot compared to its surroundings will radiate heat as infrared light. The sun is hot, so heat from it radiates to a conventional solar cell on Earth, which is cooler in comparison. Thermoradiative photovoltaics uses this same concept to traditionally absorb heat from surrounding hot objects, like a generator’s cooling tower or an engine's exhaust pipe, and convert it into energy.", "A conventional photovoltaic or solar cell (left) absorbs photons of light from the sun and generates an electrical current. A thermoradiative cell (right) generates electrical current as it radiates heat toward the extreme cold of deep space. Tristan Deppe, Jeremy Munday/UC Davis", "But the theory proposed by UC Davis researchers turns thermoradiative panels on Earth into these so-called hot objects and quite literally points them at a cold object, for example, the night sky. Space is cold, so a warm object pointed at the night sky will radiate heat toward it to convert heat into electricity through photons, or light cells.", "“A regular solar cell generates power by absorbing sunlight, which causes a voltage to appear across the device and for current to flow. In these new devices, light is instead emitted and the current and voltage go in the opposite direction, but you still generate power,” said lead researcher Jeremy Munday in a university news release at the time. “You have to use different materials, but the physics is the same.”", "Humans have been using similar technologies for thousands of years in design choices for their structures. For example, indigenous communities in the Southwest have created adobe homes that slowly warm up during the day and give off heat at night to regulate the interior heat. In more modern times, white paint is used to coat the roofs of buildings to reflect sunlight and reduce heat during the day.", "And though the actual device has not yet been developed, researchers concluded that generating carbon-neutral power at night will help in the global push for carbon neutrality, paving way for new technologies that can produce clean energy around the clock.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]