["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Beirut's port area lies in ruins following a massive explosion on Aug. 4, 2020. (AP)", "A viral video purports to show a missile hitting a building in Beirut’s harbor right before the massive explosion.", "Digital analysts debunk the video as a crude fake.", "A video of Beirut’s harbor moments before the huge blast that leveled the area purports to show a missile strike. At about the four-second mark, a long, white object flashes in from the upper left corner. A massive explosion follows.", "The video has been shared thousands of times on Facebook and Twitter. (Many instances of the video have been removed from both platforms.)", "Don’t be fooled.", "Digital forensics professor Hany Farid at the University of California-Berkeley said \"it is clearly and obviously a fake.\"", "\"If you watch the video frame by frame, you will notice a few things that clearly illustrate it to be a crude fake,\" Farid said.", "The missile disappears before the explosion, Farid said, and there is no motion blur on the missile, which, he said, you would see given the speed a missile travels. And, Farid continued, the missile looks identical in each frame.", "\"This is a tell-tale sign of a crude copy-paste manipulation in which the missile was pasted into each successive frame,\" Farid said.", "In freeze-frame, the missile also is bent in the middle.", "Image from fake video. (Screenshot)", "Jeffrey Lewis, a missile expert at the Middlebury Institute of International Studies, told the AP, \"it’s basically a cartoon missile that doesn’t look anything like a real missile striking a target.\"", "There is at least one other manipulated video that claims to show a missile strike causing the blast.", "The latest reports out of Beirut say the cause was a fire that ignited 2,750 tons of ammonium nitrate, a fertilizer with great explosive potential, that had been stored in a warehouse since 2014. Ammonium nitrate is the chemical used in the 1995 Oklahoma City bombing that killed 168 people at a federal building.", "There is no evidence that a missile triggered the blast. This is False.", "Facebook, post, Aug. 6, 2020", "AP, Video showing ‘missile’ in Beirut blast was manipulated, Aug. 6, 2020", "Reuters, Fact check: Beirut explosion video has been doctored to include fake missile, Aug. 6, 2020", "BBC, Beirut explosion: What we know so far, Aug. 6, 2020", "Oklahoma Historical Society, Oklahoma City bombing, accessed Aug. 7, 2020", "Email exchange, Hany Farid, professor, UC Berkeley School of Information, Aug. 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]