["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The GOP is attempting to link Senate hopeful and U.S. Rep. Patrick Murphy to the third rail of Florida politics, saying he wants to cut both Social Security and Medicare.", "Playing off questions about Murphy’s job history, the National Republican Senatorial Committee created a website called RealMurphyResume.com. The site spins a partisan look at the Jupiter Democrat’s qualifications and policy positions, and says one of his priorities was to \"Advocate for cuts to Social Security and Medicare.\"", "When we first looked over the website on Sept. 7, 2016, we wondered if Murphy really did say he wanted to cut the two programs for seniors. The evidence doesn’t suggest that’s the case.", "‘Structural changes’", "The NRSC told PolitiFact Florida that Murphy had said as much in a CNN interview on Jan. 2, 2013 — the day before he started his first term in the U.S. House of Representatives.", "CNN anchor Ashleigh Banfield asked Murphy what he was prepared to do to find common ground in a partisan Congress that had begrudgingly reached a compromise over budget negotiations — a situation usually referred to as the \"fiscal cliff.\" The House had passed a bipartisan agreement on Jan. 1 that fended off big income tax increases on most Americans and prevented huge cuts in defense spending and other programs.", "In the interview, Murphy said he wanted to help the House make \"big choices\" to move ahead without similar battles in the future. When Banfield asked him what those choices were, he said he didn’t think Congress should continue to delay action on passing a budget or shoring up benefits programs.", "\"Unfortunately, we have to look at cuts across the board,\" he said. \"We're going to have to look at defense. We're going to have to look at some structural changes to some programs like Social Security and Medicare.\"", "He went on to say he wanted to eliminate \"fraud, waste and abuse.\" He said he thought his CPA training would be helpful in going through the budget to find the best places to cut. Later in the interview, Banfield asked Murphy if he would break away from his party on any issue during negotiations, and where he thought Congress could make \"painful cuts\" if needed.", "\"You know, I think we're going to have to make some structural changes to programs such as Social Security, Medicare, Medicaid,\" he answered. \"We're going to have to make sure they're sustainable for years to come.\"", "The NRSC did not provide any more evidence of Murphy’s position on Social Security and Medicare.", "Murphy’s primary opponent in this year’s Senate race, U.S. Rep. Alan Grayson, had used this same line of attack, editing the quote to, \"We have to look at cuts across the board, uh, to some programs like Social Security and Medicare.\"", "But in full context, Murphy said \"structural changes,\" which is not the same as cuts. We couldn’t find any clear evidence that Murphy had voted for or advanced any legislation that would have cut the programs.", "His campaign told us Murphy was referring to raising the taxable income limit for the payroll tax, and allowing the government to negotiate with pharmaceutical companies over drug prices.", "There are some examples of Murphy wanting to prevent cuts to the programs.", "On Murphy’s 2012 campaign website — archived on the Wayback Machine — he vowed to protect both Social Security and Medicare. He said he would fight attempts to privatize Social Security and cut the program, and oppose moving Medicare patients to the open market.", "Three weeks after joining the House, Murphy offered a motion to change a debt ceiling bill in order to prevent future benefit changes for seniors and veterans. The failed motion sought to keep Congress from changing Medicare to a voucher plan and privatizing Social Security in 2014 budget negotiations. He subsequently made similar actions through his term, although many of them failed in the Republican-led House.", "In August 2014, Murphy spoke out about increasing the taxable income limit for the payroll tax, which was $117,000. Income above that threshold is not subject to the payroll tax that funds Social Security. Taxing income above that would bring more money into the program.", "\"If you’re going to be honest about addressing Social Security you have to, I think, take a broad approach to it and look at all options. That is the easiest option, raising that cap to a larger number,\" Murphy said.", "He signed onto a bipartisan letter to the Centers for Medicare and Medicaid Services in March 2015, asking the agency to abandon proposed cuts to Medicare Advantage. CMS decided to increase Medicare Advantage payments instead.", "Our ruling", "The National Republican Senatorial Committee said Murphy advocated for \"cuts to Social Security and Medicare.\"", "The attack focused on one interview from before Murphy officially joined Congress. While Murphy said cuts were possible, he pointed out Congress will need to focus on \"structural changes\" to the two programs. Murphy’s efforts to protect Social Security and Medicare have focused on protecting seniors and veterans, but we didn’t find any clear evidence he has endorsed or voted for legislation to cut current or future benefits.", "We rate the statement False.", "National Republican Senatorial Committee, RealMurphyResume.com, accessed Sept. 7, 2016", "New York Times, \"Divided House Passes Tax Deal in End to Latest Fiscal Standoff,\" Jan. 1, 2013", "PolitiFact, \"Fiscal cliff deal gets to heart of Obama’s tax promises,\" Jan. 2, 2013", "YouTube.com, Murphy Interview on CNN Newsroom, Jan. 2, 2013", "U.S. Government Publishing Office, \"Congressional Record — House,\" Jan. 23, 2013", "TCPalm.com, \"Robert McElroy: Murphy's congressional motion bold, but could cause problems with Republicans later,\" Jan. 31, 2013", "PolitiFact Wisconsin, \"U.S. Rep. Paul Ryan says fiscal cliff deal is largest tax increase ever,\" March 15th, 2013", "Palm Beach Post, \"Murphy open to extending payroll tax to incomes above $117,000 as part of Social Security fix,\" Aug. 13, 2014", "Sunshine State News, \"Murphy, Buchanan Lead the Charge Against Obama's Medicare Advantage Cut,\" March 15, 2015", "Palm Beach Post, \"Medicare Advantage news for 2016 better than feared, lawmakers say,\" April 6, 2015", "PolitiFact Florida, \"A guide to the attacks on Patrick Murphy’s resume,\" June 29, 2016", "Palm Beach Post, \"Democrat Alan Grayson’s TV ad edits Patrick Murphy answer on Social Security,\" Aug. 5, 2016", "Federal News Service, Andrea Mitchell Reports transcript, Nov. 21, 2012, accessed via Nexis", "Finance Wire, CNN Newsroom transcript, Jan. 2, 2013, accessed via Nexis", "Congress.gov, HR 325, accessed Sept. 7, 2016", "Interview with Greg Blair, NRSC spokesman, Sept. 7, 2016", "Interview with Galia Slayen, Murphy spokeswoman, Sept. 7, 2016", "Interview with Joshua Karp, Murphy spokesman, Sept. 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]