["About this rating", "This tale about a pastor who goes \"undercover\" as a homeless man is reminiscent of an urban legend based on the true story of an experiment conducted for a social psychology class at Princeton University in 1970, in which seminary students were sent on urgent assignments designed to take them past an actor posing as a person in need of assistance. Researchers measured whether (and how) students interrupted their pressing tasks to render help, and analyzed the results.In the story reproduced above, the actor portraying a homeless man is no psychology researcher, however — he's Jeremiah Steepek, the new head pastor of a very large church. After spending half an hour incognito in his new church prior to services and finding that only a very few congregants would even return his greeting (much less respond to his pleas for money to buy food), he reveals himself to his new flock and delivers to them a lesson in Christian compassion.", "But as for this particular version of the \"incognito clergyman\" tale, it appears to be a fabricated story. No one has yet identified a real pastor by the name of Jeremiah Steepek (or a similar variant of that name) or found any church, large or small, headed by a pastor with that name. Nor has anyone been able to verify the event described, even though it was supposedly witnessed by several thousand congregants.", "Additionally, the photograph of \"Pastor Jeremiah Steepek\" that accompanies the online version of this story is complete unrelated to the narrative: it's actually a picture of an unidentified homeless man snapped by photographer Brad J. Gerrard in Richmond (London):", "I was walking down the street in Richmond, saw this man talking to someone, could see he was quite a picture in the making. On the way back, when he was free I had a short conversation with the gentleman and he agreed to let me photograph him. I liked the result. He was very friendly.", "Although this particular narrative about a Pastor Jeremiah Steepek may be an invented one, the gist of the tale was expressed in some real-life incidents that took place in 2013. In June 2013, the Rev. Willie Lyle, the newly-appointed pastor of the Sango United Methodist Church in Clarksville, Tennessee, spent four and a half days living in the streets in the guise of a homeless man. He then transformed back into his role as pastor as he delivered a sermon:", "In a dream, God told Willie that he needed to live on the streets of Clarksville as a homeless and hungry person. He challenged Willie to experience firsthand just what it was like to have nothing — no home, no money, no friends, no food on even a semi-regular basis, no nothing.Pastor Willie's wife, Suzette, dropped him off in downtown Clarksville early Monday morning, June 17, and he lived on the street through the morning of Friday, June 21. In those four and a half days, he learned a great deal about the homeless, the working poor who face hunger daily and those in need of spiritual and emotional help. It was not comfortable.", "Early morning on June 23, Willie lay under a tree on the church lawn covered up by a big overcoat. He still had not shaved or combed his hair. He wondered how many people would approach him and offer him food, or a place to sit inside an air conditioned room, or just see how they could help. Twenty people spoke to him and offered some type of assistance.", "While he preached, his daughter-in-law cut his hair and his daughter helped shave off his scruffy beard. He changed shoes, and beneath the overcoat, he was wearing his Sunday clothes. He put on a tie and his suit coat, all the while continuing to preach his message. Before the 200 people gathered that morning, he went from looking like a homeless person to the new pastor of the congregation.", "The sermon title was \"The Least Used Parts of the Body\" and based on I Corinthians 12:12-15. According to Pastor Lyle, \"Often the least used parts of the body are the ones that mean the most, like our heart and mind. We need to understand that there are no small or least used parts in the body of Christ.", "\"Too many of us only want to serve God one hour each week. That doesn't cut it. That is not God's plan.\"", "Similarly, in November 2013 Mormon bishop David Musselman posed as a homeless man and interacted with congregants outside a Taylorsville, Utah, church before services one Sunday:", "Members of a Mormon congregation in a Salt Lake City suburb encountered someone they thought was a homeless man at church on Sunday. What they did not know was the man was a bishop for The Church of Jesus Christ of Latter-day Saints.At least five people asked David Musselman to leave the church property in Taylorsville, some gave him money and most were indifferent.", "He said he disguised himself as a homeless man to teach his congregation a lesson about compassion. To make his appearance more convincing, he contacted a Salt Lake City makeup artist to transform his familiar face to that of a stranger not even his family recognized.", "\"The main thing I was trying to get across was we don't need to be so quick to judge,\" Musselman said.", "He received varied reactions to his appearance at church, he said.", "\"Many actually went out of their way to purposefully ignore me, and they wouldn't even make eye contact,\" he said. \"I'd approach them and say, 'Happy Thanksgiving.' Many of them I wouldn't ask for any food or any kind of money, and their inability to even acknowledge me being there was very surprising.\"", "Bishop Musselman told only his second counselor that he would be disguised as a homeless man. The bishop purposefully walked to the front of the chapel and sat in the front row at the beginning of sacrament meeting. After his counselor's talk, the bishop had his counselor lean forward over the stand and he asked through a whisper if he could say a few words.", "We also note that the plot of this anecdote is somewhat similar to an episode from the opening of In His Steps: What Would Jesus Do?, a best-selling 1897 book by Charles Monroe Sheldon (which features a real jobless man shaming a congregation and their pastor for their lack of compassion towards him, rather than a pastor pretending to be jobless in order to test his congregation):", "The main character is the Rev. Henry Maxwell, pastor of the First Church of Raymond, who challenges his congregation to not do anything for a whole year without first asking: \"What Would Jesus Do?\"The novel begins on a Friday morning when a man out of work appears at the front door of Henry Maxwell while the latter is preparing for that Sunday's upcoming sermon. Maxwell listens to the man's helpless plea briefly before brushing him away and closing the door. The same man appears in church at the end of the Sunday sermon, walks up to \"the open space in front of the pulpit,\" and faces the people. No one stops him. He quietly but frankly confronts the congregation — \"I'm not complaining; just stating facts\" — about their compassion, or apathetic lack thereof, for the jobless like him. Upon finishing his address to the congregation, he collapses, and dies a few days later.", "That next Sunday, Henry Maxwell, deeply moved by the events of the past week, presents a challenge to his congregation: \"Do not do anything without first asking, 'What would Jesus do?'\" This challenge is the theme of the novel and is the driving force of the plot. From this point on, the rest of the novel consists of certain episodes that focus on individual characters as their lives are transformed by the challenge.", "Parrish, Tim.   \"Pastor Goes Undercover for 5 Days As Homeless Man.\"\r\n    USA Today.   24 July 2013.", "Parrish, Tim.   \"Tenn. Pastor Goes Undercover As Homeless Man for Week.\"\r\n    WBIR-TV [Knoxville, TN].   8 July 2013.", "Stevens, Abby.   \"Mormon Bishop Disguises Himself as Homeless Man .\"\r\n    Deseret News.   27 November 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]