["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late April 2020, social media users shared a link to a column published by The Irish Times, a daily newspaper based in Dublin, Ireland. The headline and summary of the article contained commentary scathing enough to prompt some readers to ask Snopes if it was real:\n\nThe Irish Times column is real and was published on April 25, 2020. Written by columnist Fintan O'Toole, the full text of the article was obscured from some readers behind a paywall on the newspaper's site. However, it was pasted either in part or in full onto third-party websites and social media posts, or aggregated by other news media outlets, which prompted readers to ask about its authenticity and origin.", "The piece was a condemnation of U.S. President Donald Trump's leadership during the COVID-19 coronavirus disease pandemic.", "\"Over more than two centuries, the United States has stirred a very wide range of feelings in the rest of the world: love and hatred, fear and hope, envy and contempt, awe and anger. But there is one emotion that has never been directed towards the US until now: pity,\" O'Toole wrote. \"However bad things are for most other rich democracies, it is hard not to feel sorry for Americans. Most of them did not vote for Donald Trump in 2016. Yet they are locked down with a malignant narcissist who, instead of protecting his people from Covid-19, has amplified its lethality. The country Trump promised to make great again has never in its history seemed so pitiful.\"", "As of this writing, the Centers for Disease Control and Prevention (CDC) reports there are more than 980,000 known COVID-19 cases in the U.S. and upwards of 55,000 fatalities.", "O'Toole, Fintan. \"Donald Trump has Destroyed the Country He Promised to Make Great Again.\"\r\n  The Irish Times. 25 April 2020.", "Benen, Steve. \"Trump's Disinfectant Comments Lead to 'Stifled Giggles' Abroad.\"\r\n  MSNBC. 27 April 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]