["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Lt. Gov. Jeff Kottkamp, a Republican running for attorney general, is trying to push back against criticisms that he's a politician first and lawyer second by highlighting his success in the courtroom.\n\nAt a July 31, 2010, debate with GOP rivals Holly Benson and Pam Bondi, Kottkamp said that he'd put his legal experience up against anyone running.\n\nThen he offered his proof. \"I've taken on the federal government,\" Kottkamp said. \"And won.\"\n\nWe wanted to see if Kottkamp is accurately describing his legal career.\n\nAccording to the Florida Constitution, the state attorney general must have been a member of the bar of Florida for the preceding five years. That's a standard Kottkamp must, and does, meet.\n\nKottkamp attended the University of Florida College of Law and received his Juris Doctor degree in 1987. He clerked for U.S. District Court Judge Joe Eaton and U.S. District Court Judge Sidney Aronovitz. From 1991-2005, he was a shareholder in the Fort Myers firm of Henderson, Franklin, Starnes & Holt, and before becoming lieutenant governor, he spent a brief time as a partner at Morgan & Morgan. Kottkamp remains a member in good standing with the Florida Bar.\n\nKottkamp's campaign pointed us to case from the 1990s to back up his claim.\n\nWhat follows is an account cobbled together from court documents of the case, Robert B. Reich vs. John C. Davis, P.A.", "In that case Kottkamp represented John C. Davis, a Fort Myers Beach accountant who was sued by the U.S. Department of Labor for firing two employees. Darlene Smiley and Cynthia Fellows claimed that they were terminated for speaking up about not getting paid overtime.\n\nDavis paid overtime during tax season -- roughly January to April -- but offered only compensation time the rest of the year, Smiley and Fellows said. When Smiley asked Davis to pay her the money she was entitled in the fall of 1986, Davis refused.\n\nSo Smiley complained to the Department of Labor.\n\nInvestigators interviewed both Smiley and Fellows and determined Davis needed to pay. He did, and then promptly fired both Smiley and Fellows.\n\nIn court, the Labor Department claimed that Davis violated the Fair Labor Standards Act and argued that the two women should be offered their jobs back.\n\nDavis, through his attorney Kottkamp, said that while the overtime controversy was one of the reasons Smiley and Fellows were fired, they would have been fired anyway, because of poor work habits and poor work product.\n\nIn a 1993 ruling, the U.S. District Court for the Middle District of Florida sided with Davis, saying that Smiley and Fellows were not fired because they complained about the overtime. The district court's ruling actually was vacated on appeal in 1995 because the appellate court determined that the complaints were a reason the women were fired. But the appellate court said that as long the complaints were not the only reason, Davis acted lawfully.\n\nThe case returned to district court and quickly was dismissed, giving Kottkamp the victory he claims over the feds.\n\nKottkamp said during a televised debate that he has taken on the federal government as a lawyer and won.\n\nIn the 1990s, Kottkamp represented an accountant who was sued by the U.S. Department of Labor for allegedly violating the Fair Labor Standards Act. Kottkamp successfully argued that the man fired two employees legally.\n\nFor that, we rate his claim True.", "Bay News 9/CFN 13, attorney general debate, July 31, 2010\n\nFlorida Constitution\n\nLt. Gov. Jeff Kottkamp official biography\n\nJeff Kottkamp campaign, e-mail interview with David Bishop, Aug. 6, 2010\n\nFlorida Bar, member search, accessed Aug. 11, 2010\n\nLexis-Nexis courts, Robert B. Reich vs. John C. Davis, accessed Aug. 11, 2010\n\nPACER, U.S. District Court docket 94-02075, accessed Aug. 11, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]