["The video was posted here on TikTok on January 10, 2021. It has been viewed more than 3.6 million times.", "It shows passengers screaming as the aircraft shakes violently. Items can be seen falling out of the cabin's overhead compartments.", "“Verily we belong to Allah, and verily to Him do we return. I seek forgiveness from Allah, oh Allah,” the post's Indonesian-language caption reads.", "The post’s hashtags translate to English as “Plane crash” and “condolences”, while text superimposed on the video reads, “The situation on the plane that crashed yesterday.”", "Indonesia’s Sriwijaya Air Flight SJ 182, carrying 62 people on board, crashed into the Java Sea near Jakarta’s airport on January 9, 2021.", "The video has been viewed more than nine million times after appearing on TikTok here and here alongside a similar claim.", "The claim, however, is false.", "An online search found the TikTok video previously appeared in this video posted on the YouTube channel of Euronews on June 18, 2019. The video is titled: “Turbulence captured on video by passenger on Kosovo-Switzerland flight.”", "Euronews also published a report on the incident with the same headline.", "“A passenger on a flight from Kosovo to Switzerland has captured the moment a plane hit a severe pocket of turbulence,” the article reads.", "“Ten people were injured in the incident aboard the ALK Airlines flight from Pristina to Basel, including a member of cabin crew who was thrown into the ceiling.”", "ALK Airlines is a Bulgarian-based airline.", "The same video of the incident was also posted here on the YouTube channel of video agency Storyful on June 17, 2019. It credits the video to passenger Mirjeta Basha.", "Below is a screenshot comparison of the video in the misleading post (L) and the Euronews video (R):", "Multiple other false social media posts about the Sriwijaya Air crash, shared here and here on Facebook; and here and here on YouTube, also included the AKL Airlines video spliced together with a video of turbulence on an Etihad Airways plane in 2016 or a clip of the Ethiopian Airlines crash in 1996.", "AFP debunked the Etihad Airways video here and the Ethiopian Airlines clip here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]