["About this rating", "Two of the favorite targets of disreputable, right-wing web sites are the Black Lives Matter movement and the \"mainstream liberal news media.\" In February 2018, the MediaConservative.com web site republished a fabricated story that ticked both those boxes.", "The story attacked a purportedly prominent member of Black Lives Matter named Marquesha Johnson, accusing her of \"organizing over 900 events and gather[ing] millions of dollars in donations\" to escape homelessness and purchase a million-dollar home with donations solicited to help the social justice movement. MediaConservative wrote:", "In fact, the donations [Johnson] collected helped only herself to “rise” in society. A class action lawsuit, stated that Johnson had “solicited donations from vulnerable people to help others but instead used it to help herself.”", "According to the document, the Black Lives Matter leading figure, purchased a $1.2 million home for herself. But this is not all, instead of using the donations to help people she also bought herself a brand new Range rover as well as some “other exorbitancies”.", "The post rehashes a story originally published in November 2017 by the \"satirical\" web site ReaganWasRight.com, which falsely reported:", "Unfortunately, it’s likely that what she did was perfectly legal because she solicited the funds through a GoFundMe campaign and the company is notoriously bad at working with police to crack down on scammers. Johnson was questioned by police, but denies misusing funds. She refuses to hand over records.", "We found no evidence that corroborates any of these claims, which were also circulated on the ConservativeStand.com web site.", "The ReaganWasRight.com article linked to a federal court records database, but there is no record there of any lawsuit against a Marquesha Johnson. In fact, we could find no evidence of a leading Black Lives Matter campaigner of that name.", "The image used in all three articles does not show \"Marquesha Johnson\" and her \"$1.2 million home.\" In fact, it is a composite of a police photograph of Temitope Adebamiro, a Delaware woman sentenced to four years in prison in 2016 for stabbing her husband to death, and a photograph of Las Ventanas Al Paraiso, a resort in Los Cabos, Mexico, owned by the billionaire Ty Warner.", "In other words, the story and the accompanying photo are both outright fabrications.", "ConservativeStand.com publishes sensationalist right-wing content, and has a disclaimer stating the authors don't guarantee the accuracy of what they publish:", "All the information on this website is published in good faith and for general information purpose only. ConservativeStand does not make any warranties about the completeness, reliability and accuracy of this information.", "ReaganWasRight.com, the original source of the fabricated \"Marquesha Johnson\" story, is run by Christopher Blair, a well-known purveyor of fake news and so-called satire who is also behind the web sites Last Line of Defense, Freedum Junkshun and As American As Apple Pie.", "In a disclaimer on ReaganWasRight.com, Blair makes it clear that nothing published on the web site is to be taken as accurate:", "Reagan Was Right is a whimsical playland of conservative satire…Everything on this web site is fiction.", "Despite claims of satire from these sites, it's not at all clear what this particular article is satirizing, or where the humor is in a false story about a black woman activist stealing millions of dollars which had been donated in good faith to a prominent social justice movement.", "The article simply plays into common negative, false portrayals of the Black Lives Matter movement as betraying African-Americans.", "Masulli Reyes, Jessica.  \"Wife Gets 4 Years After Murdered Husband's Past Unfolds.\"\r\n  The News Journal (Delaware.)  15 December 2016.", "Stone, Madeline.  \"Outrageous Perks at this $35,000-a-Night Mansion Include the Option to Program Your Own Fireworks Show.\"\r\n  Business Insider.  13 August 2016.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]