["A video of a woman dancing to the Hindi song ‘Hawa Hawai’ in the presence of other women is widespread online. Madhya Pradesh Youth Congress shared the video on Facebook with a sarcastic remark suggesting this was during a National Health Mission, Madhya Pradesh meeting on COVID-19. “What is happening Shivraj ji,” MP Congress questioned state chief minister and BJP leader Shivraj Singh Chauhan.", "भोपाल में राष्ट्रीय स्वास्थ्य मिशन की कार्यशाला में कोरोना पर गंभीर चर्चा..!", "– शिवराज जी ये क्या हो रहा है..?", "Posted by Madhya Pradesh Youth Congress on Friday, 19 March 2021", "Congress leader from Maharashtra Khizar Parwaiz Khan, state secretary of IT and social media department of Congress MP Kamesh Shivhare, state spokesperson of MPCC Narendra Saluja and MPCC general secretary Satyanarayan Patel were among the Congres members who shared the video.", "राष्ट्रीय स्वास्थ्य मिशन की कार्यशाला में कोरोना पर गंभीर चर्चा।#मध्यप्रदेश@INCMP pic.twitter.com/S8Hh1I6ouV", "— Kamesh Shivhare INC (@KameshShivhare3) March 19, 2021", "Journalist Mohammed Sartaj Alam and parody Twitter account @NewsVulgar also circulated the video.", "राष्ट्रीय स्वास्थ्य मिशन की मीटिंग में कोरोना पर गंभीर चर्चा ।। मध्यप्रदेश शिवराज सरकार जबलपुर की पूर्व कलेक्टर छबि भारद्वाज जी भी उपस्थित है 😂👌🏻👇👇 pic.twitter.com/1f37NIIPh6", "— Vulgar_news (@NewsVulgar) March 21, 2021", "According to a report in Dainik Bhaskar, the video shows female workers of the National Health Mission (NHM), Bhopal celebrating women’s day. The report says that the video has drawn criticism since the women neither followed social distancing norms nor had they worn masks. NHM MD Chavi Bharadwaj said that the event was held in the conference hall due to COVID. The local administration has clarified that the celebrations were held on March 8 and the video is being circulated with misleading claims.", "ETV Bharat Haryana also reported NHM’s statement that the event was held for entertainment purpose.", "A video of women employees of National Health Mission, Madhya Pradesh dancing on women’s day celebrations was shared by several Congress members with the false claim that the video depicts a meeting on coronavirus pandemic.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]