["About this rating", "After the conclusion of the second presidential debate held at Washington University in St. Louis on 9 October 2016, multiple fashionistas identified the fuchsia blouse worn by Melania Trump at that event as an $1,100 silk crepe de chine creation by the fashion giant, Gucci — a style of blouse known as a \"pussy bow\" (supposedly because the bow at the throat resembles ones commonly tied around cats’ necks).", "And as Mashable (and others) pointed out, the choice of blouse may have been poorly-timed, given that an audio tape of Donald Trump's talking in lewd terms about women had been leaked just days earlier:", "The wardrobe selection comes only two days after a 2005 video showed Donald Trump saying, \"Grab them by the pussy\" when referring to women he predatorily pursued.", "Melania's choice of clothing was in all likelihood a total coincidence. (Or a soon-to-be-fired stylist is smirking somewhere.) The style is a common accoutrement on women's blouses, and one favored by the likes of former U.K. Prime Minister Margaret Thatcher and legendary designer Coco Chanel.", "Coincidence? Trolling IRL? You decide, America.", "An online shopping page shows an identical-looking Gucci blouse selling for $1,100:", "The \"pussy-bow\" blouse is an established style that features a loose tie at the neck of a shirt, usually made of thick material, that allows the wearer to tie it in various ways. It has been in fashion in recent years but has decades of history behind it as an item of women's apparel.", "The campaign said Ms. Trump's choice of attire was \"not intentional\":", "Campaign spokeswoman says this was not intentional. https://t.co/Yuka1Pli2j", "— Sopan Deb (@SopanDeb) October 10, 2016", "Colbert, Anne. \"You Truly Won't Believe the Name of Melania Trump's Debate Blouse.\"\r\n    Mashable.   9 October 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]