["About this rating", "The Morton County Sheriff's Department said that it plans to fine anyone bringing supplies to protesters.", "According to North Dakota's governor, the sheriff's department has no authority to do so.", "On 30 November 2016, several sites reported that people attempting to physically deliver supplies (such as food or water) to Dakota Access Pipeline protesters at the Standing Rock Reservation would be subject to potential fines of $1,000:", "In what could only be termed a potential gross violation of human rights, the Morton County Sheriff’s Department announced today it plans to block all supplies from entering Standing Rock camps — including deliveries of food.", "Shortly after issuing the notice it would block supplies, the Morton County Sheriff’s Department backed away somewhat, saying it would take a passive role to try to prevent supplies from reaching the camps, by issuing hefty $1,000 fines for vehicles attempting such deliveries — saying it had interpreted the evacuation order as a reason for a blockade.", "Officials speaking on behalf of the Morton County Sheriff's Department and the North Dakota Department of Emergency Management confirmed that the threat of a fine had replaced a physical blockade:", "Law enforcement would take a more \"passive role\" than enforcing a blockade, said Maxine Herr, a spokeswoman for the Morton County Sheriff's Department.", "\"The governor is more interested in public safety than setting up a road block and turning people away,\" Herr said by telephone.", "Officers will stop vehicles they believe are headed to the camp and inform drivers they are committing an infraction and could be fined $1,000.", "The North Dakota chapter of the American Civil Liberties Union is actively seeking any individuals fined under the new policy.", "However, North Dakota's governor, Jack Dalrymple, told reporters that state officials have no plans to set up roadblocks or fine people carrying supplies to protesters, and that regional authorities do not have the power to do so:", "Dalrymple said the protesters are on federal land controlled by the U.S. Army Corps of Engineers, and he reiterated that it's up to Corps to handle.", "\"We have not at any time, ever contemplated going to the main camp and removing people from that area,\" he said, adding that the Corps has not asked the state to do so.", "Bernish, Claire.   \"Sheriff’s Dept To Fine People $1K For Bringing In Food And Supplies To Standing Rock.\"\r\n    Activist Post.   30 November 2016.", "Sylvester, Terray.   \"North Dakota Officials Hope To Quell Pipeline Protests With Fines.\"\r\n    Reuters.   30 November 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]