["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "One year old Leif Sedlack-Brown cools off in a fountain this week at the Atlanta Botanical Garden. AJC photo by John Spink / [email protected].", "The bad news regarding water in Georgia is legion.", "No major reservoir has been built since the 2007-2008 drought to insulate metro Atlanta from future water shortages.", "Water/sewer rates have gone up in several counties to cover everything from federally mandated upgrades to increased material costs.", "Then there is the so-called \"water war\" with Alabama and Florida, a multi-year battle of lawsuits over how to meet the water needs across the states.", "So it was a surprise to read the recent headline in the Athens Banner-Herald: \"Water use in Georgia declines, even as population grows.\"", "The trend, the May 10, 2015 story said, was a 30 percent drop in water usage in the three decades between 1980 and 2010, the last year that federal data was available.", "Suffice it to say the claim whet our appetite – we save wetting our whistle for after-hours – for the numbers and what might be going on.", "We reached out to the U.S. Geological Survey, which has a mandate to file a water usage report for the nation every five years.", "In concert with that work, the agency encourages states to conduct their own reports.", "Georgia has compiled a report every five years since 1975, in a bid to provide information about the precious resource in a state without a single natural lake.", "The 1980 report shows that year, Georgia sucked 6.7 billion gallons of water from Georgia rivers and aquifers every day.", "In 2010, it sipped 4.7 billion gallons every day.", "While the reports in that overall span show some increases – including a 21 percent jump in daily use during the 1990s – water usage has plunged 30 percent when looking at the three decades.", "Census figures show the number of people living in Georgia over that period exploded, from 5.46 million in 1980 to 9.69 million in 2010. That’s a 77 percent increase.", "Given the well-known water woes in the Peach State, how is that possible?", "Conservation plays some role, which we will get into in a moment.", "But the biggest factor was the change in how thermoelectric plants across the state operated.", "Several of the facilities were decommissioned between 2000 and 2010 – during the worst of the drought years and the decade that saw usage plunge nearly 28 percent, said Steve Lawrence, a hydrologist with the USGS in Atlanta.", "Several other plants converted from coal-fired, which needs plenty of water to cool it as an energy source, to natural gas, Lawrence said.", "\"Thermoelectric withdrawals account typically for a third of withdrawals, so all water withdrawals decrease when such a large user drops its share,\" Lawrence said.", "Data is not available for 1980 for the per capita usage in Georgia. But 1985 and 2010 figures mirror the overall trend.", "Every Georgian used about 860 gallons of water daily in 1985 but only 470 gallons daily in 2010, Lawrence said.", "Those totals include a person’s share of water that a utility, say Georgia Power, uses to provide electricity.", "It’s unclear what the per person usage would be in 1985, if the water used by agriculture, industry and utilities are removed.", "But in 2010, it was an estimated 75 gallons a day per person to bathe, cook and clean, Lawrence said.", "\"That’s a good number, one you see with the push for water-efficient fixtures and conservation efforts like tiered pricing,\" Lawrence said.", "Local water providers, however, don’t always follow the statewide trend.", "The Cobb County Water System can provide daily usage dating back to 1986, when the then-small county used just 38.6 million gallons countywide.", "In 1990, when the county had about 451,000 people, average daily use was 42.5 million gallons countywide.", "In 2010, about 688,000 people lived in Cobb, and daily usage was 57.1 million gallons for the county.", "That’s a 53 percent jump in population, and a 34 percent increase in daily usage. Although the daily usage did not keep pace with the population increase, the jump itself bucks the state trend.", "However, water system officials point out that Cobb saw usage drop 14 percent countywide between 2006 and 2014, during the worst of the recent droughts.", "The 2014 daily usage, of 104 gallons per person, also is down 15 percent from the 122 gallons per person in 2005, when the county began looking at per capita usage.", "\"You can see very clearly the impact of our water conservation efforts, which became much more aggressive in 2008,\" county spokeswoman AikWah Leow said.", "Our ruling", "News reports claimed that Georgia has seen its water usage drop over the past three decades, in the same period that the population mushroomed.", "Federal reports confirm that unlikely shift, largely due to a change from coal-fired electric plants to facilities powered by natural gas.", "Conservation efforts also have made an impact, even if local water systems don’t show quite the same drop in usage.", "But the statewide trend is clear. We rate the statement True.", "Athens Banner-Herald, \"Water use in Georgia declines, even as population grows,\" May 10, 2015", "The Atlanta Journal-Constitution, \"Regional divisions hobble metro Atlanta,\" May 30, 2015", "The U.S. Geological Survey, Water Use in the United States, accessed June 17, 2015", "The U.S. Geological Survey, Estimated Water Use in the United States 2010, Nov. 5, 2014", "The U.S. Geological Survey, Water Use in Georgia By County for 1990, Published 1992", "The U.S. Geological Survey, Water Use in Georgia by County for 2005; and Water-Use Trends, 1980–2005, Revised March 8, 2011", "The U.S. Census Bureau, Population Distribution and Change: 2000 to 2010, March 2011", "The U.S. Census Bureau, Population 1790 to 1990, August 1993", "The U.S. Census Bureau, Population of Georgia Counties by Decennial Census: 1900 to 1990, March 1995", "The U.S. Census Bureau, Cobb County QuickFacts 2010, accessed June 22, 2015", "Interview with Steve Lawrence, hydrologist, U.S. Geological Survey, June 17, 2015", "Email interview with Robert Bernstein, spokesman, U.S. Census Bureau, June 18, 2015", "Email interview, AikWah Leow, spokeswoman, Cobb County, June 22 and June 23, 2015", "Email interview, Cobb County Water System, June 22 and June 23, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]