["Former Michigan Gov. Jennifer Granholm took a swipe at Mitt Romney after he stoked speculation that he may seek a third run for president.", "Count on hearing a lot about federal taxes this week.", "In his State of the Union address, President Barack Obama will lay out his plan to raise billions of dollars from the wealthiest people and the biggest financial institutions to make community college more affordable and pay for middle class tax cuts.", "And if that were not enough, we have the return of the 2012 Republican presidential nominee Mitt Romney. Romney’s announcement that he’s seriously assessing a third White House bid has revived a conversation topic that bedeviled him the last go around -- that he’s too steeped in cash to connect with the struggles of the average American and benefits from a lopsided tax code.", "On Sunday, former Gov. Jennifer Granholm, D-Mich., gave a sign of what Romney can expect. Romney had told a gathering of Republicans in San Diego a couple days before that under Obama, \"the rich have gotten richer, income inequality has gotten worse, and there are more people in poverty than ever before.\"", "Granholm said in sticking up for the little guy, Romney had an \"authenticity problem.\"", "\"You know, he pays less tax than the guys who installed his car elevators,\" Granholm said on ABC News’ This Week. We decide to look into that claim.", "Echoes of 2012", "What car elevators, you might ask? In the spring of 2012, the public learned that Romney’s plans for a multimillion dollar beach house in La Jolla, Calif., included an elevator to move cars from the basement to street level. Think of it as a way to get more than one car into a one-car garage. This add-on costs about $55,000 fully installed. (Construction on the site is underway, and we don’t know if the elevators are done yet.)", "Needless to say, this was an unwanted, if minor, distraction for the Romney campaign, which was already dealing with calls to be more transparent about the governor’s financial assets.", "As part of his presidential campaign, the former Massachusetts governor released two years of income tax returns. They showed that in 2010, he paid 13.9 percent of his reported income in federal taxes and in 2011, 15.3 percent. Those rates were a bit less than the national average.", "We don’t have all the details on his tax bills. The 2011 return was incomplete, and there was the possibility that Romney’s actual tax rate would be less.", "With that caveat, these are the best numbers we have.", "Granholm’s comment mirrored a running theme from the 2012 election that the tax code treats income from work and income from investments differently. Above a certain point, income from work is taxed at a higher rate than income from the stock market.", "Billionaire Warren Buffett memorably distilled this down to the line that he paid a lower tax rate than his secretary thanks to the favorable treatment of capital gains.", "Elevator installers", "Assessing whether the men who installed the elevators paid more in taxes than Romney is difficult. We reached out to Granholm and did not hear back.", "We take her words to refer to tax rates, not the total tax amounts. Romney made about $22 million a year and paid millions in taxes both years. From the Bureau of Labor Statistics, we see that in the San Diego metro area, the average elevator installer earned $83,460 in 2013.", "What an installer paid in taxes varies based on a number of factors, including family situation.", "If the installers were single with no children, then a simple tax calculator gives them an effective federal income tax rate of 17 percent. If they were married and had a child, and had no other income, the rate would fall to 8.4 percent.", "However, not only is that a bare-bones estimate, it fails to include payroll taxes for Social Security and Medicare. These payments represent a substantial portion of taxes paid by the average worker. The Tax Policy Center, a project of the Urban Institute and the Brookings Institution, uses a complicated tax simulator to estimate the total tax burden.", "The Tax Policy Center table for 2014 gives a total effective tax rate of 15.7 percent for households making between $75,000 and $100,000 a year. Take this number only as a rough guide. It includes various kinds of income, as well as a range of tax effects, and it blends together single as well as married filers.", "Comparing tax rates", "The point is, Granholm's claim could be right or wrong -- it just depends on a person's individual circumstances. A single, childless elevator installer with wages at the higher end of the scale might be paying at a higher rate than Romney did in 2011. That person's, even before payroll taxes, could be as high as 17 percent compared to Romney’s 15.3 percent.", "On the other hand, someone married and caring for a child could be paying as little as 8.4 percent.", "Our ruling", "Granholm said that Romney paid less tax than the guys that installed his car elevator.", "On the most literal level, we don't even know if the car elevators have been installed. And we don't know anything about the people who did the work.", "In a broader sense, what elevator installers pay in federal taxes depends on their personal circumstances. They could be taxed at a higher -- or lower -- rate than Romney has been.", "This statement is partially accurate. We rate it Half True.", "ABC News, This Week, Jan. 18, 2015", "Bureau of Labor Statistics, May 2013 Metropolitan and Nonmetropolitan Area Occupational Employment and Wage Estimates San Diego-Carlsbad-San Marcos, CA", "2014 Federal income tax calculator", "Tax Policy Center, Average effective federal tax rates, 2014", "Politico, Romney's car elevator cost $55,000, May 25, 2012", "Los Angeles Times, Revisiting the Romneys' La Jolla beach house -- and its car elevator, Jan. 15, 2015", "Washington Post, Romney, moving toward 2016 run, outlines vision to eradicate poverty, Jan. 16, 2015", "Factcheck.org, Does Romney Pay a Lower Rate in Taxes Than You?, Aug. 3, 2012", "Mother Jones, What We Still Don't Know About Mitt Romney's Tax Returns, Jan. 15, 2015", "IRS, SOI Tax Stats - Individual Statistical Tables by Filing Status", "New York Times, Obama Will Seek to Raise Taxes on Wealthy to Finance Cuts for Middle Class, Jan. 17, 2015", "PolitiFact, Does a secretary pay higher taxes than a millionaire?, Sept. 21, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]