["“ये कोई फिल्मी सीन नही है दलीत भाईयो बसपा नेता बकरूद्दीन अन्सांरी अपने गुन्डो के साथ मिलकर दलीत महिला को सारे बाजर किया नंगा देख लो इन कुत्तों की दबंगई. (This is not a movie scene Dalit brothers, BSP leader Bakruddin Ansari, along with his goons stripped a dalit woman off her clothes – translated)” A photo of a man trying to disrobe a woman is being circulated widely on Facebook with the aforementioned text. A post with the above narrative by one Rajneesh Bharara has been shared more than 5.7k times.", "The identical picture has also been shared by one more facebook user Namo Narayan Hindu with the same text.", "The image is a scene from a Bhojpuri movie titled “Aurat Khilona Nahin”, released in 2014. The same image can be seen in a blog post from 2014.", "This particular still can be seen at approximately 2 hours and 11 minutes into the movie.", "Moreover, we could not find any prominent BSP leader with the name ‘Bakruddin Ansari’.", "Alt News had debunked this image when it was first circulated by many on social media in July 2017 after riots had broken out in Basirhat in West Bengal. At that point in time, this image was circulated with the claim that this is a Hindu woman being molested by members of the Muslim community in Basirhat.", "Vijeta Malik, who according to her Facebook bio was a state executive member of BJP Haryana, had shared this image with a claim that Hindus were under attack in West Bengal.", "Rajneesh Bharara and Namo Narayan Hindu have not deleted their posts despite being informed multiple times about the falsity of their claim.", "Donate Now", "Follow @free_thinker", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]