["By Katie Busch", "Posted on September 25, 2020", "A social media post claims that Social Security checks have not been sent by mail “since 2013 because it’s not secure.” The Social Security Administration required electronic payment transfers in compliance with a 1996 federal law — not due to security concerns. Even so, about 850,000 checks are still mailed each month.", "In late August, posts claiming that the Social Security Administration stopped using the postal service due to security concerns began circulating on Facebook.", "“Social Security checks do not go through the postal service since 2013 because it’s not secure,” one post reads. “Let that sink in.”", "The post has garnered over 19K shares since its publication on Aug. 20. A slightly different version of the post claimed that then-President Barack Obama had “determined Social Security would not send checks through the USPS, because it was not secure!?”", "More recently, this misleading statement has resurfaced on Twitter.", "“Social Security checks do not go through the postal service since 2013 … because it’s not secure,” reads a Sept. 20 tweet. “Let that sink in.”", "Though these tweets have received significantly less attention than their Facebook counterparts, they still perpetuate the same misinformation.", "It’s true that most Social Security beneficiaries were required to switch to electronic payment in 2013. But the law wasn’t motivated by security concerns and some beneficiaries still receive their Social Security checks in the mail.", "Shortly after the new requirement was implemented, Social Security Administration official Theresa Gruber told a Senate committee that the switch to electronic payment had been mandated by 1996 law that required “all federal payments [to] be made electronically after January 1, 1999, with limited exceptions.”", "“Over time and through regulation, Treasury has encouraged more and more beneficiaries to receive their benefit payments electronically,” Gruber testified on June 19, 2013. Treasury issued a final rule in late December 2010 that required Social Security checks to be sent electronically, and it took effect March 2013, she said.", "Prior to the 2013 electronic payment mandate, about 94% of Social Security retirement benefits and 83% of Supplemental Security Income payments were already being made electronically, she testified.", "Additionally, beneficiaries can still apply for a waiver that exempts them from the electronic requirement.", "As of September, the Social Security Administration sent paper checks to 852,279 people who get either Social Security or Supplemental Security Income payments. That’s about 1.2% of the 72,296,327 people who received payments that month, according to official data.", "At the Senate hearing, Gruber listed the benefits of the electronic transfers, which included a savings in check distribution costs, easier payment during natural disasters, and increased ease of payment tracking. She said it cost the federal government $1.25 to issue a paper check, but only 9 cents for electronic payments.", "“One of the objectives of the 1996 Act was to save the government money through increased EFT [electronic fund transfer] use,” the U.S. General Accounting Office — known now as the Government Accountability Office — said in a 2002 report.", "Gruber did mention that electronic payments also offered some security benefits, such as the minimized risks of check theft or loss. In 2011, over 440,000 Social Security checks were reported lost or stolen and over $70 million worth of checks were fraudulently endorsed.", "However, electronic payments come with their own security concerns, such as identity theft that can result in Social Security payments being rerouted to another bank account without the beneficiary’s knowledge.", "The social media posts started circulating in August at a time when President Donald Trump questioned whether the United States Postal Service could handle the surge of mail-in ballots that are expected in the 2020 election. As we have written, the president has relentlessly attacked mail-in voting as “corrupt” and “fraudulent.”", "But, contrary to the social media posts, the Social Security Administration didn’t stop mailing checks in 2013 “because it’s not secure.” It was done to comply with a 1996 law, which was primarily designed to save the federal government money. And, as we said, about 850,000 checks are still mailed each month.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Social Security Administration. “Statement of Theresa Gruber, Assistant Deputy Commissioner for Operations, Social Security Administration, before the Senate Special Committee on Aging.” 19 Jun 2013.", "Social Security Administration. “Request for Payment of Federal Benefits by Check.” Undated. Accessed 25 Sep 2020.", "Social Security Administration. “Supplemental Security Income Direct Deposit and Check Statistics.” Sep 2020.", "Social Security Administration. “Social Security Direct Deposit and Check Statistics.” Sep 2020.", "General Accounting Office. “Electronic Transfers: Use by Federal Payment Recipients Has \nIncreased but Obstacles to Greater Participation Remain.” 12 Sep 2002.", "Hicken, Melanie. “No more paper Social Security checks come March.” CNN. 9 Jan 2013.", "Ellis, Blake. “Scam targets seniors’ Social Security benefits.” CNN. 26 Sep 2012.", "Kiely, Eugene. “Trump Proves Biden Right on USPS Funding, Mail-In Ballots.” FactCheck.org. 14 Aug 2020.", "Kiely, Eugene et al. “The President’s Trumped-Up Claims of Voter Fraud.” FactCheck.org. 30 Jul 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]