["The photo was posted here on Facebook on March 9, 2021.", "The image shows a red banner with Urdu-language text that reads: \"I was 9 years old and he was 50. I was silenced and his voice is still heard in mosques till this day”.", "The Facebook post’s caption claims that the banner was intended as a criticism of the Prophet Mohammed and one of his wives, Hazrat Ayesha.", "\"For the convenience of those who do not understand, let me explain that this is a flag from the women's march in which the Holy Prophet (PBUH) [peace be upon him] and Hazrat Ayesha (RA) [may Allah be pleased with her] have been criticized,” the Urdu caption says.", "\"Meaning, the Holy Prophet was 50 years old and Ayesha was nine when she was forcibly married. To this day, the name of the Holy Prophet resonates in mosques. Their whining is growing every year.”", "The lengthy post urges Muslims to “rise up in the name of God” and “hold this criticism to account”.", "Women’s marches, or “Aurat Marches” were held around Pakistan to mark International Women’s Day on March 8, 2021.", "The events have sparked backlash in socially conservative Pakistan.", "Posts making the same allegation have been shared on Facebook here, here, here, here, here and here; and on Twitter here, here, here, here and here.", "However, the claim is false.", "According to the official Aurat [Women] March Lahore, the story shared in the banner is “by a woman in Lahore who experienced sexual abuse at the hands of a 50-year-old qari sahib [religious teacher] when she was 9 years old”.", "Statement by Aurat March Lahore condemning slander against the march.#AuratMarch2021 #AuratMarchLahore pic.twitter.com/Mq0IFNTe6I", "March organisers had asked women to share their experiences of sexual violence and abuse as part of a “#MeToo blanket”, which they shared photos of in a Twitter thread.", "TRIGGER WARNING// RAPE AND ASSAULT\n\n\t\tLike last year, #AuratMarchLahore is unfolding its #metoo blanket. Women have shared their experiences of sexual violence and abuse. We're sharing small snippets from the blanket being carried by the marchers right now.#AuratMarch2021\n\n\t\t?", "The Human Rights Council of Pakistan also spoke out against the false claims.", "“Once again, allegations of blasphemy have been weaponised, this time against women who bravely drew attention to the harassment & sexual assault they had experienced,” it said in a tweet.", "AFP was unable to identify the woman who made the banner.", "Contacted by AFP, feminist activist and professor of gender studies at the Lahore University of Management Studies Nida Kirmani, who is in contact with the march organisers, said the woman wanted to remain anonymous.", "\"I think people are scared to come out personally right now as the risks are quite high,” she said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]