["On May 2, Aam Aadmi Party conducted a press conference accusing BJP candidate Hans Raj Hans of concealing information about his conversion to Islam. AAP claimed that he was ineligible to contest the election from the North West Delhi which is reserved for the Scheduled Caste category. Hans is fighting the elections against Congress’ Rajesh Lilothia and the AAP’s Guggan Singh in North West Delhi.", "Following the press conference, AAP social media in-charge Ankit Lal tweeted a video to support the allegation with a message, “Some bhakts claiming that Hans Raj Hans has not converted. How do they explain this then. Waiting for them to say that this is a deep fake. When they say that, I am ready to go in for a digital forensic analysis of this video.” In the video, Hans can be heard speaking in Urdu. Via his tweet, Lal suggested that this video was evidence of Hans Raj Hans converting to Islam.", "Some bhakts claiming that Hans Raj Hans has not converted. How do they explain this then.", "Waiting for them to say that this is a deep fake. When they say that, I am ready to go in for a digital forensic analysis of this video. pic.twitter.com/ly77bp5rVN", "— Deshbhakt Ankit Lal (@AnkitLal) May 2, 2019", "Spandan Srivastava and Mitalee Rishi, who are members of the AAP social media team, also tweeted the same video as Lal with a similar message. The text superimposed over the video tweeted by the duo reads, “Hans Raj Hans aka Mohammad Yusuf speaking on Islam”.", "Alt News found that the video tweeted by Srivastava and Rishi of the Aam Aadmi Party’s social media team was edited and passed off with a misleading context to suggest that Hans was speaking about Islam. The video was edited to cut out the part where Hans talks about Muhammad Tahir-ul-Qadri and his teachings. On the other hand, Lal tweeted a full video, but with a misleading context. We found the same video uploaded on YouTube by a channel named Minhaj TV on February 19, 2018.", "According to the caption and description of the video, Hans Raj Hans was giving tribute to the renowned Pakistani Islamic Scholar Muhammad Tahir-ul-Qadri on the latter’s 67th birthday. Tahir-ul-Qadri is a Sufi cleric and a leader of the political party Pakistani Awami Tehreek (PAT). He is also the founder of the Minhaj-ul-Quran, International organization.", "As far as the allegation on Hans Raj Hans’ conversion to Islam is concerned, Yuvraj Hans, son of Hans Raj Hans in 2014 had termed the news reports published by Pakistani media as “rumours”. While speaking to media, Yuvraj said, “Our family was completely disturbed after we came to know of the report by online news Pakistani portal and a TV channel that my father had converted his religion in Lahore. I was shooting at that time. I called up my father and he, too, was stunned at the news. We did not know how the footage got spread and who is behind this.” Moreover, it may be noted that the news reports circulating about Hans Raj Hans converting to Islam date back to 2014 and were based on Pakistani media reports.", "In conclusion, AAP social media in-charge Ankit Lal tweeted a video of BJP candidate Hans Raj Hans falsely suggesting it as evidence of Hans having converted to Islam. Last week, Lal had tweeted an old and misleading video featuring former Delhi CM Sheila Dixit.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]