["By Angelo Fichera", "Posted on October 2, 2018", "Q: Was Supreme Court nominee Brett Kavanaugh’s home vandalized by “over 200 protesters”?", "A: No. The vandalized home in the photo is actually a house in Ontario, Canada.", "Through a viral image and story, tens of thousands of social media users have helped spread a false account about vandalism at the home of Supreme Court nominee Brett Kavanaugh.", "The popular meme shared in multiple posts on Facebook includes a photo of a home defaced with graffiti that, among other things, reads: “I should burn this house!”", "“Judge Kavanaugh has now gone into hiding due to escalated violence,” the text in the meme reads. “This is Judge Kavanaughs home that was vandalized today by over 200 protesters. As you can see, it’s not a mansion, he is not a wealthy man. They destroyed the yard by driving cars on it, threw feces on all the windows, every outside wall was spray painted. How do you explain.”", "But Capt. Paul Liquorie of the Montgomery County Police Department told us in an email that there have been “no reported incidents of vandalism or other crimes” on the block where Kavanaugh lives in Chevy Chase, Maryland, in the last month. The block in question is under the jurisdiction of the department’s 2nd District, which Liquorie commands.", "In fact, the photo of the property in the meme doesn’t even match the house where Kavanaugh lives, which has been shown in press reports.", "Instead, we found the photo used is actually of a home in Ontario, Canada, that was vandalized in 2016. The photo was among several featured in a news story about the incident in the Hamilton Spectator.", "The same erroneous claim about Kavanaugh’s home — and the photo — was the focus of a story published Sept. 30 on a website belonging to a supposedly satirical publisher, America’s Last Line of Defense. That story also appeared on a website called ABCNews.live — whose version, lacking any “satire” label, accrued nearly 13,000 engagements on Facebook, according to CrowdTangle data.", "The story claimed the Kavanaughs’ home was in Mayo Lake, Pennsylvania, though there is no such town in the state.", "Kavanaugh, who has denied the allegations of sexual misconduct that have challenged his nomination, has said he received “vile threats of violence” against his family. Lawyers for Christine Blasey Ford, the California professor and accuser who testified before the Senate Judiciary Committee last week, have said their client has received death threats.", "But the viral claim of massive vandalism at Kavanaugh’s home is a hoax.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“About.” TrumpBetrayed.us. Accessed 2 Oct 2018.", "Liquorie, Paul. Captain, Montgomery County Police Department. Email to FactCheck.org. 2 Oct 2018.", "Paddon, Natalie. “Ancaster home vandalized after city-owned tree chopped down.” The Hamilton Spectator. 29 Jul 2016.", "“Protesters Vandalize Kavanaugh’s House, $11,000 Damage.” ABCNews.live. 1 Oct 2018.", "“Protesters Vandalize Kavanaugh’s House, $11,000 Damage.” TrumpBetrayed.us. 30 Sep 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]