["By Brooks Jackson", "Posted on August 23, 2018", "A Democratic ad revives long-discredited claims of corruption and shady dealing by GOP Rep. Steve Pearce of New Mexico. We thoroughly debunked those same claims eight years ago. And unlike wine and whiskey, political mud doesn’t improve with age.", "Pearce is now running for governor. The ad was launched Aug. 21 by “Stronger New Mexico,” a group backed by the Democratic Governors Association.", "The ad states that Pearce was “twice named one of the most corrupt members of Congress by an independent watchdog group.” Overall, it insinuates a corrupt bargain for which we find no basis in fact.", "The group that called Pearce “corrupt” is Citizens for Responsibility and Ethics in Washington, which has a Democratic tilt. Its current chairman (and co-founder), for example, is Norman Eisen, who was President Barack Obama’s White House ethics adviser from 2009 to 2011, and later his ambassador to the Czech Republic.", "Pearce was one of 18 Republicans on CREW’s 2007 list of “most corrupt” House and Senate members, which named only four Democrats. The following year Pearce was among 14 Republicans and six Democrats to be named “most corrupt.”", "More important, CREW based its 2007 claim of corruption primarily on what it said was “his failure to properly report a transaction on his financial disclosure report” in 2003. In that transaction, Pearce sold the assets of his oilfield equipment leasing business for a reported $12 million.", "Trouble is, Pearce wasn’t legally required to report that transaction, according to an official ruling from the House Ethics Committee, which Pearce sought and obtained shortly after CREW posted its 2007 report.", "Nevertheless, CREW again named Pearce to its “most corrupt” list in 2008, citing the same issue. CREW later admitted that it had “erred” in failing to discover and mention the ethics panel’s ruling clearing Pearce. But it did not retract its “corrupt” label and said “we stand by our original interpretation” that the law required disclosure.", "In fact, the sale was no secret. Pearce did report ownership of the company, Lea Fishing Tools Inc., in his financial disclosure reports covering 2002 and 2003. He valued his stake at between $1 million and $5 million. On Oct. 8, 2003, the Associated Press reported that Pearce had finalized a deal to sell the company to Key Energy Services, though no price was mentioned.", "The AP quoted a Pearce spokeswoman as saying the congressman was having trouble finding time to run the business. “The Pearces felt like it was putting unnecessary stress on them and the business,” she said. The AP didn’t mention a price, however.", "When the newspaper Roll Call dug into the matter in early 2008, it reported that Pearce received about $12 million for the company — far above the value he placed on it in his disclosures. And Roll Call also found that an executive of Key Energy had testified at a House field hearing co-chaired by Pearce about six weeks before the deal closed.", "Based on a selective reading of that decade-old story, the DGA-backed ad says, “He made millions selling his company’s assets for twice its stated value, to an oil company that testified before his task force.” On screen appear the words, “Steve Pearce cut deal with oil company,” citing the Roll Call story.", "Left out of the ad is that the newspaper also reported: “Roll Call found no evidence that Pearce has taken any legislative action to specifically benefit Key Energy Services.” And no evidence has surfaced to indicate that Key Energy paid more than fair market value when it bought out Pearce’s company.", "Pearce’s spokesman told Roll Call that the value reported on the congressman’s disclosure report was based on the depreciated value of its assets. The price paid by Key Energy was based on its value as a going concern.", "Roll Call reported, “In its announcement of the purchase, Key said it anticipated Pearce’s company would generate $8 million a year in revenues.” Paying $12 million to get an annual revenue stream of $8 million hardly amounts to a sweetheart deal.", "Pearce is running this fall against Democratic Rep. Michelle Lujan Grisham to replace two-term Gov. Susana Martinez, who is prevented by term limits from running for a third term.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]