["Vice President Mike Pence listens as Democratic vice presidential candidate Sen. Kamala Harris, D-Calif., speaks during the vice presidential debate Wednesday, Oct. 7, 2020, at Kingsbury Hall on the campus of the University of Utah in Salt Lake City. (AP)", "On Oct. 7, Vice President Mike Pence and Democratic vice presidential nominee Kamala Harris debated for the first and only time before Election Day.", "But a recent Facebook post suggests that the debate was rigged — that unlike Pence, Harris knew the debate questions ahead of time.", "\"Kamala said to the moderator ‘yes, that’s a great segway to the next question,’\" the post says, misspelling segue. \"How did she know what the next question was?", "\"Segue\" and \"Segway\" are homophones, words that sound alike but are spelled differently and have different meanings. A segue is a transition from one scene to the next. A Segway is a trademarked brand of motor scooter.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "It conflates two comments, one made by Harris and one made by Susan Page, the debate’s moderator and Washington bureau chief of USA Today.", "At that point in the debate, Page was speaking over Pence and Harris was speaking over Page but, essentially, Pence finished speaking and Page said: \"That’s a good segue into our third question.\" Harris then said. \"That’s a great segue.\"", "Here’s what happened in more detail.", "About 20 minutes and 45 seconds into the debate — you can read the transcript here — Page asked Harris if voters have a right to know more detailed information about presidential candidates and presidents.", "\"Absolutely,\" Harris said, \"and that’s why Joe Biden has been so incredibly transparent.\"", "Harris then pivoted to attacking President Donald Trump for a lack of transparency about his health and his personal finances.", "Pence, given the opportunity to respond, defended Trump and said he’s a job creator who \"turned this economy around by cutting taxes, rolling back regulations, unleashing American energy, fighting for free and fair trade.\"", "Pence was over his speaking time and Page interrupted him three times to move on before he finished by saying all of the aforementioned accomplishments were in danger if Biden and Harris were elected.", "\"That’s a good segue into our third topic,\" Page said. She was then cut off by Harris.", "\"That’s a great segue,\" Harris said.", "Page then finished her sentence: \"Which is about the economy.\"", "We reached out to the Biden campaign about the campaign post and to clarify what Harris meant when she said \"that’s a great segue.\"", "But at the beginning of the debate, Page addressed what Pence, Harris and the Commission on Presidential Debates knew about the event.", "\"No one at either campaign, or at the commission, or anywhere else has been told in advance what topics I’ll raise, or what questions I’ll ask,\" she said.", "Harris does not make the statement that the Facebook post attributes to her, but she did say, \"that’s a great segue.\" It’s unclear what she meant when she said that, and it doesn’t prove that she knew debate questions ahead of time.", "Page, however, was explicit when she said that neither Harris nor Pence knew what topics or questions she would cover.", "We rate this Facebook post Mostly False.", "Facebook post, Oct. 8, 2020", "CNN, Vice presidential debate: Full video, Oct. 7, 2020", "Rev, Kamala Harris & Mike Pence 2020 presidential debate transcript, Oct. 7, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]