["About this rating", "On 9 December 2015, a Facebook user published the status update reproduced below; it read:", "Why would anyone need that many bottles of propane. Picture was taken 12/9 in Miami Fl.", "Contemporaneous rumors spreading in Missouri claimed suspicious purchases of large quantities of cell phones and thefts of propane tanks portended an imminent Christmastime attack. That rumor was debunked when local law enforcement confirmed the cell phone purchases were not related to violent criminal activity, and were instead the work of re-sellers.", "On 14 December 2015, the web site America's Freedom Fighters published the photo in an article titled \"ALERT: Muslim Men Caught Purchasing Mass Quantities of THIS at Home Depot… This CAN’T Be Good.\" It said:", "There’s a disturbing photo making the rounds on social media that shows two men, one dressed in a Muslim religious outfit, loading a suspicious number of propane tanks into a truck in Florida.", "The Muslims were seen loading around 30 propane tanks onto the back of their pickup truck at a Home Depot store in Miami.", "As we reported, the FBI is investigating bulk purchases of cellphones by Muslim men at Walmart stores. These are notoriously used by the jihads as detonating devices for bombs as well as a means of untraceable communication.", "Also, there have been thefts of massive amounts of propane tanks in that same area.", "And as we reported, a massive cache of ‘volatile explosives’ was discovered, again in the same area.", "The above-excerpted portion referenced the photograph, purportedly taken in Miami on 9 December 2015, along with \"thefts of massive amounts of propane tanks in that same area\" and \"a massive cache of ‘volatile explosives’ ... discovered, again in the same area.\" It's worth noting that the incidents cited occurred in and around Lebanon, Missouri, a distance roughly 1,300 miles from Miami.", "We contacted Home Depot's media relations department to inquire about the photograph. They told us:", "This is a rumor that pops up now and then. We haven't found any high volume purchase of tanks in that area from any customers. We've had no such thefts either - that's been another previous rumor over the years.", "The origin of the photograph was unclear, but Home Depot confirmed that neither large purchases nor thefts of propane tanks were reflected in their inventory records. As such, the claim is false.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]