["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On Labor Day, democratic presidential candidate Joe Biden meets with union leaders outside the AFL-CIO headquarters in Harrisburg, Pa. (AP Photo/Carolyn Kaster)", "For the 100 largest government contractors, the annual rate of jobs lost due to offshoring — the moving of jobs overseas — was about 2-1/2 times the average during the Obama administration.", "The time period studied included a few months before Trump took office.", "Up to date information on jobs offshored is limited.", "In a Labor Day event, Joe Biden told workers that President Donald Trump’s claims about supporting the average person aren’t supported by the facts.", "\"He gave big tax cuts to corporations without making them bring jobs home,\" the Democratic nominee said Sept. 7. \"He let federal contractors double offshoring jobs in his first 18 months in office.\"", "That last part about offshoring — when companies move jobs overseas to save money — caught our ear. As we drilled down, we found that the numbers behind Biden’s statement are reasonably correct, but the underlying government data aren’t robust enough for firm conclusions.", "The Biden campaign relied on a report from the labor-backed project Good Jobs Nation, which is part of a group called Change to Win. The report looked at companies that won government contracts between the time Trump won the election and the first week of June 2018. The first thing to note is the period included about three months before Trump took office, which isn’t what Biden said.", "The report then looked at companies with workers who were at risk of losing their jobs because the company planned to move work overseas.", "That second list comes from the federal Trade Adjustment Assistance program, an effort that’s been around for about six decades to help workers displaced by foreign trade. When someone loses their job, they can apply for retraining and financial assistance to move into a new job.", "The Good Jobs Nation report took the top 100 government contractors — which included companies such as Boeing, General Motors, Siemens and United Technologies — and counted up the number of jobs that appeared under their names in the Trade Adjustment Assistance program. The study included jobs at risk due to production shifting overseas.", "The report found that collectively, these firms accounted for 8,363 lost jobs per year. In contrast, the average rate was 3,100 during the Obama administration. The Trump rate is about two and a half times higher, so that’s the basis for Biden’s statement.", "To be clear, the report had a narrow focus. The report’s author, George Faraday, a lawyer and policy analyst with Change to Win, said it was written in response to Trump’s signature effort in 2016, before he took office, to stop the air conditioning company Carrier Corp. from sending jobs to Mexico. (We rated that a Promise Kept.)", "\"Our point was that Carrier was a one-off and there was no serious follow up,\" said Faraday. \"The administration was willing to award these companies contracts worth billions of dollars from taxpayers, with no expectation that they would invest in the country.\"", "Faraday said he never updated the study beyond the June 2018 cutoff point.", "It’s important to understand what the trade adjustment job numbers mean, and where the report’s numbers aren’t as precise as they appear. For example, it says Boeing Co. was awarded over $29 billion in contracts, and had 2,681 jobs show up in the Trade Adjustment Assistance program. In fact, the government ultimately found that over 5,275 jobs were threatened.", "We found a few instances where the Good Jobs Nation report overshot the government figures by a few hundred jobs. On balance, the numbers we found indicated that the thrust of the report’s findings holds up, even if the numbers are off at certain points.", "It’s worth noting that the government numbers don’t necessarily count people who lost their jobs. The estimates include actual separations, people whom the company thinks it might need to lay off and workers who might see their hours and wages cut back. And it also counts contract workers, which in Boeing’s case involves a large number of firms that provide Boeing with workers who have special skills.", "Even if the numbers in the report check out, it’s reasonable to scrutinize the findings a little more.", "We looked at whether total U.S. employment at some of the largest firms rose or fell during the period the report covers. We were able to get hard numbers only from Boeing. Between 2016 and 2017, the company shed about 9,000 jobs.", "The comparison isn’t perfect. The figure doesn’t include contract workers, and the time period doesn’t align perfectly with the 18 months in the Good Jobs Nation study. But the decline suggests the report spotted a real trend.", "On the other hand, what happened at Boeing in 2018 and 2019 points to the biggest limitation in Biden’s claim — it considers a narrow time frame.", "The Boeing press office told us that the number of workers rose over the next two years, and by 2019, the total was 5,000 higher than in 2016.", "It’s also worth noting that Biden spoke only about federal contractors and jobs sent out of the country. Looking at all companies and jobs affected by trade — which includes jobs lost when production shifts to outside U.S. borders, but also when imports displace domestic production — the average number of displaced workers is lower during the Trump years than during Obama’s second term. The difference is about 4,000 jobs, or a decline of about 5%.", "The flip side of offshoring is reshoring, or bringing overseas jobs back to the U.S. The data on that is limited.", "The Reshoring Initiative, a project of a private business consultant Harry Moser, tracks press releases and news reports to count jobs brought back to the U.S. That’s a bit informal, but in any case, Moser said Trump’s record is mixed, largely due to his policy of imposing tariffs.", "\"Reshoring grew solidly thru 2015, soared in 2016 when Trump was elected, accelerated higher in 2017 with lower taxes and regulations, then declined in 2018 and 2019, primarily due to business uncertainty from the trade war,\" Moser said.", "But the bottom line is that claims about both sending jobs overseas and bringing them home should not be taken at face value.", "Biden said that in his first 18 months in office, Trump allowed government contractors to offshore jobs at twice the rate as before.", "Biden accurately quoted a report, and its findings are reasonably accurate. But the report’s job count actually began before Trump took office, and the government’s tallies include jobs that are at risk, not necessarily ones that are lost. That way of counting jobs, however, would apply equally to the Trump and Obama years.", "There’s a measure of accuracy in Biden’s statement, but it requires more context.", "We rate this claim Half True.", "Joe Biden, Labor Day speech, Sept. 7, 2020", "Good Jobs Nation, The offshoring of American jobs continues, August, 2018", "U.S. Department of Labor, TAA data overview, accessed Sept. 8, 2020", "U.S. Department of Labor, Petitions and Determinations Data, accessed Sept. 9, 2020", "U.S. Department of Labor,Trade Adjustment Assistance Program: 2019 annual report, accessed Sept. 8, 2020", "U.S. Department of Labor, Boeing combined petition, May 19, 2017", "U.S. Department of Labor, $1.6M GRANT TO HELP BOEING WORKERS, BOLSTER WASHINGTON STATE ECONOMY, June 5, 2017", "Reshoring Initiative, home page, accessed Sept. 8, 2020", "Bureau of Economic Analysis, Activities of U.S. Multinational Enterprises, 2018, Aug. 21, 2020", "Kearney, Trade wars spur sharp reversal in 2019 reshoring index, May 2020", "Trade Vistas, CAN WE MEASURE WHETHER \"RE-SHORING\" IS REAL?, May 21, 2020", "Washington Post, Is President Trump the ‘Offshorer-in-chief’?, Feb. 8, 2020", "Interview, George Faraday, lawyer and policy analyst, Change to Win, Aug. 10, 2020", "Email exchange, Harry Moser, president and founder, Reshoring Initiative, Aug. 9, 2020", "Email exchange, Bryan Watt, Public Affairs, Boeing Corp., Sept. 9, 2020", "Interview, Michael Gwin, spokesman, Biden for President, Aug. 11, 2020", "Email exchange, Zach Parkinson, spokesman, Trump for President, Aug. 11, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]