["The 20-second video was shared on Facebook here on September 29, 2020.", "The clip has been edited to add a popular Hindi song as a soundtrack.", "The post’s Hindi caption translates to English as: “You might recognise this messiah journalist? Hint: He is a mine of knowledge on journalism for the world. He is Ravish Kumar.”", "Ravish Kumar is a prominent Indian TV journalist.", "The video was also shared here, here, here and here on Facebook, and here, here, here and here on Twitter alongside identical claims.", "However, the claim is false.", "A reverse image search by the keyframes obtained using InVID video verification tool found the clip was taken from a blooper video posted here on YouTube by Indian news channel NDTV on August 27, 2013.", "A further investigation found that the man seen rolling on the street is an Indian-administered Kashmir-based journalist named Fayaz Bukhari.", "In an email to AFP on October 6, 2020, Bukhari, who is currently working with Reuters news agency, confirmed that he is the man seen in the video, not Ravish Kumar.", "Bukhari also told AFP that he was trying to protect himself from gunfire while covering a militant attack in Srinagar, the capital city of India’s Jammu and Kashmir state, in May 2006.", "“There was a congress (Indian National Congress) rally which came under attack in May 2006. I was doing live after it was over. And no one was knowing that one more militant was alive and hiding nearby. All of a sudden there was heavy firing and I was in open doing a live broadcast without any cover. The camera persons had taken cover and I was the only one who was exposed to fire. I ducked and rolled to reach behind the other camera persons to get cover from direct fire. It was from Poloview near city centre Srinagar,” he replied to an AFP enquiry via mail.", "Below is a screenshot comparison of the man seen in the video (L) and a photo of Bukhari taken from his Facebook page (R):", "The militant attack in May 2006 was widely reported in Indian media, for example here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]