["The images were published in a Facebook post here on June 20, 2020.", "The post’s Hindi-language caption translates to English as: “Recognise these communists traitors, Setaram Yechury and Brinda Karat. These communists also stood by China in 1962 and Kanhaiya Kumar is also a leader of this party. And today, these people are insulting our Indian army.”", "The text on the posters reads: “Indian army down..down, We support to long live China” (sic).", "Sitaram Yechury and Brinda Karat are both leaders of the Communist Party of India (Marxist), a left-leaning political organisation in India. Kanhaiya Kumar is another politician from the Communist Party of India.", "The post’s caption also makes reference to the war between India and China in 1962, which is widely known as the Sino-Indian War and erupted in the disputed Himalayan border regions.", "The posts circulated days after a deadly clash between Indian and Chinese soldiers in India-administered Ladakh on June 15. At least 20 Indian soldiers were killed in the incident. China has refused to confirm if it suffered any casualties in the first deadly clash at the border in decades, although Indian media said at least 40 Chinese troops were killed or seriously hurt, as reported here by AFP.", "The two images were also shared alongside a similar claim on Facebook here and here; on Twitter here and here.", "The claim is false.", "A reverse image search on Google found the images were doctored to digitally insert the anti-India, pro-China placards. The original photos were published on Twitter here by the Communist Party of India (Marxist) (CPI(M)) on June 16, 2020, and show the CPI(M) leaders protesting domestic policies of the ruling government led by Prime Minister Narendra Modi.", "The tweet reads: “All India Protest against Modi govt's anti-people policies. #PeopleProtestModiGovt.”", "All India Protest against Modi govt's anti-people policies.#PeopleProtestModiGovt pic.twitter.com/oJRUqXHsN5", "Below is a screenshot comparison of the doctored photos in misleading post (L) and original photos published on Twitter (R):", "The text on the poster held by Yechury (seen top-right above) reads: “Immediately pay 7,500 Indian rupees a month for the next three months to all outside tax bracket.”", "The text on the poster held by Karat (seen bottom-right above) reads: “Provide free 10 kilograms foodgrains per month for six months to all needy individuals.”", "The CPI(M) protest was also reported in the media on June 16, 2020, here and here.", "CPI(M)’s official response to the fallout from the mid-June border clash was published here on June 19, 2020. It expressed support for the government’s response.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]