["About this rating", "The U.S. Equality Act would prohibit schools, hospitals, public accommodations and in some cases churches from discriminating against individuals on the basis of sexual orientation and gender identity; legally oblige those establishments to accommodate transgender persons in accordance with their preferred gender identity; remove a major \"conscience protection\" for religious workers, including healthcare workers, and thereby indirectly weaken the legal position of religious employers in hiring workers in accordance with their religious ethos; leave religious colleges open to being cut off from federal assistance if they violate Title VI non-discrimination rules, and could indirectly weaken their protection against having their accreditation removed.", "However, the Equality Act would not, as Graham's letter asserts, directly neutralize an existing exemption in federal law that allows religious organizations to discriminate in favor of employees of the same religious faith or religious values; directly cause religious colleges to lose their accreditation (as opposed to jeopardizing their access to federal assistance); or force business owners and others to change their personal beliefs and attitudes regarding sexual orientation and gender identity (as opposed to their behavior).", "In February 2021, as the U.S. House of Representatives voted on the proposed Equality Act, a piece of legislation that would formally and explicitly prohibit various forms of discrimination based on sexual orientation and gender identity, readers asked Snopes to examine the accuracy of an open letter attributed to the influential evangelist Franklin Graham.", "The letter typically began \"I am writing to you about a very dangerous piece of legislation—the Equality Act\" and was shared widely on Facebook, and republished on various blogs and websites in the final week of February 2021. It contained several assertions about the effect the bill would have in supposedly coercing faith-based organizations to go against their religious convictions by accommodating LGBTQ persons in their hiring practices and in allegedly removing conscientious-abstention allowances for healthcare workers.", "Graham did indeed author the letter, and it was originally published on the website of the Billy Graham Evangelistic Association on Feb. 25. It can be read in full here. The Equality Act can be read here. The House passed it on Feb. 25, and it was introduced in the Senate on March 1.", "The following fact check offers a breakdown of the accuracy of the claims made by Graham in the letter.", "The Civil Rights Act of 1964 prohibited discrimination in various aspects of American social, commercial and civic life including voting, public accommodations, education, employment and so on, on various grounds including race, national origin, religion and sex.", "Over the ensuing decades, a political and legal dispute has arisen over the meaning of sex discrimination, and whether it should be interpreted as covering discrimination linked to sexual orientation and gender identity. Two main methods exist for formalizing and clarifying the extent and meaning of parts of a law: court precedents and additional legislation.", "A federal court ruling that said sex discrimination in the Civil Rights Act did comprehensively cover discrimination relating to sexual orientation and gender identity would go a long way towards offering LGBTQ people various legal protections in the realms of employment, healthcare, education, and so on.", "Equally, a new piece of legislation could simply amend the Civil Rights Act itself in order to explicitly specify that sex-based discrimination includes discrimination related to sexual orientation and gender identity.", "In the summer of 2020, the U.S. Supreme Court issued a ruling in Bostock vs. Clayton County, a case that addressed workplace discrimination related to sexual orientation and gender identity. We have written about that case in greater depth previously, but the key implication from the 6-3 vote was summarized by Justice Neil Gorsuch in the majority opinion:", "Today, we must decide whether an employer can fire someone simply for being homosexual or transgender. The answer is clear. An employer who fires an individual for being homosexual or transgender fires that person for traits or actions it would not have questioned in members of a different sex. Sex plays a necessary and undisguisable role in the decision, exactly what Title VII forbids. Those who adopted the Civil Rights Act might not have anticipated their work would lead to this particular result. Likely, they weren’t thinking about many of the Act’s consequences that have become apparent over the years, including its prohibition against discrimination on the basis of motherhood or its ban on the sexual harassment of male employees. But the limits of the drafters’ imagination supply no reason to ignore the law’s demands.", "Although the court's June 2020 ruling related specifically to Title VII – the section of the Civil Rights Act that deals with employment discrimination – the landmark decision was likely to have far-reaching implications and effectively ban several forms of discrimination against LGBTQ people in various other contexts, such as housing, healthcare and education.", "In the majority opinion, Gorsuch even made the much broader pronouncement that, \"It is impossible to discriminate against a person for being homosexual or transgender without discriminating against that individual based on sex.\"", "With that precedent established, LGBTQ individuals who could demonstrate that they had been fired, looked over for promotion, denied access to housing, healthcare or education, and so on, on the basis of their perceived sexual orientation or gender identity, would likely find success in bringing litigation, based on the assumption that courts would be bound by the precedent set in the Supreme Court's June 2020 ruling.", "However, a more certain, and in some ways more straightforward, way to ensure those legal protections would be to change the text of the law itself, by passing new legislation. This is where the proposed Equality Act comes into play.", "The preamble to the legislation explicitly mentions that June 2020 Supreme Court ruling, explaining that, on the basis of that precedent, the Equality Act would \"make explicit\" the illegality of sex discrimination related to sexual orientation and gender identity:", "(13) Numerous provisions of Federal law expressly prohibit discrimination on the basis of sex, and Federal courts and agencies have correctly interpreted these prohibitions on sex discrimination to include discrimination based on sexual orientation, gender identity, and sex stereotypes.", "In particular, the Supreme Court of the United States correctly held in Bostock v. Clayton County, 140 S. Ct. 1731 (2020) that the prohibition on employment discrimination because of sex under title VII of the Civil Rights Act of 1964 inherently includes discrimination because of sexual orientation or transgender status.", "(14) This Act makes explicit that existing Federal statutes prohibiting sex discrimination in employment (including in access to benefits), healthcare, housing, education, credit, and jury service also prohibit sexual orientation and gender identity discrimination.", "The bill was introduced in the U.S. House by David Cicilline, a Democratic Congressman from Rhode Island, on Feb. 18, 2021. On Feb. 25, it passed the House by a vote of 224-206, and n March 1 it was introduced in the U.S. Senate. Cicilline had introduced a similar bill in 2019, which also passed the House, but never came to a Senate vote. He introduced similar bills in 2015 and 2017, but they never reached a vote in what was a Republican-controlled House on both occasions.", "The three most significant changes that the Equality Act would bring about, if implemented, are as follows:", "Broadly, Graham made five main assertions about the likely or inevitable consequences of the Equality Act. The following is our assessment of the accuracy of those claims, which contained a mixture of accurate and inaccurate statements.", "1. \"The Equality Act designates schools, churches, and healthcare organizations as 'public accommodations.' With this, schools, churches, and hospitals could be forced to accept the government’s beliefs and mandates about sexual orientation and gender identity ...\"", "MOSTLY TRUE: Schools, healthcare providers, and potentially in some circumstances churches, would be prohibited from discriminating against clients, customers, and members of the public on the basis of sexual orientation or gender identity, but the law would govern only their behavior, not their personal beliefs and attitudes.", "The Equality Act explicitly designates any \"establishment that provides health care\" as a \"public accommodation,\" so Graham is right on that count. It doesn't do likewise for schools, but that's a moot point since, as we've discussed, a large swathe of federal law, including Title IX, is given over to non-discrimination in public education.", "On the question of churches, a spokesperson for Graham clarified for Snopes that:", "\"The concern with that language is it could easily be used to apply to church facilities under a number of public accommodation headings. Churches that hold weddings or have banquet halls could be required by sexual orientation and gender identity ('SOGI') laws to provide same-sex wedding services in their sanctuary or building.\"", "While the Equality Act does not list churches among public accommodations, it does stipulate that an establishment subject to the non-discrimination laws in question is any individual or entity \"whose operations affect commerce and who is a provider of a good, service, or program.\" This would clearly appear to apply to churches that lease or make available buildings for events and functions.", "On Graham's claim that the legislation means churches could be \"forced to accept the government's beliefs and mandates,\" it's important to note that while non-discrimination laws might form part of a broader movement to change the attitudes that prevail within society, the laws themselves do not compel individuals to change their beliefs, but rather their behavior. A restaurant owner might personally hold intensely bigoted and negative views about LGBTQ people, but would uphold the law once the owner served, seated, and charged a same-sex couple in the same way as everyone else.", "The core requirement in the \"public accommodations\" law in question (Title 42, Chapter 21, Subchapter II of the U.S. Code) states that:", "All persons shall be entitled to the full and equal enjoyment of the goods, services, facilities, privileges, advantages, and accommodations of any place of public accommodation, as defined in this section, without discrimination or segregation on the ground of race, color, religion, or national origin.", "The Equality Act would insert \"sex (including sexual orientation and gender identity)\" after \"religion.\" Any establishments subject to those requirements would not have to accept certain beliefs about sexual orientation and gender identity, but they wouldn't be able to treat potential customers or clients differently, on that basis.", "2. \"The Equality Act will legislate that we allow boys in girls’ sports, boys in girls’ locker rooms, men in women’s shelters, and men in women’s prisons. It will force teachers and students to publicly pretend that a biological male is a female ...\"", "MOSTLY TRUE: The bill would legally oblige schools and public establishments to accommodate transgender persons in accordance with their preferred gender identity. Graham's description of \"men in women's shelters\" only pertains if one denies the validity of transgender identity itself, as a whole.", "Graham's reference to \"boys in girls' sports\" makes it clear that he denies the validity and integrity of transgender identity itself, and the reference to \"pretending\" suggests he believes everyone else is of the same mind.", "Nonetheless, the legislation would indeed require that places of public accommodation, which are specified to include shelters, as well as public schools, would be obliged to accommodate transgender individuals in accordance with their professed gender identity.", "The Equality Act does not explicitly address questions like bathroom and changing-room accommodations, but existing federal court precedents have held that misgendering students, employees and other individuals, and failing to give them access to facilities in accordance with their gender identity, amounts to sex-based discrimination.", "With gender identity included as a protected trait, along with race, religion and others, the Equality Act would therefore codify those protections, and require public schools and places of public accommodation to honor the gender identity of transgender individuals, whether employees, students, customers and clients, or members of the public.", "3. \"The Equality Act will use the force of law across all 50 states to strip Christian and other religious ministries of their right to hire people of shared faith to pursue a shared mission.\"", "MIXTURE: The bill would not change or repeal an existing exemption in civil rights law, which allows religious organizations to discriminate in favor of individuals of the same religion or religious values in their employment practices. However, by removing the ability of religious employers to invoke another \"conscience protection\" — the Religious Freedom Restoration Act — in litigation, the Equality Act would automatically weaken their hand in potential future court cases, and therefore indirectly make it more likely that federal judges rule against them if they seek to assert their right to make employment decisions in accordance with their religious ethos.", "The legislation explicitly changes Section 703 of the Civil Rights Act, adding \"sex (including sexual orientation and gender identity)\" to the following proscription:", "It shall be an unlawful employment practice for an employer", "(1) to fail or refuse to hire or to discharge any individual, or otherwise to discriminate against any individual with respect to his compensation, terms, conditions, or privileges of employment, because of such individual's race, color, religion, sex, or national origin...", "The bill would therefore appear to create a blanket ban on any workplace discrimination based on an individual's perceived or actual sexual orientation or gender identity. However, Section 703 of the Civil Rights Act comes with a religious exemption, which states that:", "This subchapter shall not apply to an employer with respect to ... a religious corporation, association, educational institution, or society with respect to the employment of individuals of a particular religion to perform work connected with the carrying on by such corporation, association, educational institution, or society of its activities.", "We did not find anything in the text of the Equality Act that would directly affect or neutralize that religious exemption for religious employers when it comes to hiring and firing. However in an email to Snopes, a spokesperson for Graham argued that the implementation of the Equality Act would itself change judges' interpretation of federal non-discrimination law, as a whole, in potential future litigation:", "If the Equality Act is passed as is, Congress would be effectively and emphatically stating that religious freedom must be weakened and narrowed, especially when it conflicts with sexual orientation protections.", "... The Equality Act applies to all 50 states and adds the specific protected classes of sexual orientation and gender identity with the imprimatur of Congress, so if the bill is passed, many judges will begin to emphasize the newly accepted SOGI categories over religious freedom.", "Additionally, the Equality Act would strip away another major \"conscience protection\" — the Religious Freedom Restoration Act (RFRA), which we examine in greater detail in the next section. By doing so, it would mean that judges would no longer be obliged to apply a standard known as \"strict scrutiny\" when evaluating whether a particular law or official action has violated an individual or entity's constitutionally protected right to the free exercise of their religious faith.", "Notwithstanding the continued existence of the religious exemption in Section 703 of the Civil Rights Act, stripping away RFRA would weaken the hand of, for example, a religious employer making employment decisions based on their religious ethos, if they subsequently become embroiled in a court battle. \n\n4. \"The Equality Act will strip health professionals of their rights of conscience. It will force doctors and medical professionals who long to do no harm to engage in gender transition treatments such as hormone-blocking, cross-sex hormones, or surgery.\"", "TRUE: The bill explicitly removes a major \"conscience protection\" in the form of the Religious Freedom Restoration Act, and appears to leave healthcare workers who object to gender transition and reassignment treatments for religious reasons without a robust legal defense.", "As we have already outlined, the bill explicitly designates any \"establishment that provides health care\" as a public accommodation, and therefore subjects hospitals (and by extension their employees) to prohibitions against discrimination based on sex, which would be newly defined as including sexual orientation and gender identity.", "So health care practitioners could fall foul of the law if, for non-medical reasons, they refuse to take part in procedures or treatments related to gender transition and reassignment, but don't refuse to take part in other procedures or treatments, or don't refuse to take part in the same procedure in different circumstances — for example, performing a hysterectomy for a cisgender woman, but refusing to perform the same procedure for a transgender man as part of gender transition.", "Historically, businesses have — at least in principle — been able to avail themselves of a defense against such non-discrimination requirements — the Religious Freedom Restoration Act (RFRA). That law was signed by then-President Bill Clinton in 1993 with widespread bipartisan support in Congress. It requires that the federal government can only \"substantially burden\" an individual's constitutionally protected exercise of their religion if a \"compelling governmental interest\" exists, and the imposition on the individual's religious freedom is the \"least restrictive\" way of advancing that compelling interest.", "RFRA famously played a key role in the landmark 2014 Supreme Court case Burwell vs. Hobby Lobby, in which the owners of the craft store chain Hobby Lobby successfully argued that RFRA applied to secular, for-profit businesses, and allowed them to object, for personal religious reasons, to providing their employees access to free contraception as part of their company health insurance, a requirement under the Affordable Care Act, commonly known as Obamacare.", "The Equality Act explicitly seeks to strip away RFRA as the basis for a legal challenge to the non-discrimination requirements set out in the bill. Section 9 of the legislation states:", "“The Religious Freedom Restoration Act of 1993 (42 U.S.C. 2000bb et seq.) shall not provide a claim concerning, or a defense to a claim under, a covered title, or provide a basis for challenging the application or enforcement of a covered title.”", "RFRA is not the only legal \"conscience protection\" historically available to health care practitioners and providers, but the others primarily relate to faith-based objections to abortion, specifically. In light of the Supreme Court's ruling in Bostock vs Clayton County, the Equality Act's move to neutralize RFRA would appear to leave health care workers who object to procedures and treatments connected to gender transition without a robust legal defense.", "5. \"The Equality Act will be a tool used by the government to deny or threaten accreditation to religious colleges and universities if they do not satisfy the demands of the secular Left to apply sexual orientation and gender identity to dorms, sports, places of privacy, and even teachings.\"", "MIXTURE: By integrating sexual orientation and gender identity into Title VI non-discrimination rules, the bill could ultimately leave religious colleges open to being cut off from federal assistance. It would not in itself cause them to lose their accreditation, but it could indirectly prompt accrediting agencies to usher in their own new non-discrimination standards. If a religious institution fails or refuses to abide by those rules, it could ultimately leave itself open to losing its accreditation, at least with that particular agency, and thereby also its eligibility for federal aid.", "Setting aside the rhetorical flourishes, this appears to be a somewhat accurate representation of the text of the bill, and its legal consequences, although it appears to confuse the link between a school or college's accreditation and its receipt of federal funding.", "Section 6 of the Equality Act changes Title VI of the Civil Rights Act, which bars discriminatory practices by entities and programs that receive federal assistance, including schools and colleges.", "At present, the core requirement in Title VI is that:", "No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance", "The Equality Act would add \"sex (including sexual orientation and gender identity)\" to the list of protected traits, along with race and so on. Educational institutions that engage in discriminatory practices do so at the risk of losing access to federal funding and assistance.", "Since the Equality Act, combined with the court precedents we discussed above, would effectively make it impermissible discrimination for schools and colleges not to accommodate transgender students according to their preferred gender identity, then failing or refusing to provide those accommodations could, in principle, ultimately lead the government to cut off federal assistance to those institutions.", "However, it would not, in and of itself, cause them to lose their accreditation. Generally speaking, a school or college requires proper accreditation to receive federal assistance, but does not need to receive federal assistance in order to be accredited.", "However, an independent accrediting agency might have its own standards by which a Title VI or other non-discrimination violation triggers a loss of accreditation. If the Equality Act prompts accrediting agencies to introduce new standards that bar discrimination against LGBTQ individuals (understood to require recognizing the validity and dignity of same-sex relationships and accommodating individuals in accordance with their preferred gender identity), then religious institutions that fail or refuse to meet those standards could ultimately find their accreditation threatened. In turn, that could lead them to lose access to federal assistance.", "Updated [9 March 2021]: Rating changed from \"Mixture\" to \"Mostly True.\" Revised the article's examination of some of the likely and potential indirect consequences of the Equality Act, if it were signed into law.", "Correction [10 March 2021]: Previous versions of this article incorrectly stated that David Cicilline is a representative from New Jersey; he represents Rhode Island.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]