["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "During his campaign for president, Michael Bloomberg has pointed to his record as a three-term mayor of New York City, highlighting certain parts to appeal to Democratic primary voters.", "On his campaign website, Bloomberg claims that during his tenure, \"street homelessness decreased by 28 percent.\"", "\"As Mayor of New York City, Mike led one of the nation’s most ambitious affordable housing plans, implementing several initiatives that have been replicated in cities around the country. During his tenure, street homelessness decreased by 28% and more than 170,000 affordable homes were built or preserved,\" his site states.", "We were curious about Bloomberg’s claim about \"street homelessness,\" and reached out to the campaign. Spokesman Michael Frazier directed us to a city report from 2013.", "According to the Mayor’s Management Report, \"the estimate of those living on the street in 2013 is 28 percent lower than the baseline established in 2005.\"", "Street homelessness is a portion of the total number of people who are homeless. The city considers people who sleep on the streets or in the parks or subway system to be part of this subset. It does not include the much larger number of people in the city’s shelters.", "The Bloomberg administration began counting people who are part of the street homeless population in 2005. Data from the city’s Department of Homeless Services show a 28 percent drop in the number of people who slept on the streets or in the parks and subway during annual point-in-time counts between 2005 and 2013. On March 7, 2005, volunteers counted 4,395 street homeless people for the inaugural Homeless Outreach Population Estimate, or HOPE count. On Jan. 28, 2013, the last year of Bloomberg's tenure, the count was 3,180.", "The count on Jan. 27, 2014, a month after Bloomberg left office, was 3,357, or a drop of 24 percent from 2005.", "The Urban Institute published a report in 2014, funded by the Bloomberg administration, supporting Bloomberg’s claim.", "Under Bloomberg, New York City became a \"national model for how to reduce unsheltered and chronic homelessness,\" wrote Josh Leopold, a senior research associate.", "In an interview, Leopold said the administration did not interfere with his work on the report.", "Bloomberg’s management background contributed to the city’s efforts to organize street outreach and coordinate services for homeless people, he said.", "\"His administration should get a lot of credit for that,\" Leopold said.", "While the counting methodology does account for including some people the counters may have missed, the data can be unreliable, according to some experts.", "In a paper published by the conservative American Enterprise Institute, Kevin C. Corinth wrote that \"street counts are inherently difficult to conduct and should therefore be treated cautiously.\"", "Giselle Routhier, policy director for Coalition for the Homeless, an advocacy organization that has been critical of Bloomberg, said that the shelter census is a better measure.", "\"We never trust the HOPE estimate,\" Routhier said. The count could be influenced by various factors, such as the weather. Counters can also miss homeless people on the street because they may not always be in publicly visible places, such as an ATM vestibule, and efforts to get people off the street in the week before the annual count can affect the result, she said.", "New York City provides temporary emergency shelter to every eligible man, woman, and child, every night. This means that many of the city's homeless are in shelters, not on the street, Routhier said.", "While the street homeless population has fluctuated between 2,328 and 4,395 since 2005, according to the HOPE counts, the shelter population surpassed 50,000 under Bloomberg.", "Other homelessness experts gave Bloomberg mixed report cards on his efforts, even as some said that his claim of reducing street homelessness is correct.", "Thomas J. Main, a professor at the Marxe School of Public and International Affairs at Baruch College, credited Bloomberg’s efforts to prevent homelessness and his outreach to people living on the street. On balance, Bloomberg's record is positive, Main said.", "Main, however, wrote in his book, \"Homelessness in New York City: Policymaking from Koch to de Blasio,\" that a policy change that ended homeless families receiving priority in access to public housing \"would be seen as part of the reason why the shelter population was to grow to unprecedented levels.\"", "Main also notes homelessness is sometimes driven by factors outside of a mayor’s control, such as recessions and state and federal policy.", "City University of New York Professor John Krinsky called Bloomberg’s claim \"both technically true and very misleading,\" given the increase in the number of people staying in homeless shelters.", "Bloomberg claimed that under his administration, street homelessness decreased by 28 percent.", "City data confirms it decreased by 28 percent from when the city began counting in 2005, three years into Bloomberg's first term, until the year he left office.", "As experts pointed out, many more homeless people in New York City stay in shelters and do not live on the streets. But the Bloomberg claim specifically cited street homelessness.", "We rate this claim True.", "Bloomberg campaign website, \"Mike Unveils Plan to Tackle America’s Housing Affordability and Homelessness Crisis,\" Jan. 30, 2020.", "Phone interview, Giselle Routhier, policy director, Coalition for the Homeless, Feb. 19, 2020.", "Urban Institute, \"Innovations in NYC Health & Human Services Policy: Street Homelessness and Supportive Housing,\" Josh Leopold, February 2014.", "Urban Institute, \"Innovations in NYC Health & Human Services Policy: Homelessness Prevention, Intake, and Shelter for Single Adults and Families,\" Christin Durham and Martha Johnson, February 2014.", "Phone interview, Josh Leopold, senior research associate, Urban Institute, Feb. 21, 2020.", "Email interview, Michael Frazier, spokesman, Bloomberg campaign, Feb. 19, 2020.", "NYC.gov, Mayor’s Management Report, September 2013, City of New York. Accessed Feb. 19, 2020.", "NYC.gov, Department of Homeless Services, slideshow, \"HOPE 2018: HOPE NYC 2018 Results.\" Accessed Feb. 20, 2020.", "Coalition for the Homeless, blog post, \"Bloomberg on NYC Homelessness: A Total Lack of Accountability,\" Patrick Markee, Dec. 18, 2013. Accessed Feb. 20, 2020.", "NYC.gov, Department of Homeless Services, \"Shelter.\" Accessed Feb. 21, 2020.", "Phone interview, Thomas J. Main, professor, Marxe School of Public and International Affairs, Baruch College, Feb. 24, 2020.", "Book, \"Homelessness in New York City: Policymaking from Koch to de Blasio,\" Thomas J. Main, NYU Press, July 28, 2016.", "Email interview, John Krinsky, professor, Graduate Center and City College, CUNY, Feb. 24, 2020.", "NYC.gov, report, \"Turning the Tide on Homelessness in New York City,\" 2017. Accessed Feb. 25, 2020.", "American Enterprise Institute, report, \"Street homelessness: A disappearing act?,\" Kevin C. Corinth, June 2015. Accessed Feb. 25, 2020.", "New York City Independent Budget Office, fiscal brief, \"The Rising Number of Homeless Families in NYC, 2002-2012: A Look at Why Families Were Granted Shelter, the Housing They Had Lived in & Where They Came From,\" November 2014. Accessed Feb. 25, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]