["Several news organisations such as Zee News, Navbharat Times, Patrika and Punjab Kesari have published a video which has gone viral on social media. In the video, a woman can be seen walking on a street while talking on the phone, followed by a gentleman who yells, “अरे मैडम, ओ रुको अरे बुलाओ उनको” (Arre Madam, please stop, someone call her), and asks her to take her baby whom she left behind. Following this, the woman comes back and takes the baby with her.", "The video was also broadcast by ABP News in its programme Viral Khabar. All the media organisations, in their reports, have referred to this video having been posted by a social media user named Amit.", "The video is viral on social media with the message, “मोबाइल के चक्कर मे अपने बच्चे को ही भूल गयी” (Distracted by mobile, woman forgets her child- translated). This video has also been posted on Facebook by a page Sonepat Breaking News. The video has been viewed over 41,000 times from this link alone and shared over a thousand times.", "मोबाइल के चक्कर मे अपने बच्चे को ही भूल गयी 🤦🏻‍♂ आखिर ये चक्कर क्या है ….?", "Posted by Sonipat Breaking News on Friday, August 23, 2019", "The video has been circulated on Twitter, Facebook and YouTube.", "A close look at the video reveals that the accompanying claim is false. At 0:07 minutes in the video, behind the person carrying the child, a crowd can be seen gathered at the spot. The people stand still and watch what’s happening in front of them This suggests that the video is perhaps a scene from a shoot.", "Apart from this, a twitter user Aasif Todia commented that this is a video from a shoot, and posted another video of the same incident wherein the person seen in the viral video can be viewed clearly.", "Suting pic.twitter.com/AnWA60t5nU", "— Aasif todia 🔵 (@aasiftodia) August 24, 2019", "We found that a user Hetal Oza, commenting on another user  @Amit_smiling‘s post, said that this video is of a film shoot, adding that the person seen in the video is a Gujarati actor and has often been seen in the serial ‘Tarak Mehta Ka Oolta Chashma’.", "This man is an actor. Famous in gujarati theatres and also seen in Taarak mehta ka ooltah chashma many times. This must be some scene frm a tv/film.", "— Hetal Oza (@hetal007_oza) August 23, 2019", "On the basis of this claim, Alt News conducted a basic search and found that the person in the video is Sharad Sharma, who is an actor in Gujarati movies and shows. Alt News then contacted Sharma for clarification, who told us, “This is a video from a shoot. Last Monday, I shot at Nasik where I donned the role of a rickshaw walla. During the shoot, one of the bystanders recorded it and shared it on social media. When this video releases then you will be able to see these visuals.” (translated).", "A video shot by a bystander during a shoot was shared on social media with the false claim that a woman forgot her child behind in an auto as she was occupied with talking on a mobile phone.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]