["Following the Jan. 6 attack on the U.S. Capitol by a pro-Donald Trump mob, more than 400 suspects have been identified and over 130 have been arrested. Federal authorities say they expect to bring charges of seditious conspiracy \"very soon\" against some of those linked to the insurrection, a charge punishable by up to 20 years in prison, the Detroit Free Press reports.", "The action that day was spurred, at least in part, by supporters of the now-former president, who promoted false claims that the election was stolen from him. USA TODAY has debunked those claims.", "Related to allegations of election fraud, an Instagram post claims a 19th century act of treason led to a far harsher sentence than prison.", "\"Did you know in 1863 4 people where HUNG for TREASON....all because they tried to STEAL the ELECTIONS from Lincoln!\" writes one Facebook user in a Dec. 18 post, which has 7,300 shares. Another user posted the same claim on Dec. 31.", "It is unclear whether the posts were intended to be satirical. They appear to refer to the group of individuals involved in the assassination of the 16th U.S. president, Abraham Lincoln.", "USA TODAY reached out to the users for further comment.", "More:Fact check: No basis for claims that President Joe Biden's inauguration was faked", "Contrary to the post's claims, there was no one hung in 1863 for \"stealing\" the election from Lincoln nor any Confederates for treason against the federal government during the Civil War.", "On the night of April 15, 1865, actor John Wilkes Booth entered the presidential box of Ford's Theatre in Washington, where Lincoln sat with his wife, Mary Todd Lincoln, socialite Clara Harris and her fiancé, Major Henry Rathbone. Booth shot the president in the back of the head. Lincoln died the next day.", "Booth, a Confederate sympathizer who was \"deeply disappointed\" the Confederacy lost the war, regarded Lincoln as his personal enemy, said Terry Alford, author of \"Fortune's Fool – The Life of John Wilkes Booth,\" to WTOP News in 2014.", "The original plot against Lincoln, concocted some time before his assassination, was actually a kidnapping. Booth planned to \"snatch the president, spirit him away to Richmond, then exchange him for thousands of Confederate prisoners of war who could return to the battlefield.\"", "But after the capture of Richmond, Virginia, the Confederacy's capital, and surrender of General Robert E. Lee's army in early April 1865, \"kidnapping Lincoln made no sense\" and Booth decide to kill the president instead.", "Booth would be discovered weeks later in a tobacco barn in Port Royal, Virginia, with his co-conspirator David Herold, and died during the confrontation with the 16th New York Cavalry.", "Get these in your inbox: We're fact-checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "Herold and three others — Lewis Powell, George Atzerodt and Mary E. Surratt — were found guilty of conspiracy to assassinate Lincoln and hanged on July 7, 1865, not in 1863 as the post claims. Surratt was the first women to be executed by the federal government, according to the Washington Post.", "We rate this claim that in 1863 four people were hung for treason for stealing the election from Lincoln as FALSE, because it is not supported by our research. There are no reports of any individuals being hanged in 1863 for treason against Lincoln. The three men and one woman found guilty in Booth's plot to assassinate Lincoln were convicted and hung in July 1865, not 1863.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]