["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President-elect Joe Biden speaks Nov. 9, 2020, at The Queen theater in Wilmington, Del. (AP)", "Joe Biden is the clear winner of the presidential race, having won more votes than Donald Trump in battleground states like Wisconsin, Michigan and Pennsylvania and enough electoral votes overall.", "It’s unlikely that legal challenges from the Trump campaign will affect the outcome of the election.", "President-elect Joe Biden has won the most votes in the U.S. presidential election, but a map published on Facebook claims to show President Donald Trump with a slight edge in the electoral college.", "The map, published in a Nov. 11 post, shows Trump with 232 electoral votes and Biden with 227. The map shows North Carolina in the Trump column, while other battleground states — Arizona, Wisconsin, Michigan, Georgia, Nevada and Pennsylvania — are labeled as having \"incomplete or contested results.\"", "\"The real electoral map...... before the lying media called it for Biden,\" the caption says.", "(Screenshot from Facebook)", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Similar claims have spread in groups dedicated to the Stop the Steal movement, which took off after Election Day and has spread misinformation about voter fraud.", "We’ve seen several inaccurate and misleading electoral maps that make it seem like Trump was leading Biden in electoral votes. This one is similarly wrong.", "The map in the Facebook post comes from the Epoch Times, a pro-Trump news outlet with a history of publishing misinformation. As of Nov. 11, the website said the election outcome is \"unclear\" and that it \"will not declare a winner of the election until all results are certified and any legal challenges are resolved.\"", "States have until Dec. 8 to finalize their results. State electors cast their ballots Dec. 14, but the vote will not be made official until Jan. 6, when Congress tallies the electoral votes.", "But Biden is the clear winner, as he received more votes than Trump in battleground states like Wisconsin, Michigan and Pennsylvania, which helped put him over the 270 electoral vote threshold for election. Every major TV network and the Associated Press has projected that Biden won the election.", "In Pennsylvania, the former vice president led by more than 50,000 votes. It’s unlikely that the Trump campaign’s legal challenges in the state will make up that gap.", "So where does the electoral map stand?", "As of Nov. 12, Biden was projected to win 290 electoral votes — 20 more than he needs to win the White House — while Trump is expected to win 217. The AP hasn’t called North Carolina or Georgia for either candidate.", "The Facebook post is inaccurate. We rate it False.", "AP ELECTION RESULTS 2020, accessed Nov. 11, 2020", "The Epoch Times, \"ELECTION OUTCOME UNCLEAR AMID PENDING RECOUNTS AND LEGAL CHALLENGES,\" Nov. 11, 2020", "Facebook post, Nov. 11, 2020", "Facebook post, Nov. 11, 2020", "NewsGuard, theepochtimes.com", "The New York Times, \"How The Epoch Times Created a Giant Influence Machine,\" Oct. 24, 2020", "The New York Times, \"Tracking Which News Outlets Have Called the Presidential Race in Each State,\" Nov. 7, 2020", "NPR, \"Trump Election Lawsuits Have Mostly Failed. Here's What They Tried,\" Nov. 10, 2020", "Pennsylvania Department of State, 2020 Presidential Election, Tuesday, November 3, 2020, Unofficial Returns - Statewide, accessed Nov. 11, 2020", "The Philadelphia Inquirer, \"Do Trump’s legal challenges have any chance of changing Pa.’s election results? A look at the suits he hopes can do it.\" Nov. 9, 2020", "PolitiFact, \"Election results map spreading on social media is from 2016, not 2020,\" Nov. 11, 2020", "PolitiFact, \"Fact-checking social media posts about Biden’s lead in battleground states,\" Nov. 10, 2020", "PolitiFact, \"How online misinformation unfolded after Election Day, boosted by Trump and his allies,\" Nov. 5, 2020", "PolitiFact, \"The media have called the presidential race for Joe Biden. Here's what's next,\" Nov. 7, 2020", "PolitiFact, \"Trump, with help, is trying to sue and tweet his way to a second term. Could it work?\" Nov. 11, 2020", "USA Today, \"Nine legal experts say Trump's lawsuit challenging election results in Pennsylvania is dead on arrival,\" Nov. 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]