["About this rating", "On 7 May 2016, the World News Daily Report (WNDR) web site published an article reporting that \"a panel of Saudi scientists\" had concluded women were mammals, but not humans:", "In an unprecedented ruling, a panel of Saudi scientists has concluded that women are actually mammals, granting them the same rights as other mammal species such as camels, dromedaries and even goats.", "The verdict, which fell just hours before the International Women’s Day, is considered “historic” by some experts and advocacy groups for women’s rights.", "“This is a great leap forward for women’s rights in Saudi Arabia,” concludes Jane Austin, spokeswoman for the Women’s Liberation Action Network. “It may seem too little, too late, but it is truly a milestone event for all women in the region,” she says, visibly excited. “From now on, women will be considered as members of the mammal class, whereas before women shared the legal status of an object, similar to that of a home appliance,” she admits.", "The large visible logo visible in the accompanying photograph purportedly showing the panel of Saudi scientists indicates that it was taken at the World Government Summit, a yearly event held in Dubai as a \"global platform dedicated to shaping the future of government worldwide.\"", "The program for the World Government Summit 2016 did not include any Saudi scientists listed among the event's speakers, nor any presented reports touching on the biological classification of women.", "Not surprisingly, this unusual news about a ruling from \"a panel of Saudi scientists\" was reported exclusively by World News Daily Report, a well-known purveyor of fake news whose disclaimer says:", "WNDR assumes however all responsibility for the satirical nature of its articles and for the fictional nature of their content. All characters appearing in the articles in this website – even those based on real people – are entirely fictional and any resemblance between them and any persons, living, dead, or undead is purely a miracle.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]