["About this rating", "On Oct. 27, 2019, U.S. President Trump announced the death of Islamic State (IS) leader Abu Bakr al-Baghdadi. As news outlets quickly fielded reports about the terrorist leader's death, the Washington Post published an obituary that labeled al-Baghdadi an \"austere religious scholar.\"", "Screenshots of this obituary headline were widely shared on social media along with criticism of the news outlet. Former White House Press Secretary Sean Spicer, for instance, posted the following message on Twitter:", "Stop, read this & think about it: last night a ruthless, brutal terrorist who threatened our country & is responsible for the death of American citizens was killed in a successful operation by US military & @washingtonpost described #Albagdadi as an “austere religious scholar” pic.twitter.com/Mjptm0Fa3Z", "— Sean Spicer (@seanspicer) October 27, 2019", "This is a genuine headline that briefly appeared on Washingtonpost.com. An archived version of the article can be found here.", "The headline appeared on the Washington Post's website for about two hours. The story was published at 8:31 a.m. CDT, according to the article's timestamp. This headline was changed to \"Abu Bakr al-Baghdadi, extremist leader of Islamic State, dies at 48\" at about 10:35 a.m., according to archived links from the Internet Wayback Machine.", "Kristine Coratti Kelly, the vice president and communications general manager of Washington Post Live, posted a message on Twitter saying that the headline \"should never have read that way.\"", "Regarding our al-Baghdadi obituary, the headline should never have read that way and we changed it quickly.", "— Kristine Coratti Kelly (@kriscoratti) October 27, 2019", "The qualms over the Washington Post's headline likely served as the inspiration of a meme targeting another \"mainstream media\" outlet, CNN. Some social media users started to share an image that supposedly showed a screenshot from a CNN broadcast about al-Baghdadi's death featuring the chyron \"Trump Kills Unarmed Father of Three\":", "For the record, while the Washington Post briefly published a headline for al-Baghdadi's obituary labeling him a religious scholar, the above-displayed chryon is a digital manipulation featuring a years-old image of Don Lemon that never aired on CNN.", "Warrick, Joby.   \"Abu Bakr al-Baghdadi, Extremist Leader of Islamic State, Dies at 48.\"\r\n    The Washington Post.   27 October 2019.", "Warrick, Joby.   \"Abu Bakr Al-Baghdadi, Extremist Leader of Islamic State, Dies at 48.\"\r\n    The Washington Post.   27 October 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]