["About this rating", "Pelosi and Trump's top emissary — U.S Treasury Secretary Steven Mnuchin — for months butted heads over details of a comprehensive COVID-19 stimulus bill, and they had not come to a final agreement, as of this writing. Pelosi called the White House's proposal too meager and wanted to spend more money on things such as virus testing and child care.", "However, the House Speaker's opposition to the White House's proposal was not the only reason it was stalled — some Republicans, too, were hesitant to support the Trump administration's spending plan. Top GOP vote-counter Sen. John Thune told reporters that \"it'd be hard\" for Trump to convince Republican Senators to vote for his plan. And Senate Majority Leader Mitch McConnell said he told the White House not to compromise with Pelosi, according to news reports.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "After a months-long political debate over how to address America's pandemic-stricken economy and just 13 days before the 2020 presidential election, U.S. House Speaker Nancy Pelosi's office announced she and U.S. President Donald Trump's top emissary, Treasury Secretary Steven Mnuchin, were inching toward an agreement on a new economic stimulus package.", "\"Both sides are serious about finding a compromise,\" tweeted Drew Hammill, a spokesperson for Pelosi, on Oct. 20.", "The announcement came after repeated claims by Trump that Pelosi was the sole roadblock in his administration's plans to spend about $1.8 trillion on unemployment benefits, schools, and other initiatives — adding to $3 trillion in emergency relief that the federal government approved in spring 2020. In a nationally televised town hall on Oct. 15, for instance, Trump said of Pelosi:", "\"We are ready to sign and pass stimulus, but she’s got to approve it,\" he said. \"She’s penalizing our people. I’m ready to sign a big, beautiful stimulus.\"", "Days later, while speaking to a Milwaukee news reporter, Trump suggested that Pelosi, who was running a reelection campaign to represent California's 12th Congressional District, was not negotiating in good faith and purposefully delaying a consensus until after the Nov. 3 election. That way, in theory, she and Democrats could restart stimulus talks with Democratic presidential nominee Joe Biden in the White House.", "\"She thinks it's good politically for her not to approve it,\" Trump said.", "In an interview with Bloomberg, Pelosi denied that accusation by the president and his supporters and said she would not be negotiating with the White House if she did not want an agreement.", "Nonetheless, a closer look at the stimulus negotiations showed a more complex debate. It was not just Pelosi with whom the White House needed reconciliation to pass COVID-19 economic relief in fall 2020 as the president alleged.", "Here's what was true: Members of Congress and the White House reached an impasse over COVID-19 emergency spending in fall 2020. Mnuchin and Pelosi had intermittently negotiated terms of a comprehensive relief package since August, and the Democrat-led House approved a package totaling about $2.2 trillion concurrently.", "Weeks later, as the election crept closer, Trump said in media interviews that he would sign a package that was greater than House Democrats' proposal, even though key Republicans wanted him to go the opposite direction in negotiating.", "\"I would rather go bigger than that [$2.2 trillion] number, but we'll see,\" he said on Fox & Friends. \"[Pelosi] doesn't want to do anything until after the election, because she thinks it helps her. I actually think it helps us because everyone knows she's the one who's breaking up the deal.\"", "All of that said, the Democrat-approved plan overlapped in some areas with the White House's proposal to help small businesses and pay each eligible U.S. citizen a one-time $1,200 check.", "But this was key: Trump's GOP allies in the Senate were skeptical of any proposal greater than $1 trillion. For months, they had debated economic stimulus measures smaller than the White House's initial proposal of about $1.6 trillion, which later grew to $1.8 trillion before Trump said he wanted to spend more than Democrats. Reuters reported: \"Senate Republicans have repeatedly stated their opposition to additional COVID-19 relief spending near the $2 trillion mark and have focused instead on smaller initiatives.\"", "The Republicans were focusing on one-off initiatives to help businesses and families instead of a comprehensive spending bill. They supported one measure in particular that totaled about $650 billion in emergency economic relief, or about one-third the amount of Trump's proposal.", "In other words, the disagreement over funding was not along party lines, with Senate Republicans taking Trump's side and Pelosi leading an oppositional force, like most political battles over Trump's first term. Rather, key Republicans were skeptical of a relief package greater than $1 trillion and had not expressed support for the White House's proposal.", "As proof of that lack of enthusiasm for Trump's COVID-19 spending plan, the leading GOP vote-counter, Sen. John Thune, told reporters on Oct. 19 that \"it’d be hard\" to find the necessary Republican support to pass the $1.8 trillion package.", "Additionally, multiple news reports said McConnell told Senate Republicans the following day that he had advised the White House against making any deal with Pelosi before the election — significant evidence that the House Speaker was not the only barrier to a compromise. The New York Times reported:", "Mr. McConnell’s counsel, confirmed by three Republicans familiar with his remarks, threw cold water on Mr. Trump’s increasingly urgent push to enact a fresh round of pandemic aid before he faces voters on Nov. 3. It underscored the divisions within the party that have long hampered a compromise.", "Republicans are growing increasingly anxious that Mr. Trump and his team are too eager to reach a multitrillion-dollar agreement and are conceding far too much to the Democrats. Republicans fear that scenario would force their colleagues up for re-election into a difficult choice of defying the president or alienating their fiscally conservative base by embracing the big-spending bill he has demanded.", "The Washington Post added:", "Many Senate Republicans oppose a massive new spending bill and McConnell is not eager to hold a vote that would divide his conference just before the election, when most Senate Republicans want attention focused on the Barrett nomination. [...]", "McConnell’s remarks Tuesday indicate that even if Pelosi and Mnuchin do manage to reach a deal, any vote in the Senate would wait until after the election. If Democrats win a number of seats in the November elections, they could seize control of the Senate beginning in January.", "Nonetheless, if or when Pelosi and Mnuchin reached an agreement, Trump suggested on multiple occasions without evidence that he could convince naysayers to agree to whatever he wanted. \"He'll be on board if something comes,\" Trump said of McConnell's reluctance in the Fox News interview. \"Not every Republican agrees with me, but they will.\"", "The time window for an agreement before the Nov. 3 election was narrowing as of this report. Hammill, the spokesman for Pelosi, on Oct. 20 tweeted that Mnuchin and Pelosi had a 45-minute conversation earlier in the day that showed they were \"serious about finding a compromise\" and moving closer to an agreement in the coming days or weeks with the help of congressional committee chairs.", "In sum, considering McConnell, the Senate Majority leader, had reportedly told the White House to not make a deal with Pelosi — proof that the House Speaker was not the only barrier to an agreement — as well as a comment by another Senate Republican that \"it'd be hard\" to rally his colleagues around Trump's plan for emergency economic spending, we rate this claim a \"Mixture\" of truth and falsehoods.", "Factba.se.   \"Interview: Charles Benson of WTMJ4 Milwaukee Interviews Donald Trump - October 17, 2020.\"\r\n    Accessed 20 October 2020.", "Rev.   \"Donald Trump NBC Town Hall Transcript October 15.\"\r\n    Accessed 20 October 2020.", "Nancy Pelosi Newsroom.   \"Dear Colleague: Update on Effort to Reach Coronavirus Relief Agreement Before Election.\"\r\n    18 October 2020.", "Nancy Pelosi Newsroom.   \"Transcript of Pelosi Interview on ABC's This Week With George Stephanopoulos.\"\r\n    18 October 2020.", "Nancy Pelosi Newsroom.   \"Dear Colleague on Urgency to Pass Relief Bill with Values and Common Sense.\"\r\n    15 October 2020.", "Nancy Pelosi Newsroom.   \"Transcript of Pelosi Interview on MSNBC's The ReidOut with Joy Reid.\"\r\n   19 October 2020.", "Taylor, Andrew.   \"Deadline Looms, But COVID Relief Deal May Be Far Off.\"\r\n   The Associated Press.   20 October 2020.", "Zeballos-Roig, Joseph.   \"Senate Republicans Are Pouring Cold Water on Approving A Multi-Trillion Dollar Stimulus Deal As Trump Pushes For A Larger Relief Package Than Democrats.\"\r\n   Business Insider.    20 October 2020.", "Henney, Megan.   \"Trump Says He Want A Bigger Coronavirus Relief Package Than Pelosi's $2.2T Proposal.\"\r\n   FOXBusiness.   20 October 2020.", "Stein, Jeff, et. al.   \"Trump Makes $1.8 Trillion Economic Relief Offer, But Deal With Pelosi Remains Elusive.\"\r\n    The Washington Post.    9 October 2020.", "Cornwell, Susan.   \"Trump Pushes For Major COVID-19 Deal Over Senate Republican Objections.\"\r\n   Reuters.   20 October 2020.", "House, Billy, et. al.   \"Pelosi Mnuchin Narrowing Gap on Stimulus, to Talk Again Tuesday.\"\r\n   Bloomberg.   19 October 2020.", "Fandos, Nicholas.  \"McConnell Advises White house Not to Strike Pre-Electino Stimulus Deal With Pelosi.\"\r\n   The New York Times.   20 October 2020.", "Stein, Jeff, and Werner, Erica.  \"McConnell Warns White House Against Making Stimulus Deal Before Election, Sources Say.\"\r\n   The Washington Post.   20 October 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]