["In this Oct. 19, 1918, photo provided by the U.S. Naval History and Heritage Command, a sign is posted at the Naval Aircraft Factory in Philadelphia that indicates what was called the Spanish flu was then extremely active. (AP)", "The post suggests pandemics occur with synchronicity every 100 years, in 1720, 1820, 1920 and 2020.", "There wasn’t a pandemic in 1720. The years listed for the next two pandemics are wrong.", "Many more pandemics have occurred outside of a neat timeline.", "According to this post on Facebook, pandemics like COVID-19 strike with eerie precision, every 100 years:", "\"1720 — Plague; 1820 — Cholera outbreak; 1920 — Spanish flu; 2020 — Chinese coronavirus. What’s happening? There is a theory that every 100 years, a pandemic happens. At first glance, nothing seems strange, but the accuracy with which these events take place is scary.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The plague cited wasn’t a pandemic; two of the other examples didn’t occur neatly in the years cited; and, most importantly, numerous other pandemics have occurred without such synchronicity.", "\"I am suspicious of the idea that pandemics operate to a railroad timetable,\" Yale University history professor Frank Snowden, author of \"Epidemics and Society,\" told PolitiFact, noting several problems with the post.", "The World Health Organization defines pandemic as: \"The worldwide spread of a new disease.\"", "The definition from the U.S. Centers for Disease Control and Prevention is nearly the same: \"A pandemic is a global outbreak of disease. Pandemics happen when a new virus emerges to infect people and can spread between people sustainably.\"", "The Facebook post suggests that pandemics only occur every 100 years. But that ignores numerous pandemics, including the Great Plague of London, in 1665; yellow fever in the late 1800s; the H2N2/Asian flu in 1957-1958; the H3N2 flu virus in 1968; and the H1N1/swine flu in 2009.", "Now, a breakdown of the four outbreaks cited in the post:", "Plague, an infectious fever caused by a bacterium transmitted from rodents to humans by the bite of infected fleas, caused some of the worst pandemics in history, according to Britannica.com.", "What was known as Great Plague of Provence, or Great Plague of Marseille, killed as many as 126,000 people in southern France starting in 1720, according to an article by Cindy Ermus, a history professor at the University of Texas at San Antonio who is writing a book on the outbreak. But because this particular episode of plague happened largely in France, it wasn’t a pandemic.", "The first pandemic of cholera began three years before the post claimed.", "\"Since first spreading from Calcutta along the Ganges Delta in 1817, it has killed millions,\" says the Robert Wood Johnson Foundation, which supports health research and programs.", "During the 1854 Broad Street cholera outbreak in the Soho district of London, according to the foundation, English physician John Snow had, based on his theory that cholera was transmitted by exposure to contaminated water, \"used extensive interviews and intricately plotted maps to trace the source of the outbreak to a single water pump. Disabling the pump ended the outbreak almost immediately, in a poignant example of an early, effective public health intervention.\"", "This influenza pandemic started two years before what the post claims and is more accurately called \"The Great Influenza\" by modern historians.", "The pandemic \"was caused by an H1N1 virus with genes of avian origin. Although there is not universal consensus regarding where the virus originated, it spread worldwide during 1918-1919,\" according to the CDC. \"In the United States, it was first identified in military personnel in spring 1918. It is estimated that about 500 million people or one-third of the world’s population became infected with this virus. The number of deaths was estimated to be at least 50 million worldwide with about 675,000 occurring in the United States.\"", "It was called the Spanish flu \"not because it originated in Spain but because it was World War I, and Spain was the only country being honest about the toll the pandemic took on the country,\" according to a Washington Post article on the deadliest pandemics in history.", "The post is more or less correct in saying this pandemic is from 2020.", "COVID-19 can be traced back at least to Dec. 31, 2019, when the government in Wuhan, China, confirmed that health authorities were treating dozens of cases of pneumonia from an unknown cause. Eight days later, China identified a new type of coronavirus. The first coronavirus case in the United States was confirmed on Jan. 21, 2020.", "The World Health Organization declared COVID-19 a pandemic on March 11, 2020, saying it is the first pandemic caused by a coronavirus.", "A claim on Facebook that a pandemic occurs exactly every 100 years cites four outbreaks that it says occurred in 1720, 1820, 1920 and 2020. But the first example was not a pandemic and the second and third started a couple of years before 1820 and 1920.", "More importantly, the claim ignores many other pandemics over several centuries that did not occur in such a neat pattern.", "We rate the statement False.", "Facebook, post, March 24, 2020", "World Health Organization, \"Rolling updates on coronavirus disease (COVID-19),\" April 7, 2020", "World Health Organization, \"What is a pandemic?\" Feb. 24, 2010", "Britannica.com, \"Plague,\" March 21, 2020", "Washington Post, \"The danger of prioritizing politics and economics during the coronavirus outbreak,\" March 13, 2020", "Robert Wood Johnson Foundation, \"The Five Deadliest Outbreaks and Pandemics in History,\" Dec. 16, 2013", "AFP Fact Check, \"Health experts dismiss false claim that COVID-19 fits a pattern of viral outbreaks every 100 years,\" March 16, 2020", "U.S. Centers for Disease Control and Prevention, \"100 Years Since 1918: Are We Ready for the Next Pandemic?\" accessed April 8, 2020", "Washington Post, \"History’s deadliest pandemics, from ancient Rome to modern America,\" April 7, 2020", "U.S. Centers for Disease Control and Prevention, \"Situation Summary,\" April 7, 2020", "U.S. Centers for Disease Control and Prevention, \"1918 Pandemic (H1N1 virus),\" March 20, 2019", "U.S. Centers for Disease Control and Prevention, \"Past pandemics,\" accessed April 8, 2020", "Snopes, \"Have Plagues Repeated Exactly Every 100 Years?\" April 7, 2020", "Email, Yale University history professor Frank Snowden, author of \"Epidemics and Society,\" April 9, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]