["In the weeks since rioters stormed the U.S. Capitol apparently attempting to stop Congress from counting electoral votes that would confirm President Joe Biden’s election victory, some social media users have compared the Jan. 6 insurrection to other recent demonstrations.", "One such post uses images of protesters demonstrating in late 2018, during the confirmation hearings for now-Supreme Court Justice Brett Kavanaugh, who was accused of sexual assault as a teenager – an allegation he denied. An array of photos on the post shows protesters being removed by U.S. Capitol Police, pounding on the doors of the Supreme Court and occupying the Capitol steps.", "It reads: “No this was not yesterday. This was in 2018 when the liberals and Democrats stormed the Capitol building and the Supreme Court building and disrupted and desecrated them over Judge Kavanaugh, or did we all forget about that.”", "The screenshot of that post has been viewed thousands of times on Facebook after being shared by dozens of individual users. The earliest identifiable individual who shared the post could not be reached for comment.", "Fact check:Biden administration delays implementation of Trump rule on insulin, EpiPens", "While Kavanaugh answered questions from senators during his confirmation hearings, protesters demonstrated both inside and outside the U.S. Capitoland at the Supreme Court.", ".", "They were demonstrating after California professor Christine Blasey Ford accused Kavanaugh, initially in an anonymous letter and then in testimony during the confirmation hearings, of sexually assaulting her when the two were teenagers decades earlier. Kavanaugh, then a federal appeals court judge, vehemently denied the allegation.", "While some people protested outside, others waited in line for tickets to the confirmation hearing, where they stood to disrupt senators' questioning of Kavanaugh, according to Reuters.", "Inside the Hart Senate Office Building, protesters unfurled banners and even directly confronted Sen. Jeff Flake, R-Ariz., according to USA TODAY. Several were taken out of the Dirksen Senate Office Building in plastic cuffs.", "While protesters did push past a police barricade in front of the steps of the Supreme Court to pound on its doors, according to NBC News, USA TODAY could find no reference to protesters entering the Supreme Court building.", "Capitol Police said in a press release they arrested more than 100 people for infractions that ranged from crowding and obstructing to unlawful conduct on Oct. 5, 2018, but The Washington Post reported that nearly 300 protesters had been arrested.", "That followed hundreds of protesters arrested during earlier hearings, including about 200 in early September 2018, mostly for disorderly conduct, according to Reuters.", "USA TODAY could find no reference to those protesters damaging the Supreme Court or Capitol, which was open to the public in 2018. During the Jan. 6 riot, though, the Capitol and its visitors center were closed to the public, including tours led by members of Congress and their staff, according to a security notice sent to all members of Congress.", "The six photos used in the viral post are cropped and sourced from Reuters, the Associated Press and Getty Images, which covered the events.", "Fact check:What's true about the Capitol riot, from antifa to BLM to Chuck Norris", "Although both demonstrations brought thousands of people to the Capitol, the Jan. 6 insurrection that followed a speech from then-President Donald Trump left both demonstrators and police injured or, in some cases, dead.", "Video and images from the riot show demonstrators beating a police officer with objects, including a hockey stick; assaulting a photographer; carrying zip-tie handcuffs, and breaking out windows in the Capitol.", "U.S. Capitol Police also reported that two pipe bombs were discovered nearby during the demonstrations.", "“These individuals actively attacked United States Capitol Police Officers and other uniformed law enforcement officers with metal pipes, discharged chemical irritants, and took up other weapons against our officers. They were determined to enter into the Capitol Building by causing great damage,” now-former U.S. Capitol Police Chief Steven Sund said in a prepared statement.", "A Capitol police officer died from injuries sustained during the riot, according to the department, and a Capitol police officer shot and killed a woman who was trying to enter the Speaker’s Lobby through a broken window.", "Three other people died from medical emergencies during the demonstration.", "As of Feb. 1, the Department of Justice has announced federal charges related to the Jan. 6 insurrection against 160 people from across the country. Charges include assault of a federal officer, carrying a gun or ammunition on Capitol grounds, violent entry on Capitol grounds and theft of government property, among others.", "A post equating the Jan. 6 riot at the U.S. Capitol to 2018 demonstrations against the confirmation of Brett Kavanaugh to the Supreme Court is MISSING CONTEXT, based on our research, because without additional information it could be misleading. Photos in the post authentically represent the 2018 protests, but the text leaves out key differences between the demonstrations, including violence during the Jan. 6 riot that resulted in the death of a U.S. Capitol Police officer and a demonstrator. Protesters also did not enter the Supreme Court in 2018, as the post claims. The Capitol was open to the public in 2018, but closed during the Jan. 6 riot.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]