["The newspaper published the article (archived here) on November 2, 2020, within hours of Tedros tweeting that he was self-quarantining after someone he had been in contact with tested positive for Covid-19.", "“BREAKING: WHO DG contracts COVID-19,” reads the headline of the article, which was shared across The Nation’s social media platforms, including on Facebook and Twitter.", "Other news websites in Nigeria such as WithinNigeria, Oriental Times, and Republican Nigeria republished the same short article, with slightly different headlines.", "While these articles’ headlines all allege that Tedros was infected with Covid-19, they go on to explain that this is based on his tweet from November 1, 2020, where the 55-year-old former Ethiopian minister of health said he was “identified as a contact of someone who has tested positive for #COVID19” and that he was, therefore, self-quarantining in line with WHO protocols.", "It is critically important that we all comply with health guidance. This is how we will break chains of #COVID19 transmission, suppress the virus, and protect health systems.", "Nowhere in Tedros’s tweet thread or subsequent tweets does he say that he himself tested positive, nor does he say if he underwent testing.", "AFP reported that the WHO chief’s announcement came as there is growing anger and exasperation over new coronavirus curbs, as several European nations announced fresh lockdowns and restrictions aimed at halting rising infections and deaths.", "An individual is deemed Covid-19 positive if they are tested and confirmed to have been infected.  Meanwhile, a contact person refers to someone who has been in close contact with someone who has tested positive.", "Although it is possible that Tedros might later announce that he has been tested and found either negative or positive for Covid-19, he has not yet said anything about this as of November 2, 2020.", "The WHO also dismissed the reports.", "“Contrary to some incorrect reports, @DrTedros hasn't tested positive for #COVID19,” reads a WHO tweet from November 2, 2020. “He has been identified as a contact of a person who tested positive. Dr Tedros is feeling well and is in self-quarantine as a precautionary measure, in line with WHO protocols.”", "Contrary to some incorrect reports, @DrTedros hasn't tested positive for #COVID19. He has been identified as a contact of a person who tested positive.\n\t\tDr Tedros is feeling well and is in self-quarantine as a precautionary measure, in line with WHO protocols. https://t.co/dDjh9ZTDcN", "Tedros has been at the forefront of the United Nations health agency's efforts to battle the pandemic that has claimed nearly 1.2 million lives and infected more than 46 million people globally since emerging in China late last year.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]