["This Facebook post was published February 1, 2020, as the death toll and number of infections of COVID-19 continued to surge in and outside mainland China.", "Below is a screenshot of the post, which has been shared more than 38,000 times:", "Published alongside a stock photo of a ginger root, the lengthy post states in part: “Cure for coronavirus\n\tIn case you contract this.. don't eat for 24 hours. And boil ginger and drink it like water but it has to be hot... You will drink it for 3 days continuously.", "“Ways to boil ginger\n\tBoil according to your taste because this is pungent. But better if you boil a lot so the virus dies faster.”", "The post says that drinking hot liquid works because “coronavirus is a virus that lives only in cold weather... It is unlikely they'll live in warm weather… Remember that all kinds OF coronavirus only live in cold weather.”", "Similar claims have also been shared here, here and here on Facebook.", "These claims are misleading; health experts say there is no scientific evidence boiled ginger can definitively cure people of the viral infection, and advised those showing symptoms to seek immediate medical help, instead of testing home remedies.", "In response to the claim, Dr. Mark Kristoffer Pasayan, a fellow at the Philippine Society for Microbiology and Infectious Diseases, told AFP on February 12, 2020: “For all coronaviruses, there is no evidence pointing to the efficacy of this method to prevent and even cure viral infections.", "“Having low humidity and cold environments makes it easy for one pathogen to be transmitted from one person to another... but it is not connected with the intake of any hot food or item.”", "Pasayan also said the claim was a “false report”, like many circulating online, including drinking boiled garlic. Here is an AFP report on prominent online misinformation on false virus cures.", "The WHO also told AFP that there is not enough evidence to suggest a connection between temperature and the novel coronavirus.", "In an email to AFP on February 12, 2020, a spokesperson for the WHO said: “The virus is too new for us to know how weather could affect transmissibility.", "“The virus has affected people in cold/dry and warm/wet climates.”", "The WHO’s latest guidelines do not advise of a specific medicine – herbal or otherwise – to prevent or treat the novel coronavirus.", "The report reads, in part: “If you want to protect yourself from getting infected with the new coronavirus, you should maintain basic hand and respiratory hygiene, and safe food practices and avoiding close contact, when possible, with anyone showing symptoms of respiratory illness such as coughing and sneezing.", "“If you have fever, cough and difficulty breathing seek medical care early to reduce the risk of developing a more severe infection and be sure to share your recent travel history with your healthcare provider.”", "More than 1,350 people have died from COVID-19 in mainland China, while nationwide infections have risen to nearly 60,000 since late 2019, according to this AFP report dated February 13, 2020.", "The WHO said that despite assurances from the Chinese government that the outbreak would peak in weeks, it remains too early to predict the stage of the epidemic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]