["About this rating", "In September 2015, an image began circulating via social media, stating that teens could text 741741 in order to speak with a crisis counselor.", "Many were skeptical about the program, since the organization behind it was not identified in the image. Nonetheless, 741741 is indeed the number for the Crisis Text Line in the United States and Canada.", "Although the image specified \"teens,\" the number is available to anyone in crisis:", "Q: HOW DOES CRISIS TEXT LINE WORK?", "You text 741741 when in crisis. Anywhere, anytime. A live, trained crisis counselor receives the text and responds quickly. The crisis counselor helps you move from a hot moment to a cool calm to stay safe and healthy using effective active listening and suggested referrals – all through text message using CTL’s secure platform.", "Q: WHO SHOULD TEXT IN? A: We exist to help anyone in crisis any time.", "The Crisis Text Line also notes in their FAQ that all text messages are anonymous and free, although charges may apply with carriers other than AT&T, T-Mobile, Sprint, or Verizon.", "In a June 2015 article published by the Chicago Tribune, Nancy Lublin, the CEO of DoSomething.org, explained why she founded the Crisis Text Line:", "The text message to a DoSomething.org staffer read: \"He won't stop raping me. He told me not to tell anyone.\"", "Those words quickly made their way to Nancy Lublin, the CEO of the New York City-based youth empowerment group, which runs do-good campaigns by text, like initiatives for gender-neutral bathrooms and sharing tips to prevent texting while driving.", "Lublin's staff had received a few messages — concerns about bullying and the like — unrelated to their campaigns, but \"that one message stopped me in my tracks,\" Lublin said. \"It was like being punched in the stomach. The first rule of marketing and sales is: Go where demand is. People want this by text. We should be supplying crisis counseling by text.\"", "That week, Lublin started building Crisis Text Line, a national 24/7 text number — 741741 — available to everyone but mostly used by teens. It went live two years later in 2013 in Chicago and El Paso, Texas. Chicago was chosen because of the influence of an early funder, the Chicago-based MacArthur Foundation. El Paso was a data-driven decision based on its large Latino population.", "Within four months, the line had been contacted by cellphones from every area code in America. The organization is expected to surpass 7 million messages by July, and Lublin is now in need of more counselors.", "The service is available 24 hours a day in the United States and Canada.", "9 September 2019, 7:35 A.M.: Updated to accurately reflect the name of the Crisis Text Line in both the U.S. and Canada.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]