["About this rating", "A man who claims to have extrasensory perception (ESP) allegedly sent a letter predicting a devastating tsunami by the end of 2017 to Indian Prime Minister Narendra Modi. In his letter, which went viral in September 2017, Babu Kalayil claims to have predicted that an earthquake will strike somewhere in the Indian Ocean, causing the tsunami:", "Respected Sir,", "In the Indian Ocean there is an earth quake expecting before 31st December 2017. This Vigerous earth quake can be shaked the entire coast of the Asian continental areas. More over this effect will even replaced the boundary of sea shore. This will extent in to Eleven countries named, India, China, Japan, Pakistan, Nepal, Bangladesh, Thyland, Indonesia, Algantstan, Srilanka and will proceed into Gulf countries too, The possibility to strike the “SHEESHMA” storm during this period which exist for about 120km to 180km with mighty power. Heavy rain harbor waves (Tsunami).", "The above observation made on August 20, 2017 with the help of ESP.", "Thanking You,", "Yours Sincerely,", "Babu Kalayil", "First and foremost, earthquake prediction — at least when limited by things that have a scientific basis — is one of the major as-yet-unrealized dreams of seismology. The best science can offer outside of probability estimates are warnings after an earthquake has occurred but prior to its effects reaching an area further away — something that provides advance notice on the order of seconds, but which is not, strictly speaking, a prediction.", "ESP is not supported by any rigorous science, but even if it were, Kalayil’s claims — encompassing a four-month period of time and the entirety of an ocean basin that frequently experiences earthquakes — are pretty vague. What science can tell us is that, based on the geologic record of tsunamis from northern Sumatra that goes back 1,000 years, tsunamis on the scale Kalayil describes in that region are quite rare:", "These findings [...] suggest that damage-causing tsunamis in Aceh [a region in northern Sumatra] recur infrequently enough for entire human lifetimes to typically elapse between them. Such recurrence adds to the challenge of preparing communities along the northern Indian Ocean shorelines for future tsunamis.", "This is not the first time Kalayil has turned up in the news. A dubious 2005 story published in the Indian newspaper The Hindu described an alleged effort (which we cannot verify) by a physicist identified as “G. Renuka” at the University of Kerata to test Kalayil’s powers of ESP:", "Dr. Renuka says that on August 2, 2001, Babu had predicted the presence of water on Mars, a month before a team of Hungarian scientists reported the presence of water on the red planet. Scientists at the Berkeley University of California had claimed to have discovered a new planet, 50 light years from the earth, in 2004. Mr. Babu had, in 1998, predicted the existence of such a planet. Dr. Renuka also notes that Mr. Kalayil had predicted, again using ESP, sounds similar to thunder emanating from Titan, one of the 10 moons of Saturn. It was in October, 2004, that he made this prediction, which was firmed up on January 16, 2005.", "Regardless of the veracity of any of those claims (which also sound quite broad), fear-mongering reports that his letter should hold any weight whatsoever are misinformed. While his stationery is impressive looking and contains an excellent play on words (defining ESP as both extrasensory perception AND earth and space prediction), he is merely an individual who believes he has the power to see the future.", "Indian fact-checking website Boom attempted to contact Kalayil through the numbers listed on his letter, but received no response. As such, we rank the claim of any valid prediction regarding an Indian Ocean earthquake/tsunami prior to December 31, 2017 as false.", "News River.   \"This Will Happen End of December…Warning Letter to the Prime Minister of India..!! Modi Has Gone Shock?\"\r\n    25 September 2017.", "Jacob, Jency.   \"FactChecking Predictions Of An Earthquake Before December 31, 2017.\"\r\n    Boom.   27 September 2017.", "Hough, Susan Elizabeth.   Predicting the Unpredictable: The Tumultuous Science of Earthquake Prediction.\r\n    Princeton University Press, 2017.   9780691173306.", "Fesenmaier, Kimm.   \"An Earthquake Warning System in Our Pockets?\"\r\n    Now@Caltech.   10 April 2015.", "Wiseman, Richard, and Watt, Caroline.   \"Belief in Psychic Ability and the Misattribution Hypothesis: A Qualitative Review.\"\r\n    British Journal of Psychology.   August 2006", "Monecke, Katrin, et al.   \"A 1,000-year Sediment Record of Tsunami Recurrence in Northern Sumatra.\"\r\n    Nature.   30 October 2008.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]