["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rex Tillerson, then chairman and chief executive of ExxonMobil, speaks during a news conference in Dallas, May 25, 2016. (Ben Torres/New York Times)", "Rex Tillerson, the ExxonMobil CEO who is President-elect Donald Trump's choice for secretary of state, owns more than $200 million worth of his company’s stock, according to the latest Securities and Exchange Commission filing.", "His shares in the giant oil company pose a potential conflict of interest if he is confirmed to the post.", "Rep. Chris Collins, R-Clarence, said any conflict would become moot because Tillerson has to divest his shares from ExxonMobil before the Senate confirms him.", "\"First of all, he will have to divest his holdings, that’s a requirement,\" Collins said. \"So, there’s not going to be any conflicts when he is secretary of state.\"", "Is Collins right? Is Tillerson required to divest his holdings?", "What the experts say", "Federal law prohibits cabinet members and other employees in the government’s executive branch from having a financial conflict of interest. Anyone who financially benefits from his or her decisions can face anywhere from one to five years of prison and a fine.", "\"It’s hard to imagine that anyone could reasonably assert that an interest in $200 million in Exxon stock is not substantial,\" said Kathleen Clark, a law professor at Washington University in St. Louis and a leading expert on legal ethics.", "That doesn't mean Tillerson necessarily has to sell his ExxonMobil stock. Experts we spoke to said Tillerson could legally hold onto his stock while serving as secretary of state -- as long as he takes one of three steps.", "First, Tillerson could have someone step in when matters of state present conflicts with his finances.", "\"He cannot participate in any legal matter that affects Exxon,\" Clark said. \"He would have to recuse and someone else at the State Department would have to participate instead.\"", "Second, Tillerson could also place his assets in a blind trust, an arrangement where he would still own the investment but would not be able to manage or measure its performance. In other words, he would hand over the assets to an independent party and would not be able to know what’s happening with them until he leaves his position in the federal government, said Richard Briffault, the Joseph P. Chamberlain professor of legislation at Columbia Law School.", "\"As secretary of state, he might have to participate in decisions that would directly affect his financial interests,\" Briffault said. \"If so, he would have to divest or place the holdings in blind trust to avoid criminal liability.\"", "Third, Tillerson could seek a waiver from the president-elect. The Office of Government Ethics says Trump would have to put in writing that he does not believe Tillerson's financial holdings present a substantial enough conflict of interest to violate federal law while he serves as secretary of state.", "Our ruling", "Collins said Trump’s pick for secretary of state \"will have to divest his holdings, that’s a requirement.\"", "Legal experts we spoke to said the law forbids a financial conflict of interest for cabinet members. If Tillerson wanted to hold onto his stock in ExxonMobil, he would have to recuse himself of any state business related to the company. Or he could place his holdings in a blind trust during his tenure as secretary of state. Tillerson could also seek a waiver from the president-elect.", "We rate this claim as False.", "\"Collins, Schumer Weigh In On Sec. of State\" WGRZ, Dec. 13, 2016, Accessed Dec. 23, 2016", "Phone and email conversation with Michael McAdams from Rep. Collins’ Press Office", "Phone conversation with Kathleen Clark, Law Professor from Washington University in St. Louis", "Phone conversation with Richard Benedetto, Adjunct Professor from American University", "Email conversation with Richard Briffault, Joseph P. Chamberlain Professor of Legislation from Columbia Law School", "Phone conversation with the U.S. Office of Government Ethics", "Title 18 Section 208 of the U.S. code, Legal Information Institute, Cornell Law, Accessed Dec. 22, 2016", "Penalties for Title 18 Section 208 of the U.S. code, Legal Information Institute, Cornell Law, Accessed Dec. 22, 2016", "PolitiFact: Giuliani: President Trump will be exempt from conflict-of-interest laws, Nov. 16, 2016, Accessed Dec. 22, 2016", "Yahoo Finance profile of ExxonMobil, Accessed Dec. 22, 2016", "\"Rex Tillerson of Exxon Mobil expected to be named Trump's Secretary of State: Sources\" CNBC, Dec. 10, 2016, Accessed Dec. 23, 2016", "\"Behind the deep ties between Exxon's Rex Tillerson and Russia\", CNN, Dec. 11, 2016, Accessed Dec. 23, 2016", "\"The World's Largest Oil And Gas Companies 2016: Exxon Is Still King\", May 26, 2016, Accessed Dec. 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]