["About this rating", "A photograph supposedly showing volcanic lava pouring into an ocean that created several steam vortices was met with a mixture of awe and skepticism as it circulated on social media:", "While these \"tornadoes\" could be more accurately described as \"steam devils,\" and while there are actually seven vortices in this picture, not six, this is a genuine photograph.", "The stunning scene was captured by photographer Bruce Omori off the coast of Hawaii in 2009. Omori described the photograph, which won the 2012 Power of Nature Windland Smith Rice International Award, as follows:", "On an early morning shoot at the Waikupanaha ocean entry, lava from the Kilauea volcano poured into the sea. This created a huge escape of steam, and as it rose, multiple vortices began spinning off of the huge plume. [...] A vortex or two is a pretty rare sight — but when one after another kept forming, my fumbling with the lenses turned into a panicked rush to switch my telephoto to wide angle lens to capture this awesome scene of seven vortices in a row.", "Omori, the owner of Extreme Exposure Fine Art Gallery, told Business Insider that plumes of steam rise when lava comes in contact with water. Sometimes these plumes will induce \"a spin upon columns of rising air from the heated sea.\"", "Photographer Leigh Hilbert, who has also captured photographs of these lava-induced steam vortices, described them as follows:", "Looking very much like water spouts, and often miss-named that way in many field reports in the past, these ‘plume twisters’, as I call them, are actually spinning columns of steam sucked out of the super-heated vortex of broiling plume steam.", "As lava pours into the ocean the resulting collision produces all sorts of chemical and geological reactions such as sulfur dioxide, hydrochloric acid, ash, tephra, black sand, an assortment of glass particles, several other gases and lots of extremely hot steam. As the steam races rapidly upward the relatively colder water and air surrounding it tends to pull at the edges of the plumes rolling steam – stretching it out and producing these fingers and columns of spinning steam. There is no technical name for this phenomenon that applies exclusively to lava-generated plume steam. The closest proper descriptive is Steam Devil, or steam vortexes: “a rotating updraft that involves steam”.", "The \"Volcanic Vortices\" photograph is also available on Omori's 500PX page. More of his work is displayed on his website and his Instagram page.", "https://web.500px.com/photo/46583578/Volcanic-Vortices-by-Bruce-Omori/", "Hawaii Reporter.   \"Hilo Photographer Receives Award from Smithsonian Museum of Natural History.\"\r\n    20 May 2013.", "Hara, Andrew.   \"Capturing the Irresistible, Horrifying Beauty of Kilauea Volcano.\"\r\n    CBS News.   28 May 2018.", "Mosher, Dave.   \"Incredible Photo Shows Hot Lava Forming Tornadoes of Steam Over the Ocean.\"\r\n    Business Insider.   12 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]