["Multiple Facebook posts, for example here and here, published on March 6, 2019, and shared hundreds of times since, contain two photos of Trump holding up a white shirt. In the first image he is showing the front of the shirt, and in the other, the back.", "In the photos, the shirt appears to have a logo on both the front and back featuring the letters \"HNP\".", "On the back of the shirt a circular logo with a fist in the middle can also be seen.", "Below is a screenshot of one of the posts:", "\"HNP\" refers to Hugpong ng Pagbabago, a regional political party headed by Sara Duterte, daughter of Philippine President Rodrigo Duterte. Here is the party’s Facebook page.", "The circle with the fist in the middle is the logo of Partido Demokratiko Pilipino- Lakas ng Bayan (PDP-Laban), the political party of President Duterte.", "Both parties have fielded candidates for the midterm elections in May, as reported here by the state-run Philippine News Agency and here on the PDP-Laban’s Facebook page.", "A reverse image search traced the misleading photos back to this article on the website of British newspaper The Sun, dated July 12, 2018.", "The original photos show Trump holding a white shirt with his surname on the back and the logo of the football team of England at the front. The shirt was given to him by The Sun when they interviewed him in 2018 in Brussels.", "Screenshots of the original photos in the The Sun article can be seen below:", "Both the original and misleading photos contain these key details: a US flag in the background, a carpet with a floral design, a white fireplace and a wooden door.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]