["By Robert Farley", "Posted on July 20, 2017", "President Donald Trump misleadingly suggested Deputy Attorney General Rod J. Rosenstein may be biased against him because Rosenstein “is from Baltimore” and “there are very few Republicans in Baltimore.”", "Rosenstein, who has testified that he is not a member of any political party, was appointed by Republican President George W. Bush to serve as U.S. attorney for the district of Maryland and elevated to deputy attorney general by Trump.", "And he is not from Baltimore. Rosenstein grew up in the suburbs of Philadelphia. As the U.S. attorney for Maryland, he worked in Baltimore, but lived in Bethesda, Maryland.", "In a New York Times interview on July 19, Trump expressed frustration with Attorney General Jeff Sessions for recusing himself from any federal investigation involving the 2016 presidential campaign. Sessions was the first U.S. senator to endorse Trump and served as a senior adviser to his campaign.", "Trump said that after Sessions told him about the recusal, he asked Sessions, “Who’s your deputy?” Trump announced his intention to nominate Rosenstein to be deputy attorney general on Jan. 31, and Rosenstein was overwhelmingly confirmed 94-6 by the Senate on April 25.", "Trump, July 19: Yeah, what Jeff Sessions did was he recused himself right after, right after he became attorney general. And I said, “Why didn’t you tell me this before?” I would have — then I said, “Who’s your deputy?” So his deputy he hardly knew, and that’s Rosenstein, Rod Rosenstein, who is from Baltimore. There are very few Republicans in Baltimore, if any. So, he’s from Baltimore.", "When Sessions recused himself on March 2, it fell to Rosenstein to oversee any matters involving the 2016 presidential campaign. Just a few weeks later, FBI Director James Comey confirmed at a congressional hearing that the bureau was investigating “whether there was any coordination between the [Trump] campaign and Russia’s efforts” to influence the 2016 presidential election.", "The first crack in Rosenstein’s relationship with the president surfaced shortly after Trump fired Comey on May 9. Rosenstein contradicted the White House’s initial contention that Trump’s decision to fire Comey was based on a recommendation from Rosenstein.", "Rosenstein did, in fact, write a two-and-a-half page memo that laid out a case for Comey’s removal, citing Comey’s “handling of the conclusion of the investigation of Secretary [Hillary] Clinton’s emails.” Rosenstein criticized Comey for holding a press conference on July 5, 2016, to publicly announce his recommendation not to charge Clinton, and for announcing on Oct. 28, 2016, that the FBI had reopened its investigation of Clinton.", "But Rosenstein later told Congress that he knew of Trump’s decision to fire Comey a day before he penned the memo. (In the New York Times interview, Trump continued to insist the letter played a role in his decision to fire Comey, though Trump acknowledged that even without it, “perhaps I would have fired Comey anyway.” See our story, “Why Did Trump Fire Comey?”)", "Rosenstein further drew the ire of the president due to his decision to appoint a special counsel to investigate possible collusion between the Trump campaign and Russian officials attempting to influence the election in Trump’s favor. Trump told the New York Times, “A special counsel should never have been appointed in this case.”", "But Trump’s insinuation that Rosenstein may be politically biased against him — based on being “from Baltimore” — is misplaced.", "Rosenstein grew up in the suburbs of Philadelphia. He graduated from the University of Pennsylvania’s Wharton School, as did Trump. He then went on to Harvard Law School and became a prosecutor with the U.S. Department of Justice. In the mid-1990s, Rosenstein was tapped by Kenneth Starr to help as a prosecutor with the Whitewater investigation involving Bill and Hillary Clinton’s business dealings in Arkansas.", "In 2005, George W. Bush appointed Rosenstein to serve as the U.S. attorney for the district of Maryland. Two years later, Bush nominated Rosenstein to a federal appeals court, but the move was blocked by Maryland’s two Democratic senators. He continued to serve as a U.S. attorney under Democratic President Barack Obama.", "It’s true that while Rosenstein served as the U.S. attorney for Maryland, he was based in Baltimore, which is an overwhelmingly Democratic city. In fact, Democrats outnumber Republicans 10-to-1 in the city, according to the Baltimore Sun.", "But Rosenstein resides in Bethesda, Maryland. Montgomery County, Maryland, which includes Bethesda, is strongly Democratic — with registered Democrats outnumbering Republicans more than 3-to-1 — but there are plenty of Republicans in Bethesda.", "Thiru Vignarajah, who once worked as a federal prosecutor under Rosenstein at the U.S. attorney’s office in Maryland, described Rosenstein as a “rock-ribbed Republican” in a column he wrote for Vox in May.", "But a 2011 profile of Rosenstein in the Washington Post noted, “Colleagues say he keeps his politics out of the office.” The profile said: “He is one of only three U.S. attorneys — out of 93 nationwide — appointed by then-President George W. Bush who has been kept on by the Obama administration.”", "In his written testimony for the Senate judiciary committee, Rosenstein stated, “I have not been a member nor held office in or rendered services to any political party or election committee.”", "FactCheck.org Rating:", "Read More", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]