["About this rating", "Trump had more people in attendance during his 2017 inauguration than Biden had in 2021.", "Biden's inauguration crowd wasn't smaller because of poor turnout. Rather, the crowd size was intentionally and significantly restricted due to the ongoing COVID-19 pandemic.", "Yes, we are talking about crowd sizes again.", "That's because on Jan. 23, 2021, the Facebook page for political action committee Restoration PAC shared a meme comparing crowd sizes at former U.S. President Donald Trump's inauguration in 2017 with that of Joe Biden's in 2021.", "The meme compares side-by-side images labeled \"Trump's inauguration\" and \"Biden's inauguration\" with the caption, \"They still want us to believe that Joe Biden was the most popular presidential candidate in U.S. history?\"", "It also left out key context, namely that unlike Trump's inauguration, Biden's took place amid a surging COVID-19 pandemic, forcing tightly restricted inauguration attendance. Trump had been widely criticized for mismanaging the government's response to the pandemic that began during his presidency and resulted in a massive death toll.", "Biden was taking office as the pandemic death in the U.S. reached 400,000. USA Today reported, \"Tickets for this year's ceremony will be limited. In the past, members of Congress have received about 200,000 tickets to distribute to their constituents for the swearing-in. This year, they will be limited to tickets for themselves and one guest.\"", "This is not the first time we've fact-checked a manufactured controversy over crowd sizes. In the early days of his presidency, the Trump administration pushed false claims that Trump's inauguration crowd drew, \"the largest audience ever to witness an inauguration, period, both in person and around the globe,\" even though information drawn from photographs, videos, and public transportation data told a different story.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]