["About this rating", "On Nov. 23, 2020, Twitter users reported seeing advertising on YouTube videos for \"Star Wars: The Rise of Skywalker.\" A voice-over in the 15-second video ads began with \"this Christmas\" and ended by saying \"tickets available now,\" with Dec. 20 displayed as the release date. The ninth chapter in the Star Wars saga was originally released one year earlier, on Dec. 20, 2019, and is often referred to by fans as \"TROS.\"", "Understandably, some fans were confused upon seeing the outdated ad:", "Woke up groggy from a nap and put on a new Daily Show clip on YouTube, and it began with a pre-roll Rise of Skywalker ad with a \"this Christmas\" voice over that ends with a \"Tickets on sale now\" graphic and briefly worried I was about to re-live the entire past year.", "— Eric Goldman (@TheEricGoldman) November 24, 2020", "why did YouTube just give me a TROS ad in November 2020 lmao", "— boys are back in town (@LadySt4rkiller) November 24, 2020", "Youtube just played me a TROS ad....? \"Coming this Christmas\". 😂", "— Scott G (@scottgibby) November 23, 2020", "Bruh I just got an AD on YouTube for TROS IN THEATERS THIS DECEMBER 20TH AND I???? Did I go back in time??", "— Morgan 🌻🥨 (@Siirriius) November 24, 2020", "why is youtube giving me a ad to by tickets for TRoS lmaoooo", "— elizabeth (@villainseras) November 24, 2020", "However, \"Star Wars: The Rise of Skywalker\" is not rising again in movie theaters on Dec. 20, 2020. The resurgence of the \"Star Wars: Episode IX\" YouTube ads appeared to be a mistake. While the reason for the 2019 ads reappearing in 2020 is unknown, it's possible that in 2019 some YouTube ads for the film were scheduled to run with the wrong year. In November 2019, \"Star Wars: The Rise of Skywalker\" was being advertised to sell tickets for the film's release.", "Watch the resurrected ad below:", "Disney and Lucasfilm have not yet commented on the matter, and the ads were still running as of the morning of Nov. 24, 2020.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]