["A video is viral on social media which shows a group of Muslim men performing a punishment called “murga” in Hindi where a person is made to squat, hold their ears and hop like a chicken. In the video, a person with a stick can be seen giving instructions to the men. It has been shared with the claim that the video is from Uttar Pradesh.", "योगीजी का पॉल्ट्री फार्म….😊 pic.twitter.com/RWVZ04aKjV", "— योगी सारांश llॐ 📿ll३भll (@Yogisaransh_1) April 7, 2022", "Several people have shared the video on Twitter while celebrating the alleged treatment of Muslims under Yogi Adityanath.", "The same video was shared in 2020 after a 21-day nationwide lockdown was announced by Prime Minister Modi on March 24, 2020, due to COVID-19 amid reports of excessive police force used on curfew violators.", "Alt News had received several requests to fact-check the images on WhatsApp (+91 76000 11160) and on our official Android application.", "On March 30, 2020, a Twitter user posted the viral video and mockingly said, “Look what corona has done to the owners of Lal Qila, Taj Mahal and Qutub Minar (archive link). Some users also left lewd remarks targeting the Muslim community while reacting to the video (archive link).", "लालकिला ताजमहल कुतुबमीनार के मालिकों की क्या हालत कर दी इस कोरोना ने😜 pic.twitter.com/5EYu0oy1vZ", "— Shuchita Kattar Hindu (@shuchispeak) March 30, 2020", "The clip was also shared on Facebook.", "The incident is not from India but from Pakistan. We found the same via a Google reverse image search of a keyframe of the video. On March 28, 2020, Facebook page ‘War Against to Coronavirus’ posted two videos of the incident and wrote, “Manshara Police Zindabad Section 144.”", "mansehra police zindabad Section 144", "Posted by War Against to Corona virus on Saturday, March 28, 2020", "A Pakistani Twitter user had posted the viral video on March 29, 2020, and tagged several prominent handles including the police. Manshara police responded to his tweet and wrote, “DIG Hazara and DPO Manashara have already taken notice of this incident and asked Ainda to desist from giving such punishments in any police station. The inquiry is going on, will warn you soon (translated from Hindi).”", "DIG hazara or DPO mansehra ny already is waqiya ka notice b liya hy…or ainda sy kisi b thany main is tarha ki punishment dainy sy baz rehny ka b kaha hy…enquiry ho rage hy jald ap ko agaa karen gy", "— Mansehra Police Official (@MansehraO) March 30, 2020", "Thus, a video of Pakistan has been circulating on the Indian social media ecosystem with the false claim that it shows the treatment of Muslims in UP under Yogi Adityanath. The same video was shared two years ago with the false claim that members of the Muslim community were punished by the police for flouting coronavirus lockdown rules.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…"]