["The claim was shared in this website post on September 29, 2020.", "The post states in part: \"Netizens are worried now because of news that there is another new virus that is spreading now in China! / As the pandemic is still infecting many countries, everyone is hoping for a vaccine and healing of everyone. Sadly, it seems like this virus can’t leave our year 2020 as another one was found in China. According to reports, this was called as the Novel Bunya V!rus that is caused by ticks. People who are infected with this were diagnosed to have Severe Fever with Thrombocytopenia Syndrome (SFTS).\"", "Chinese state media site Global Times reported here on August 5, 2020 that dozens of people in China’s Jiangsu province had been diagnosed with SFTS, an infectious disease spread by ticks.", "An identical claim was also shared on Facebook here and here; and in website posts here and here.", "But the posts omit important context about the disease.", "A spokesperson for the World Health Organization told AFP in an email on August 17, 2020: “Severe fever with thrombocytopenia syndrome (SFTS) is a disease caused by a virus, and was first reported in China in 2009. Since then, infections were reported in China and elsewhere in East Asia over the past decade.”", "The spokesperson added there is yet no vaccine and specific antiviral treatment for SFTS infections, which range from mild to serious.", "The US Centers for Disease Control and Prevention (CDC) website also states: \"Severe fever with thrombocytopenia syndrome (SFTS) is a tickborne infection caused by the SFTS virus (SFTSV, also known as Huaiyangshan banyangvirus), which was identified in China in 2009 and afterward in South Korea, Japan, and Vietnam. Since then, the number of SFTS cases in East Asia has risen rapidly.\"", "The CDC has previously published reports on the prevalence of SFTS cases in South Korea from 2016 to 2018 here; and in Japan from 2013 to 2017 here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]