["Twitter handle ‘@BJPBalochistan’ shared three pictures on August 27 along with the claim that a Hindu girl died in a ‘love Jihad’ incident. Two out of the three pictures are of a couple where the girl is seen to be wearing sindoor (vermillion) and dupatta (headscarf) in the first picture and Muslim attire in the second picture. The third picture shows a dead woman in a suitcase, surrounded by the police. The tweet received 9,600 likes and 5,300 retweets. It was also quote-tweeted by Madhu Kishwar, who is infamous for sharing false claims on social media.", "This slideshow requires JavaScript.", "The pictures are circulating on Twitter as well as on Facebook with the same claim.", "This report will reveal how pictures of two unconnected incidents were misused to create a false story.", "Let’s start with the photographs of the couple. Upon conducting a reverse image search, we found these pictures in a July 28 Facebook post which said that the woman’s name is Lavi Joshi and the man is Mohammad Adil Pasha. As per this post, she is a resident of Dehradun, Uttarakhand. The post does not say that she was found dead.", "Alt News spoke with a senior police officer posted in Dehradun who informed that the viral social media claims are false and no such incident of a woman’s death has been reported in the state.", "We also contacted Monica Manral, the police officer in charge of the case. She said, “The woman in the picture is alive and lives with her husband, who is a Muslim. She chose to marry him against the wishes of her parents. After false claims went viral on social media, she visited the police station to confirm verbally and in writing that she is happily married and does not wish to be sent back to her parents. She also said that her brother circulated the pictures online with false claims following which she has received death threats. The woman has filed a police complaint against her family members.” When we requested for a copy of the complaint, Manral informed that the woman’s family has also registered a case against her and the written testimony has been sent to the court. Manral also added that Dehradun has not witnessed any recent ‘love Jihad’ cases.", "Speaking with Alt News, the woman in the pictures verified that her photos are viral on social media with false claims. We are refraining from disclosing her identity in the report. “My name is not Lavi Joshi and I live with my husband. I am happy and not facing any problems,” she told us.", "Who is the dead woman in the suitcase?", "Upon conducting a reverse image search, we found that this picture is from an incident that took place on July 27 in Ghaziabad’s Dashashwamedh Vatika. News18 had reported that a woman claimed the dead body was her daughter Varisha’s who recently got married. She claimed that Varisha’s husband and in-laws were responsible for her murder. However, the story took a fresh turn when Varisha herself appeared and said that she fled from her in-laws’ house on July 23 and had since been in hiding. After this revelation, police reopened the investigation on the dead body found in a suitcase case. Hindustan Times contacted Bulandshahr city officer, Diksha Singh, who informed that a case of dowry harassment was registered against Varisha’s husband and in-laws. There was also a possibility of a case being registered against Varisha’s mother and brother for false identification of the dead body.", "This slideshow requires JavaScript.", "We spoke with SHO of Shahabad police station to get an update on the other case. We were informed that the investigation is still underway and the cops do not have any information about the deceased. The picture of the dead body in a suitcase was also published in a Jagran report from August 4.", "Thus pictures of two separate incidents were misrepresented and used to create a false story. The dead body found in a suitcase pertains to a case from Uttar Pradesh’s Ghaziabad while the other two pictures show a woman from Uttarakhand’s Dehradun. Both cases have no links whatsoever.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]