["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Dave Marsden says expanding Medicaid in Virginia will save lives. And he points to Massachusetts’ experience as proof.", "\"When Massachusetts got health care, their mortality rate went down either 2.9 or 3.9 percent -- whatever -- but it saved lives,\" Marsden, D-Fairfax, said during a June 18 radio interview.", "Marsden’s comments, made on the John Fredericks Show, came amid fiery partisan debate over whether to expand Medicaid eligibility to as many as 400,000 low-income and disabled Virginians. Under provisions of the Affordable Care Act, Uncle Sam would pay the entire tab through 2016 and 90 percent of added cost down the road.", "On June 12, the Republican-led General Assembly passed a two-year state budget designed to close Democratic routes toward expansion.", "We found Marsden’s comment interesting and wondered whether whether the death rate in Massachusetts really did fall by at least 2.9 percent after then-Gov. Mitt Romney, a Republican, signed a health reform bill in 2006 that expanded Medicaid and mandated individual health care coverage.", "Brent McKenzie, Marsden’s legislative assistant, said the statement was based on a study by  the Harvard School of Public Health that was published in May 2014 in the Annals of Internal Medicine.", "Researchers examined the death rates in Massachusetts counties before and after the reforms were enacted, looking at the periods from 2001-2005 and 2007-2010. They concluded that the death rate per 100,000 people aged 20 to 64 dropped dropped 3.2 percent during the years after the reforms.", "The data was compared to statistics of people in the same age group from 531 counties in 46 states that had not undergone coverage expansions. The researchers concluded that the decline in Massachusetts was 2.9 percent greater than the average of the U.S. counties that had not expanded coverage.", "\"What we found in Massachusetts after reform was a significant reduction in deaths from the kinds of illnesses where we expect health care to have the biggest impact, including infections, cancer and cardiovascular disease,\" Benjamin Sommers, an assistant professor of health policy at Harvard and a report co-author, said in a news release announcing the results.", "The study also found the largest death rate drops occurred in Massachusetts counties that had low insurance coverage prior to the reforms. A key advantage of the Harvard study was its size -- examining an estimated 270,000 Massachusetts adults gained insurance through the reform.", "Although the study found a correlation between health care coverage and lower death rates, there’s on-going debate over whether the reforms caused that result.", "The Harvard School of Public Health report estimated that state’s mandatory insurance laws prevented about 320 deaths a year.", "But researchers cautioned that they couldn’t definitively \"establish cause and effect\" between the lowered death rate and the reforms. They also noted that the results in Massachusetts \"may not generalize to other states.\"", "\"We find significant reduction in mortality among nonelderly adults in Massachusetts since its 2006 reform relative to a control group in counties of similar counties in states without such reforms,\" the report says. \"Although this analysis cannot demonstrate causality, the results offer suggestive evidence that the Affordable Care Act -- modeled after the Massachusetts law -- may impact not only coverage and access but also mortality.\"", "An article in the New York Times said health economists viewed the report as strong evidence that the Massachusetts’ health care overhaul had saved lives, but noted experts also said the study \"will not settle the long-debated question on whether being insured prolongs life.\"", "Some analysts quoted in The Times and in a Boston Globe article said the results add to a body of research showing health care coverage extends lives. But skeptics questioned whether the death rate drop found in the study would occur so quickly after the Massachusetts reforms took root.", "The Harvard report notes other studies have looked at the effect of health insurance on mortality and the results have been mixed.", "A 2012 report in the New England Journal of Medicine found that several states that expanded their Medicaid eligibility programs before Obamacare passed in 2010 saw \"significant decreases in mortality.\" The researchers noted, however, that they \"cannot definitively show causality.\"", "In contrast, a 2011 study of Medicaid expansion in Oregon did not find a link between health insurance and death rates. A 2013 follow-up study found that the state’s Medicaid expansion led to better mental health and lower financial strain among beneficiaries, but researchers did not find improvement in important physical attributes such as blood pressure, cholesterol and blood sugar levels.", "Our ruling", "Marsden said that after Massachusetts enacted its sweeping health care reform in 2006, its mortality rate dropped by at least 2.9 percent, \"saving lives.\"", "His statement correctly summarizes a recent study finding the state’s death rate dropped by 3.2 percent among 20-64 year-olds. The decline was 2.9 percent greater than the average of a comparison group of 531 counties across the nation.", "But Marsden reaches a little when he says the results proved the health reforms \"saved lives.\" Researchers believe that’s the case, but caution they could not establish a \"cause and effect\" between the lowered death rate and the health reforms.", "So Marsden’s statement is accurate, but needs a little clarification. We rate it Mostly True.", "Sen. Dave Marsden’s comments during The John Fredericks Show, Jun 10, 2014. (Statement is at 4:10 in video).", "E-mails from Brent McKenzie, legislative assistant for Sen. Dave Marsden, June 17 and June 23, 2014.", "Interview with Dave Marsden, June 18, 2014.", "Interview with Benjamin Sommers, assistant professor of health policy at Harvard University’s School of Public Health.", "Annals of Internal Medicine, \"Changes in mortality after Massachusetts health care reform,\" May 6, 2014.", "The New York Times, \"Mortality drop seen to follow ‘06 health law,\" May 5, 2014.", "New England Journal of Medicine, \"The Oregon Experiment -- Effects of Medicaid on clinical outcomes,\" May 2, 2013.", "PolitiFact Virginia, \"Do people without health insurance die sooner,?\" July 12, 2011.", "PolitiFact, \"Alan Grayson claims 45,000 people die a year because they lack health insurance,\" Sept. 6, 2013.", "PolitiFact Florida, \"Charlie Crist says six Floridians die a day due to lack of Medicaid expansion,\" Feb. 7, 2014.", "Washington Post Fact Checker, \"Obama’s claim on death rates and poverty due to lack of health insurance,\" Dec. 6, 2013.", "New England Journal of Medicine, \"Mortality and access to care among adults after state Medicaid expansions,\" Sept. 13, 2012.", "New England Journal of Medicine, \"The Oregon experiment -- effects of Medicaid on clinical outcomes,\" May 2, 2013.", "Health Affairs Blog, \"Opting out of Medicaid expansion: The health and financial impacts,\" Jan. 30, 2014.", "PolitiFact, \"Is a new study of Medicaid a game changer?\" May 3, 2013.", "The Urban Institute, \"Uninsured and dying because of it: Updating the Institute of Medicine of the impact of uninsurance on mortality,\" January, 2008.", "Paper by Richard Kronick, \"Department of Family and Preventative Medicine at the University of California (San Diego) School of Medicine, \"Health insurance coverage and mortality revisited,\" April, 2009.", "Institute of Medicine, \"Care without coverage: Too little, too late,\" May 21, 2002.", "USA Today, \"VA chief subpoenaed in investigation of dying veterans,\" May 8, 2014.", "PolitiFact, \"Newt Gingrich ad says Mitt Romney enacted taxpayer-funded abortions,\" Jan. 10, 2012.", "Massachusetts Division of Health Care and Finance Policy, \"Health care in Massachusetts: Key indicators,\" May, 2011.", "Boston Globe, \"Study calls wide Mass. coverage a lifesaver,\" May 5, 2014.", "Harvard School of Public Health, \"Significant decline in deaths after Massachusetts’ health reform,\" May 5, 2014.", "Kaiser Health News, \"More health insurance equals fewer deaths in Massachusetts,\" May 5, 2014.", "Blue Cross Blue Shield of Massachusetts Foundation, \"Health reform in Massachusetts,\" March 2014.", "U.S. News and World Report, \"Death rates fell in Massachusetts after health-care reform,\" May 5, 2014.", "Forbes, \"New study suggests RomneyCare saved lives, but at a  very high cost,\" May 5, 2014.", "National Review, \"Cautions about interpreting the Massachusetts mortality study,\" May 14, 2014.", "National Bureau of Economic Research, \"The Oregon health insurance experiment: evidence from the first year,\" July 2011.", "American Journal of Public Health, \"Health insurance and morality in U.S. adults,\" 2009.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]