["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As President Donald Trump has upped the ante in his tariff war with China, he’s consistently argued that consumers shouldn’t be worried.", "Trump has slapped China with a 25 percent tariff on $200 billion of goods and floated the possibility of tariffs on $325 billion in additional Chinese goods. China, meanwhile, prepared to impose retaliatory tariffs on $60 billion in American products.", "In remarks at the White House on May 9, Trump said, \"So our country can take in $120 billion a year in tariffs, paid for mostly by China, by the way, not by us. A lot of people try and steer it in a different direction. It’s really paid — ultimately, it’s paid for by — largely, by China. And businesses will pour back into our country.\"", "He reiterated that argument in a May 13 tweetstorm, saying that \"there is no reason for the U.S. Consumer to pay the Tariffs, which take effect on China today.\" Trump suggested some alternatives — buying from suppliers in a country without tariffs, or buying from an American company.", "His repeated message is that Americans shouldn’t worry about the economic impact of his tariffs, couching his claim by saying it's \"mostly,\" \"really,\" \"largely\" or \"ultimately\" paid for by China. Despite the hedging words he uses, experts told us the president is wrong to offer that sort of assurance.", "\"It is inaccurate to say that ‘countries pay’ tariffs on commercial and consumer goods — it is the buyers and sellers that bear the costs,\" said Ross Burkhart, a Boise State University political scientist. \"Purchasers pay the tariff when they buy popular products. Sellers lose market share when their products get priced out of markets.\"", "The White House did not respond to an inquiry for this article.", "The idea behind imposing tariffs is to make American companies more competitive with their foreign counterparts. As those companies prosper, the thinking goes, they can hire more workers and pay their employees better. Those workers, in turn, would have more money to spend, and that helps spread those dollars around the economy more broadly.", "Economists told us, however, that real-world examples of tariffs working as intended are rare, and consumers of the tariff-levying country are the primary victims of tariffs, by having to pay higher prices.", "The federal treasury does get paid when tariffs are levied. But Chinese exporters don’t make the payment. The importers do — usually U.S. companies.", "\"If the U.S. imposes a tariff on Chinese televisions, the duty is paid to U.S. Customs and Border Protection at the border by a U.S. broker representing a U.S. importer — say, Costco,\" Howard Gleckman, a senior fellow at the Urban Institute-Brookings Institution Tax Policy Center, wrote in September. \"The Chinese government pays nothing.\"", "Customs and Border Protection typically requires payment within 10 days of their shipments clearing customs, Reuters reported. Companies that don’t pay their amount by that date are sent a new bill.", "When the tariff is small, an importer may elect to keep its prices stable rather than pass the tariff cost along to the consumer. But experts say that’s not the most common decision for the types of tariffs at issue in the current U.S.-China trade war.", "\"When tariffs are levied at 10 percent, many firms choose to absorb the cost in their margins,\" said Monica de Bolle, a senior fellow at the Peterson Institute for International Economics. This can be done by settling for lower profit margins or cutting costs in some fashion.", "\"However, with tariffs now scaled up to 25 percent, firms will inevitably pass on some or all of the increase to U.S. consumers,\" de Bolle said. \"That means that U.S. consumers could in some cases pay 25 percent more for a given good than they did before.\"", "Meanwhile, tariffs could mean that producers pay more, as materials that are used to make products sold in the United States rise in price. Those price increases are likely to be passed on to consumers as well. It’s possible that U.S. consumers could find tariff-free products elsewhere, but in many cases, a suitable product may not be available, or may be more expensive or of lower quality.", "In addition, tariffs could also produce delays or price spikes that spiral across the economy, since the economy is now tightly interwoven into complex and time-sensitive \"supply chains.\" And any slowdown in the supply chain could mean layoffs for producers and a hit to the broader U.S. economy.", "Because studies have shown that lower-income Americans tend to spend a larger fraction of their income on goods, they could feel the pinch worse than more affluent Americans do.", "U.S. producers selling to China would be hurt by retaliatory tariffs, given the large Chinese share of certain American agricultural exports, such as soybeans. Finally, Gleckman wrote, a decline in overseas competition hurts consumers by making them more reliant on less competitive firms with higher prices.", "All estimates of the potential economic hit from the Trump tariffs are subject to some degree of speculation. However, the Congressional Research Service recently reviewed a range of professional estimates and found that they \"generally suggest a moderately negative impact.\"", "One recent study by economists at the Federal Reserve Bank of New York, Princeton University, and Columbia University concluded that \"the full incidence of the tariff falls on domestic consumers, with a reduction in U.S. real income of $1.4 billion per month by the end of 2018.\"", "The Congressional Budget Office projected a 0.1 percent decline in the annual U.S. GDP growth rate. The International Monetary Fund projected a 0.2 percent decline in the annual U.S. GDP growth rate.", "A variety of companies have reported harm from the U.S. and retaliatory tariffs, including Walmart, Caterpillar and Tyson Foods, CRS reported.", "The U.S. bears the brunt from tariffs, but China could suffer, too.", "Facing higher prices for Chinese goods, U.S. consumers may choose to buy fewer Chinese goods, thereby hurting China’s gross domestic product. But that’s not even certain, since China could conceivably make up those sales, or many of those sales, elsewhere.", "Tariffs do generate some revenue, but economists say it’s not wise to count on tariffs for this purpose.", "According to the Congressional Research Service, revenues from the Trump-imposed tariffs through Feb. 21, 2019, have totaled about $18.5 billion.", "However, that’s just 2 percent of the federal budget deficit, most recently estimated at $896 billion.", "Trump said that tariffs are \"paid for mostly by China, by the way, not by us.\"", "China doesn’t pay the initial tariffs — U.S. importers do. In many if not most cases, those costs are passed on to American consumers, whether it’s directly on the products hit by the tariffs or through an impact on U.S. companies who use raw materials hit with tariffs. China could also take a hit over the longer term in its gross domestic product, but experts say the harm to the U.S. economy would be swifter, more certain and potentially bigger.", "We rate the statement False.", "Donald Trump, remarks at the White House, May 9, 2019", "Donald Trump, tweet, May 13, 2019", "Howard Gleckman, \"What Is A Tariff And Who Pays It?\" Sept. 25, 2018", "Congressional Budget Office, 10-year budget estimate, May 2019", "Congressional Research Service, \"Trump Administration Tariff Actions: Frequently Asked Questions,\" Feb. 22, 2019", "Mary Amiti, Stephen J. Redding and David Weinstein, \"The Impact of the 2018 Trade War on U.S. Prices and Welfare,\" March 2, 2019", "Washington Post, \"Trump’s trade approach under attack as China retaliates on tariffs; markets open with big sell-off,\" May 13, 2019", "Reuters, \"Explainer: Who pays Trump's tariffs - China and other exporters or U.S. customers?\" May 5, 2019", "PolitiFact, \"Donald Trump says tariffs will make America rich again. Economists disagree,\" Dec. 17, 2018", "Email interview with Daniel J. Mitchell, conservative economist, Dec. 5, 2018", "Email interview with  I.M. (Mac) Destler, professor at the University of Maryland School of Public Policy, Dec. 5, 2018", "Email interview with Gary Burtless, senior fellow at the Brookings Institution, Dec. 5, 2018", "Email interview with Lawrence White, professor at New York University’s Stern School of Business, Dec. 5, 2018", "Email interview with D. Munroe Eagles, political scientist at the University at Buffalo, May 13, 2019", "Email interview with Ross Burkhart, Boise State University political scientist, May 13, 2019", "Email interview with Monica de Bolle, senior fellow at the Peterson Institute for International Economics, May 13, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]