["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Responding to rampant criticism about the Democratic Party’s presidential debate schedule, Debbie Wasserman Schultz has boasted about viewership numbers.", "The critics include party leaders as well as Hillary Clinton’s primary rivals, U.S. Sen. Bernie Sanders of Vermont and former Maryland Gov. Martin O’Malley. Some Democrats say that the schedule of six debates including some on weekends limits voters’ exposure, giving Clinton an edge.", "But Wasserman Schultz says ratings show that voters have had plenty of TV face time with the Democratic candidates.", "\"In fact, our first debate beat at least two of the Republican debates. And our last debate, compared to the Republican last debate, was just a little bit less than theirs,\" the Democratic National Committee chair told CNN’s Brian Stelter Jan. 17, hours before the debate over the Martin Luther King weekend in Charleston.", "After Stelter pressed her, Wasserman Schultz, a Broward County congresswoman, replied:", "\"Brian, there's no number of debates that will satisfy everyone. So, I did my best to make sure, along with my staff and along with our debate partners, to come up with a schedule that we felt was going to maximize the opportunity for voters to see our candidates.\"", "Clearly, we can't rate what people within the Democratic party intended. Our fact-check looks at what the outcome was. Did the Democrats \"maximize the opportunity\" for voters to see their candidates? We found there’s no fair reading of the Democratic debate schedule that supports this.", "Democratic and Republican debate schedules in 2016", "The Democrats scheduled six primary debates; the Republicans scheduled 11 primary debates (plus one more in March that is unscheduled).", "So far, Democrats have held four debates with a cumulative viewership of about 42.5 million while Republicans have held six debates with a cumulative viewership of about 103.7 million, according to Nielsen ratings of same-day viewership.", "Democratic debates:", "Date", "Day of week", "Network", "Viewership", "Oct. 13, 2015", "Tuesday", "CNN", "15.8 million", "Nov. 14, 2015", "Saturday", "CBS", "8.5 million", "Dec. 19, 2015", "Saturday", "ABC News", "8 million", "Jan. 17, 2016", "Sunday", "NBC News", "10.2 million", "Feb. 11, 2016", "Thursday", "PBS", "TBD", "March 9, 2016", "Wednesday", "Univision", "TBD", "Republican debates:", "Date", "Day of week", "Network", "Viewership", "Aug. 6, 2015", "Thursday", "Fox News", "24 million", "Sept. 16, 2015", "Wednesday", "CNN", "23 million", "Oct. 28, 2015", "Wednesday", "CNBC", "14 million", "Nov. 10, 2015", "Tuesday", "Fox Business Network", "13.5 million", "Dec. 15, 2015", "Tuesday", "CNN", "18.2 million", "Jan. 14, 2016", "Thursday", "Fox Business Network", "11.1 million", "Jan. 28, 2016", "Thursday", "Fox News", "TBD", "Feb. 6, 2016", "Saturday", "ABC", "TBD", "Feb. 13, 2016", "Saturday", "CBS", "TBD", "Feb. 25, 2016", "Thursday", "CNN", "TBD", "March 10, 2016", "Thursday", "CNN", "TBD", "Back in 2008, when Barack Obama won the nomination, the Democrats held about 25 primary debates while the Republicans held 21.", "Overall, it looks like the GOP is doing a significantly better job of reaching viewers.", "Wasserman Schultz response", "In defense of Wasserman Schultz’s statement, DNC spokesman Sean Bartlett raised several points:", "• There are more GOP candidates than Democratic candidates. At the outset of the 2016 race, there were 17 Republican candidates but only five Democratic candidates.", "• Only three Democratic debates in 2008 topped the Democrats’ lowest rated debate this cycle.", "• The first Democratic debate drew 15.8 million viewers, surpassing the viewership of three of the Republican debates this cycle.", "• All but one of the Democratic debates are on broadcast network TV, which makes it more likely for people without cable to tune into the debates.", "• The schedule of one debate a month for six months doesn’t pull the candidates away from town halls and other events with voters.", "Still, Wasserman Schultz has faced constant questions about the debate schedule, specifically whether it was intended to help Clinton or minimize viewership.", "\"That’s ridiculous,\" she said on Jan. 11 in Broward County. \"I don’t know how many times I have to say it.\"", "She said that the Sunday debate in Charleston -- the city where nine African-Americans were killed at a church in 2015 -- was a recommendation by the Congressional Black Caucus Institute and NBC to coincide with Martin Luther King weekend.", "Experts dispute Wasserman Schultz’s characterization", "We contacted five professors of political science and communications. None of them bought Wasserman Schultz’s statement.", "\"By the time voting starts in Iowa, potential voters will have seen about 40 percent less of Democratic candidates on the debate stage than their Republican counterparts,\" University of Michigan’s Director of Debate Aaron Kall told PolitiFact.", "Kall cited several factors contributing to the larger Republican viewership:", "• The first Republican debate occurred in early August, before the start of the NFL and NCAA college football seasons. Viewer anticipation is usually highest for the first debate. The Democrats didn't host their first debate until over two months later.", "• Of the four Democratic debates so far, three were on weekends, including the Dec. 19 debate a week before Christmas and the same night as the New York Jets vs. Dallas Cowboys NFL game. The Jan. 17 debate was the day before the Martin Luther King, Jr. Day holiday.", "Kall cited two major factors beyond the Democrats’ control that have aided superior Republican ratings: a much larger GOP field and the phenomenon of Donald Trump, an entertainment star in his own right from his time on The Apprentice.", "John Schroeder at Northeastern University noted that the two highest Republican debates each drew between 23 million and 24 million, much higher than the Democratic debates. While a lot of the disparity is due to Trump, another factor is that all the Republican debates so far have been held on weekdays.", "\"I think we can safely say that weekend time slots are not the key to maximizing the viewing audience,\" Schroeder said.", "Our ruling", "Wasserman Schultz says the party came up with a debate schedule \"to maximize the opportunity for voters to see our candidates.\"", "Wasserman Schultz’s best point is that the Democrats largely scheduled their debates with TV networks, which means viewers without cable can see them. But other than that, her statement is very disingenuous.", "There are six Democratic party debates compared with 11 scheduled for the Republicans, and half of the Democratic debates are on weekends -- including one the weekend before Christmas and another on the Martin Luther King Jr. holiday weekend. If the Democrats had wanted to \"maximize\" opportunities for viewers, the party could have added more debates, scheduled them on weekdays and avoided holidays.", "We rate this claim False.", "CNN Reliable Sources, Transcript, Jan. 17, 2016", "Mediate, \"CNN’s Stelter Grills Wasserman Schultz: ‘Sunday Night’s a Terrible Time to Have a Debate,’\" Jan. 17, 2016", "Medium post by Luis Miranda, Democratic National Committee communications director, \"2016 Democratic Debate Ratings Rank Far Ahead of Most Primary Debates,\" Dec. 21, 2015", "Five thirtyeight blog, \"Is six Democratic debates too few?\" May 6, 2015", "Washington Post, \"The case for more Democratic debates,\" Sept. 21, 2015", "Adweek, \"Democrat debate delivers 10.2 million viewers to NBC,\" Jan. 2016", "Adweek, \"CNN Democratic Debate Upped to 15.8 Million Viewers,\" Oct. 14, 2015", "CNN, \"Democrats to attend CNN forum Jan. 25 at Drake,\" Jan. 20, 2016", "Sun Sentinel, \"From gyrocopter pilot to angry Bernie Sanders fans, Debbie Wasserman Schultz faces multiple challenges,\" Jan. 19, 2016", "New York Times, \"Two DNC officials call for adding more debates,\" Sept. 9, 2015", "Washington Post The Fix blog, \"DNC chair Debbie Wasserman Schultz’s list of enemies keeps growing,\" Jan. 19, 2016", "Washington Post, \"DNC chairwoman heckled over debate schedule at New Hampshire convention,\" Sept. 19, 2015", "Miami Herald’s Naked Politics blog, \"Debbie Wasserman Schultz under fire in Las Vegas over Democratic debate schedule, rules,\" Oct. 13, 2015", "U.S. Presidential Election News, Democratic debates and Republican debates, 2015-16", "Nielsen, Ratings data for presidential primary debates, October-January 2016", "Interview, Sean Bartlett, Democratic National Committee spokesman, Jan. 19, 2016", "Interview, Michael Traugott, University of Michigan Center for Political Studies Research Professor, Jan. 19, 2016", "Interview, Aaron Kall, University of Michigan Director of Debate and Dean of Students, Jan. 19, 2016", "Interview, Thomas Whalen, Boston University associate professor of social sciences, Jan. 19, 2016", "Interview, Alan Schroeder, Northeastern University journalism professor, Jan. 19, 2016", "Interview, John Sides, George Washington University associated political science professor, Jan. 19, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]