["As coronavirus numbers improve in the U.S. and vaccine rollouts continue nationwide, Congress has passed President Joe Biden's $1.9 trillion COVID-19 relief package, providing financial support for millions of Americans.", "The bill was passed by the Senate March 6 and by the House  on March 10, with no support from Republican members of Congress.", "One viral March 7 Facebook post claims that the bill included a significant pay bonus for members of the House.", "\"Did you know? Line 17 of the $1.9 TRILLION CV #Stimulus awards a $25 MILLION BONUS to House Reps?\" the post said.", "USA TODAY has reached out to the poster for comment.", "Fact check:Breaking down spending in the COVID-19 relief bill", "In March 2020, similar false claims about bonuses for members of Congress were circulating on social media. USA TODAY fact-checked those claims here.", "This more recent Facebook post claims that bonuses for members of Congress are mentioned in \"line 17\" of the bill, but does not specify what page of the legislation. The post does not quote or cite evidence from the bill to support the claim.", "Contrary to the post's claims, the 628-page bill does not include bonuses or pay raises for members of Congress.", "The bulk of the bill's provisions includes $1,400 checks for most Americans who are earning up to $75,000, the allocation of billions in funds to help reopen schools and colleges, as well as funding for businesses and the vaccine rollout.", "Members of Congress last received a pay increase in January 2009, when annual salaries were increased 2.8% to $174,000.", "Fact check:Rep. Alexandria Ocasio-Cortez's net worth is not close to $1 million", "The claim is FALSE, based on our research. The $1.9 trillion coronavirus stimulus, which has passed the House and Senate and been signed by Biden, does not include bonuses for members of Congress.", "The bulk of the bill centers around checks for Americans as well as funding for reopening schools, vaccine rollout and small businesses.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]