["Rex Tillerson, then chairman and chief executive of ExxonMobil, speaks during a news conference in Dallas, May 25, 2016. (Ben Torres/New York Times)", "Exxon Mobil CEO Rex Tillerson, President-elect Donald Trump’s pick for secretary of state, doesn’t have a problem with fracking until it affects him, says a consumer rights group.", "\"ExxonMobil is a major player in the fracking industry, and #ExxonKnew climate change was a problem for decades, but covered up the evidence,\" reads a campaign letter from Food & Water Watch. \"Tillerson infamously sued to keep a fracking project out of his backyard, but seems happy to profit off fracking in other people's backyards.\"", "For this fact-check, we wanted to know if the head of the largest natural gas-producing company in the United States really said no fracking way to a drilling project in his own neighborhood.", "Food & Water Watch is right about Tillerson’s participation in the natural gas litigation, though its account misses a few details.", "Fracking-caused noise and traffic was one of many concerns listed in the lawsuit. Tillerson’s lawyer also told the Wall Street Journal that Tillerson himself cared the most about property devaluation. And the oil chief dropped out of the lawsuit after receiving attention for it.", "In 2012, Tillerson, his wife and their neighbors in Bartonville, Texas, sued to block the construction of a 160-foot water tower in their luxury community. The tower would, in part, supply water for hydraulic fracturing — which injects pressurized water as well as sand and chemicals under shale rock formations to extract natural gas.", "The lawsuit contended the project violates the town’s zoning ordinance and will also be an \"unbearable nuisance.\"", "\"A water tower will have lights on at all hours of the night, traffic to and from the tower at unknown and unreasonable hours, noise from mechanical and electrical equipment needed to maintain and operate the water tower, and creates and (sic) unsafe and unattractive nuisance to the children of the area,\" the suit reads.", "\"Furthermore, upon information and belief, (the Bartonville Water Supply Corporation) will sell water to oil and gas explorers for fracing shale formations leading to traffic with heavy trucks on FM 407, creating a noise nuisance and traffic hazards,\" it continues.", "In addition to joining the lawsuit, Tillerson sat for a three-hour deposition in May 2013 and protested the project at a town council meeting that November, according to the Journal’s report in February 2014. But the newspaper noted that Tillerson wasn’t \"the most vocal or well-known opponent of the tower.\" That distinction belonged to the lead plaintiffs, former U.S. House Majority Leader Dick Armey and his wife.", "Environmentalists jumped on the story, with plenty pointing out the irony and hypocrisy but embracing Tillerson into their ranks.", "A former oil executive penned an open letter to Tillerson on NoFrackingWay.Us decrying the environmental impacts of the practice and wishing him \"good luck with that fracking water tank.\" Credo Action, an online hub of progressive activists, dubbed Tillerson \"the highest-profile anti-fracking activist in the world.\" And MoveOn.org offered Tillerson its \"FrackingFighter\" award.", "Under pressure and after a judge dismissed the claims, Tillerson dropped out of the lawsuit two months later in April 2014, the Dallas Business Journal reported. The Armeys and a few others continued to pursue legal action over the project, and the battle continued into at least November 2015, the last mention of the case we could find.", "Our ruling", "Food & Water Watch said Tillerson \"sued to keep a fracking project out of his backyard.\"", "Tillerson joined a lawsuit that listed noise nuisance and traffic hazards among the plaintiffs’ many concerns, though he later dropped out of the litigation.", "We rate the claim Mostly True.", "Food & Water Watch, \"Secretary ExxonMobil? Reject Rex Tillerson,\" Dec. 10, 2016", "National Gas Supply Association, \"Top 40 Natural Gas Producers in the U.S.,\" November 2016", "Wall Street Journal, \"Exxon CEO Joins Suit Citing Fracking Concerns,\" Feb. 20, 2014", "District Court of Denton County, Texas, Armey et al v. Bartonville Water Supply Corporation, 2012", "Dallas Business Journal, \"Rex Tillerson drops out of water tower lawsuit in Bartonville,\" April 21, 2014", "Cross Timbers Gazette, \"Bartonville water tower saga continues,\" Nov. 20, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]