["About this rating", "In September 2017, a purported quote from Hillary Clinton began spreading widely on Facebook in which the former Democratic presidential candidate appears to claim that women who voted for Donald Trump did so under pressure from the men around them:", "Women voted against me because they caved in to pressure from their husbands, fathers, boyfriends and male bosses.", "This is not, in fact, a direct quote from Clinton; it is instead an oversimplified version of something she said during an interview with National Public Radio that was published on 12 September 2017.  (The relevant portion of this interview, which can be heard here, starts at 3:10.)", "Interviewer Rachel Martin asks Clinton about whether she believes that sexism played a role in her defeat to Donald Trump, and if she thinks this might be because Clinton failed to inspire them. During her response to this question, Clinton recounts a conversation with Facebook's Sheryl Sandberg:", "...Sheryl ended this really sobering conversation by saying that \"Women will have no empathy for you, because they will be under tremendous pressure — and I'm talking principally about white women — tremendous pressure from fathers and husbands and boyfriends and male employers not to vote for the girl.\"", "NPR's audio of the interview skips to another question at this point, but the transcript continues with Clinton observing:", "And we saw a lot of that during the primaries from Sanders supporters, really quite vile attacks online against women who spoke out for me, as I say, one of my biggest support groups, Pantsuit Nation, literally had to become a private site because there was so much sexism directed their way. So I knew going in that this would be a hurdle for me.", "Earlier in the interview, Clinton noted: \"I didn't win the vote of white women.\"", "The quote that spread widely on Facebook should not be attributed to Hillary Clinton, because she didn't say those exact words and was quoting someone else to begin with — and she pointedly did not use the word \"caved\".", "Neither did Clinton speak in such absolute terms about the dynamics at play among female voters or state that pressure from men was a motivating factor for all women who voted for Donald Trump, although she also did not offer any alternative explanations for why she lost among white women in particular.", "In March 2018, Clinton made similar comments during an event in India. Asked why 52 percent of white women had voted for Donald Trump, and not her in 2016, Clinton pointed out a historical pattern of decline in Democratic voting among white women.", "However, she also suggested once again that pressure from men was a motivating factor for some married white women in voting for Trump:, especially after former FBI Director James Comey made a bombshell announcement about the investigation into Clinton's private server, days before the election: (Relevant section of video starts at 40:00.)", "Part of that [decline] is an identification with the Republican party, and a sort of ongoing pressure to vote the way that your husband, your boss, your son -- whoever -- believes you should. What happened in my election is I was on the way to winning white women until [James Comey] dropped that very ill-advised letter on October the 28th, and my numbers just went down...", "All of a sudden, white women who were going to vote for me and frankly standing up to the men in their lives and the men in their workplaces, were being told \"She's going to jail, you don't want to vote for her. That'd be terrible, you can't vote for that.\"", "Once again, Clinton did not actually say that women \"caved in\" to pressure from men, and this time, she specifically framed her remarks around married white women, not all women, as well as offering historical context for the Democratic party's declining vote share among the white, female electorate.", "Morning Edition.  \"Transcript: Hillary Clinton's Full Interview With NPR's Rachel Martin.\"\r\n  National Public Radio.  12 September 2017.", "India Today.  \"No Plans of Running for Next Presidential Elections: Hillary Clinton at India Today Conclave 2018.\"\r\n  India Today.  10 March 2018.", "Updated [13 March 2018]: Added similar remarks Clinton made in India in March 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]