["“Locals gather at Singhu border, sloganeering against farmers’ protest and asking farmers to evacuate,” tweeted NDTV on January 28.", "Violence erupted in parts of Delhi on January 26 after a group of protestors against the farm bills veered off the course during the Republic Day tractor parade. Farmers’ protests have been ongoing since the past three months where farmers have gathered at border points in Delhi to demand that the centre repeals the laws. Mainstream media organisations reported that several locals held demonstrations at Singh border on January 28 demanding that the inter-state highway be cleared.", "“Group of people claiming to be locals gather at Singhu border demanding that the area be vacated,” wrote ANI.", "#WATCH | Delhi: Group of people claiming to be locals gather at Singhu border demanding that the area be vacated.", "Farmers have been camping at the site as part of their protest against #FarmLaws. pic.twitter.com/7jCjY0ME9Z", "— ANI (@ANI) January 28, 2021", "Other news organisations that carried similar reports were The Hindu, Times Now, Hindustan Times, CNN News18, India Today, The Times of India, The Indian Express, TV9 Telugu and Hindustan.", "This slideshow requires JavaScript.", "While it is true that a bunch of people gathered at the Singhu border to demand that farm bill protestors are removed from the area, this is only half true.", "The protest wasn’t organised by mere ‘locals’ but members of the Hindu Sena. “Delhi: Hindu Sena group and locals took out a procession against farmers’ protest at Singhu border,” said a tweet by Aaj Tak which was also retweeted by the organisation’s founder and president Vishnu Gupta.", "Gupta had also issued a press release which stated, “Today, local Hindu Sena activists along with local area residents went to Singhu border amid farmers and raised slogans against Khalistan supporters and appealed to the farmers to clear the road.”", "“Hindu Sena warned pro-Khalistan protesters that they resolve their problems in 24 hours after talking to the government and empty the Singhu border and the road,” it further added.", "आज स्थानीय हिंदू सेना के कार्यकर्ताओ ने स्थानीय क्षेत्र वासियों के साथ मिलकर किसानों के बीच सिंघु बॉडर जाके खालिस्तानी समर्थको के खिलाफ जमके नारेबाजी क व किसानों से रोड खाली करने की अपील की ! @ANI@IndiaToday @ABPNews @PTI_News @indiatvnews pic.twitter.com/yx1pczvOMz", "— Vishnu Gupta🕉 (@VishnuGupta_HS) January 28, 2021", "Alt News contacted Vishnu Gupta who reiterated that the protest was organised against ‘Khalistani’ elements in the farmers’ protest. “We want to give them an ultimatum to clear the roads. But we did not interact with farmer leaders since the area was barricaded by the police.” He added that the demonstration, which saw the participation of locals, was organised by the Hindu Sena. “We have local units that help in these situations,” he said.", "Hindu Sena is a fringe outfit that has often made headlines for the forceful imposition of ‘Hindu values and culture’. Last year during Valentine’s Day, it warned couples of police arrest. The outfit had also threatened violence against Shaheen Bagh protestors and later called-off mobilisation. They had put up posters on the signage of India Islamic Cultural Centre which read “Jihadi Terrorist Islamic Centre”.", "A protest organised by the far-right group was misleadingly reported by media outlets. Media reports failed to highlight that Hindu Sena workers led the protest against farmers at Singhu border and gave them an ultimatum to clear the area.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]