["A statement attributed to former Chief Minister of Uttar Pradesh and Samajwadi Party (SP) leader Akhilesh Yadav is doing the rounds on social media. “In 2022, SP will form the government in UP and we don’t need Ram and Hanuman,” reads the purported quote. Twitter user ‘Kosindra Tomar (BJP)’ posted an image carrying the statement and took a jibe at the SP leader. “Tap thief (referring to Yadav) used to say we don’t need Ram and Hanuman but he is now saying that he wants to build Vishnu temple in Itawa.” According to his Twitter bio, Tomar is a member of the Rashtriya Swayamsevak Sangh (RSS).", "Twitter user @gulab_dharkar had posted the same image on May 23, 2020. It was retweeted more than 300 times. The image is being shared on Facebook as well.", "Alt News also received verification requests on its official WhatsApp number (+91 7600011160).", "With a keyword search on Google, we found a report published by Hindi newspaper Hindustan. The article was titled, “Hindustan Summit Conference: I don’t need to latch on to Ram and Hanuman. I will hold on to work.” (translated)", "Akhilesh Yadav was one of the speakers invited at the Hindustan Summit held on February 22, 2020. Yadav was asked, “Kejriwal is latching onto Hanuman, BJP is latching onto Ram…so you latch onto Krishnaji… you are Yaduvanshi.” In response to the question, he said, “We are holding on to work, we are making an expressway.” At 25 minutes in the video posted below, the relevant portion can be heard.", "News reports of Yadav’s statement were also published at the time.", "This slideshow requires JavaScript.", "Dainik Jagran’s fact-checking wing Vishvas News earlier fact-checked the same claim.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]