["About this rating", "Make up your mind, conspiracy theorists. Is \"hot dog\" code for male prostitutes, or does \"hot dog\" simply refer to a food item?", "In January 2019, President Trump was criticized for serving items from McDonald's, Burger King, and other fast food spots to the Clemson Tigers during a White House celebration of the football team's NCAA Championship. While a number of pundits defended Trump, saying the controversy was overblown, the conspiracy theory website InfoWars went a step further and maintained that the criticism was hypocritical, claiming that former President Barack Obama had once purchased $65,000 worth of hot dogs for a private party:", "\"The left is mocking President Trump for providing a fast food buffet to a college football team, but emails obtained by WikiLeaks show that former President Obama flew in $65,000 worth of hotdogs from Chicago -- using taxpayer funds -- for a private party in 2009.\"", "This argument was not made in good faith and was not based on any credible evidence.", "The notion that President Obama purchased $65,000 worth of hot dogs for a private party came from a single email chain published by Wikileaks in October 2012 as part of the so-called \"Global Intelligence Files.\" This email was not sent by President Obama or any member of his administration; rather, the email chain, dated 14 May 2009, involved various employees at the intelligence company Stratfor discussing a \"Chicago Hot Dog Party.\"", "Stratfor's Fred Burton responded to an email by writing, \"I think Obama spent about $65,000 of the tax-payers money flying in pizza/dogs from Chicago for a private party at the White House not long ago, assume we are using the same channels?\"", "This single message was not proof that President Obama ever purchased $65,000 worth of hot dogs. It was merely speculation (or possibly an attempt at humor) about a supposed exorbitant expenditure by the Obama administration. The email was not accompanied by any evidence to support its literal reading and did not originate with a member of the Obama administration or from anyone in attendance at the alleged hot dog party.", "It's possible that the original Stratfor email was misstating the facts about a Super Bowl viewing party hosted by President Obama at the White House in February 2009. The president did serve hot dogs at that party (as well as brownies, hot fudge ice cream, pizza, soft pretzels, chicken sandwiches, etc.), but we found no reports stating that he purchased $65,000 worth of hot dogs (at $3 a dog, that's more than 20,000 hot dogs) or that the treats were flown in from Chicago.", "Interestingly, this isn't the first time this \"hot dog\" email has been used in an attempt to smear the Obama administration. Back in 2016, this innocuous email exchange was used to push the Pizzagate conspiracy theory. InfoWars head Alex Jones himself even claimed that \"hot dog\" was actually code for \"male prostitutes\":", "I learned this with Pizzagate and stuff. You’ve got admissions and thousands of emails about the kids will be delivered into the hot tub for your pleasure and then it’s the FBI code words for sex with kids off their own homeland security manual and they’re talking about $65,000 of succulent hot dogs. “Oh God, these are good. I had these hot dogs in Hawaii and they were delivered by jet.” It’s male prostitutes.", "And look, Obama’s having sex with 10 dudes a day, whatever.", "While Jones once used the term \"hot dog\" to push a baseless conspiracy theory concerning pedophilia and sex trafficking, by January 2019 this code word for male prostitutes had reverted back to referencing an ordinary food item in order to launch a new (yet similarly baseless) attack on Obama.", "We reached out to Pete Souza, Obama's official White House photographer, to determine if he had ever seen his former boss with a suspiciously large amount of hot dogs.  He told us, \"I shot almost two million photographs as the Chief Official White House Photographer during my eight years in the Obama administration. Every picture was transferred to the National Archives on 1/20/2017, and I can assure you there is not a single photograph of President Obama with 20,000 hot dogs.\"", "Media Matters.   \"Alex Jones: President Obama Has Been 'Having Sex With 10 Dudes a Day' on Taxpayer Time.\"\r\n    1 August 2018.", "Rothschild, Mike.   \"An Obama Meme About Pizza Reveals a Bigger Problem.\"\r\n    ATTN.   4 November 2016.", "CNN.   \"Malveaux: Inside Obama's Super Bowl Party.\"\r\n    2 February 2009.", "White, Jamie.   \"Left Mocks Trump Fast Food Feast -- But Obama Spent $5,000 on Hot Dogs!\"\r\n    InfoWars.   15 January 2019.", "Smith, Kyle.   \"Attacking Trump Over His Fast Food Feast Is Just Ridiculous.\"\r\n    New York Post.   15 January 2019.", "Kendall, Erika.   \"Trump Serving Fast Food to the Clemson Players Isn't Just Insulting. It's Especially Bad for Elite Athletes.\"\r\n    NBC News.   16 January 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]