["The photo was published by a Facebook page with more than 560,000 followers here on January 6, 2020.", "The post has been shared more than 7,000 times.", "The post’s caption states: ”Thank God , it's raining in Australia #wedontdeservethisplanet”.", "At least 25 people have been killed and more than 1,800 homes destroyed after deadly bushfires scorched millions of hectares of land in Australia, as reported here by AFP on January 7, 2020.", "Below is a screenshot of the misleading post:", "The photo was also shared thousands of times alongside a similar claim here on Facebook and here, here, here and here on Twitter; by India-based Facebook users here, here, here and here; and with an identical claim in Sinhala here and here.", "The photo has been circulated in a misleading context; it was taken in 2014 by a nature photographer in Australia.", "A reverse image search on Google found the same photo published here on the website of photographer Charles Davis, who is based in New South Wales, Australia.", "The photograph is captioned: “Praise to the Rain”.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the one published on Davis’ website (R):", "Davis told AFP in an email dated January 8: “That photo was taken almost 7 years ago. It is my photo, It has nothing to do with the fires and it is not raining very much at all here.", "“The kangaroos in that photo are likely all ash now as the fires have gone through that area. I don’t know who started using that photo but it has been used completely out of context.”", "He later issued a clarification in this Instagram post on January 14, which states in part:", "\"I took this photo in 2014. These kangaroos are more than likely ash now and definitely aren’t celebrating anything.\"", "It really annoys me that I even have to post this while everything around my home is still burning. This photo, my photo has been used to post lies all over social media for the last two weeks. People are posting it saying (someone captured these kangaroos celebrating the rains that are putting out the fires in Australia). Firstly I took this photo in 2014. These kangaroos are more than likely ash now and definitely aren’t celebrating anything. I can say first hand there has been bugger all rain and everything is still very much burning. If you see you anyone posting this photo with bullshit lies like this please set them straight. It’s bad enough to have your work stolen but to have it used to promote lies for others social media ego stroking is not cool.", "A post shared by  Charles Davis (@charlesdavisphotography) on Jan 14, 2020 at 12:40am PST", "Rain did fall in parts of the bushfire-stricken states of New South Wales and Victoria around January 6 when the misleading posts were shared, but experts said it was not enough to extinguish the fires, ABC Australia reported here on January 7.", "Indian news site LatestLY also debunked the misleading claim about the kangaroo image in this report published on January 6, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]