["An article published by Dainik Bhaskar New Delhi Edition on August 23, 2018 carried a photo of a baby elephant with a caption “सेना केरल में बाढ़ में फंसे लोगों के साथ जानवरों की भी मदद कर रही है। जवान ने हाथी के बच्चे को रेस्क्यू किया।” (Army is helping animals along with the people stranded in the floods in Kerala. A jawan rescued an elephant’s baby -translated). The caption purports that a baby elephant was rescued by the army during Kerala floods.", "Gujarati edition of the same newspaper Divya Bhaskar had also published the image on August 23, 2018.", "Individual users have circulated the image as well, one Facebook user John Morris posted the same image on August 20, 2018. It has been shared more than 3000 times at the time of writing this article.", "PHOTOGRAPH OF THE YEAR KERALA, FLOODS.", "Posted by John Morris on Monday, 20 August 2018", "Palanichamy Sarathkumar, 28, a forest guard stationed near Mettupalayam, Coimbatore recieved a call on December 12, 2017 when he was heading home after a night shift. An article published by the BBC on December 29, 2017 quoted Sarathkumar saying, “The caller informed me that a female elephant was blocking the road near the Vanabhadra Kaliamman temple.” The BBC report further states that Sarathkumar and his colleagues managed to drive the elephant back in to the jungle using fire crackers. Scouting for other elephants in the area, the team came across a calf stuck inside a small ditch. They realised the calf was the reason for the female elephant’s distress. However, the calf was too weak to walk.", "Sarathkumar was further quoted saying, “We wanted to take it to the other side of the road to reunite it with its mother. But there was a danger of being attacked as she was still nearby. So, instead of all four of us being put at risk, I decided to carry the calf by myself across the road.”", "The faux pas by Dainik Bhaskar was first discovered by Twitter user Sneh Bhavsar.", "A baby elephant was rescued near Athirapally, Thrissur in Kerala on August 13, 2018. However, this was not the same one as reported by Dainik Bhaskar. In an article published by The News Minute on August 16, 2018, an image of the rescued elephant is provided. “In a heartwarming rescue operation, the Kerala State Electricity Board (KSEB) officials closed down the shutters of a dam to save a baby elephant from drowning in the overflowing river,” stated the report.", "We have observed a lack of due diligence from many reputed media organisation while reporting Kerala floods. Ascribing photos and videos to a location unrelated to the incident has been repeated multiple times.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]