["The post was published here on Facebook on June 13, 2020. It has been shared more than 7,000 times.", "The claim reads: “South Korean police shoot the crowd with purple dye, then spend the next week arresting the protestors. Who’s all in favor? And that’s how you do it.”", "The post was also shared on Facebook here, here, here, here, here, and here.", "The claim is misleading.", "A Korean National Police Agency spokesperson denied the claim, telling AFP by phone on July 6, 2020: “No such dye has been used in protest control”.", "In the past, however, South Korean police have used dyes in water cannons to target protesters.", "This Associated Press video of a 1998 pro-unification rally and this Getty Images photo of a 2008 rally against a state visit of former US President George W. Bush's show police firing water cannons laced with yellow dye.", "Blue dye has also been used by police. The Hankyoreh, a South Korean newspaper, reported on blue dye being used in this 2008 report about anti-US beef protests and South Korean news agency Yonhap reported on the same practice being used in this 2011 report on an anti-police brutality protest.", "Keyword searches for purple dye on the South Korean search engine Naver, however, yielded no results.", "Kyung-Seok Choo, a US-based associate professor of Criminal Justice & Economic Crime at Utica College and president of the Korean Society of Criminology in America, told AFP that South Korean police have stopped using such dyes.", "“Korean police occasionally used yellow or blue dye against protests and unlawful assembly from 2008 to 2011,\" Choo said in an email on July 10, 2020.", "“Since 2011, police stopped using dyes not because of social issues related to the dyes but because of its effectiveness to control the protests. No dye supplies have [been] distributed since 2015 at all.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]