["The video was shared in this Facebook post on May 29, 2019, where it has been viewed more than 213,000 times and shared more than 3,100 times.", "Below is a screenshot of the misleading Facebook post:", "The one-minute, 39-second video shows a man dressed in Muslim attire facing a Sikh man who is sitting on a stage. The man in Muslim attire kneels and bows his head several times in prayer towards the stage.", "The Malaysian-language caption translates to English as: “This video was taken at gurdwara sahib temple, Johor Bahru. If this man is Muslim, which Islamic school of thought does he belong to? Islamic prayers but no rukuk (a bowing gesture while praying). \n\tCongratulations MP Johor Bahru, may your reckoning be easy.”", "“Johor Baru” refers to a city in south Malaysia. “Gurdwara Sahib temple, Johor Bahru” refers to a Sikh temple listed on Google Maps here. A photo of its prayer hall can be seen here.", "The misleading post was shared a day after Johor Bahru lawmaker Akmal Nasir was criticized after he attended an interfaith iftar, or fast-breaking meal, at the Gurdwara Sahib in Johor Baru on the evening of May 28, 2019, during Ramadan.", "This report about the incident was published by Malaysian news site Malaysiakini on May 28, 2019.", "The first paragraph of the report says: “Johor Bahru MP Akmal Nasir has defended his breaking fast programme to be held at a gudwara (Sikh temple) in the state this evening.”", "The video was also shared on here and here on Facebook with a similar claim, and on YouTube here with a similar claim.", "The claim is false; the video was actually filmed at a different temple more than 130 miles away and posted days before the controversy was sparked over the lawmaker’s actions.", "The same video was published in this Facebook post on May 25, 2019, before the interfaith iftar event which lawmaker Akmal attended on May 28.", "Below is a screenshot comparison of the video in the misleading posts (L) and the same video shared on Facebook on May 25, 2019 (R):", "The caption for the Facebook post published on May 25, 2019, states: “God Is One.. A Muslim Man Performing His Prayers In Gurdwara Sahib Melaka Darbar Sahib.. Sabna Jiya Ka Ek Data..\n\t#Saturday25052019”.", "“Darbar Sahib” refers to the stage where the holy book is placed, while “Sabna Jiya Ka Ek Data” translates from Punjabi to English as: “There is only the One, the Giver of all souls.”", "The caption states the video shows a Muslim man praying at the Gurdwara Sahib Melaka on May 25, 2019.", "Here is the Gurdwara Sahib Melaka in the city of Malacca on Google Maps.", "This Google user’s image tagged at the location on Google Maps in November 2018 shows a corresponding interior to the temple seen in the misleading Facebook post.", "Below is a screenshot of the image:", "Below is a screenshot comparison of the video in the misleading post (L) and the Google image (R):", "The Gurdwara Sahib Melaka is 222 km (138 miles) from the Gurdwara Sahib Johor Bahru, according to Google Maps.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]