["You may have seen articles circulating on Facebook with headlines that claim Denver Broncos General Manager John Elway threatened to fire players if they kneel during the national anthem.", "The problem is, the quote attributed to the two-time Super Bowl-winning quarterback is fake. It originated from a satirical website.", "But there’s no way to know the quote is fabricated by looking at the headline on Facebook, which reads:", "\"John Elway Lays Down The Law: ‘Kneel On My Field And You’re Fired On The Spot’\"", "Other websites, such as Prep-101.com and Conservative Republic, copied and pasted the fabricated story without a disclaimer that it was made up.", "People commenting on those pages also seemed to have no idea that the story wasn’t real.", "One person wrote: \"Way to go John Elway for standing up for the flag national anthem if they don’t want to stand fire them on the spot way to go to John Elway every team should do that.\"", "Another said: \"Haven’t watched NFL since this kneeling started and nothing was done about it. Thank you MR. Elway wish more would do this.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The story originated on a satirical website called \"PotatriotsUnite.com,\" which states on its \"about us\" page that it’s part of the America’s Last Line of Defense network of satire sites and says everything on its website \"is fiction.\"", "While Elway said in 2017 that he believed in standing for the national anthem, he posted a statement on Twitter on June 5, 2020, saying he felt it was time to join this \"important conversation,\" following the death of George Floyd and the worldwide protests against police brutality.", "\"The way the players amplify the voices that need to be heard is more important than ever,\" Elway wrote. \"I fully support them using their platform and influence in a positive way to create change.\"", "After a lot of listening, I wanted to share some of my thoughts and felt it was time to join this important conversation. pic.twitter.com/2ncnFvmq33", "That was the same day NFL Commissioner Roger Goodell said in a video message that the league would embrace the rights of players to protest racism peacefully.", "Elway never said that he would fire players if they kneeled during the anthem. We rate this Pants on Fire!", "Prep-101, John Elway Lays Down The Law: ‘Kneel On My Field And You’re Fired On The Spot’, Accessed July 1, 2020", "Conservative Republic, John Elway Lays Down The Law: ‘Kneel On My Field And You’re Fired On The Spot’, Accessed July 1, 2020", "Bleacher Report, John Elway on Kneeling for Anthem: 'I'm One That Believes in Standing', Sept. 26, 2017", "Twitter, John Elway post, June 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]