["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Recent blog posts circulating on social media claim President Donald Trump approved scholarships to help students in Africa study in the United States.", "\"US President D. Trump Approves Scholarship for 50,000 African Student (sic) to Study in USA 2018,\" reads the headline of one such post on the website studentapply.info.", "But you shouldn’t believe it.", "This story was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The article is rife with grammatical errors that almost bring it to the point of incomprehensibility. To start with, the headline references \"50,000 African Student,\" singular, not 50,000 African students, plural.", "At one point, it declares, \"The US Embassy will work emphatically through their specialists with understudies occasionally masterminded social events and courses to help them all through the application strategy to hook declaration and honors to go to schools and colleges in the United States.\"", "We searched on Nexis to see if any major news outlets reported on the news of Trump approving scholarships for African students, and could not find any evidence to support the headline’s claim.", "A Google search revealed that this hoax has appeared before in a similar form. Another website previously touted that Trump had approved \"fully government sponsored scholarships for international students … in USA universities.\"", "Studentapply.info did not respond to a request for comment sent through its contact form.", "We rate this claim Pants on Fire!", "Studentapply.info, \"US President D. Trump Approves Scholarship for 50,000 African Student to Study in USA 2018,\" July 13, 2018", "US Department of State, \"Press Releases: 2018,\" accessed August 23, 2018", "US Department of State, \"What is a U.S. Embassy?,\" accessed August 23, 2018", "SmartGeak, \"USA PRESIDENTIAL SCHOLARSHIP – Donald Trump Approves Fully Government Sponsored Scholarships For International Students (undergraduates/MBA/Postgraduates)In USA Universities,\" accessed August 23, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]