["About this rating", "Verizon Wireless admitted that they made a \"mistake\" after fire officials in nothern California revealed the company had stifled their data usage amid a historic wildfire in July 2018.", "According to Santa Clara County Fire Chief Anthony Bowden, the data service provider failed to live up to their policy of lifting data caps in emergency situations when Bowden department asked for help while they battled the Mendocino Complex Fire. As of late August 2018, the fire had consumed more than 400,000 acres of land, making it the largest wildfire in California history.", "The complaint came to light as part of a lawsuit filed by attorneys general from 22 states and the District of Columbia, as well as the County of Santa Clara, the Santa Clara County Central Fire Protection District, and the California Public Utilities Commission, seeking to overturn the Federal Communication Commission's move to repeal net neutrality rules. Bowden made his allegation in an addendum to an amicus brief filed by the complainants:", "Verizon representatives confirmed the throttling, but rather than restoring us to an essential data transfer speed, they indicated that County Fire would have to switch to a new data plan at more than twice the cost, and they would only remove throttling after we contacted the Department that handles billing and switched to the new data plan.", "Bowden said the data throttling primarily affected one specific vehicle, OES 5262, which his department employed to \"track, organize, and prioritize routing of resources from around the state and country to the sites where they are most needed\" during the blaze. The department's plan called for their data speeds to be slowed if they used more than 25 gigabytes a month.", "\"In the midst of our response to the Mendocino Complex Fire, County Fire discovered the data connection for OES 5262 was being throttled by Verizon, and data rates had been reduced to 1/200, or less, than the previous speeds,\" he wrote.", "Verizon released a statement conceding that they \"made a mistake\" in discussing the department's plan:", "Regardless of the plan emergency responders choose, we have a practice to remove data speed restrictions when contacted in emergency situations. We have done that many times, including for emergency personnel responding to these tragic fires. In this situation, we should have lifted the speed restriction when our customer reached out to us. This was a customer support mistake. We are reviewing the situation and will fix any issues going forward.", "Verizon rejected the department's contention that the incident could be connected to the repeal of net neutrality rules. However, officials in Santa Clara County said that Verizon's actions during the fire represent conduct that is being encouraged by the repeal.", "\"Verizon's throttling has everything to do with net neutrality -- it shows that the ISPs will act in their economic interests, even at the expense of public safety,\" said county counsel James Williams.", "Brodkin, Jon.   \"Verizon Throttled Fire Department's \"Unlimited\" Data During Calif. Wildfire.\"\r\n    Ars Technica. 21   August 2018.", "Kastrenakes, Jacob.   \"22 States Ask Court to Restore Net Neutrality.\"\r\n    The Verge.   21 August 2018.", "Brodkin, Jon.   \"Fire Dept. Rejects Verizon's \"Customer Support Mistake\" Excuse for Throttling.\"\r\n    Ars Technica.   22 August 2018.", "Graff, Amy.   \"Mendocino Complex Fire is Now 400,000 Acres -- More Than Half the Size of Rhode Island.\"\r\n    SFGate.   21 August 2018.", "Updated [4 March 2019]: Updated to add reference to two parties to the lawsuit against the Federal Communication Commission.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]