["A bunch of images doing rounds on social media is being circulated with the claims that it depicts the devastation caused by the Indian Air Force in Pakistani territory. The caption used to share the viral images is – “पुलवामा की तो तस्वीर बहुत देखी जरा आज पाकिस्तान का भी हाल देखो!!!! (Seen enough photograph of Pulwama, now see the condition of Pakistan).”", "This photograph has been shared by many, including the Facebook group I Support Amit Shah. It depicts the October 2005 Kashmir earthquake. The photograph was taken in the Pakistani town of Balakot. According to a BBC report, “The earthquake had affected the northern regions of Pakistan, Afghanistan and India. An estimated 75,000 people were killed, mostly in Pakistan-administered Kashmir.”", "This image is also of the 2005 Kashmir earthquake. We found the original photograph in Getty Images.", "The photograph above is of the 2005 earthquake as well. Getty Images has the original photo in its stockpile.", "This photograph, same as the others, is widely circulated on WhatsApp. However, it does not depict the recent turmoil between India and Pakistan. The photograph was shot on November 3, 2014, after a Pakistani Taliban group bombed the Indo-Pak border. We found the original image on an Al Jazeera report.", "Both these images are of the same suicide bomb attack as image 4. We found the original photographs on CNN and Dawn.", "While Alt News was unable to determine the exact origin of this photograph, we were able to trace it as far back as 2015. A blog – worthefforts.blogpost.com – posted it as the 2015 Punjab-Gurdaspur terrorist attack. Since the image is old, it cannot be representative of anything that is happening in the present altercation between India and Pakistan.", "We found the original photograph on a July 8, 2015, Tribune article, which described the incident as, “Tribespeople from Kurram Agency observed Youm-e-Shuhada (Day of martyrs) by paying tribute to those who had lost their lives due to militancy across the province since 2005.” The tribute was observed in Parachinar, the capital city of Pakistan’s Kurram District.", "We found that this image dates back to December 19, 2014. It was uploaded by Getty Images and described as dead bodies of alleged Taliban militants who were killed following a military operation in Pakistan’s Hangu.", "While we were unable to locate the exact origin of the photograph on the bottom, we were able to trace it as far back as 2016. The image was on a blog myopenionsblog.wordpress.com. Since it is old, it’s clear that it cannot depict the present turmoil.", "The image on the top was found on Outlook, which described it as, “Army personnel poses with the bodies of three Lashkar-e-Taiba militants, killed during an encounter at Wandarbal village in Handwara.”", "Alt News located all the above images with a simple Google reverse image search. With a surge in misinformation after the Pulwama attack and the turmoil that followed, it is essential that social media users practice self-verification and forward photographs/ videos/ messages only if found authentic.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]