["The Facebook post, published in December 2019 and archived here, relies on a divinely-inspired tale about a sex worker who turns her life around for God and, as a reward from the heavens, is gifted a newborn child. The post features images of a woman holding an infant.", "Warning: these images might be distressing to some", "Show", "Hide", "It claims her pregnancy was a miracle because she had an elective hysterectomy years earlier to eliminate the risk of falling pregnant.", "So far, the post has had more than 158,000 shares and nearly 24 million views.", "The same story appears in earlier posts but with different illustrations, such as this one here from February  2019, which was reposted in March and April.  The March post was shared nearly 3,000 times.", "In 2018, a similar post appeared here, this time with a video of a motivational sermon.", "The earliest version of the claim AFP could find with a basic Facebook search dates back to December 2016 and appears here with an unrelated video of a little girl trying to mount a pony.", "However, a Twitter search threw up several results from 2013 and 2014, all of them tweets linking to Facebook posts like these here, here and here where the same claim is made without any images.", "The story uses a typical chain email format by encouraging people to share the post in five different Facebook groups to guarantee blessings from above.", "Ultimately, the pregnancy claim is false because a woman cannot have a baby once she has had her uterus removed, as the US Department of Health and Human Services explains here.", "The images used in the misleading December post show US mother Yasminé Indiaa Jordan and her son Jeremiah Kai Hillman who was stillborn on March 13, 2018.", "She decided to capture the heartbreaking moment and the days that followed in a series of photographs published on her Facebook and now disabled Instagram accounts.", "Warning: this image may be distressing to some", "Show", "Hide", "The decision by the Florida resident to publicly document her grief sparked a major public reaction, both positive and negative, as reported here, here, here and here.", "Jordan, who also goes by the name Zariah Jackson, defended both her decision and a crowdfunding campaign launched to support her, as documented in this Yahoo story from April 2018 which features a screenshot of the Instagram post:", "Her Instagram account was later closed after being hacked.", "AFP has tried to contact Jordan on Facebook for comment but is yet to receive a reply.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]