["The Conservatives are polling 38% in North East Somerset, the Liberal Democrats are on 32%, and Labour are on 8%.", "These are the results of a poll asking how people in the area would vote if only the Liberal Democrats and Conservatives were competitive.", "Headline vote intention figures from a poll of North East Somerset residents have the Lib Dems at 28%, in second place behind the Conservatives on 44%. Labour were third on 14%.", "Correct.", "Yesterday, a local branch of the Liberal Democrats talked up their chances of winning the North East Somerset seat. To illustrate this, they first shared this graph on Twitter. If we work together, and back @nickcoatesnes we will beat Jacob Rees-Mogg in North East Somerset #VoteNickCoates #StopMogg pic.twitter.com/ymubNsMVg8— BathNES Lib Dems 🔶 (@bathnesld) October 30, 2019", "If we work together, and back @nickcoatesnes we will beat Jacob Rees-Mogg in North East Somerset #VoteNickCoates #StopMogg pic.twitter.com/ymubNsMVg8", "You might expect this to show the results of the last election, or current voting intention in North East Somerset.", "This isn’t what the graph shows.", "The actual question asked was:", "“Imagine that the result in your constituency was expected to be very close between the Conservative candidate and the Liberal Democrat candidate, and none of the other parties were competitive [emphasis added]. In this scenario, which party would you vote for?”", "38% of all respondents (not just those likely to vote) said the Conservative candidate Jacob Rees-Mogg and 32% said the Liberal Democrat candidate Nick Coates.", "The exact wording of the question is included in the small-print below the graph, and the local branch told us they had done that in part because there wasn't enough room to include it in full in the text of the tweet. However, the text is so small that it cannot reasonably be expected that most people will notice it.", "The question wording forces a hypothetical scenario on respondents which encourages them to choose either the Conservative or the Lib Dem candidate.", "This is not a good way to understand how people actually intend to vote in the area. When people go into the polling booth, they do not see a message like this telling them which parties are not competitive.", "The standard way to test voting intention is to ask people “If there were a general election held tomorrow and the following candidates stood in your North East Somerset constituency, which party would you vote for?”", "The same poll, commissioned from Survation by the Liberal Democrats, also did this. After accounting for likelihood to vote and removing don’t know and refusal responses, the results show 44% would vote for the Conservatives’ candidate, 28% for the Liberal Democrats’ and 14% for Labour’s.", "The Liberal Democrats did also tweet these figures in a follow up to the graph, but did not lead with this and those figures were much less widely shared.", "So while the Liberal Democrats are firmly the second place candidate, the gap to the Conservatives is much larger than the graph in their leading tweet suggests.", "Update 4 November 2019", "We updated this piece with a response from the Lib Dem local branch.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]