["By Saranac Hale Spencer", "Posted on November 23, 2018", "Q: Is the American Red Cross “not helping California wildfire victims” but helping members of the “caravan”?", "A: No. The American Red Cross is helping in California, and the global Red Cross network is helping migrants from Central America.", "The American Red Cross has been helping the victims of the California wildfires since at least Nov. 9 and during the Thanksgiving holiday.", "The Guatemalan Red Cross, Honduran Red Cross, and Mexican Red Cross have helped migrants from Central America traveling through Mexico who are part of what has been called a “caravan.”", "But a bogus meme is circulating online claiming: “The Red Cross is not helping California wildfire victims, but is helping the caravan.”", "That text is used with a picture of American Red Cross volunteers distributing supplies to Hurricane Sandy victims in 2012 and has nothing to do with migrants.", "In fact, the California Department of Forestry and Fire Protection lists the American Red Cross as a cooperating agency and the Federal Emergency Management Agency says the Red Cross is helping victims find emergency shelter.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“California Wildfires – Red Cross Helps as Thousands Evacuate.” Press release. American Red Cross. 9 Nov 2018.", "“California Wildfires – Red Cross Caseworkers Help with Next Steps.” Press release. American Red Cross. 20 Nov 2018.", "“How Does the American Red Cross Help Migrants?” Press Release. American Red Cross. 30 Oct 2018.", "Richards, Paul. Hurricane Sandy relief photo. Getty Images. 5 Nov 2012.", "California Department of Forestry and Fire Protection. Incident information — Woolsey Fire. Fire.ca.gov. 20 Nov 2018.", "Federal Emergency Management Agency. FACT SHEET: Housing Options. Fema.gov. 21 Nov 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]