["About this rating", "Former Republican congresswoman Michele Bachmann so frequently invoked her religious beliefs during her 2011 presidential campaign that when a quote attributed to her about assault rifles appeared in March 2018, some found it plausible:", "\"If we weren't meant to own assault rifles then why did Jesus create them?\" - Michele Bachmann on Fox and Friends. 3/2/2018.", "This quote is not genuine. For one thing, Bachmann did not appear on \"Fox & Friends\" on either 2 March 2018 or 3 February 2018. Neither of the official Twitter accounts for either Bachmann or \"Fox & Friends\" promoted or mentioned such an appearance. We also searched the show's web site and the IMDB pages for the episodes on the aforementioned dates and found no record of Bachmann's alleged visit.", "None of that was strictly necessary, as this meme contains a watermark for the Facebook page \"Christians for Michele Bachmann,\" a satirical group that frequently mocks her for her religious beliefs. However, we couldn't find this particular meme on the \"Christians for Michele Bachmann\" Facebook page. We did find a similar meme using the same format and color scheme, but the included fictional quote involved Roy Moore, not assault rifles:", "The earliest version of the fake \"assault rifles\" quote that we could find was posted to another political satire Facebook page, \"Politicked,\" on 5 March 2018. That page is categorized as \"just for fun\" and states in its \"About\" section that it creates \"left wing political satire with original and biting memes.\"", "It's unclear if \"Politicked\" created the assault rifle meme (using a template from Christians for Michelle Bachmann) or if they reposted the meme after the original was deleted. Regardless of which came first, this is not a genuine quote from Michele Bachmann.", "Taibbi, Matt.   \"Michele Bachmann's Holy War.\"\r\n    Rolling Stone.   22 June 2011.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]