["About this rating", "On June 28, 2020, a video supposedly showing two people pointing weapons at a group of protesters went viral on social media:", "This is a genuine video. It was taken by Daniel Shular, a photographer for the Columbia Missourian, and it is one of several photographs and videos that captured this incident. Here's a series of photographs taken by Laurie Skrivan, a photographer with the St. Louis Post-Dispatch:", "This video was taken on June 28, 2020 in a gated community in the Central West End neighborhood of St. Louis, Missouri.", "On social media, the two people in the video with guns were quickly labeled \"Ken and Karen,\" a play on the \"Karen\" term that has become associated with \"rude, obnoxious and insufferable middle aged white women,\" according to Urban Dictionary.", "St. Louis Today identified these individuals as Mark and Patricia McCloskey, personal-injury lawyers at the McCloskey Law Center. In 2018, the McCloskey's were featured in St. Louis Magazine after finishing renovations on their Midwestern palazzo.", "On June 26, a few days before this protest, Mayor Lyda Krewson publicized the names and addresses of various St. Louis residents who had written to her about defunding the police department during a Facebook Live stream, which the mayor has regularly conducted during the coronavirus pandemic. The mayor was accused of doxxing these citizens and putting them in danger of retaliation. The protesters were marching to Krewson's home when they passed by the gun-toting couple.", "The Washington Post reported:", "“Resign Lyda, take the cops with you,” they shouted on the way to the mayor’s house in the Central West End, banging on drums and carrying signs that said, “Respect us.” The first-term Democrat had publicly released the names and addresses of some fellow activists, and now they wanted to bring their demonstration to her door.", "But as the peaceful crowd of about 500 walked along a private, gated street, a white couple who emerged from a marble mansion had something else in mind.", "Around 6 p.m. Sunday, a barefoot man in a pink collared shirt walked out from the five-story house, carrying a semiautomatic rifle as he appeared to threaten the group. A few feet away, a woman pointed a pistol at the crowd, her finger directly on the trigger.", "As this video went viral, many people claimed that this couple's actions were illegal, since they were pointing their weapons at these protesters in a threatening manner. Others, however, claimed that they had the right to defend their home from and claimed that the protesters were trespassing on private property.", "The St. Louis Dispatch reported:", "To access Portland Place, the crowd entered through an iron pedestrian gate. The McCloskeys told police the protesters broke the gate to get in.", "St. Louis police said the couple had called police for help once they saw the large crowd enter Portland Place. The McCloskeys had been at home and heard a loud commotion coming from the street; they went to investigate and saw “a large group of subjects forcefully break an iron gate marked with ‘No Trespassing’ and ‘Private Street’ signs,” police said.", "“The group began yelling obscenities and threats of harm to both victims,” police said. “When the victims observed multiple subjects who were armed, they then armed themselves and contacted police.”", "The investigation into this incident is ongoing. The official police report, which we obtained from the St. Louis Police Department, lists the McCloskeys as victims No. 1 and 2, and labels the incident as a case of \"trespassing / assault 4th intimidation\" by unknown suspects:", "Incident: Trespassing / Assault 4th Intimidation\nLocation: 0 block of Portland Place\nDate/Time: 06/28/20 @ 1923\nVictim #1: 63-year-old White Male\nVictim #2: 61-year-old White Female\nSuspect: Unknown", "Officers responded to a “Call for Help” at the above location. The victims stated they were on their property when they heard a loud commotion coming from the street. When the victims went to investigate the commotion, they observed a large group of subjects forcefully break an iron gate marked with “No Trespassing” and “Private Street” signs. Once through the gate, the victims advised the group that they were on a private street and trespassing and told them to leave. The group began yelling obscenities and threats of harm to both victims. When the victims observed multiple subjects who were armed, they then armed themselves and contacted police. The investigation is ongoing.", "The Associated Press.   \"Couple draw guns at crowd heading to St. Louis mayor’s home.\"  \r\n  16 August 2018", "Russell, Stefene.   \"A Decades-Long Renovation Returns a Midwestern Palazzo to its Original Glory.\"\r\n    St. Louis Magazine.   16 August 2018", "Murphy, Doyle.   \"Gun-Swinging Lawyers Confront Protesters in Central West End.\"\r\n    Riverfront Times.   28 June 2020.", "Rice, Rachel.   \"Couple Points Guns at Protesters Marching to St. Louis Mayor’s Home to Demand Resignation.\"\r\n   St. Louis Today.   29 June 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]