["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "There is no evidence the coronavirus was “invented.”", "The best available information is that it originated with an animal in China and then infected humans.", "Did someone invent and patent the coronavirus in the United States only to plant it in China?", "That’s what one YouTube video shared on Facebook claims in yet another bogus coronavirus conspiracy theory that attempts to conflate a real news story with misinformation:", "\"The coronavirus was invented and patented in the USA and then planted in China,\" reads the YouTube headline.", "But the seven-minute video, which had more than 81,000 views as of March 9, 2020, provides no evidence to back up the headline. Instead, it shows footage from an unrelated press conference.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The video shows footage of U.S. Attorney Andrew Lelling at an actual Jan. 28, 2020, news conference describing cases of \"Chinese economic espionage and research thefts in the United States.\" But the video has been edited to include a jazz track and captions that were not a part of the original media event.", "During the press conference, Lelling announced the arrest of  Harvard University professor Charles Lieber for allegedly lying about his participation in a Chinese program to recruit foreign talent to China.", "The Justice Department charged Lieber and two Chinese nationals in connection with aiding the Chinese government. Lieber allegedly lied about his contact with the Chinese program known as the Thousand Talents Plan, which the U.S. has previously flagged as a serious intelligence concern, and about a lucrative contract he signed with China's Wuhan University of Technology.", "How does this relate to the current coronavirus outbreak? It doesn’t.", "While Novel coronavirus 2019, or COVID-19, was first detected in China’s Wuhan Province, there is no connection between coronavirus and the investigation into Lieber’s activities involving Wuhan University of Technology: There is no mention of coronavirus in the news release or in news reports about the case.", "At one point in the YouTube video, a partial document is superimposed over the screen. It makes reference to \"United States Patent Rota et al.  — Coronavirus isolate from humans\" and what appears to be a list of inventors, beginning with Paul A. Rota, of Decatur, Ga.", "That document is the patent awarded in 2007 to Rota and others for \"a newly isolated human coronavirus (SARS-CoV), the causative agent of severe acute respiratory syndrome (SARS).\" It was a patent for genetic sequencing and was filed by the federal Centers for Disease Control and Prevention, FactCheck.org explained.", "FactCheck.org and the fact-checking organization Snopes have both reported there is no link between Lieber and the new coronavirus.", "Here’s what we know about how coronavirus emerged in December 2019 in Wuhan:", "COVID-19 \"is a zoonotic virus\" — that is, it was spread from animals to humans — according to a report from 25 international experts, including some from China and the U.S., convened by the World Health Organization.", "Bats \"appear to be the reservoir of COVID-19 virus,\" but the intermediate host or hosts — that is, how it went from bats to humans — has not been identified.", "Such viruses often originate in bats, although they sometimes can jump to another species before infecting humans. Chinese researchers have found a possible link between COVID-19 and pangolins, a mammal entirely covered in scales.", "Early on, many of the patients in Wuhan had some link to a large seafood and live animal market, suggesting animal-to-person spread, according to the U.S. Centers for Disease Control and Prevention. Later, a growing number of patients reportedly did not have exposure to animal markets, indicating person-to-person spread.", "There is no credible evidence to back a claim that the coronavirus was invented in the U.S. \"and then planted in China.\"", "The best available information is that the virus originated in China with an animal and then spread to humans.", "We rate the statement False.", "YouTube, video, Feb. 19, 2020", "U.S. Department of Justice, news release, Jan. 28, 2020", "FactCheck.org, \"No Link Between Harvard Scientist Charles Lieber and Coronavirus,\" Feb. 21, 2020", "FactCheck.org, \"Social Media Posts Spread Bogus Coronavirus Conspiracy Theory,\" Jan. 24, 2020", "Snopes, \"Was Charles Lieber Arrested for Connections to Coronavirus, Wuhan Lab?\" Feb. 18, 2020", "PolitiFact, \"No evidence that coronavirus was faked to cover up ‘5G Syndrome,’\" March 9, 2020", "US Patent No. 7,220,852 B1, May 22, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]