["By Eugene Kiely", "Posted on May 19, 2020 | Updated on May 22, 2020", "Former Vice President Joe Biden overstated the Centers for Disease Control and Prevention’s staffing cuts in China during the Trump administration. He said the CDC reduced its staff to four, but it was actually 14.", "The presumptive Democratic presidential nominee made his remarks on MSNBC’s “The Last Word.”", "Biden, May 14: We had over 44, if I’m not mistaken, people from the CDC in China, in China to observe what was going on. The president brought home the vast majority of them and I think left only four in place.", "He is mistaken.", "The Biden campaign confirmed that the former vice president was referring to a March 25 Reuters report that said the Trump administration had cut CDC’s staff in Beijing by more than two-thirds.", "But that story said CDC’s staff in China “has shrunk to around 14 staffers, down from approximately 47 people since President Donald Trump took office in January 2017,” citing CDC documents.", "So how did Biden get to four?", "The documents cited by Reuters provided a breakdown of CDC’s workers by Americans and Chinese nationals. The documents show that most of the CDC staffers let go were Chinese nationals — contrary to Biden’s claim that President Donald Trump had “brought home the vast majority of them.”", "“The biggest cuts were to positions filled by Chinese employees on the U.S. payroll, down to around 10 from 40 over the same period,” Reuters reported.", "The Reuters story said the Chinese nationals let go included “medical and disease experts” with “deep expertise and institutional knowledge.”", "There were only eight Americans assigned to the CDC’s Beijing office, and that number was reduced to three at the start of the Trump administration, increasing to four with the recent arrival of a deputy director, Reuters had reported.", "The Biden campaign told us that its candidate was referring to the total number of CDC workers at the start of the Trump administration and the number of Americans who remained after the cuts. But he’s misrepresenting the staffing levels by comparing a total headcount that includes the Chinese nationals with a smaller, post-reduction number that does not.", "It would be accurate if Biden had said that Trump had cut CDC staff in Beijing from eight to four Americans or that the president reduced the agency’s total staff from 47 to 14. But he’s wrong to say the staffing level was cut from 47 (or “over 44”) to four.", "Update, May 22: In an email on May 19, the CDC provided our friends at PolitiFact with a further breakdown of the agency’s staffing levels in China. The CDC email, which PolitiFact shared with us, showed the overall number of CDC employees in China declined from 44 in March 2017 to 14 in March 2020. Specifically, the CDC cut its staff from 14 to five during that time in the Division of Global Health Protection — which is charged with helping “to stop potential pandemics at the source,” according to the CDC website. None of the five CDC employees in the global health division in China were Americans.", "Editor’s Note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]