["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this Tuesday, Jan. 21, 2014 file photo, Oumou Balde, 4, left, plays with her teacher Jacqualine Sanchez, right, and some pretend food in a pre-kindergarten class at the Sheltering Arms Learning Center in New York. (AP)", "When it comes to family budgets, one of the biggest bites can be child-care costs.", "Just how big is that bite?", "\"Child care costs account for 24% of a WI family’s budget.This is well above the 10% affordability threshold established by the U.S. Dept. of Health & Human services. Paid Family Leave would allow parents the flexibility necessary 2 ensure they are able 2 put their family first,\" state Rep. David Crowley, D-Milwaukee, said Oct. 22, 2019 in a Twitter post.", "Crowley’s tweet came on the same day Assembly Democrats reintroduced the Wisconsin Family Medical Leave Insurance Act.", "Under the bill, Wisconsin workers without employer-funded family medical leave would be able to buy into a state-run insurance program. The proposal would expand the state’s current family medical leave law to allow individuals to take leave for more family members, including care of grandparents and siblings.", "According to a Legislative Reference Bureau analysis, a covered individual who is on family or medical leave would be eligible, beginning on Jan. 1, 2024, to receive up to 12 weeks of family or medical leave insurance benefits. This is the third time the measure has been introduced; it has not gained support from Republican lawmakers.", "Is Crowley, who has announced his candidacy for Milwaukee County executive, on target about the cost of child care for Wisconsin families?", "Let’s take a look.", "The evidence", "When asked for backup, Crowley’s staff pointed us to a 2018 United Way report. The report focused on a population group that has been given the acronym ALICE -- Asset Limited, Income Constrained, Employed. The ALICE Report was part of a collaboration between the United Way in Wisconsin and 16 other states.", "Indeed, the report itself includes a line that is nearly identical to Crowley’s tweet:", "\"In the Household Survival Budget, child care accounts for 24 percent of the Wisconsin family budget, well above the 10 percent affordability threshold established by the U.S. Department of Health and Human Services.\"", "But where did the numbers come from?", "Officials with the state Department of Children and Families told us they do not collect that data. They pointed us to a series of advocacy groups, as opposed to any government agency or repository.", "According to the United Way, the report’s child care budget is based on the average annual cost of care for one infant and one preschooler in registered family child care homes -- the least expensive childcare option.", "The most recent U.S. Department of Health and Human Services reports, dating from 2016 onward, recommend that child care be considered affordable if out-of-pocket costs are equivalent to 7% of total household income.", "In earlier years, dating back to at least 2015, the federal benchmark for child care affordability was reported as 10%, the figure referenced in the second part of Crowley’s tweet.", "Additional groups", "Other advocacy groups have done their own tallies -- though each measures a slightly different thing:", "Economic Policy Institute: A July 2019 report from the institute puts the average cost of infant child care in Wisconsin at $12,597 a year. The report states that care for one infant would take up 18.5% of a median family’s income in Wisconsin. Wisconsin is ranked 20th out of 50 states and the District of Columbia for most expensive infant care.", "The group’s source list includes the U.S. Bureau of Labor Statistics, Child Care Aware of America and the U.S. Department of Health and Human Services.", "Child Care Aware: According to a 2017 report, the average cost of center-based infant care across all states tops 27% of the median income for single parents, an increase of 3 percentage points from findings in the group’s 2016 report, \"Parents and the High Cost of Care.\"", "The group says it obtains data through surveys of state child-care referral agencies. For states that did not respond to the survey, child care capacity and price data was pulled from publicly accessible databases and market rate surveys.", "Center for American Progress: On average, a family making the state median income in the United States would have to spend 18% of its income to cover the cost of child care for an infant, according to a November 2018 report.", "The 18% number is based on the state median income for a family of four, which comes from 2018 U.S. Department of Health and Human Services data.", "\"It’s also important to flag that the 18% number is the cost of child care for an infant in a center-based program. If you are focused on home-based child care as implied by one part of the statement we would note that the number for home-based family care is 11%,\" Steven Jessen-Howard, a Center for American Progress spokesman, said in an email.", "\"The high cost of child care is out of reach for most working families,\" said Simon Workman, co-author of the American Progress report in a statement.", "In short, each of the studies support Crowley’s central point that child care costs consume a far greater share of an average Wisconsin family’s budget than is recommended -- though the estimates vary, from 11% to 27%.", "Our ruling", "Crowley said \"child care costs account for 24% of a WI family’s budget.\"", "Child care costs can vary, of course, based on age of the child, number of children receiving care and where the care is provided. But each of the available reports supports Crowley’s main point -- that the costs far exceed the recommended amount -- even if the numbers come up somewhat different in each analysis.", "At PolitiFact Wisconsin, a statement is Mostly True when \"it is accurate but needs clarification or additional information.\" That fits here.", "This fact-check has been updated to change an emailed quote mistakenly attributed to Julia Cusick of the Center for American Progress to Steven Jessen-Howard from the same organization.", "Tonyevers.com \"Public Education in Wisconsin.\"", "Tony Evers Office of the Governor Veto Message  Page 16.", "Twitter, State Rep. David Crowley, Oct. 22, 2019.", "Email, State Rep. David Crowley’s staff, Nov. 5, 2019", "Email, United Way of Wisconsin, Nov. 14, 2019", "United Way ALICE Project 2018 report, Page 45.", "United Way ALICE Project \"Project Methodology,\" ,", "Economic Policy Institute, \"Child care is unaffordable for typical families in Wisconsin, July 2019", "Milwaukee Journal Sentinel, \"State Rep. David Crowley announces run for Milwaukee County executive,\" Nov. 4, 2019.", "U.S. Department of Health and Human Services Federal Register/ Vol. 81, No. 190 / Friday, September 30, 2016 / Rules and Regulations https://www.govinfo.gov/content/pkg/FR-2016-09-30/pdf/2016-22986.pdf", "Child Care Aware \"High Cost of Child Care\" 2017.", "MarketWatch \"The 5 states where child care is least affordable,\"  Jan 8, 2018", "Center for American Progress: \"CAP Report Analyzes Costs of Child Care for Infants and Toddlers, Need for Increased Public Support\" November 15, 2018", "Wisconsin Public Radio, \"Wisconsin Democrats Reintroduce Family Medical Leave Insurance Act,\" Oct 22, 2019.", "U.S. Department of Health and Human Services \"State Median Income Estimates for Optional Use in FY 2018 and Mandatory Use in FY 2019\"", "Institute for Child, Youth and Family PolicyHeller School for Social Policy and ManagementBrandeis University \"Child Care affordability for working parents,\" November 2018", "Economic Policy Institute,\"High quality child care is out of reach for working families,\" Oct. 6, 2015.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]