["About this rating", "On August 3, 2019, several Kentucky politicians and political candidates descended on Fancy Farm, Kentucky, for the annual St. Jerome Catholic Church Picnic. The event, first held in 1881, has traditionally been viewed as the start of the Kentucky political-campaign season. U.S. Senate Majority Leader Mitch McConnell, who is facing reelection in 2020, was among the speakers there. \"Team Mitch” T-shirts were a fixture of the event, as were cardboard cutouts of politicians from all sides of the political spectrum.", "Two days later, several social media accounts began sharing a photograph of male attendees wearing “Team Mitch” shirts posing with a cardboard cutout of U.S. Rep. Alexandria Ocasio-Cortez. At least two individuals in this picture appear to have been kissing and choking it.", "The first picture (below) shows what appears to be an individual kissing the cutout’s face while the others hold their thumbs down. The second photo, which is contained in most viral posts, appears to show an individual choking or wringing the congresswoman’s neck. Because Snopes believes some individuals pictured may be minors, we have blurred their faces and removed personally identifying information:", "These pictures are authentic. Snopes viewed and archived the original Instagram version of the first photo shown above prior to its deletion from the platform. This picture contained the same individuals as the second, more viral picture, which can be viewed in this tweet. Responding to criticism of the photo before it was deleted, the individual who published the top photo stated:", "We reached out to McConnell’s re-election campaign to ask if any individuals in the pictures worked on the campaign, and if the campaign condoned the behavior expressed in those photos. We did not immediately receive a response. The photos being shared on social media, however, are genuine.", "Bailey, Phillip M.   “McConnell Couldn't Escape 'Moscow Mitch' at Kentucky's Biggest Political Picnic.”\r\n    Louisville Courier Journal.   3 August 2019.", "Louisville Courier Journal.   “Fancy Farm 2019 Brings Barbecue, Fun and a Lot of Opinions.”\r\n    24 September 2018.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]