["On January 31, Times of India reported India’s first case of the new strain of coronavirus in Thrissur, Kerala. Since then, the disease has been covered extensively in the media. Recently, videos of a meat market have gone viral with the claim that it is from the Chinese city Wuhan, the epicentre of the coronavirus outbreak.", "‘Deepak maurya’, a Facebook page, posted a four-minute 40-second video on February 2 and wrote, “The Chinese market where coronavirus originated. This a market where even demons are scared to visit. Whuan market, China. The origin of the #Corona virus#…” (Translated from चाईना का वो मार्केट जहां से कोरोना वायरस की शुरुआत हुई। देखिए कि जहां राक्षस भी इनके खानपान मार्केट में घुसने पर घबरा जायें ..। Whuan market, China. The origin of the #Corona virus#…)” This video has been viewed over 41,000 times.", "On January 30, @JithuShajiVar4 tweeted a two-minute 22-second video of the meat market and enquired, “Whuan market. China, the origin of the #Corona virus… How unclean place? Then how the 2019 virus can be restricted?” This video has been viewed over 6,000 times.", "Whuan market. China, the origin of the #Corona virus… 👀 How unclean place? Then how the n2019 virus can be restricted? pic.twitter.com/iVlHSVEtoe", "— Jithu Shaji Varghese (@JithuShajiVar4) January 30, 2020", "Alt News also noticed that some social media users have shared a shorter 44-second version of the video as well. On February 3, Twitter user @PCVerma16 shared the 44-second video and said, “Whuan market. China, the origin of the #Corona virus… ”", "Similarly, several Facebook and Twitter users have shared a video with the claim that it shows Wuhan market.", "The video posted by @JithuShajiVar4 and Deepak Maurya begins with the phrase ‘Pasar Extream Langowan’ flashed on the screen. Using that as a clue, Alt News did a keyword search on YouTube and found the viral video. It was uploaded by Jerry Mewengkang in July 2019. The video’s run time is 4:41 minutes.", "Langowan market is one of the tourist hubs in Indonesia’s North Sulawesi province. According to a 2014 report by the Daily Mail, the market is known for ‘exotic’ food such as spit-roasted bats, battered snake, pickled rats and boar legs. Therefore the claim, that video is from Wuhan is false. Alt News also noticed that Wuhan is misspelt as Whuan in the viral posts.", "As for the shorter videos, they are clipped from the four-minute viral video. The video shared by @PCVerma16 has been clipped at 3:53 minutes. While the video share by @JithuShajiVar4 shows the opening 2:22 minutes of the video.", "In conclusion, the viral posts falsely claim that the meat market in the video is from Wuhan, China. However, the video shows Langowan market, Indonesia. This claim was also fact-checked by the Association for Financial Professionals (AFP) on January 24. You can visit the World Health Organisation‘s website for more information on coronavirus.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]