["“National Guard Turned Backs on Biden Motorcade,” reads the headline of an article on Infowars, the platform founded by conspiracy theorist Alex Jones.", "The article features an embedded video, which is no longer available, of National Guard soldiers lining a road. The video is shot from a moving vehicle, purportedly part of Biden’s motorcade during the January 20, 2021 inauguration. Dozens of soldiers can be seen looking away from the convoy.", "The article claims that “members of the US National Guard refused to acknowledge Joe Biden as his motorcade drove by following his inauguration.” Several other online outlets, Instagram and YouTube accounts reported on the video, drawing the conclusion that National Guard soldiers snubbed the incoming president.", "Some of the online articles featured the original video of the soldiers, but took it out of context.", "ABC journalist Ines de La Cuetara, who was assigned to cover Biden, posted the video on Twitter the morning of Inauguration Day, just before the ceremony began. “The view from Biden’s motorcade as it made its way up to the Capitol,” Cuetara wrote.", "The view from Biden’s motorcade as it made its way up to the Capitol pic.twitter.com/iYi79VaaRf", "The video was taken on the way to the inauguration ceremony. More precisely, it was shot on Washington, DC’s Constitution Avenue, between 1st Street NW and New Jersey Avenue, as shown by the Robert A Taft Memorial, which is visible behind the soldiers.", "Nahaku McFadden, a spokeswoman for the National Guard, said by phone that the soldiers in the video were not present on the Capitol grounds to honor Biden.", "“This was a perimeter, not a parade,” she said by phone. “These National Guardsmen were on duty with a mission to protect the president against potential threats. Some are facing out to ensure the safety of all,” she added in an emailed statement.", "More than 25,000 National Guard members from across the United States were deployed in the capital before and during the 2021 Inauguration, as part of an unprecedented security response after Trump supporters stormed the Capitol on January 6 following a rally denouncing the election results.", "In 2017, 8,000 Guard troops helped secure Trump’s inauguration.", "After Biden’s swearing-in, troops marched in a parade for the 46th president as he stood on the steps of the Capitol, turning their heads towards their new commander in chief as they passed. More troops faced and saluted Biden when he and his wife Jill arrived outside the White House later that day, as live feed of the day shows.", "AFP Fact Check debunked other misinformation surrounding the Inauguration, including false claims that Trump invoked the Insurrection Act, allowing the military to ensure law and order, after the storming of the Capitol.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]