["About this rating", "A five-year old video clip showing a brief tussle between an adult woman and a little girl over possession of a baseball tossed into the stands during a Houston Astros game recirculated online in July 2016, along with the claim that the ball-snatching woman had finally been identified as a child psychologist named Grennele Brashkowitz:", "A video from more than five years ago is making the rounds again showing a woman grab a baseball from a little girl at a game in Houston from 2011. What is difficult to verify are the supposed follow up stories about an alleged interview with the woman named Grennele Brashkowitz. Supposedly she did not apologize and then lost her job as a child psychologist.", "﻿", "This video depicted an incident that occurred at a 2011 game between the Houston Astros and the Arizona Diamondbacks at Minute Maid Park in Houston. Although the clip was featured by numerous news outlets at the time the event took place, no contemporaneous news reports identified the woman seen in the video as \"Grennele Brashkowitz\" or a \"child psychiatrist.\" Instead, most reports simply referred to her as \"awful\" or a jerk of unknown name and occupation:", "During a recent game between the Astros and Diamondbacks at Minute Maid Park, an unknown woman was caught on camera taking a ball from a sweet little girl.", "The video is only 20 seconds, but it shows a ball being tossed by a player to a little girl and some awful lady ripping it out of the little girl's hands. She then high-fives the person she was with, while the little girl runs away heartbroken.", "The absolute worst part of the video is near the end when the woman turns away from the cluster of children and to her friends to show off her new possession. Lady, baseballs are cheap, and the Astros are terrible. That ball is nearly worthless, and you look like a jerk.", "Shortly after the video went viral, the woman became the subject of an Internet witch hunt to identify and publicly shame her. Those efforts yielded no results, but on 9 September 2014 the web site The Damien Zone published an article stating they had identified her:", "To some people, she is:", "1 -\"That horrible baseball-stealing woman with the lipstick lesbian haircut,\"\n2 – \"That square butt-face old hag in ugly white pants and a big bully belt who snatched away a baseball from a child\"\n3 -\"She is the embodiment of evil and greed and selfishness. She has no soul and she should rot in hell.\"", "Those are only some of the angry accusations that have been hurled at a woman named Grennele Brashkowitz, who until today, had gone unidentified after she displayed one of the most outrageous examples of human greed in the history of Major League Baseball.", "Grennele Brashskowitz is a child psychologist in private practice with four other clinicians. So far all of the staff has walked out and the partners are in the process of buying her out of the business.", "This article was just another another bit of fake news, however. The biggest giveaway is that The Damien Zone linked to the Internet Movie Database (IMDb) page of David D. Mattia in places that should have linked to pictures of Brashkowitz and her alleged associate, Daneesh Pargrim. (Mattia is frequently listed as a contributor to The Damien Zone.) We also found no record of a child psychologist named \"Grennele Brashkowitz\" operating in New York, nor of her associate \"Daneesh Pargrim.\"", "Although The Damien Zone does not specifically identify itself as satirical in nature, the site's disclaimer makes it clear that the blog places more weight on \"humor\" than on accuracy:", "TheDamienZone.com sometimes disguises names in its stories to protect identities of morons and their personal information — except in cases when public figures are being satirized, or when a story about a misquote attributed to any persons, living or dead, is being abused for comical purposes of self-promotion. Any other use of real names in funny or obviously humorous articles is accidental and coincidental or simply because the writer is a nasty, foul-mouthed, intolerant GENIUS!", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]