["A video of ink thrown on a man is getting circulated on social media. It is being claimed that the man is ‘Haryana BJP MP Raj Kumar Saini’. The clip has been linked to the farm bills.", "किसान_बील_का_पहला_रुझान बीजेपी सांसद सैनी की हरियाणा में मुँह काला करके जूतों से ठुकाई 👇👇😁🤣 pic.twitter.com/FzaEhlZtWH", "— Jagmohan Kaushal 🏹 (@JagmohanKausha2) January 1, 2021", "The same video was widespread in September when the message further stated that news channels will never broadcast these visuals. In the video, a person suddenly walks from the crowd and smears ink on the face of another person who is wearing a headgear. Later in the video, a group can be seen beating the attacker.", "*हरियाणा के जाटों ने बीजेपी सांसद सैनी का मुंह काला करके जूते मारे* और ये न्यूज़ किसी चैनल पर ❌ नही दिखाई गई", "ये है असली आलू से सोना 🤣 pic.twitter.com/EtjMgsU2Q6", "— Bandit Queen (@speedytohike) September 26, 2020", "It is noteworthy that large-scale farmer protests are ongoing countrywide against the BJP, including in Haryana.", "The video was also viral on Facebook with the same claim.", "A Twitter user posted the video with the claim that members of the Jat community in Haryana smeared ink on BJP MP Saini’s face and thrashed him with shoes. The tweet has garnered over 2,000 retweets so far.", "Jats of Haryana blacken BJP MP Saini and hit by shoes & this news was not shown on any channel. 😭😭😭 pic.twitter.com/bwsKzHp2m9", "— ℠ (@SpiderMan_r) September 26, 2020", "A keyword search reveals that the incident took place in 2016. The video was tweeted by the handle ‘Haryana News Line’ on November 5, 2016.", "Exclusive: कुरुक्षेत्र से भाजपा सांसद राजकुमार सैनी के मुंह पर कालिख लगाने का विडियो आज सामने आया है. आप भी देखिए आखिर हुआ क्या था. pic.twitter.com/HCgz0FUdwo", "— Haryana Newsline (@HaryanaNewsline) November 5, 2016", "At the time, several media outlets like Punjab Kesari, InKhabar, and Amar Ujala had reported on this incident. InKhabar’s report was published on October 16, 2016. Punjab Kesari’s YouTube channel posted the same video on November 7, 2016.", "“The five men who threw ink on Kurukshetra’s BJP MP Raj Kumar Saini on Sunday, have been booked for attempt to murder. The FIR lodged against them includes Section 307 of the Indian Penal Code (IPC) which invites punishment of up to life imprisonment. Besides Section 307, Sandeep Kumar, Praveen Kumar, Harikesh, Saurav Dhanda and Jitender have also been charged with assault targeted to defame a person and act which could result in communal clashes in the case registered at Kurukshetra’s city police station,” stated a report published by The Times of India on October 18, 2016.", "Therefore, a 2016 video of an ink attack on then BJP MP Raj Kumar Saini is being shared as recent.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]