["About this rating", "The military satire web site The Duffel Blog published an article on 29 August 2017 which claimed that a Navy Destroyer had crashed into a building in downtown Houston after the city was flooded during Hurricane Harvey:", "As if the city of Houston hasn’t seen enough tragedy due to catastrophic flooding from Hurricane Harvey, things took a turn for the worse today after a U.S. Navy ship collided with a building in the downtown area.", "The ship was identified as an Arleigh Burke-class destroyer belonging to the Navy’s 7th Fleet.", "It was unclear why the destroyer was not able to see the building and take evasive action, or why it was over 20 miles inland and trying to navigate through a major metropolitan area.", "The story isn't real. The Duffel Blog carries a readily available disclaimer:", "We are in no way, shape, or form, a real news outlet. Everything on this website is satirical and the content of this site is a parody of a news organization. No composition should be regarded as truthful, and no reference of an individual, company, or military unit seeks to inflict malice or emotional harm.", "All characters, groups, and military units appearing in these works are fictitious. Any resemblance to real persons, living or dead, or actual military units and companies is purely coincidental.", "The featured photograph that accompanied the story is, unsurprisingly, fake. The real image was published in 2015 and showed flood waters (sans Navy ship) approaching downtown Houston. Here is the real image and the doctored one that Duffel Blog used side by side:", "The ship featured in the doctored image, the USS Mustin was not deployed in the Gulf of Mexico during Hurricane Harvey. The ship was stationed more than 6,000 miles away off the coast of Yokosuka, Japan in August 2017.", "Hanford Sentinel.   \"Carrier Strike Group 5 Returns to Yokosuka.\"\r\n    11 August 2017.", "Hooper, Don.   \"Renew Houston-Prop1, and the Politics of Flooding.\"\r\n    Big Jolly Politics.   11 June 2015.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]