["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As Antonin Scalia is memorialized for his conservative influence on the Supreme Court and legal theory, Stephen Colbert paid tribute to the late justice’s \"great sense of humor.\"", "\"People have actually broken down the transcripts for oral arguments,\" Colbert said on Feb. 15’s Late Show, \"and he told more jokes and got more laughs than any of the other justices.\"", "The comedian then shared a memory of Scalia being one of the few people to enjoy Colbert’s controversial address lampooning the George W. Bush administration at the 2006 White House Correspondents Association Dinner.", "Colbert's line got us wondering: Is there really data that shows Scalia made more jokes than any other justice? Or was Colbert, himself, just telling a joke?", "A spokesperson for CBS did not get back to us, but we found plenty of evidence backing Colbert’s point.", "King of laughs", "Researchers and Supreme Court watchers have been counting how many chuckles each justice has earned since 2004, when court reporters began identifying the nine members by name. Laughs are demarcated as (Laughter.) in oral argument transcripts.", "Really. This is a thing.", "Out of six Supreme Court terms dating back to 2004, Scalia has taken the crown for funniest justice every term. Overall, he was responsible for about 40 percent of the laughter (352 out of 919 laughs). Here’s a breakdown:", "Jay Wexler, a Boston University law professor and first person to count Supreme Court laughs in 2005, told PolitiFact that Scalia always came in first place for as long as he’s been tracking them.", "\"Justice Scalia was a brash questioner and would say things people didn’t necessarily expect, which helps account for his laughs,\" he said.", "Take, for example, the giggles he got in Jan. 19’s argument for Heffernan vs. City of Patterson, in which Jeffrey Heffernan sued for the city for demoting him based on the mistaken perception that he was taking part in a political campaign. Attorney Thomas Goldstein, representing the city, argued that the case was \"bizarre\" given that Heffernan was politically apathetic and therefore not exercising his constitutional right to free speech.", "\"It is bizarre,\" Scalia chimed in. \"Do you really believe, Mr. Goldstein, that the Constitution does not solve all problems?\"", "(Laughter.) ensued.", "Scalia is actually 64 percent funnier than the transcripts show, drawing more laughter than the bottom seven justices combined, according to a 2012 paper by litigation consultant and communications expert Ryan Malphurs.", "In a separate analysis, Malphurs noted the wide range of Scalia’s wisecracking. He made humorous hypotheticals, poked fun at himself and joked with advocates and the other justices.", "Witness Scalia riffing with Justice Anthony Kennedy in March 2007’s oral argument for Morse vs. Frederick, a case about whether the First Amendment protected students to express pro-drug use views:", "Justice Kennedy: \"So under your view, if the principal sees something wrong in the crowd across the street, had to come up and say now, how many of you here are truants — I can’t discipline you because you’re a truant, you can go ahead and throw the bottle (Laughter.)\"", "Mr. Mertz: \"No I don’t think she needs to do that in the heat of the moment. But later on once she’s discovered the true facts, then at that point I think she loses a basis for punishing him as a student if he was not there as a student.\"", "Justice Scalia: \"Because you’re both a truant and a disrupter, you get off. (Laughter.) Had you been just a disrupter, tough luck. (Laughter.)\"", "The joshing wasn’t always good-natured, Malphurs told PolitiFact in an interview. Scalia joked pleasantly with Justices Stephen Breyer and Clarence Thomas outside of court, but Breyer, one of the court’s more liberal members, often bore the brunt of merciless teasing from Scalia in court.", "\"Scalia's humor was dependent on the tone that he wanted to take and the position he wanted to take,\" Malphurs said. \"The humor was goodnatured if he agreed with the advocate. If he disagreed with the advocate, it tended to be sarcastic and belittling.\"", "A noted wit", "Scalia’s sarcasm shown especially in his opinions. Between 1986 and 2013, Scalia was quantifiably the most sardonic justice, penning more \"sarcastic\" or \"caustic\" opinions (75) than all the other justices combined. For context, Justice John Paul Stephens came in second with nine sarcastic opinions.", "In his controversial Obergefell vs. Hodges dissent, Scalia denounced gay marriage and skewered his colleagues, writing, \"The Supreme Court of the United States has descended from the disciplined legal reasoning of John Marshall and Joseph Story to the mystical aphorisms of the fortune cookie.\"", "And then there's his hyperbolic refrain in his King vs. Burwell dissent: \"Understatement, thy name is an opinion on the Affordable Care Act! … Impossible possibility, thy name is an opinion on the Affordable Care Act! … Contrivance, thy name is an opinion on the Affordable Care Act!\"", "Of course, some have found Scalia’s acerbic lines to be extremely offensive. But sometimes that was the the point, as shown by the Scalia-isms the justice \"unleashed\" on the court. Here are a few via intellectual property lawyer Yury Kapgan:", "• \"A fiction of Jack-and-the-Beanstalk proportions ...\";", "• \"'We’ll-look-at-all-the-circumstances-and-see-if-it-looks-dangerous’ approach ...\";", "• \"'It-is-so-because-we-say-so’ jurisprudence ...\";", "• \"The original-meaning-is-irrelevant, good-policy-is-constitutional-law school of jurisprudence ...\";", "• \"Thoreauvian ‘you-may-do-what-you-like-so-long-as-it-does-not-injure-someone-else’ beau ideal ...\"", "Whether Scalia joked to lighten the mood of oral arguments or used humor bitingly in legal prose, one thing is for sure.", "\"He liked to laugh and to make people laugh,\" said Geoffrey Stone, a University of Chicago law professor and friend of Scalia’s.", "Our ruling", "Colbert said, \"People have actually broken down the transcripts for oral arguments and (Scalia) told more jokes and got more laughs than any of the other justices.\"", "This wasn't a joke.", "Out of six Supreme Court terms spanning 2004 to 2016, Scalia produced about 40 percent of all the laughter transcribed in oral arguments. That’s more than any other justice overall and more than any other justice every term.", "We rate Colbert’s claim True.", "Youtube, \"Stephen’s Tribute to Antonin Scalia,\" Feb. 16, 2016", "Supreme Court, Argument transcripts, accessed Feb. 16, 2016", "The Green Bag, \"Laugh Track,\" 2005", "Communication Law Review, \"‘People Did Sometimes Stick Things in my Underwear’ The Function of Laughter at the U.S. Supreme Court,\" 2010", "Ryan A. Malphurs, et. al, \"Too much Frivolity, Not Enough Femininity A Study of Gender and Humor at the U.S. Supreme Court,\" Oct. 3, 2012", "Twitter, @SCOTUS Humor, April 30, 2014", "Twitter, @SCOTUS Humor, April 30, 2015", "Twitter, @SCOTUS Humor, Jan. 20, 2016", "Email interview with Jay Wexler, law professor at Boston University, Feb. 16, 2016", "Supreme Court, \"Heffernan v. City of Paterson oral argument transcript,\" Jan. 19, 2016", "Supreme Court, \"Morse v. Frederick oral argument transcript,\" March 19, 2007", "Interview with Ryan Malphurs, senior litigation consultant at Courtroom Sciences, Inc., Feb. 16, 2016", "Richard L. Hansen, \"Essay: The Most Sarcastic Justice,\" Feb. 8, 2015", "Supreme Court, \"Obergefell v. Hodges,\" June 26, 2015", "Supreme Court, \"King v. Burwell,\" June 26, 2015", "Slate, \"What Made Antonin Scalia a Great Writer,\" Feb. 13, 2016", "Email interview with Geoffrey Stone, law professor at the University of Chicago, Feb. 16, 2016", "Wall Street Journal, \"Justice Scalia’s Legacy of Laughs,\" Feb. 14, 2016", "New York Times, \"Scalia Lands at Top of Sarcasm Index of Justices. Shocking.,\" Jan. 19, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]