["About this rating", "In 2004, a virulent form of canine influenza surfaced at greyhound racing parks in Florida. In that outbreak, it infected 24 greyhounds and killed 8 more. The contagion has since been confirmed in seven states, having killed greyhounds at tracks in Florida, Massachusetts, Arizona, West Virginia, Wisconsin, Texas and Iowa. It is highly contagious, spreading through shared items (like toys) or human contact (kennel workers have carried the virus home with them), in addition to dog-to-dog encounters.", "The virus that has been felling greyhounds is an H3N8 flu closely related to an equine flu strain. It is not related to typical human flus or to the H5N1 avian flu that killed about 100 people in Asia.", "Several states -- including Florida, Minnesota, and Louisiana, among others -- reported another rash of cases in late June 2017. According to the American Veterinary Medical Association (AVMA), the outbreaks in those states were caused by a strain known as canine H3N2 influenza, which was first reported in Chicago in 2015.", "An AVMA spokesperson, Sharon Granskog, told us in a phone interview that such outbreaks can be seasonal in nature:", "There's a time of year when more dogs are in contact with one another, they're at dog parks, it's highly contagious. We suggest that you make sure if your dog is going to a dog park that it's healthy and talk to a veterinarian about whether or not a vaccine would be right for your dog.", "The disease was first reported in the U.S. in 2004 after several racing greyhounds in Florida contracted it. The AVMA said that they believed that the dogs became infected by a strain of H3N8 influenza, which is particular to horses.", "Dr. Ruben Donis, chief of molecular genetics for the influenza branch of the Centers for Disease Control and Prevention, confirmed that the flu jumped from horses to dogs, \"a very rare event of considerable scientific interest\" and added \"at this point, there is no reason to panic.\" How that jump occurred is either not known at this point or is not being commented on, so the email's assertion that the eating of raw meat was to blame should be regarded as speculation rather than as fact. While there is always the possibility the virus might again jump species, this time to humans, this strain of flu has been present in horses for more than 40 years without any documented cases of humans catching it or the related canine flu. But there are vaccines available for both the equine and canine flus.", "Many readers have been confused (and unnecessarily frightened) by the difference between the terms \"morbidity rate\" and \"mortality rate.\" The morbidity rate describes the percentage of animals that will contract the disease after being exposed to the virus, but, despite its name, the term has nothing to do with the death rate associated with the flu. (Nearly 80 percent of dogs exposed to the canine flu virus will contract only a mild form of the disease which mimics kennel cough, a type of canine bronchitis that is rarely serious.) The mortality rate, which describes the percentage of animals that will die after contracting the disease, is in the much lower range of 5 to 8 percent, according to Dr. Cynda Crawford, the veterinary immunologist who first isolated the canine flu virus:", "The mortality rate is around 5 to 8 percent, says veterinarian Cynda Crawford at the University of Florida's College of Veterinary Medicine in Gainesville.", "\"I want to stress that despite the rumors that are out on the Internet and other such sources, this disease is not as deadly as people want to make it,\" Crawford said. She says she receives more than 30 calls a day from concerned veterinarians.", "Dr. Crawford describes the contagion as producing in dogs \"a moist, productive cough that ends in a gagging response, that will persist for one to four weeks, despite treatment with antibiotics or cough suppressants. Some dogs develop a thick, yellow discharge from the nose. A very few dogs will spike a high fever, between 105 to 107 degrees Fahrenheit. They become lethargic and weak, with rapid, shallow breathing. This is likely to progress to pneumonia.\" Other veterinary experts have estimated the potential death rate as between 1 and 10 percent, with the higher percentage applying to very young, very old, or infirm dogs.", "Presence of the virus in dogs can be confirmed only through blood tests performed at the Cornell University College of Veterinary Medicine. Results of such blood screens take as long as two weeks.", "Dr. Crawford recommends keeping dogs showing symptoms of respiratory disease at home and away from other dogs for up to two weeks. The CDC, which is tracking the disease, issued no official recommendations.", "Because the symptoms of this as yet unnamed virus somewhat mimic bordetella, a less virulent illness commonly known as kennel cough, it is hard to ascertain how widespread the flu has become. On the flipside of that confusion, vets in various parts of the country have been thrown into a panic when encountering run-of-the-mill kennel cough in any of their clients, fearing they are instead confronting cases of the new flu.", "The Animal Health Diagnostic Center at Cornell University inserted a caution against such hair-trigger diagnosis within a larger advisory about the potential for the flu to have spread to the state of New York: \"One should not lose sight of the fact that all respiratory infections in dogs are not due to canine influenza virus. Adhering to the 'band wagon' approach could result in the failure to appropriately treat dogs with infections previously known to cause respiratory problems in dogs.\"", "We found this good advice for vets and dog owners in our inbox one day:", "PLEASE DO NOT PANIC, and do NOT assume that every cough is Canine Influenza. Kennel Cough from parainfluenza and Bordetella is more common. However, the Animal Health Diagnostic Center at Cornell is interested in receiving samples from dogs that appear to have kennel cough.", "Clinical Signs: Since this is a new pathogen in dogs, there is currently no natural immunity present in the unexposed canine population. Almost all exposed dogs will become infected, and nearly 80% have clinical signs. In the mild form the dogs will have a cough that persists for 10 to 21 days. The cough may be soft and moist or dry. Many dogs will have a nasal discharge from a secondary bacterial infection and low grade fever. The nasal discharge responds to broad spectrum antibiotics.", "In the severe form with pneumonia there is a high fever (104-106 F) and respiratory difficulties. X-rays may show consolidation. These dogs often have secondary bacterial infections and have responded to broad-spectrum antibiotics and supportive care including intravenous hydration.", "The incubation period is two to five days and dogs may shed virus for seven to 10 days. The disease can spread rapidly throughout a boarding kennel. Dogs that are coughing SHOULD NOT BE BROUGHT TO SHOWS or Performance EVENTS.", "In a 1 June 2017 advisory to its members, the AVMA suggested that vaccines against the H3N2 virus strain \"might be another prevention option\" for dogs who were at least 8 weeks old and also recommended isolating dogs who could be infected, as well as not sharing toys between dogs and disinfecting shelter, veterinary, and boarding facilities.", "Gordon, Jane. \"Dogs Cough, and Owners Worry.\" The New York Times. 25 September 2005.", "McNeil, Donald. \"Scientist Recommends Isolation for Animals Showing Signs of Canine Flu.\" The New York Times. 27 September 2005.", "Mott, Maryann. \"New Dog Flu Spreads in U.S., But Death Rate Is Low.\" National Geographic News. 27 September 2005.", "Noyes, Jesse. \"Killer Flu Tracks U.S. Greyhounds.\" The Boston Herald. 23 September 2005.", "Rubenstein, Carin. “Virulent Dog Virus Hits Area Kennels.” The New York Times. 25 September 2005.", "Van Voorhis, Scott. \"Deadly Dog Flu Could Kill Family Pets.\" The Boston Herald. 13 May 2005.", "American Veterinary Medical Association. \"Canine Influenza.\"", "American Veterinary Medical Association. \"Veterinarians Can Expect Calls After Recent Reports of Canine Influenza.\" 1 June 2017.", "Beno, Leah. \"23 Reported Dog Flu Cases in Minnesota, Vets Recommending Vaccine.\" KMSP-TV. 29 June 2017.", "Davis, Kelsey. \"New Strain of Dog Flu Prompts Concern for Pet Owners Across Louisiana.\" WDSU-TV. 29 June 2017.", "Santich, Kate. \"As Dog Flu Outbreak Widens, Experts Call for Flu Shots.\" Orlando Sentinel. 30 June 2017.", "Updated with information from the American Veterinary Medical Association.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]