["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The growing income inequality in the United States -- the gap between rich and poor -- was one of the issues raised Feb. 5 when the House Committee on Labor listened to testimony on a proposal to raise the minimum to $10.10 per hour for most workers.", "George Nee, president of the Rhode Island AFL-CIO, advocated for the increase, telling lawmakers, \"We have some real serious issues in this country with income equality, and Rhode Island, unfortunately, is one of the worst states in terms of the gap.\"", "Raising the minimum wage to $10.10 in January, which would be the fourth increase in as many years, \"is another way of helping to close that,\" he said.", "We've seen a lot of rankings for Rhode Island, but we apparently missed this one. So we asked Nee for his source. Meanwhile, we went looking ourselves.", "But first, let's acknowledge that there's no specific definition of how bad Rhode Island would have to be to make it \"one of the \"worst.\" Some might say being among the top five worst states would qualify. But we’ll draw the line at being in the top 10.", "We found a 2012 report from the Center on Budget and Policy Priorities, a liberal think tank based in Washington, D.C. It gauged the income gap in each state and found that the richest 20 percent of Rhode Island households had incomes that were 7.5 times higher than the poorest 20 percent. But that put Rhode Island in the middle of the income inequality pack, not at the top.", "So by that assessment, Nee was wrong.", "Two days later, Nee responded by sending us other analyses.", "One cited the Gini coefficient, which measures the concentration of wealth using a number ranging from 0 (where everyone has the same amount of wealth) to 1 (where all of the wealth is held by one person). It's based on U.S. Census data.", "According to the Wikipedia page cited by Nee, Rhode Island ranked 12th worst in income inequality in 2010. New York, Connecticut, Massachusetts, Louisiana, Florida, Alabama, California, Texas, Tennessee, Mississippi and Georgia had more income inequality than we did. That still missed the top 10.", "We found 2013 state data from the Census Bureau put us even further away from the worst. According to those numbers, Rhode Island has dropped to 13th. If you take the three-year and five-year averages, we're 17th out of 50.", "Nee also directed us to a Jan. 26, 2015 report and data compiled by the Economic Policy Institute, another Washington, D.C.-based liberal economic think tank. It compared each state's highest earners -- the top 1 percent -- with everyone else.", "The Institute reports in Table 2 that in 2012, the average income of Rhode Island's top 1% was $966,071.  That’s less than the $1.3 million U.S. average.", "The average income for the rest of Rhode Island was $44,563, a tad higher than the national average of $43,713.", "By that measure, Rhode Island had the 29th biggest gap between the top 1 percent and the rest of the state. Once again, if you think income inequality is bad, we're not even close to being the worst.", "(That report, by the way, concludes that your income needs to be at least $314,647 in Rhode Island to be in the top 1 percent.)", "Nee also cited a real estate blog that claims Rhode Island is 10th highest in terms of income inequality. That could make us one of the worst, but the blog item doesn't cite the sources of its data and uses a questionable statistical method -- creating four rankings and then averaging them to come up with a fifth ranking -- to reach that conclusion. Thus, we don't regard it as good evidence.", "Finally, Nee referred us to the \"Executive Pay Watch\" portion of the AFL.CIO's website. There, Rhode Island ranks 3rd when you compare CEO income to the minimum wage (before the minimum wage rose to $9 in January) and 2nd if you compare what those CEOs make compared to average workers' pay, the union says.", "Rhode Island certainly seems to deserve being called \"one of the worst\" by that measure.", "The problem: Rhode Island's ranking is based on the compensation for only 10 people -- the CEOs of 10 publicly-traded companies listed on the Russell 3000 index whose headquarters are based in Rhode Island.", "The growing gap between the pay of CEOs and the average worker may be indicative of income inequality, but this sample size is much too small to draw any useful comparisons between states. The rankings of Wyoming and New Mexico, to give an even better example, are based on the incomes of only one -- that's right, just one -- CEO.", "And when roughly 2,300 Rhode Island households report adjusted gross incomes of more than a half million each year -- or at least, that was the number for 2008 -- it's not clear that the pay of just 10 CEOs accurately represents all of Rhode Island's wealthy.", "Nee responded that he believes the data support his assertion. \"It is clear that, even with the increase in the minimum wage from $8 to $9 per hour,\" he wrote in an email, \"Rhode Island's lowest paid employees are falling further and further behind when compared to a sampling of Rhode Island's wealthiest. Rhode Island's minimum wage workers fare amongst the worst in the country in this regard.\"", "Our ruling", "Rhode Island AFL-CIO President George Nee said Rhode Island is one of the worst states for the gap between rich and poor.", "His organization's comparison of CEO pay in the country's top public companies with what the average worker makes shows that Rhode Island is close to being THE worst, but that conclusion is based on the pay of only 10 CEOs.", "The Census Bureau's Gini index and the analysis by the Center on Budget and Policy Priorities offers a better assessment of the gap. Yet in neither case does Rhode Island rank as a top 10 state.", "Because Nee's statement contains some element of truth but ignores critical facts that would give a different impression, we rate it Mostly False.", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "RILIN.state.RI.US, \"2-5-15 House Committee on Labor Part 2 of 2,\" Rhode Island General Assembly website, Capitol Television Video on Demand, Feb. 5, 2015, accessed Feb. 10, 2015", "CBPP.org, \"Pulling Apart: A State-by-State Analysis of Income Trends,\" Nov. 15, 2012, accessed Feb. 20, 2015", "Email, George Nee, president, Rhode Island AFL-CIO, Feb. 12 and 17, 2015", "Wikipedia.org, \"List of U.S. states by Gini coefficient,\" and \"Gini coefficient,\" undated, accessed Feb. 12, 2015", "Factfinder.Census.gov, \"Gini Index of Income Inequality,\" category B19083, 1-, 3- and 5-year estimates for 2013, U.S. Census Bureau, American Fact Finder section, accessed Feb. 12, 2015", "EPI.org, \"The Increasingly Unequal States of America: Income Inequality by State, 1917 to 2012,\"     Table 2, Economic Analysis and Research Network, Jan. 26, 2015, accessed Feb. 12, 2015", "Movoto.com, \"This Eye-Opening Map Shows Which States Have The Highest Income Inequality,\" Sept. 15, 2014, accessed Feb. 12, 2015.", "AFLCIO.org, \"CEO Pay by State,\" undated, accessed Feb. 12, 2015", "DOR.RI.gov, \"Understanding the Personal Income Tax Reform Simulation Runs,\" first table, Rhode Island Department of Revenue, Jan. 18, 2011, accessed Feb. 12, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]