["By Angelo Fichera", "Posted on March 22, 2019 | Updated on March 25, 2019", "A popular meme attributes an ageist and inflammatory remark to a supposed Democrat from New York, but there is no trace of any elected officials by the name Jenna Tull.", "We’ve debunked a number of viral memes that have attempted to tie erroneous quotes to well-known political figures.", "But the latest example to gain traction on Facebook takes aim at a woman who doesn’t appear to exist.", "The meme claims that a “recording has been found of Democrat, Jenna Tull, of New York” that contains an inflammatory quote: “Americans should be euthanized when they hit 70. They just become too dumb…and think of the money we’d save!”", "Including a photo of a smiling, blonde-haired woman, the meme implores people to share “so people know and we can get rid of her!”", "The meme implies the individual is an elected official or at least a Democrat of some degree of prominence, and such a quote would no doubt be perilous to one’s career. But there is no Jenna Tull from New York in Congress or in the state Legislature, and we could find no trace of local Democratic elected officials by that name, either. (The name may be a play on words.)", "Instead, reverse image searches show that the image used in the meme is of a businesswoman whose Ireland-based company, THEYA Healthcare, makes bras for breast cancer patients and other health care garments.", "Christopher Blair, the founder of a self-described satirical publication known as America’s Last Line of Defense, confirmed in an email to FactCheck.org that his publication produced the meme. It’s far from the first time his work was erroneously spread as if real.", "The publication recently changed how it distributes its content. A March 10 post on the publication’s Facebook page indicated that “everything that comes from this page will be branded and 100 percent transparent.” Old content — including the Tull meme — was removed, and the page began applying a “satire” mark on its new content.", "“The fact that it’s still circulating illustrates why. No matter how ridiculous we think something is, there’s a potato out there willing to believe it,” Blair said. “The meme was, obviously, meant to be a fairly puerile joke.”", "The meme confused and deceived some. A number of readers asked us about the meme’s veracity, and several users who came across it contacted an actual woman named Jenna Tull from Indianapolis on Facebook.", "Tull, a 34-year-old self-described socialist who makes podcasts, told FactCheck.org that her Facebook posts are public in part because she wants to publicly show her support for Vermont Sen. Bernie Sanders’ 2020 presidential campaign. But she was confused when several individuals she didn’t know began commenting on her posts and sending her messages referencing the supposed quote from the meme.", "“People started saying that I said this…totally ridiculous thing,” she said.", "“Are you the same Jenna Tull that said that all people should be euthanized when they turn 70 because they start getting too dumb? And who decides what is dumb, a mind numbingly stupid person like you?” one user commented. “This is the socialist/communist mindset to remove anyone including babies that they consider an inconvenience. Of course those in charge never take the time to examine how useless they are.”", "Tull said she and a friend tracked down the meme and eventually traced the image back to THEYA; she was relieved to learn that the meme invoking her name did not also use her image.", "Still, the episode left Tull “disheartened for our country and society,” she said.", "“I just don’t understand. We have unlimited resources and people still can’t Google something,” Tull added. Instead, “people are continuing to misuse the Internet to spread hate and to troll.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Update, March 25: We added a response from Blair confirming that the meme originated with America’s Last Line of Defense.", "Blair, Christopher. Founder, America’s Last Line of Defense. Email to FactCheck.org. 23 Mar 2019.", "“Our Story.” THEYA Healthcare. Accessed 21 Mar 2019.", "Tull, Jenna. Phone interview with FactCheck.org. 21 Mar 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]