["“Oh that ‘Crazy Nancy’” reads text accompanying a photo of Pelosi shared on Facebook on October 8, 2020. “I’m very sure she doesn’t want this drunken photo out there of her.”", "The photo itself shows Obama leaning in from behind Pelosi before kissing her on the cheek. The congresswoman’s unwieldy hair and reddish face, combined with the night’s darkness and other people nearby, makes the closeup of the two politicians’ faces look like it could have been taken during a party.", "However, the photo used in posts was cropped and stripped of its original context.", "A Google reverse image search leads to an article from The Daily Caller featuring the same cropped version of the photo, credited to photographer Kevin Lamarque of Reuters.", "Searching for “Barack Obama Nancy Pelosi Kevin Lamarque Reuters” on Google reveals the original photo on the news agency’s website.", "Its original caption reads “U.S. President Barack Obama kisses House Democratic leader Nancy Pelosi upon their return from Israel to Joint Base Andrews in Washington,” and is dated September 30, 2016.", "Obama, Pelosi, and an entire US delegation were returning from an official visit to Israel, where they had attended the state funeral of former president Shimon Peres.", "“There is nothing to it,” the photographer Lamarque told AFP in an email, confirming the trip but dismissing the claim that Pelosi was out of control.", "“He is not kissing a drunk Nancy Pelosi at a party,” he said. “The wind was probably howling, like always on the airstrip, and one would usually look a bit disheveled after such a long journey!”", "The original uncropped photo shows someone holding the handle of a travel suitcase in front of Obama and Pelosi, while the Speaker holds what appears to be a garment bag. A man who appears to be then-secretary of state John Kerry was also pictured, looking on from behind.", "Drew Hammill, Pelosi's deputy chief of staff, said that the she “doesn’t drink” alcohol in general. “This is false,” he said of the recent claims that she was drunk.", "His statement echoes another from Pelosi’s daughter Christine, who spoke up on Twitter in May 2019 after a doctored video making her mother appear drunk circulated on social media. Pelosi appeared to be slurring her words, but the video had in fact been slowed down to create such an effect, AFP Fact Check reported at the time.", "Republicans and their conservative allies have been pumping this despicable fake meme for years! Now they are caught. #FactCheck: Madam Speaker doesn’t even drink alcohol!\nhttps://t.co/rJ5jxiuvqM", "Just days later, another Facebook post made a similar claim using a different photo.", "“Looks like Crazy Nancy had a liquid lunch,” reads the caption on a Facebook post shared more than 53,000 times since October 10, 2020.", "The accompanying photo shows Pelosi being guided in the street by another woman. A man in a suit follows closely behind.", "A Google reverse image search and traced the picture to a blog post from September 16, 2016 on the website of Connecticut journalist Dennis House.", "The post, titled “Nancy shops in Hartford” features various photos of Pelosi “shopping at one of Connecticut’s oldest stores,” Stackpole, Moore and Tryon.", "“Pelosi was greeted by store owner Jody Morneault and later escorted to a waiting SUV by Morneault and a government security detail,” it reads.", "Store owner Jody Morneault said she was helping Pelosi because “the street was in bad repair and I didn’t want her to fall.”", "“Our city of Hartford had neglected the street in front of our store. I fell, my husband fell and my employees fell. She dresses with really high heels, so the last thing I needed her to do was fall,” she said on the phone.", "Morneault rejected the allegation that Pelosi was drunk in the photo.", "“She does not drink alcohol,” she said.", "Pelosi is a regular visitor to Stackpole, Moore and Tryon. The store has posted photos of her previous visits on its Facebook page, including in 2015, 2018 and 2019.", "Another Facebook post shares a video of Pelosi appearing to stumble her way through an interview with slurred speech.", "“Nancy Pelosi appears DRUNK on Fox News Sunday,” reads the caption on the post, shared more than 4,500 times since August 10, 2020.", "However, the original interview from August 9, 2020 confirms that the clip shared on Facebook has been digitally altered to give the impression the House Speaker was talking slowly.", "Pelosi has been the target of similar attacks in recent years. In 2010, the Republican Minnesota representative Michele Bachmann falsely accused Pelosi of “sticking the taxpayer with her $100,000 bar tab for alcohol on the military jets that she’s flying.”", "Other debunked instances of people attempting to portray Pelosi as inebriated include a 2017 claim that the politician was injured while driving drunk, a 2020 claim that she was removed from the House after cursing at Republicans while drunk, and more, Poynter reported.", "Unfortunately, false claims persist.", "Claire Wardle, the US director of First Draft, an organization that monitors disinformation, told Poynter that the danger of further claims is that repetition can trick the human brain into thinking such information is legitimate, even when each individual allegation is false.", "“If you’ve read something before you’re more likely to consider it as true,” she said.", "This latest round of false posts attempt to give credence to the nickname “Crazy Nancy,” which President Donald Trump and his supporters have used to disparage the California lawmaker, in the same way that he calls presidential candidate Joe Biden “Sleepy Joe.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]