["“Sonia Gandhi hates Hindus! This truth is revealed by none other than Former President Pranab Mukherjee” This was tweeted by BJP MP Subramaniam Swamy in February 2018; the title of an article published by Postcard News.", "Sonia Gandhi hates Hindus! This truth is revealed by none other than Former President Pranab Mukherjee https://t.co/YBF7tMjy4h via @postcard_news", "— Subramanian Swamy (@Swamy39) February 4, 2018", "Postcard News‘s article was based on an excerpt from former President Pranab Mukherjee’s memoir The Coalition Years. According to Postcard News, this excerpt from the book illustrated how Sonia Gandhi was inherently anti-Hindu.", "The following is an excerpt from the article by Postcard News according to which Sonia Gandhi had betrayed her ‘anti-Hindu’ tendencies over the issue of the arrest of Shankaracharya.", "Mukherjee has disclosed how under the leadership of Sonia Gandhi, Hindus have been implicated in the target. Within a few months of coming to power in November 2004, Shankaracharya Jayendra Saraswati was arrested in a false case of murder on the occasion of Diwali. At the time of his arrest, he was preparing for 2500 years of pilgrimage to Trikal. After the arrest, he was also shown abusive charges like porn CD and tampering. However, this allegation has never been proved.", "Pranab Mukherjee has mentioned this incident in his book ‘The Coalition Years 1996-2012’. He wrote that “I was very angry with this arrest and in the Cabinet meeting I raised this issue too. I asked the question, Is the scale of secularism in the country limited to Hindu saints only? Can a state police show the courage to arrest a Muslim cleric on the occasion of Eid? “", "The same has been shared in the form of a newspaper clipping.", "Apart from Postcard News, this was reported by a website named Channel Hindustan.", "The attempt to portray Sonia Gandhi as anti-Hindu, who took anti-Hindu decisions when she was at the helm of affairs in UPA I and II, is based on an excerpt of The Coalition Years, found on Page 209 of the book. Mukherjee’s memoir with regard to the arrest of Jayendra Saraswati, erstwhile Shankaracharya of Kanchi in a murder case, finds reference on this page. It may be noted that Saraswati had been arrested by the state government in Tamil Nadu which was ruled by the Jayalalithaa led AIADMK. The union government had no role in the arrest.", "Mukherjee recalls how he was in thorough disagreement over the arrest of the Shankaracharya at a time when Diwali festivities are on, and was “extremely critical of the timing of the arrest and questioned if the basic tenets of secularism of the Indian state were confined to only Hindu monks and seers? Would the state machinery dare to arrest a Muslim cleric during Eid festivities?”", "The above passage was used by Postcard News to claim that Sonia Gandhi hates Hindus, whereas the fact of the matter is that Mukherjee himself has not made any such claim in The Coalition Years.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]