["The 30-second video was published in this Facebook post on August 27, 2019. It has been viewed more than 131,000 times and shared more than 11,000 times.", "It shows police officers climbing a gate before storming a house.", "The post's Hindi-language caption translates to English as: “The puppet media is busy in showing that Kashmiris are at peace.”", "Below is a screenshot of the misleading Facebook post:", "The misleading Facebook post was published in the same month that India revoked Indian-administered Kashmir's special autonomy, as AFP reported here.", "The claim in the Facebook post is false; the footage has circulated in media reports since at least 2013 about a police raid at a house in the Pakistani city of Faisalabad.", "A reverse image search of keyframes extracted from the video show corresponding reports about the clip have circulated online since at least June 2013.", "Below is a screenshot from the video in the misleading post (L) and an image published in this report by Pakistani news channel Dunya TV on June 12, 2013 (R):", "The report's headline states: \"Faisalabad: Cops suspended for torturing women.\"", "The report states in part: \"At least five personnel of Elite Force have been suspended on the charge that they forced into the houses of citizens and tortured the women.", "\"According to police spokesman, the suspended policemen include Babar Masih, Tauseef Ahmed, Abid Hussain. The SSP Admin will look into the matter.", "\"On Tuesday, during a protest against electricity loadsheding in Faisalabad, police entered the houses of protesters and manhandled their women.\"", "Below is another screenshot from the video in the misleading post (L) and an image published in this report by Pakistani news channel Samaa TV (R):", "AFP has circled in red a man wearing a headscarf who appears in both images above.", "The report's headline states; \"Five police who tortured women in Faisalabad, suspended.\"", "Below is another screenshot from the video in the misleading Facebook post (L) and an image accompanying this report published by Pakistan-based newspaper The Nation (R):", "AFP has circled in red a man wearing a headscarf who appears in both images above.", "The report states: \"Higher police authorities took serious action and suspended five policemen who entered the houses and tortured women in Faisalabad after protests against loadshedding.\"", "A longer version of the video was previously spread alongside false claims. The video was published on YouTube here and here alongside a caption which claims it shows a Pakistani police raid on the house of a minority member who hoisted the saffron Hindu flag outside his home. That claim was debunked in this Hindi-language BBC article in January 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]