["Senate Minority Leader Charles Schumer, D-N.Y., flanked by congressional Democrats, speaks in Berryville, Va., on July 24, 2017, to unveil a new agenda. (AP/Cliff Owen)", "While the Democratic Party held the White House for two terms during Barack Obama’s presidency, much of the country was turning a deeper shade of red.", "Republicans made dramatic down-ballot gains over the past decade, a trend that may have been overlooked somewhat given Democratic control of the executive branch for most of this time. But as the party vies to recapture the House and Senate from the GOP in upcoming midterm elections, the roots of Democrats’ recent losses are being reexamined.", "\"Unless Democrats face up to this reality and devise a strategy to reverse this tidal wave of defeat, they might find themselves surprised one more time this November,\" said CNN’s Fareed Zakaria. \"When you tally up their representation in Congress, state legislatures and governorships, the Democrats almost have their lowest representation in about 100 years.\"", "This stat, from the June 10 broadcast of his CNN show, was depicted in a graphic showing each of the two major parties’ power shifts since 1920 in Congress, governorships and state legislatures.", "(Source: CNN)", "The chart shows an ebb and flow of the parties’ power over roughly the past 100 years. The high-water mark of Democratic representation came during the New Deal era. But overall, the century is bookended with Democrats in positions of relative weakness.", "Zakaria is right: The Democratic Party is at nearly its weakest point in a century.", "Zakaria’s broader point was that center-left politics are in decline not only in the United States, but across the Western world.", "He cited a book by Barnard College Sheri Berman, \"Why the Left Loses,\" which posits several explanatory factors: center-left parties field weak leaders; they shoulder the blame (fairly or not) when the post-World War II liberal order fails, as in the 2008 global financial crisis; and they’ve embraced a politics of identity that alienates large swaths of the electorate.", "A central premise to Zakaria’s argument was the statistic about Democrats’ near-historically low influence in Congress and at the state level. A CNN spokeswoman said Zakaria had been relying on a Real Clear Politics analysis of more than a century of data, as well as a piece in 538.com.", "We contacted the RCP researchers Sean Trende and David Byler (who is now with the Weekly Standard), who shared their dataset with us. Zakaria deviated slightly from their methodology (he omitted partisan data on presidents), but the down-ballot numbers seem to back up his point about Democrats’ waning power.", "\"Zakaria’s chart doesn’t include presidential performance, which is included in our original metric,\" Trende said. \"That wouldn’t, however, alter the basic conclusion, and his findings are a fair representation of our research.\"", "To establish their partisan power index, Trende and Byler devised a points system for Democrats’ and Republicans’ performance in five electoral categories: president, House, Senate, state legislatures and gubernatorial performance. They added the five metrics together for each party, at two-year intervals. The party with the higher number had more power relative to the other.", "Byler noted a couple caveats. For starters, the dataset ends at the 2016 election. Furthermore, the researchers made certain judgment calls that resulted in the index not tracking exactly with election results. For example, Janet Napolitano won the 2006 Arizona gubernatorial election, but left relatively soon after the 2008 election to join the Obama administration. That meant Jan Brewer, a Republican, was in office for much of 2009-11.", "Under the RCP index, we found three historical instances where Democrats held a weaker position, relative to Republicans, than they did following the 2016 election: in 1920, 1926 and 1928.", "Given Zakaria’s hedging — he said Democrats almost have their lowest representation in about 100 years — we think his claim passes muster.", "The RCP data shows the Democrats’ Senate representation was weakest in 1920 during the Republican presidency of Warren G. Harding. At that point, the GOP held a 59-37 seat advantage — with Democrats holding 10 fewer seats than they do today.", "(Technically, Democrats currently hold 47 seats, though two Independent senators — Bernie Sanders of Vermont and Angus King of Maine — caucus with the Democrats, giving Republicans a razor-thin 51-seat majority.)", "To get another view of the historical data, we turned to the Brookings Institution’s Vital Statistics on Congress, which tracks election results (again, the RCP data is not precisely pegged to election results).", "According to Brookings, there were nine other instances where Democrats held fewer Senate seats than they do today: 1921 (37), 1923 (43), 1925 (40), 1929 (39), 1947 (45), 1997 and 1999 (45 each), 2005 (44) and 2015 (44).", "As in the Senate, the 1920s were a rough decade for House Democrats. The party’s weakest showing in the House was in 1920, when Democrats held 131 seats to Republicans’ 303, according to RCP data.", "Brookings data shows six other instances when Democrats held fewer than the 193 seats they boast today.", "At the state legislative level, Democrats have ceded enormous power to Republicans over the past decade. In 2008, Democrats controlled twice as many legislatures as the GOP (24-14). But Democrats’ fortunes began to reverse with their 2010 midterm \"shellacking\" (to borrow Obama’s phrase).", "John Mahoney, a policy specialist at the National Conference of State Legislatures, said it was accurate to say Democrats are at near-historical lows in this arena.", "\"There are currently 3,125 Ds serving in state legislatures, which is the lowest since 1928 when there were 3,057 Ds serving,\" Mahoney said. \"The lowest ever (since 1900) Democratic representation in the states was in 1920 when only 2,545 Ds were serving in state legislatures.\"", "A look at Democrats’ standing in governships over the past decade shows a similarly declining trend, placing the party in one of its weakest positions over the past century. Democrats now hold 16 governors mansions, compared to 33 controlled by Republicans. (Gov. Bill Walker of Alaska is an Independent.)", "According to RCP data, the only time Democrats had a weaker standing in the past 100 years was in 1920, when they controlled a mere 14 governorships.", "As we have noted in the past, the Democratic decline under Obama that produced the current low point was unusually big, but it was hardly unprecedented.", "Since World War II, no two-term president (or presidential tag team) has ever gained Senate seats, House seats, governorships, or state legislative chambers over an eight-year period. Rather, every single presidency has suffered substantial losses in each of those categories over the past seven decades. There has literally been no upside in down-ballot races for presidents as far back as Franklin D. Roosevelt.", "Zakaria said, \"When you tally up their representation in Congress, state legislatures and governorships, the Democrats almost have their lowest representation in about 100 years.\"", "Democrats wield less power than Republicans in each of these offices. In the 1920s, they had an even weaker standing relative to the GOP than they do today. But Zakaria hedged his bets by saying Democrats almost have their lowest representation in about 100 years — and the numbers appear to back him up.", "We rate this True.", "CNN’s Fareed Zakaria GPS, June 10, 2018", "Real Clear Politics, \"Republican Party the Strongest It's Been in 80 Years,\" Nov. 17, 2016", "538.com, \"Barack Obama Won The White House, But Democrats Lost The Country,\" Jan. 19, 2017", "Brookings Institution, Vital Statistics on Congress", "Washington Post, \"Obama reflects on 'shellacking' in midterm elections,\" Nov. 3, 2010", "PolitiFact, \"Explaining the Virginia election results: The White House curse,\" Nov. 8, 2017", "Email interview with John Mahoney, a policy specialist at the National Conference of State Legislatures, June 12, 2018", "Email interview with Tim Storey, director of the State Services Division for the National Conference of State Legislatures, June 12, 2018", "Email interview with Jennifer Dargan, CNN spokeswoman, June 13, 2018", "Email interview with Richard Cohen, coauthor of The Almanac of American Politics, June 13, 201", "Email interview with David Byler, chief elections analyst and a staff writer for The Weekly Standard, June 13, 2018", "Email interview with Sean Trende, senior elections analyst for Real Clear Politics, June 14, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]