["“I will not get vaccinated”, reads the Korean-language caption on a Facebook post from February 21, 2021.", "The accompanying image shows a medic in scrubs with Korean-language text saying:", "“‘I will not get vaccinated,’ says Dr. Gisèle Werner.", "“Like many of my colleagues say, it is good to wait before receiving vaccinations. We do not have the hindsight necessary to guarantee the safety of new gene therapy methods.", "“Vaccines do not prevent the spread of Covid-19 virus and won’t negate the need for preventative measures. We do not know the middle to long-term side effects of [vaccines] and are so far observing more dangers than benefits. Be careful!”", "The poster purports to be part of an official campaign from the “Swiss Federation for Vaccine Protection” and contains a disclaimer in the bottom-right corner stating that the campaign is “supported by Swiss citizens and doctors aware of the risks inherent in vaccinations.”", "The same post was shared here and here on Facebook, from as early as January 6, 2021, as well as on a Korean blog Naver blog here.", "However, the poster is not authentic and the claims made about Covid-19 vaccination are false.", "Translated from French", "The poster appears to originate from a similar French-language version posted on Facebook here on January 5, 2021. AFP published a debunk on the post here (in French).", "The Korean-language version of the post uses awkward diction, indicating it was translated using automatic software from the French poster.", "For example, a literal Korean translation for the term “preventative measures” is used, which is not the actual term used in South Korea to refer to public health measures used to prevent virus transmissions, such as wearing masks or hand-washing.", "The Korean-language poster does not translate the footnote written in small print on the bottom left, which says in French: “the doctor’s name is fictitious.”", "Fake poster", "The French-language and the translated Korean poster follow the style of genuine vaccination promotion posters from the Swiss Federal Office of Public Sanitation (FOPH), which oversees Switzerland’s national health policy.", "The real posters say: “I will get vaccinated”, and not “I will not get vaccinated”, as seen in this poster featuring a photo of Dr. Solange Peters from the University Hospital of Lausanne.", "Contacted by AFP, the FOPH said it had nothing to do with the misleading posters circulating on Facebook in French and Korean.", "“The FOPH is strongly distancing itself from the content of the message,” Grégoire Gogniat, FOPH spokesman, said in an e-mail on January 7, 2021.", "Logos and stock photos", "There is no organisation called the “Swiss Federation for Vaccine Protection” according to multiple keywords searches in English and French.", "The organisation’s purported logo is a modification of the Swiss flag.", "The other logos displayed across the bottom of the poster are not linked to organisations that work on vaccinations.", "The blue logo on the left is from a U.S. program called the Mental Health Cooperative, which helps adults with mental illness, according to their website.", "The logo second to right, reading Santé - or 'health' in French - is from a Polish company that sells breakfast foods.", "The logo on the right resembling an apple that reads “Healthcare” in English is a generic icon used in several Facebook pages, including here.", "The origin of the final second-to-left logo is unclear.", "The image used on the misleading French and Korean poster of the medic is a stock image available on multiple stock image websites including Shutterstock and iStock, captioned: “portrait of young Asian nurse wearing surgical mask”.", "Unfounded claims", "Switzerland’s vaccination campaign began on December 23, 2020.", "The posters claim that Covid-19 vaccines do not prevent virus transmission. There have, however, been positive signs that vaccines may help curb infections.", "An AFP report from February 25, 2021 cited an Israeli clinical trial published in the New England Journal of Medicine that showed among two samples populations -- vaccinated and unvaccinated -- of 600,000 persons each, infections declined sharply among the vaccinated cohort, by 92 percent among those at least one week past the second of two doses.", "The poster’s claim that vaccines won’t replace “preventative measures” is true. The World Health Organization continues to recommend vaccinated people should continue to wear masks and practice physical distancing.", "The Swiss FOPH also stresses on its website that vaccination “does not replace the rules on hygiene and behaviour”.", "South Korea began its national Covid-19 vaccination drive on February 26, 2021. Prime Minister Chung Sye-kyun has urged people to place trust in vaccinations amid a government-led investigation into the possible side effects of the AstraZeneca vaccine.", "AFP has published various debunks around South Korea’s vaccination programme, including here, and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]