["About this rating", "A quote ostensibly uttered by Alexander Soros, the son of billionaire investor and philanthropist George Soros, has been making its way around social media since at least Aug. 12, 2020. The fictitious quote, which involved Soros saying that it was his — and in turn his father's — decision to pick U.S. Sen. Kamala Harris, D-Calif., as 2020 Democratic presidential nominee Joe Biden's running mate, was frequently shared with a photograph that social media users claimed was taken right after Soros conducted the final interview in Harris' vetting process:", "This is a genuine photograph of Soros and Harris, but this quote was fabricated out of whole cloth, and this photograph does not show Soros and Harris after the \"final interview\" before Harris was selected as Biden's running mate. This image was actually taken in March 2019.", "The above-displayed meme reads:", "Alexander Soros, son of George Soros, here with Kamala Harris after their final interview in Biden's VP vetting process. \"This was the moment,\" Soros said. \"When I decided she would be the pick. I told my dad and he agreed. The rest was just a formality.\"", "For the uninitiated, George Soros, who is known for giving both verbal and financial support to progressive causes, frequently plays the \"boogeyman\" in right-wing, anti-Semitic conspiracy theories. The billionaire philanthropist has been falsely accused of wanting to destroy the United States, of busing people into areas to create chaos and riot, and of being the driving force behind antifa and Black Lives Matter. In general, a section of the population believes that Soros is a \"puppet master\" who is secretly controlling various world events. The above-displayed meme plays into this idea by claiming that Soros' son Alexander is controlling the decisions of the Democratic party.", "The above-displayed image was posted by Soros, the deputy chair of the Open Society Foundations, on Aug. 11, 2020, along with a message congratulating Harris on her selection as Biden's 2020 running mate:", "Soros's post made no mention of a \"vetting interview,\" nor did it include the alleged quote. We also found no news articles, press releases, or interviews with Soros in which he uttered this quote or talked about this supposed meeting. In fact, news articles from outlets such as USA Today and The Associated Press about the \"grueling vetting process\" that took place before Harris' nomination, made no mention of Soros at all.", "While Soros shared this image on Aug. 11, this photograph was not taken on that day. This image was actually taken — and originally posted — by Soros more than a year earlier, in March 2019. At the time, Harris was still exploring a run for president of the United States and was not being considered by Biden (who had not yet been selected as the Democratic party's nominee) as a vice presidential candidate. In other words, the claim made in this meme is completely bogus.", "So, where did this claim come from?", "An Aug. 12, 2020, a number of social media accounts on Twitter and Facebook started to copy and paste the aforementioned text. While we are not entirely sure where the message originated, one user put in plenty of effort to try to get this false rumor to spread. Garth Limburg posted this message at least a dozen times in response to messages posted by news outlets, Biden and Harris, and a number of conservative figures such as Charlie Kirk, Dinesh D'souza, the Trump campaign, Bill Mitchell, and Seb Gorka.", "While it doesn't appear that Limburg was successful in getting a retweet from any major social media account, near-verbatim copies of this message were picked up and shared uncritically by a number of smaller accounts.", "Of course, there's no evidence that Alexander Soros ever said this, nor is there any evidence that Soros had a hand in picking Harris as Biden's running mate. This quote was entirely fabricated to further a conspiracy theory about George Soros (and now his son) controlling politics.", "Reuters.   \"Fact Check: False Claims About George Soros.\"\r\n    18 June 2020.", "The Associated Press.   \"How Joe Biden Chose Kamala Harris: Inside the History-Making VP Pick.\"\r\n    12 August 2020.", "Garrison, Joey; Hayes, Christal; Morin, Rebecca; Wu, Nicholas; Jansen, Bart.   \"11 Names, 120 Hours of Interviews: Inside the Grueling VP Search That Led Joe Biden to Kamala Harris.\"\r\n    USA Today.   12 August 2020.", "Burton, Tara.   \"The Centuries-Old History of Jewish 'Puppet Master' Conspiracy Theories.\"  \r\n  Vox.   2 November 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]