["About this rating", "In October 2019 it came to our attention that an aging platitude about aging, already credited to multiple sources, found a new voice:", "The meme appeared on Get Old, a lifestyle blog published by a pharmaceutical company. The same quote has been attributed to Landers on several sites, including Psychology Today.", "However, the quote does not surface in searches at AnnLanders.com, an advice column launched in 2019 by Landers’ daughter, Margo Howard. The site is also advertised as an archive of Landers’ columns.", "That’s not the only reason to doubt the credit.", "A similar quote has been attributed to Bob Hope, Anonymous, “a wise old man,” and Winston Churchill. Snopes investigated that last one in December 2018:", "Not so long ago, this particular quote about aging existed on the Internet primarily as a wise saying attributed to “Anonymous” or “Unknown.” For example, motivational speaker Bill Benjamin included it as such on his list of “Favorite Quotes & Thoughts” as far back as 2008. This quote appears in myriad other lists of anonymous sayings as well and was “memed” into a Churchill quote only fairly recently.", "We rate the newer variation of this claim as \"Misattributed\" because, although Landers could have given some version of this advice during the 47 years she was publishing columns, there is no available evidence to prove that the exact quote originated with her.", "Unfortunately, Landers (Esther Pauline \"Eppie\" Lederer) died in 2002 at the age of 83, so we cannot ask her to confirm directly.", "Here is advice on aging Landers did recommend for “everyone over 60.” Again, however, not her words. The list was written by one of her readers.", "Have you seen other variations of this claim? Let us know.", "Bond Huberman is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]