["“First photograph of earth, sent by Chandrayan 2….. What an eye-catching visual it is,” says a message viral on social media with a set of photographs from space.", "First photograph of earth, sent by Chandrayan 2….. What an eye-catching visual it is 👇", "Posted by Marvelous belgaum on Friday, July 26, 2019", "The images were also shared by Indian classical dancer Mallika Sarabhai are currently viral on Facebook and Twitter.", "They are also floating on WhatsApp.", "On July 22, 2019, GSLVMkIII-M1 successfully injected Chandrayaan-2 spacecraft into the Earth’s orbit. According to ISRO, it is scheduled to reach the Moon by August 20, 2019. The images circulating on social media were not transmitted by the spacecraft.", "This is a photograph of a solar eclipse from the Moon and was published by NASA on March 2, 2007.", "This is not an actual photograph but a visualization of data. It is a computer-generated image published by NASA showing the extent of sea ice around Antarctica on September 21, 2005.", "This is an image of Sarychev volcano in the Kuril Islands, Russia. It was published by NASA Earth Observations in 2014.", "We found this image on a 2004 blog- 3D wallpapers for Windows phone.", "This is a digital artwork created by one Mike Kiev and was busted in 2016 by American fact-checking website Snopes.", "This photograph was used as a cover for a 2014 book Karac: Kaldar Warriors #1.", "We were able to trace this picture at least as far back as 2014 when it was uploaded by a website nanopdf.com.", "This is a poster from the 2009 Nicolas Cage movie ‘KNOWING’.", "All the above images were located by Alt News using simple Google reverse image search. Social media user can also find the truth behind unsourced images in the same manner before sharing them further.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]