["By Saranac Hale Spencer", "Posted on September 25, 2017", "Q: Has a judge banned Sharia law across the United States?", "A: No. The judge pictured with a bogus headline proclaiming a nationwide ban was the host of a daytime court TV show.", "A headline proclaiming that a judge has banned Sharia law in all 50 states is not true and the story that goes along with it appears to have been rehashed from 2015.", "An article posted on usaviralnews.info on Sept. 15 carried the headline, “BREAKING: American Judge Just Banned Sharia Law In All 50 States. Do You Support This?” Appearing immediately below the headline is a picture of a man in a black judge’s robe with his arms crossed. The picture is of Alex Ferrer, who hosted a daytime court TV show called “Judge Alex.”", "The story, which was flagged by Facebook users as potentially fabricated news, closely matches one that ran on Breitbart.com on Jan. 27, 2015 about an Islamic tribunal set up near Dallas, Texas. But both stories say nothing about a nationwide ban on Sharia law.", "Contrary to the headline, the accompanying story on usaviralnews.info only makes reference to a voluntary Islamic tribunal in Texas that Breitbart and a local CBS station in Dallas reported on in 2015. According to the CBS report,  the tribunal offers to settle cases involving divorce, business disagreements and other civil disputes among Muslims using Sharia law, which is based on the tenets of Islam. Participation in the tribunal is voluntary and its judgments are non-binding and separate from the findings of any local, state or federal court.", "A similar headline claiming that Sharia law had been banned in all 50 states also appeared on a website called Californianews.co on Sept. 18. That story included a description of a petition to increase awareness of “the ‘Creeping Sharia’ threat to America,” but the petition wasn’t available on the site.", "Although both headlines claim that there has been a sweeping, nationwide ruling that would ban the use of Sharia law in the U.S., there has been no such ruling. As of July, a total of 11 states had enacted legislation prohibiting the use of foreign or religious laws in state courts, according to the National Conference of State Legislatures. In June, Texas Gov. Greg Abbott signed legislation that will require the state Supreme Court to adopt rules and provide judicial instructions related to the use of foreign law in family court proceedings.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“BREAKING: Americab Judge Just Banned Sharia Law In All 50 States. Do You Support This?” Usaviralnew.info. 15 Sep 2017.", "Price, Bob. “ISLAMIC TRIBUNAL CONFIRMED IN TEXAS; ATTORNEY CLAIMS ‘IT’S VOMUNTARY.’” Breitbart.com. 27 Jan 2015.", "TV.com. Judge Alex show description. Accessed 25 Sep 2017.", "Paul, Jeff. “North Texas Home To First Islamic Tribunal In U.S.” 2 Feb 2015.", "“JUST IN: SHARIA LAW FINALLY BANNED IN ALL 50 STATES. DO YOU SUPPORT…?” Californianews.co. 18 Sep 2017.", "National Conference of State Legislatures. State Resources on The Prohibition of The Use of Foreign or Religious Law in State Courts. NCSL.org. Accessed 25 Sep 2017.", "Texas State Legislature. HB 45 signed 14 Jun 2017. Accessed 25 Sep 2017.", "Texas State Legislature. HB 45 “Relating to requiring the Texas Supreme Court to adopt rules and provide judicial instruction regarding the application of foreign laws in certain family law cases.” Signed 14 Jun 2017.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]