["Stacey Evans, a Democrat running to be Georgia’s next governor, claims workers are at an economic disadvantage in part because of the state’s minimum wage.", "\"I want Georgia to be the best place to work, live, and raise a family. Right now, it isn’t,\" Evans said on her campaign website. \"Georgia is 40th in income inequality, 40th in high school graduation, and has the lowest minimum wage in the country.\"", "We wondered if Georgia in fact has the lowest minimum wage in the nation.", "It does, but it’s not alone (tied with Wyoming), and most of hourly wage employees are paid above the state’s minimum wage: at least $7.25, which is also the federal minimum wage.", "Georgia’s state law sets the minimum wage at $5.15 per hour, but the federal Fair Labor Standards Act still applies, meaning most employees are covered under the federal minimum wage of $7.25 per hour.", "Wyoming, which equally has a $5.15 minimum wage, also says that when the federal minimum wage is higher than the state’s, the federal minimum wage applies to most workers.", "\"Like Georgia, Wyoming also has a $5.15 minimum wage, the lowest in the country. And while, thankfully, many Georgians are protected by a federal wage floor, many Georgians are not,\" said Adam Ney, research director for the Evans campaign. \"The fact remains that Georgia has the lowest minimum wage in the country and that we must increase it because everybody deserves a fair day’s pay for a hard day’s work.\"", "Who doesn’t get the federal minimum wage? There are exemptions in the law for certain farm workers, seasonal workers, health aides, and workers who receive tips.", "In 2016, Georgia had about 2.3 million workers paid hourly rates, and 51,000 of them (or 2.2 percent) were paid below the federal minimum wage, according to the Bureau of Labor Statistics.", "An estimated 90,000, or 3.9 percent, were paid at or below the federal minimum wage.", "Overall, Idaho, Kentucky, Louisiana, Mississippi, and South Carolina had the highest percentages of hourly paid workers earning at or below the federal minimum wage, at or about 5 percent, BLS said.", "Georgia is one of seven states that have either a lower state minimum wage than the federal standard, or no state minimum wage at all, said Wesley Tharpe, research director at the left-leaning think tank Georgia Budget and Policy Institute.", "\"In practice, the vast majority of workers in every state are subject to the federal requirement of $7.25 an hour,\" Tharpe said.", "Tipped workers, including servers, are also paid a lower hourly rate in most states including Georgia, Tharpe said. \"Some evidence suggests their tips don’t always sum to get them about the required $7.25 federal rate,\" he said.", "Evans said Georgia \"has the lowest minimum wage in the country.\"", "Georgia’s minimum wage of $5.15 per hour is the lowest in the nation, but Wyoming also has the same minimum wage.", "Also, most of Georgia’s workers paid hourly rates earn the federal minimum of $7.25.", "Evans’ statement is accurate but needs clarification or additional information. We rate it Mostly True.", "Stacey Evans campaign website, Jobs and the economy, accessed Jan. 26, 2018", "Email exchange, Stacey Evans campaign, Jan. 29, 2018", "Email exchange, Georgia Budget and Policy Institute’s press office, Jan. 29, 2018", "U.S. Department of Labor, Bureau of Labor Statistics, Characteristics of minimum wage workers, 2016, April 2017", "U.S. Department of Labor, Minimum Wage Laws in the States, updated Jan. 1, 2018", "National Conference of State Legislatures, State Minimum Wages | 2018 Minimum Wage by State, Jan. 2, 2018", "Wyoming Department of Workforce Services, A History of the Minimum Wage in Wyoming and the U.S.", "Georgia Budget and Policy Institute, Policy Report: Better Pay for Honest Work Raise Georgia’s Minimum Wage to Expand Middle Class, Strengthen Economy", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]