["The one-minute 52-second video has been shared nearly 1,000 times afte it was posted here on Facebook on May 18, 2020.", "The Facebook post’s caption reads: “Migrants returning home stopped at Delh-UP border in Ghazipur. They Entered Uttar Pradesh Later by Breaking Barricades. #UttarPradeshModel #UnplannedLockdown”.", "Ghazipur is a village in the Indian state of Uttar Pradesh (UP), which borders the capital city of New Delhi.", "The video is also shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "A reverse image search on Google using video keyframes extracted with InVID-WeVerify, a digital verification tool, found the same video published on YouTube here on October 15, 2019, months before the COVID-19 pandemic.", "According to the YouTube caption, the video shows an “Army recruitment drive in Faizabad,” another city in Uttar Pradesh that is more than 650 km southeast of New Delhi.", "Below are three sets of screenshot comparison of the video in the misleading posts (L) and the October 2019 YouTube video (R):", "Footage shot from different angles and appeared to show a very similar scene in Faizabad in October 2019 can be seen here and here.", "A Hindi news website reported here about an army recruitment drive held in Faizabad on October 15, 2019. Other local media reported here and here on the same day that the large turnout created a chaotic scene at the event.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]