["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Eric Trump, President Donald Trump’s second son, falsely claimed the Trump family children \"got out of all international business\" after their father took office.", "\"The difference between us and Hunter (Biden) is when my father became commander in chief of this country, we got out of all international business,\" he told Fox News host Laura Ingraham in response to a question about the younger Biden’s ABC interview.", "The claim is the latest in the Trump team’s attacks against Hunter Biden, the son of former Vice President Joe Biden, a 2020 contender. Facing an impeachment inquiry, the president has repeatedly charged, without evidence, that the elder Biden forced out Ukraine’s lead prosecutor to protect Hunter, who worked on the board of a Ukrainian company that was once under investigation.", "But as they accuse Hunter Biden of riding his family name to a fortune in Ukraine, the Trump children have put almost no stops to their own overseas business dealings, we found.", "Multiple news outlets and government accountability groups have documented international business dealings Eric Trump and his siblings have conducted since Donald Trump took office. In some cases, the Trump children themselves have celebrated their activities overseas.", "Before his inauguration, Donald Trump announced that he would be retaining ownership of the Trump Organization but transferring day-to-day control to his oldest sons, Eric and Donald Trump Jr.", "The move followed a post-election promise Trump made on Twitter, when he pledged that \"no new deals will be done during my term(s) in office.\" He elaborated on that promise in a white paper detailing ethics rules the Trump Organization had agreed to observe.", "The white paper said the Trump Organization would function like an \"asset-management company,\" pursuing no new foreign deals and donating all profits from foreign officials’ use of Trump properties to the U.S. Treasury. (In February, the company said it turned over $191,538 to cover foreign profits from 2018.)", "But Trump continues to make money from existing licensing and property deals sprawled across more than 20 countries, according to an analysis of Trump's foreign business interests from the Center for Responsive Politics, a nonprofit research group tracking money in politics.", "The Trump campaign pointed to an article in The Hill and otherwise directed our inquiry to the Trump Organization, which did not respond to multiple requests for comment.", "As a number of news outlets have reported, the Trump Organization has continued conducting business abroad.", "\"Eric Trump’s claim that ‘we got out of all international business’ is clearly and demonstrably false,\" said Noah Bookbinder, executive director of Citizens for Responsibility and Ethics in Washington, a nonprofit government watchdog that tracks Trump’s conflicts of interest. \"Both Eric Trump and Donald Trump Jr. have repeatedly traveled internationally to conduct business.\"", "In September, a local council in Scotland voted to let the company build 550 homes and a second golf course as an expansion of a Trump-owned golf course in the area. Eric Trump described the construction as \"a new phase of development\" in a celebratory tweet.", "Congratulations to our extraordinary @TrumpScotland team! Minutes ago, we received full & total approval for a new phase of development to include 500 homes, 50 cottages, sports center, retail & more. We also received approval to build a 2nd golf course! Very proud of them! pic.twitter.com/odVxomGdmf", "Also recently, the Trump Organization received approval to build 53 houses and a new ballroom at its seaside golf course in Ireland, according to the Washington Post.", "In addition to managing existing properties and licensures, the Trump brothers have built on deals that were already in the works or inked before Trump became president, in some cases going back and giving new life to old projects that had previously seemed abandoned.", "\"Some Trump-branded foreign projects have only been made public after Trump’s election and others have significantly expanded,\" said Anna Massoglia, a researcher at the Center for Responsive Politics. \"Projects that appeared to be long-forgotten or dormant were also revisited after Trump's election.\"", "In 2017, for example, Eric Trump went to the Dominican Republic to revive a deal from 2007. Trump Organization lawyers argued then that the deal was never dead and therefore did not count as the type of new foreign deal the company had promised to avoid. But according to the Associated Press, no new projects there had \"been built or announced in a decade.\"", "In 2018, Donald Trump Jr. traveled to sell condos at high-rises in India, where the Trump Organization has licensed its name to five projects on deals signed before the election. The Wall Street Journal reported in 2017 that promotional materials for one of those projects said buyers could be associated with \"celebrity & POTUS Donald Trump’s Trump Organisation,\" a move the Trump Organization blamed on a broker.", "In August, Trump Jr. flew to Indonesia to promote two Trump-branded resorts that have yet to be built. Bookbinder noted that in an internal presentation, the Indonesian company building those properties said the Trump international portfolio had an \"aggressive global expansion underway,\" with \"numerous projects in the pipeline.\"", "The Trump Organization has been similarly involved in projects in Canada, the United Arab Emirates and Uruguay, said Scott Amey, general counsel for the Project on Government Oversight, a nonprofit government watchdog group.", "Amey pointed to articles in Politico, the Daily Beast and the Washington Post that described how providing Secret Service protection for the Trump brothers on their business trips has cost taxpayers hundreds of thousands of dollars.", "\"Let's not forget that each year President Trump lists numerous international ventures in his financial disclosure records,\" Amey said, adding that Eric Trump’s claim was \"incorrect.\"", "The brothers have also sold off many Trump real estate holdings, according to Forbes. In January 2018, they offloaded a piece of land in the Dominican Republic for $3.2 million, a move Forbes called \"the clearest violation of their father’s pledge to do no new foreign deals.\"", "Ivanka Trump and her husband Jared Kushner, who both serve advisory roles in the White House, have also benefited from foreign business ties since Trump took office.", "Ivanka Trump kept her international fashion business running for 18 months after her father was elected. Amid trade talks with China last year, she received a number of trademarks from the country related to a variety of her fashion products. She added more this year, as well.", "\"Certainly, filing for trademarks in an international country would count as international business,\" said Jessica Tillipman, assistant dean and a professor of law at the George Washington University Law School.", "Kushner remains a partial owner of his family’s own real estate company, but he has divested some assets to a trust controlled by his mother, according to the New York Times. Last year, his company made a roughly $1 billion bailout deal with Brookfield Asset Management, which is partly owned by the government of Qatar, to save a failing New York property.", "Eric Trump said, \"When my father became commander in chief of this country, we got out of all international business.\"", "The Trump Organization said it would not make new foreign deals during Donald Trump’s presidency. But the Trump brothers have traveled across the globe, managing properties and taking action on deals that they say were signed or under works before Trump took office.", "Regardless of whether these moves should be considered new foreign deals, it’s ridiculous to claim the Trump family children stopped all international business after their father’s election.", "We rate this statement Pants on Fire!", "Jason Campbell on Twitter, Oct. 15, 2019", "Citizens for Responsibility and Ethics in Washington, \"Trump’s 2,000 Conflicts of Interest (And Counting),\" accessed Oct. 16, 2019", "U.S. Office of Government Ethics, President Donald J. Trump’s 2019 Public Financial Disclosure Report, accessed Oct. 17, 2019", "U.S. Office of Government Ethics, Ivanka Trump's 2019 Public Financial Disclosure Report, accessed Oct. 17, 2019", "Aberdeenshire Council, \"Aberdeenshire Council approves plans for 550-homes development on Menie estate,\" accessed Oct. 17, 2019", "Morgan, Lewis & Bockius LLP, \"White Paper: Conflict of Interest and the President,\" accessed Oct. 17, 2019", "MNC Group, Corporate Update Presentation, February 2019", "Letter from David J. Apol, acting director and general counsel of the Office of Government Ethics, to members of Congress, June 18, 2018", "Media Matters for America, \"Fox News helps Eric Trump lie about how Trump's adult children profit off the presidency,\" Oct. 16, 2019", "GQ, \"How Don Jr., Ivanka, and Eric Trump Have Profited Off Their Dad's Presidency,\" Oct. 14, 2019", "The New York Times, \"Those Foreign Business Ties? The Trump Sons Have Plenty Too,\" Cct. 11, 2019", "The Washington Post, \"Trump Organization gets approval to build more than 50 homes at Ireland golf course,\" Oct. 10, 2019", "The Los Angeles Times, \"Trump’s children take in millions overseas as president slams Biden’s son,\" Oct. 10, 2019", "PBS Newshour, \"Trump criticizes the Bidens, but his own family’s business raises questions,\" Oct. 9, 2019", "Forbes, \"Donald Trump’s Sons Have Sold More Than $100 Million Of His Real Estate Since He Took Office,\" Oct. 2, 2019", "The Washington Post, \"Trump’s company, seeking to revive a money-losing golf course in Scotland, gets approval to build 550 homes there,\" Sept. 26, 2019", "Eric Trump on Twitter, Sept. 26, 2019", "Politico, \"Why the Secret Service spent thousands at a Trump hotel,\" Aug. 14, 2019", "CBC, \"Expenses for Trump family trips to Vancouver tower raise conflict-of-interest concerns,\" Aug. 14, 2019", "The New York Times, \"Donald Trump Jr., in Indonesia, Defends Family’s Global Business,\" Aug. 13, 2019", "The New York Times, \"Ivanka Trump and Jared Kushner Report Up to $135 Million in 2018 Income,\" June 14, 2019", "Center for Responsive Politics, \"World of Influence: A guide to Trump’s foreign business interests,\" June 4, 2019", "Politico, \"Trump’s company says it donated nearly $200k to U.S. Treasury,\" Feb. 25, 2019", "Reuters, \"Qatar revamps investment strategy after Kushner building bailout,\" Feb. 11, 2019", "The Associated Press, \"Ivanka Trump receives five more trademarks in China, fueling ethical concerns,\" Jan. 21, 2019", "Time, \"Read a Transcript of Donald Trump's Press Conference on Conflicts of Interest,\" Jan. 11, 2019", "The Hill, \"Trump to hand over businesses to sons,\" Jan. 11, 2019", "The Daily Beast, \"Donald Trump Jr.’s Trip to India Cost Taxpayers Nearly $100,000: WaPo,\" Nov. 15, 2018", "Citizens for Responsibility and Ethics in Washington, \"Trump’s Ethics Promises Have Not Been Kept,\" Sept. 17, 2018", "The Washington Post, \"Ivanka Trump shuts down her namesake clothing brand,\" July 24, 2018", "Politico, \"Don Jr. and Eric Trump racked up nearly $250,000 in Secret Service costs in one month, watchdog says,\" July 18, 2018", "The Washington Post, \"Trump business dealings raise ‘serious concerns,’ ethics office says,\" June 23, 2018", "The New York Times, \"Ivanka Trump Wins China Trademarks, Then Her Father Vows to Save ZTE,\" May 28, 2018", "The Independent, \"Donald Trump Jr and Eric Trump's Dubai trip reportedly cost taxpayers $73,000,\" April 8, 2018", "The New York Times, \"Donald Trump Jr. Retreats From Foreign Policy on India Trip,\" Feb. 23, 2018", "The Associated Press on YouTube, \"Raw: Donald Trump Jr. Arrives In India,\" Feb. 20, 2018", "The Washington Post, \"Trumps set to launch two real estate projects in India, despite conflict-of-interest concerns,\" Oct. 28, 2017", "The Wall Street Journal, \"Pitch for Trump Tower Mumbai Plays Up Connection to Donald Trump,\" July 26, 2017", "The Associated Press, \"Resort deal revamp tests Trump pledge on foreign projects,\" Feb. 10, 2017", "Cap Cana News, \"Cap Cana Welcomes Eric Trump,\" Feb. 5, 2017", "The Washington Post, \"Eric Trump’s business trip to Uruguay cost taxpayers $97,830 in hotel bills,\" Feb. 3, 2017", "Donald J. Trump on Twitter, Dec. 12, 2016", "Statement from the Trump campaign, Oct. 16, 2019", "Email correspondence with Ann Skeet, senior director of leadership ethics at the Markkula Center for Applied Ethics at Santa Clara University, Oct. 16, 2019", "Phone interview with Jessica Tillipman, assistant dean for field placement and a professor of law at the George Washington University Law School, Oct. 17, 2019", "Email interview with Scott Amey, general counsel for the Project on Government Oversight, Oct. 17, 2019", "Email interview with Anna Massoglia, researcher at the Center for Responsive Politics, Oct. 17, 2019", "Statement from Noah Bookbinder, executive director of Citizens for Responsibility and Ethics in Washington, Oct. 17, 2019", "Email interview with Ken Duncan, communications and marketing officer for Aberdeenshire Council in Scotland, Oct. 18, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]