["The 21-second video was shared here on Facebook on January 23, 2020.", "It has been viewed over 2,900 times since.", "Below is a screenshot of the misleading Facebook post:", "The Hindi-language caption translates to English as: “Shaheen Bagh women are fighting over money, saying to hell with CAA, they need full money.”", "Shaheen Bagh is an area in India’s capital, Delhi, where hundreds of women have staged a sit-in protest since late 2019, following the passing of the contentious Citizenship Amendment Act. The law, which grants citizenship to non-Muslim immigrants from Afghanistan, Bangladesh, and Pakistan, has been criticized as anti-Muslim and sparked nationwide protests, as reported by AFP here.", "The social media chief for India’s ruling Bharatiya Janata Party, in this tweet accused the protesters at Shaheen Bagh of being paid 500 Indian rupees a day to participate in the anti-citizenship law protests. He currently faces a defamation suit, filed by a group of protesters, as reported by Indian news outlet Firstpost here.", "The same video was also published here, here, here and here on Facebook; and here and here on Twitter.", "This claim is false; the video has circulated since at least January 2019, almost a year before India passed the citizenship law, in media reports about an altercation between a group of women at a market in Bhopal, a city in the Indian state of Madhya Pradesh.", "A reverse image search on Yandex found a longer version of the video published here on the YouTube channel of the Hindi-language TV channel News 24 on January 4, 2019.", "The Hindi-language title of the video translates to English as: “High-voltage drama of women in Bhopal”.", "The Hindi-language caption of the video translates to English as: “High-voltage drama in Chowk market in Bhopal city where women were engaged in a public brawl”.", "The video report also said the fight broke out following a traffic accident.", "Chowk market is one of the oldest markets in Bhopal.", "Below is a screenshot comparison of the video in the misleading post (L) and the News 24 video (R):", "Closer analysis of the video in the misleading post and found the video was shot outside Goyal Dharmashala, a hotel close to the Chowk market area in Bhopal.", "AFP identified several distinctive building structures in the video in the misleading post, at the 12-second mark and 19-second mark, highlighted in red:", "Below is a screenshot comparison of the highlighted structures in the misleading post (L) and the image in Google Maps (R):", "The altercation was also reported by local Hindi-language news outlet Dainik Bhaskar here on January 5, 2019.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]