["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate Sen. Bernie Sanders, I-Vt., speaks at the Iowa State Fair in Des Moines Aug. 11, 2019. (AP)", "Sen. Bernie Sanders, I-Vt., accused South Carolina of spending too much on prisons and not enough on schools, keying in on the issues of mass incarceration and education with an eye toward the early primary state.", "\"Last year, South Carolina spent $21,756 per prison inmate and $11,552 per student,\" Sanders wrote in an Aug. 26 post. \"We should be investing in jobs and education, not more jails and incarceration.\"", "South Carolina’s situation is not unique. Across the country, states spend more on average to lock people up than to educate students.", "Sanders may have focused on the Palmetto State because its Feb. 29 Democratic primary vote represents the first real test case of candidates’ strength with black voters, who cite criminal justice and education as critical issues. In 2016, Sanders lost the African American vote to Hillary Clinton by an astonishing 50 percentage points.", "Sanders’ numbers checked out. But the gap between South Carolina’s spending on prisons and schools is nowhere near the biggest disparity among the states.", "Sanders is correct: South Carolina spent an average of $21,756 on each of its roughly 20,000 inmates in 2018, according to a South Carolina Department of Corrections budget sheet that Sanders’ campaign referred us to.", "During the 2017-18 academic year, the Palmetto State spent an average of $11,525 per student. That data comes from the National Education Association’s annual assessment, which Sanders’ campaign pointed us to.", "That’s a difference of about $10,000 more on prisons than schools.", "We heard from a South Carolina Department of Corrections official who pushed back against Sanders’ claim, saying that comparing inmate cost-per-year versus students \"is not an apples to apples comparison.\"", "\"Inmate cost includes 24-hour care, housing, clothing, feeding, medical care, mental health care, programming, 24-hour security, plus education costs,\" the spokesperson said.", "But other experts we spoke to said the comparison is a reasonable way to gauge a state’s priorities.", "\"It’s hard to argue that spending twice as much on prisons as on schools doesn’t reflect some distorted priorities,\" said David Bills, an education professor at the University of Iowa. \"By international standards, the U.S. has an inordinate number of people in prison, and by international standards is underinvesting in education.\"", "The disparity between prison and school spending is not unique to South Carolina — in fact, it’s the same across the country. We compared the most recent data on state prison spending from the Vera Institute of Justice, a criminal justice think tank, with state-by-state public school expenditures from the National Education Association.", "Every state averaged more spending on inmates than students, based on the available data from 2015, which included 45 states. On average, these states spent $11,709 per student, and $33,274 per inmate, or nearly three times more on prisons than schools.", "Among the states we compared, South Carolina had the ninth lowest disparity between inmate and student spending.", "If Sanders had wanted to highlight the largest disparity — $53,497 — he should have turned to deep blue California. In 2015, Sacramento spent an average of nearly $65,000 per prisoner, almost double the statewide average. That same year, California spent close to the statewide average on education per pupil, just over $11,000.", "\"I think this is generally a reasonable comparison of state priorities,\" said Marc Mauer, executive director of The Sentencing Project. \"In many states spending on corrections has increased at a far higher rate than for education over the past several decades.\"", "Sanders said, \"Last year, South Carolina spent $21,756 per prison inmate and $11,552 per student.\"", "Sanders is correct that South Carolina averaged more spending per inmate than student last year. But the disparity in prison versus school spending is true across the country, and in most states the gap is wider than in South Carolina.", "We rate this Mostly True.", "Instagram post by Bernie Sanders, Aug. 25, 2019", "PolitiFact, \"Was Bernie Sanders mute on race, gender at the top of his 2020 kickoff speech?\" March 5, 2019", "South Carolina Department of Corrections 2018 budget, accessed Aug. 27, 2019", "National Education Association, \"Rankings of the States 2017 and Estimates of School Statistics 2018,\" April 2018", "National Education Association, \"Rankings of the States 2015 and Estimates of School Statistics 2016,\" May 2016", "Vera Institute, \"Prison spending in 2015,\" accessed Aug. 27, 2019", "Email interview with a South Carolina Department of Corrections spokesperson, Aug. 27, 2019", "Email interview with Sarah Ford, a spokesperson for Bernie Sanders, Aug. 26, 2019", "Email interview with Gary Kleck, a professor of criminology and criminal justice at Florida State University, Aug. 27, 2019", "Email interview with Marc Mauer, executive director of The Sentencing Project, Aug. 27, 2019", "Email interview with David Bills, a professor of the sociology of education at the University of Iowa, Aug. 27, 2019", "Email interview with Dick Startz, a professor of economics at the University of California Santa Barbara, Aug. 27, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]