["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A few days before the U.S. Senate took a vote in favor of an amendment to expand border patrol and other border security measures, U.S. Rep. Debbie Wasserman Schultz defended President Barack Obama’s record on border patrol and security.", "MSNBC anchor Thomas Roberts asked Wasserman Schultz to respond to critics, including House Republicans, who say the bill as amnesty or portray immigrants as \"takers.\"", "Wasserman Schultz, who also serves as chair of the Democratic National Committee, portrayed Obama as tough on enforcement.", "\"President Obama has the most border patrols and border security deployed at the border of any previous president,\" said Wasserman Schultz, D-Fla. in a June 20 interview on MSNBC. Obama \"has cracked down employers -- on employers who are attracting undocumented immigrants and hiring them more than any previous president.\"", "PolitiFact has previously examined some similar claims about border patrol during Obama’s presidency. But here we wanted to fact-check Wasserman Schultz’s specific claims that Obama holds a record for border patrol and security.", "Border patrol", "The Border Patrol buildup began under President Bill Clinton with Operation Gatekeeper and Safeguards, but expanded dramatically under President George W. Bush, said Katherine Benton-Cohen, a Georgetown history professor.", "The number of border patrol agents increased dramatically between fiscal years 1993 and Sept. 30, 2012. (So did spending.) Nationwide, the peak year was in 2011 with 21,444 agents -- the number dropped slightly to 21,394 in fiscal year 2012.", "Douglas Massey, a professor at Princeton University's Office of Population Research who has studied immigration issues, previously told PolitiFact that the total number of agents is a record going back to at least 1924.", "The biggest bump in Border Patrol staffing came under Obama’s predecessor, President George W. Bush. Between 2001 and 2009, the number of agents posted nationally rose from about 9,800 to a little more than 20,000.", "Border fence", "In addition to border patrol, Wasserman Schultz also gave credit to Obama for the most \"border security deployed\" -- a more general term that we took to include fences or other technological or infrastructure improvements.", "The first fence along the southwestern border was built in 1990 but was comparatively small: Prior to 2005 there were 78 miles of pedestrian fencing and 57 miles of vehicle barriers, according to a paper by the Migration Policy Institute.", "The Secure Fence Act of 2006, passed by a Republican-led Congress and was signed by Bush. It authorized the construction of hundreds of miles of additional fencing along the border with Mexico and called for adding unmanned aerial vehicles, satellites, radar and cameras. The fenced segments totaled roughly 650-700 miles, while the entire U.S.-Mexican border is about 2,000 miles long. Obama, an Illinois senator at the time, voted for the law.", "The act specified \"at least two layers of reinforced fencing,\" but in 2007 the law was altered to give the Border Patrol leeway to decide the type of fencing. By the time Obama became president in January 2009, much of the fence was completed -- but not of the type originally planned.", "In February 2011, a GAO report about the border presented a mixed picture of progress.", "The report states that between fiscal years 2005 and 2010, the number of border miles that had fences increased from about 120 to 649. A preliminary analysis of border miles under control showed 15 percent were \"controlled\" while the rest were \"managed\" and left vulnerabilities to illegal activity.", "For this fact-check, Wasserman Schultz’s spokesman sent us a 2011 White House immigration report that stated \"DHS has also completed 649 miles of fencing out of nearly 652 miles planned, including 299 miles of vehicle barriers and 350 miles of pedestrian fence, with the remaining 3 miles scheduled to be completed.\"", "Spokesman Jonathan Beeton also pointed to the fact that Obama signed a bill in 2010 in response to increased violence in Mexico that included $600 million in supplemental funds for enhanced border protection. Separately, an additional 1,200 National Guard troops were authorized for the the border.", "Fencing isn’t the only way the federal government has attempted to manage the border. The Secure Border Initiative launched in 2005 with the intention to combine fencing with technological tools such as cameras, sensors and radar, according to a paper from the Migration Policy Institute. Boeing won a contract and received about $860 million from the federal government.", "But it quickly ran into technical difficulties, cost overruns and delays, which have been criticized in numerous Government Accountability Office reports. Under the Obama administration, the program was canceled in January 2011, and the Secretary of Homeland Security Janet Napolitano ordered that the government should focus on using proven technologies, such as video and mobile surveillance and thermal imaging.", "Under Obama, border apprehensions have fallen from their high points. Border apprehensions peaked at almost 1.7 million in 2000 under President Clinton, and apprehensions in 2011 were at the lowest level since 1970. The post-2008 declines are due to the recession and loss of jobs which had attracted unauthorized immigrants. Net illegal immigration from Mexico has fallen to zero or even fewer coming than leaving.", "Expert analysis", "We sent Wasserman Schultz’s claim to immigration experts. No one disputed the border patrol numbers, but they also pointed to other factors when examining changes in border security that provide a more complex picture.", "\"Yes, the number of Border Patrol agents is at an all-time high,\" said Rey Koslowski, an expert on the border and an associate professor of political science and public policy at the University at Albany. \"Whether that equates to ‘border security’ is another question. As to who should get more credit for border security, the fence was a bipartisan project.\"", "Christopher Wilson, an associate with the Wilson Center’s Mexico Institute and an expert on border management, noted that border patrol agents don’t precisely equal border security.", "\"In the end, though, you can’t deploy border security, it must be something that is achieved. This gets into one of the major problems with the whole border security debate—the lack of an accepted definition of the term.\"", "Our ruling", "Wasserman Schultz said, \"President Obama has the most border patrols and border security deployed at the border of any previous president.\"", "She is correct that the highest number of border patrol agents has been under Obama: there were 21,444 in 2011. Wasserman Schultz was careful here and said \"most\" and didn’t talk about the growth rate. But it’s worth noting that the big growth was during Bush’s tenure: between 2001 and 2009, the number of agents posted nationally rose from about 9,800 to a little more than 20,000.", "Other border security measures are not as simple to quantify. The key piece of infrastructure -- the fence -- was launched under Bush. Work on the fence and other border security improvements continued under Obama.", "We rate this claim Mostly True.", "MSNBC transcript, Interview with U.S. Rep. Debbie Wasserman Schultz, Accessed in Nexis, June 20, 2013", "U.S. Sen. John Hoeven, Corken-Hoeven border security amendment, June 2013", "U.S. Customs and Border Protection, United States Border Patrol, Fiscal years 1990-2012", "U.S. Border Patrol, Enacted border patrol program budget, Fiscal years 1993-2012", "U.S. Senate, On Passage of Bill H.R. 6061, Sept. 29, 2006", "U.S. Government Accountability Office, Border security, Feb. 15, 2011", "White House, \"Building a 21st century immigration system,\" May 2011", "Migration Policy Institute, \"Immigration Enforcement in the United States,\" January 2013", "PolitiFact, \"Marco Rubio says Obama shows ‘reluctance’ to enforce immigration law,\" May 7, 2013", "PolitiFact, \"Obama says the border fence is now basically complete,\" May 16, 2011", "PolitiFact, \"Obama says record number of boots on the ground near U.S.-Mexico border and illegal crossings down nearly 80 percent since 2000 peak,\" May 13, 2013", "PolitiFact, \"Barack Obama touts record high border agents, lowest immigration from Mexico in 40 years,\" Oct. 17, 2012", "POLITICO, \"Immigration deal would double size of border patrol,\" June 21, 2013", "POLITICO, \"Defining border security,\" Feb. 10, 2013", "FORBES, \"President Obama: Deporter in Chief,\" July 30, 2012", "Washington Post, \"2009 budget seeks spending freeze,\" Accessed in Nexis, Feb. 1, 2008", "Washington Post, \"Congress says DHS oversaw $15 billion in failed contracts,\" Accessed in Nexis, Sept. 17, 2008", "Christian Science Monitor, \"Where U.S.-Mexico border fence is tall, it works,\" Accessed in Nexis, April 1, 2008", "Wall Street Journal, \"Fresh raids target illegal hiring,\" May 2, 2012", "USA Today, \"Border patrol targets ex-military as agents,\" Accessed in Nexis, April 14, 2008", "Arizona Republic, \"Homeland: Mexico border security fence almost complete, 69 miles to go,\" Accessed in Nexis, Jan. 28, 2009", "Houston Chronicle, \"Napolitano signals shift in workplace raids,\" Accessed in Nexis, Jan. 16, 2009", "Miami Herald, \"Fenced Out,\" Accessed in Nexis,Dec. 3, 2008", "U.S. Department of Justice, Background to the Office of Inspector General investigation Operation Gatekeeper, 1998", "Interview, Jonathan Beeton, spokesman for U.S. Rep. Debbie Wasserman Schultz, June 23, 2013", "Interview, Carissa Frasca Cutrell, spokesman, U.S. Immigration and Customs Enforcement, June 23, 2013", "Interview, Rey Koslowski, associate professor of political science and public policy at the University at Albany, June 24, 2013", "Interview, David Martin, University of Virginia law professor, June 24, 2013", "Interview, Alex Nowrasteh, immigration policy analyst at the Cato Institute’s Center for Global Liberty and Prosperity, June 24, 2013", "Interview, Christopher Wilson, an associate with the Wilson Center’s Mexico Institute and an expert on U.S.-Mexico trade and border management, June 27, 2013", "Interview, Katherine Benton-Cohen, Georgetown history professor, June, 27, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]