["About this rating", "A $10 million lawsuit that was reportedly filed against Uber by a man accused of shooting eight people while working as a driver for the company in Kalamazoo, Michigan, has turned out to be a hoax, according to law enforcement officials.", "The handwritten, rambling letter was purported to be from Jason Dalton, who is awaiting trial on charges of killing six people on 20 February 2016 (between picking up fares as an Uber driver). Dalton, 45 — who faces 16 charges related to the shootings, including six counts of murder and two of attempted murder — told police that a \"devil\" in the Uber app took over his body, and that his memories of the shootings are spotty.", "The hoax lawsuit, which was mailed to U.S. District Court in Detroit and filed Tuesday, claims that Dalton had worked for Uber for years, although the company has said he was only approved in late January, less than a month before his shooting spree:", "This company is a hostile workplace environment. I am tired of being treated like a 2nd class citizen by Uber. Uber discriminates against my mental health. I'm currently in prison because of Uber....", "I seek $10 million dollars in punitive damages and emotional distress.", "The letter also alleges that the company would call him late at night and tell him that if he didn't go to work, he was fired. (Uber doesn't set schedules for its drivers.)", "\"He said he has no idea what it is,\" Kalamazoo County Undersheriff Pali Matyas told local news outlets. \"He said he didn't send it, didn't authorize it, doesn't know who did.\" In a previous e-mail statement, Matyas wrote:", "To let you know, the Dalton lawsuit was a hoax. I was suspicious last night when I saw the envelope the lawsuit came in was postmarked Philadelphia. We investigated and Dalton did not send it, did not authorize it and does not know who sent it. Further it was not his handwriting and it is not a jail envelope.", "Dalton was arrested 21 February 2016, and has been incarcerated at the Kalamazoo County Jail since.", "Brooke Binkowski is a former editor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]