["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In October 2020, readers asked Snopes to examine the authenticity of what appeared to be a tweet, posted on Sept. 18, 2020, predicting that U.S. President Donald Trump would announce he had contracted COVID-19 in October.", "On Oct. 2, Trump announced that he and First Lady Melania Trump had tested positive for COVID-19 amid dozens of positive tests by White House officials and prominent Republicans. In the days that followed, users of Facebook and Instagram shared a screenshot of a tweet by user @JohnCammo that stated:", "Trump’s October surprise will be the announcement of “his infection.” Fake, but quite dramatic. This twist will blow Biden off the screens, the “Trump COVID watch” dominating every minute of every day. Then, 14 days later, Trump will emerge, 100% cured by hydroxychloroquine.", "Those images were screenshots of a real tweet posted on Sept. 18, 2020, by @JohnCammo, whose name is not publicly available but who frequently tweets criticism of Trump and claims to live in rural California. An archived version of the tweet can be viewed here, establishing its authenticity, and the authenticity of its date.", "No evidence exists to demonstrate that Trump's COVID-19 diagnosis was anything other than real, and @JohnCammo appears to have been engaging in no more than idle speculation. For one thing, Trump \"emerged\" from his illness — he returned to the White House from Walter Reed National Military Medical Center four days after his diagnosis, not 14 — and as of Oct. 6, the White House has not stated that he was treated with hydroxychloroquine.", "Many other Twitter users made similar predictions of Trump's COVID-19 diagnosis. As one of the most talked-about public figures alive today, and as a 74-year-old man engaging in the activities of a presidential reelection campaign, it was inevitable that at least some social media users would speculate that Trump would contract COVID-19.", "One demonstrably false conspiracy theory held that Trump would be falsely diagnosed with COVID-19 before the first presidential debate on Sept. 29, thus providing an excuse for him to withdraw from all three debates against Democratic opponent Joe Biden.", "Conversely, several supporters of Trump promoted the same false conspiracy theory about the former vice president, predicting that Biden would be \"conveniently\" stricken by the illness in order to skip the debates:", "The Sept. 18 tweet posted by @JohnCammo was authentic, although the specific theory  advanced was either refuted or not supported by the available evidence. The prevalence of similar predictions by other social media users, about both Trump and Biden, demonstrates the ease with which social media users can engage in idle or malicious speculation, with little or no expectation of damage to reputations, even when they are proven wrong.", "CNN.  \"Here's Who Has Tested Positive and Negative for Covid-19 in Trump's Circle.\"\r\n  Accessed 6 October 2020.", "Baker, Peter and Maggie Haberman.  \"Trump Tests Positive for the Coronavirus.\"\r\n  The New York Times.  2 October 2020.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]