["About this rating", "On 15 September 2014, the InfoWars web site published an article about a purportedly worrisome incident in Jacksonville, Florida. According to the heavily conspiracy-oriented site, a 39-year-old teacher there had been suspended for giving an explicit sex-ed \"lesson\" to sixth grade students which included instructing them on how to utilize a strap-on dildo.  The article went into extensive detail and described a scenario that would likely make any parent of an 11- or 12-year-old child uneasy:", "Shocking images out of a classroom in Jacksonville, Florida illustrate how 11-12 year olds in 6th grade are being taught how to use strap-on dildos amidst a debate about sexual content finding its way into other Common Core subjects, material which has been attacked by some as pornographic.", "The pictures were taken by a student with a cellphone camera. They show a teacher demonstrating how to use a strap-on sex toy in a number of different positions.", "In one image, the teacher even shows how to insert the strap-on while her buttocks are in the air and her legs up over her head.", "In another image, the woman shows the children how to wear a harness to which the strap-on is attached.", "The photographs displayed in the original article were not in fact pictures of a Florida substitute teacher named Sharon Mercer, but rather pictures of Carlyle Jansen,  the founder and owner of Good for Her (a progressive, female-friendly sex store in Toronto, Ontario), who has upon occasion been invited to give talks about sexual health at Toronto-area high schools.  But Ms. Jansen told us that she also teaches sex ed classes for adult audiences, that the photographs displayed in the outrage-provoking article were snapped at a university-level (not a sixth grade) class, and that she \"would not have done those positions and discussed strap-ons to that extent in a high school setting.\"", "Instead, someone repurposed those photos and incorporated them into a post that read as a sort of melange of moral panics, touching on fears about the threat of common core curriculum, openly gay teachers, and general ambient concerns about acceptance of homosexuality in society. As quickly as it appeared, the InfoWars post evaporated as it was scrubbed from that site.", "That scrubbing may have taken place because the only other source for the claim about Sharon (or Sandra) Mercer, the \"proud LGBT\" teacher with an arsenal of marital aids that would make a sailor blush, traced to a post made by someone whose biography touted her work on the National Report, a fake news outlet:", "\"It's sick[,]\" said Nancy Watts, mother of two, and long time resident of Duval county. \"I went to this very same elementary school when I was a little girl. There were never any sort of these nasty classes back then. If a teacher had done something like what Ms. Mercer did, they would have been locked up in the county jail. How dare she leave the parents to explain all the disturbing mental images she has left our children with? Now my little girl thinks she may be gay. She can't be gay! She's only ten years old!\"", "In addition to the scrubbing of the InfoWars article about Ms. Mercer and the Common Core strap-on, the truthfulness of this item was doubtful because no legitimate news outlets covered the story. Given its outrageous elements and the involvement of several topically controversial aspects, it's highly unlikely such an incident would have gone unreported in the broader news media.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]