["This post -- shown below -- was published on Facebook on September 17, 2019. It has been shared more than 370 times.", "Below is a screenshot of the misleading Facebook post:", "The Sinhala-language text below the image translates to English as: “Thank you very much brother..What you did may have been a job.", "\"But you had a wish to look at the beauty of this more than us.. While as a country today we take pride in the Lotus Tower", "\"I couldn’t forget you as a youth ??”.", "The Lotus Tower in Colombo is the communications building unveiled by President Maithripala Sirisena on September 16, 2019.", "Here is a news report about the opening of the tower, majority-funded by China under its Belt and Road Initiative.", "The post's lengthy Sinhala-language caption translates to English in part as: “Since yesterday a certain group is talking about the beauty of the Lotus tower and its value. Another group is talking about the misappropriations committed through that…", "\"But many forgot the youth from the far-off village of Bakinikote, Moneragala who came to Colombo in search of a job and by some misfortune or luck managed to find a job as a worker on the Lotus Tower construction project. While he poured sweat to build this valuable creation for us, a small mishap cost him his life and we must speak at least one word about him.", "\"May this small note be a mark of gratitude for your sacrifice my brother! May you attain Nirvana! May the triple gem bless you!\"", "The same images were shared hundreds of times after being published in a Facebook post here with a similar claim.", "Two of the same images in the post showing a person hanging from the Lotus Tower can also be seen in another Facebook post here with a similar claim. The post was shared more than 13,000 times.", "The claim is false. A reverse image search on Google for the photo of the tower in the misleading posts found this article published by the Sri Lanka Mirror on June 14, 2018.", "It features an image of a worker suspended from the Lotus Tower by wire cables.", "Below is a screenshot of the images in the misleading post (L) and the image published by the Sri Lanka Mirror (R):", "The young man pictured in the misleading post is alive and well. He is IT Executive Ishara Anjana from Colombo.", "In a Facebook messenger conversation with AFP on September 19, 2019 Ishara said a photo of him was used in a misleading post on social media about his alleged death as a prank by a friend. The original post has since been deleted.", "“I doubt even he expected the post to go viral. It was a prank played using a photograph uploaded by another friend of mine,” he explained.", "Anjana said the photo below -- circled by AFP -- is the one used in the misleading post.", "Below is a comparison between the photo of Anjana outlined in red (R), and the photo used in the misleading post (L).", "Separately, local media reported one person died during the construction of the Lotus Tower after falling down the tower's lift shaft.", "The misleading post claimed the worker who died was from a village in the Northwestern Moneragala district, but local media - for example here and here - quote police saying he was actually from a town in Northern Sri Lanka. This reports say the victim was 19-year-old Koneswaran Nidharshan - from the northern town of Kilinochchi.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]