["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker, appearing here at a middle school in Platteville in February 2017, is criticized for cutting aid to schools but nevertheless claims he has made a \"record investment\" in them. (Associated Press)", "Near the end of a TV ad that features an elementary school teacher from Racine, Gov. Scott Walker declares:", "\"With a record investment in schools … we’re putting students first.\"", "The ad, released June 19, 2018, as part of Walker’s campaign to win a third term, has turned some heads. It’s a claim he essentially repeats on the official governor’s website.", "In the run-up to the Aug. 14, 2018, primary election, which pits eight candidates seeking the Democratic nomination, Walker’s spending on schools has been an issue. And it’s likely to be debated ahead of the Nov. 6, 2018, general election, as well.", "A record investment?", "That’s misleading.", "What does ‘record’ mean?", "In one of our latest fact checks, on a claim by Democratic gubernatorial candidate Mahlon Mitchell, we reported that Walker’s first two-year state budget, for 2011-’13, cut state funding to schools by nearly $800 million. Since then, Walker has gradually put back more than $1 billion.", "But the initial cut certainly put him in the hole, in terms of achieving \"record\" school funding.", "And what does Walker -- who has a history of using different phrasing to claim exceptional funding -- mean by \"record,\" anyway?", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "In the ad, as Walker begins to speak, words on the screen cite a February 2017 Milwaukee Journal Sentinel article for support.", "We found it’s a news article reporting that Walker’s state budget for 2017-’19 proposed $11.5 billion over the two years for schools — a new high, before accounting for inflation, which of course is crucial in comparing dollars over time.", "Walker’s campaign confirmed to us the $11.5 billion figure is what Walker relies on in making his \"record investment\" claim.", "That figure rings a (school) bell.", "All our fact checks in the governor’s race.", "Prior fact check", "When Walker introduced his 2017-’19 budget in February 2017, he made a claim very similar to the one in the new TV ad, saying: \"We are investing more money into education than ever before in the history of Wisconsin.\"", "We rated that claim Mostly False.", "We found that the $11.5 billion is the largest two-year tally in state history -- in raw dollars, but not so when taking into account inflation, based on figures provided to us then by the nonprofit Wisconsin Taxpayers Alliance.", "The alliance, which has since merged to become part of the Wisconsin Policy Forum, did calculations for us dating back more than 25 years:", "State budget", "Inflation adjusted", "2017-’19 (Walker)", "$11.6 billion", "2015-’17 (Walker)", "$11 billion", "2013-’15 (Walker)", "$10.8 billion", "2011-’13 (Walker)", "$10.6 billion", "2009-’11", "$12 billion", "2007-’09", "$12.5 billion", "2005-’07", "$12.9 billion", "2003-’05", "$12.7 billion", "2001-’03", "$12.9 billion", "1999-’01", "$12.6 billion", "1997-’99", "$11.8 billion", "1995-’97", "$9.9 billion", "1993-’95", "$7.78 billion", "1991-’93", "$7.08 billion", "So, adjusting for inflation, the seven state budgets prior to Walker’s taking office spent more on schools than Walker’s current budget does.", "But, as we found in the earlier fact check, Walker’s statement has only an element of truth, when considering the funding without regard to inflation.", "His claim of a \"record\" suggests a new high mark in real terms. But with inflation, his current school funding is well below that of several other budgets.", "Walker says he made \"a record investment in schools.\"", "He refers to the $11.5 billion being spent on kindergarten-through-12th grade schools in his 2017-’19 state budget. In raw dollars, that is a record in Wisconsin.", "But inflation, of course, is crucial in measuring dollars over time. On that score, seven state budgets spent more on schools than Walker’s current budget does.", "The governor’s statement contains an element of truth, but ignores critical facts that would give a different impression, making it Mostly False.", "YouTube, Scott Walker TV ad, June 19, 2018", "Email, Scott Walker campaign spokesman Austin Altenburg, Aug. 1, 2018", "Email, Wisconsin Democratic Party spokesman TJ Helmstetter, July 31, 2018", "Email, former Wisconsin Taxpayers Alliance research director Dale Knapp, Aug. 2, 2018", "Interview, Wisconsin Department of Public Instruction spokesman Tom McCarthy, Aug. 2, 2018", "Wisconsin Taxpayers Alliance, inflation-adjusted figures on school spending", "PolitiFact Wisconsin, \"Testing Scott Walker claim on record education funding in Wisconsin,\" May 17, 2017", "Milwaukee Journal Sentinel, \"Wisconsin Governor Scott Walker proposes $649 million more for state schools,\" Feb. 5, 2017", "PolitiFact Wisconsin, \"Mahlon Mitchell has a point, but mostly misses in his attack on Scott Walker over school funding,\" Aug. 1, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]