["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Christy Smith is a California state lawmaker and former school board member running against Rep. Mike Garcia (R-Cali.) for the 25th District congressional seat, north of Los Angeles. In this 2018 file photo, she casts a vote in Sacramento. (AP)", "As a member of the Newhall School Board, Smith voted in 2012 to lay off teachers and in 2013 to notify teachers of possible layoffs. She also voted soon after those moves to rehire for nearly all of the positions.", "California school districts often send notices of possible layoffs to teachers early in their budget cycle, while the state budget picture remains unknown. The notices can be rescinded once the budget situation is clarified.", "Smith joined in a 5-0 vote to raise the $250 monthly stipend of Newhall board members by $12.50.", "A TV ad attacking California congressional candidate Christy Smith portrays the former school board member as being anti-teacher.", "\"When California faced a budget crisis,\" it says over menacing music, \"Smith voted to lay off teachers and then voted to increase her pay.\"", "The ad is referring to votes that Smith cast more than six years ago during her nine-year tenure as a local school board member.", "However, the ad lacks context and tells only part of the story. Her votes ultimately led to the layoff of only one permanent teacher. Smith did vote once to raise the $250 monthly stipend of school board members by 5%.", "The ad is from the Congressional Leadership Fund, a super PAC that works to elect Republicans to the House. Smith, a California assemblywoman elected in 2018, is running against Republican Rep. Mike Garcia on Nov. 3 for the 25th District congressional seat, north of Los Angeles.", "Garcia, a former military pilot, defeated Smith in a special election for the seat in May. That election was held to replace Democrat Katie Hill after she resigned.", "The race is one of 18 pivotal House and Senate contests up for election on Nov. 3 that PolitiFact is tracking. It is rated a tossup by the nonpartisan Cook Political Report.", "The ad alludes to May 2012, when California’s governor announced that the state budget deficit was $16 billion, much wider than the $9 billion that had been estimated four months earlier. State officials were preparing to make further budget cuts to schools and other programs.", "The ad cites three votes Smith took on the Newhall School Board, on which she served from 2009 until her election to the Assembly in 2018.", "Asked for evidence of the ad’s claims, the Congressional Leadership Fund provided PolitiFact with what appear to be screenshots of portions of the minutes from three Newhall School Board meetings. PolitiFact obtained the full minutes for those votes and related votes.", "May 2012: The board voted 5-0 to lay off 17 temporary elementary school teachers and two permanent physical education teachers. Within two months, the board took two more votes — both 5-0 with Smith in favor — resulting in all of the temporary teachers being rehired and one of the physical education teachers being brought back full time and the other part time. So, the total loss was one-half of a physical education teacher position.", "March 2013: The board voted 5-0 to notify 26 temporary teachers of possible layoffs; and voted 3-1-1, with Smith abstaining, to lay off one permanent music teacher. The minutes don't state why Smith abstained, but they say current and former students and parents expressed concern about the effect on the music program of losing the position. Sixteen temps were rehired three months later, with Smith joining in a 5-0 vote for the rehiring.", "Marc Winger, who was the Newhall superintendent at the time and is now Smith’s campaign treasurer, said California law requires school districts to issue notifications of possible layoffs and that such notifications, which can be rescinded without layoffs being done, are common when districts’ finances are uncertain early in the year. The Newhall district sent possible layoff notices to temps even though their contracts were only for one school year, ending June 30, he said.", "When Smith served, the only compensation Newhall school board members received was a monthly stipend, though they could also opt to purchase health insurance through the school district, Winger said.", "On Dec. 9, 2014, the board voted 5-0 to approve \"an allowable 5% increase to their current monthly stipend,\" the minutes said. No other details were given.", "Winger said the stipend before the vote was $250. The vote raised the stipend by $12.50 per month.", "In response to a similar attack from the National Republican Congressional Committee, Smith’s campaign put out a statement in April from the president of the California Federation of Teachers that says the union is supporting her campaign. The campaign also cited awards Smith received from the California Teachers Association union in January.", "The Congressional Leadership Fund said: \"When California faced a budget crisis,\" Smith \"voted to lay off teachers and then voted to increase her pay.\"", "Smith voted in 2012 to lay off 17 temporary elementary school teachers and two permanent physical education teachers. Within two months, however, she also voted in favor of rehiring all of the temporary teachers, and one of the physical education teachers. The second physical education teacher was brought back part time. A vote she took in 2013 was to notify temporary teachers of possible layoffs.", "Smith did vote in 2014 for a $12.50 increase in a monthly stipend for board members, their only compensation.", "The statement about Smith’s votes on teacher layoffs ignores the fact that Smith also voted to rehire all the teachers, ultimately only losing a half of a position. And the claim about Smith’s vote on pay leaves out the fact that the increase amounted to $12.50 per month, important clarifying information. Overall, the claim this ad makes is partially accurate but leaves out important details. We rate it Mostly False.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "YouTube, Congressional Leadership Fund \"Christy Smith, again\" ad, Sept. 9, 2020", "Email, Congressional Leadership Fund spokesman Calvin Moore, Sept. 17, 2020", "Email, Christy Smith spokeswoman Danni Wang, Sept. 17, 2020", "CNN, \"Pension reform is key to California's budget crisis,\" May 16, 2012", "New York Times, \"Shortfall in California’s Budget Swells to $16 Billion,\"", "The Signal, \"Marc Winger — Don’t Reward NRCC Strategy,\" April 10, 2020", "Christy Smith campaign, news release, April 2, 2020", "Christy Smith campaign, news release, Sept. 15, 2020", "California Teachers Association, \"CTA Organizes for ‘Fight of Our Generation,’\" Jan. 27, 2020", "Interview, Christy Smith campaign treasurer and retired Newhall School District superintendent Marc Winger, Sept. 21, 2020", "Email, Newhall School District superintendent Jeff Pelzel, Sept. 22, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]