["Syrian refugees at a crossing gate near Suruc, Turkey, on Sept. 25, 2014. (AP Photo)", "Background checks on refugees seeking to enter the United States are among the most stringent in the world.", "California Congressman Tom McClintock recently claimed, however, those screenings were anything but strict under the Obama Administration.", "\"The vetting was very haphazard,\" McClintock said in a Jan. 31, 2017, interview with Capital Public Radio. \"In many cases, we simply accepted the word of applicants.\"", "McClintock is a Republican from the Sacramento area.", "In the interview, McClintock said he supports President Donald Trump’s immigration order, which temporarily bans all refugees from entering the country and indefinitely bars Syrian refugees.", "In addition to the refugee halt, Trump’s executive action also suspends immigration for citizens of seven majority Muslim countries for 90 days. They are: Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.", "McClintock said Trump is rightly taking time to create a new vetting system because, as he put it, Obama’s was \"very haphazard.\"", "Given the ongoing immigration debate, we decided to fact-check McClintock’s statement.", "Before we start, here’s some background on refugees:", "The federal government defines a refugee as any person outside of the U.S. that is of special humanitarian concern to the U.S. and \"has a well-founded fear of persecution on account of race, religion, nationality, membership in a particular social group, or political opinion,\" according to the Pew Research Center.", "Trump’s executive action affects many categories of immigrants from students to employees to refugees.", "Refugees, notably, have not been the primary perpetrators of any of the country’s major terror attacks that killed Americans in recent decades. Trump has said his order was necessary to ensure national security.", "Our research", "When asked about McClintock’s claim, Jennifer Cressy, a spokeswoman for the congressman said he was referring to testimony Congress received in 2015 from federal law enforcement that \"the vetting process hinges on the word of the applicant due to lack of reliable documentary proof of identity.\"", "That testimony focused on Syrian refugees, which have accounted for a small but growing share of refugees admitted to the country.", "As our national partner PolitiFact has reported, there are undoubtedly challenges to vetting refugees. No system is foolproof.", "The head of the National Counterterrorism Center told Congress in October 2015 that the intelligence in Syria is \"not as rich as we would like it to be,\" while FBI Director James Comey told Congress that there are \"gaps\" in data availability.", "The lack of U.S. relationships with Syrian government and law enforcement and the use of fake passports and fraudulent documents are also causes for concern, Jessica Vaughan of the Center for Immigration Studies, told PolitiFact in November 2015. CIS advocates for limited immigration.", "There are examples of refugees accepted under Obama who joined, or attempted to join, terror networks in the Middle East after arriving in the United States. Cressy, McClintock’s spokeswoman, pointed to Aws Mohammed Younis Al-Jayab, a refugee who after arriving in the U.S. traveled to Syria to fight for the Nusra Front, and then returned to settle in Sacramento. He is awaiting trial on terrorism charges.", "There are no examples, however, of any refugee committing fatal terror attacks on U.S. soil since the 1970s. More than three million refugees have arrived in the country since that time, making the odds of an American falling victim to a refugee in a terror attack miniscule, as PolitiFact California recently examined.", "McClintock’s claims about \"very haphazard vetting\" and that \"we simply accepted the word of applicants\" are overly broad and do not match up with how refugee screenings work.", "Refugee advocate responds", "Karen Ferguson is executive director of the Northern California International Rescue Committee, which helps resettle refugees in the United States. She responded to McClintock’s claim in an interview on Capital Public Radio’s Insight show early this month.", "\"The idea that it would be haphazard is erroneous,\" Ferguson said. \"The vetting system now takes anywhere from 16 to 36 months. It includes screenings from the Department of Homeland Security, the Department of Defense, State Department, the National Counterterrorism Center, FBI, and the U.S. Intelligence Community.\"", "\"There have always been multiple interviews, additional interviews,\" Ferguson added. \"So, the vetting process is already there. And this statement that it’s been haphazard needs to be countered. It’s not true. And (refugee vetting) has been proven to be effective.\"", "For a fact-check in November 2015, PolitiFact spoke with experts and advocates who pushed back on the notion that the United States accepts refugees with no intelligence at all. In contrast to refugees worldwide, Syrians tend to have identity documents and the reasons they give for missing documents (i.e. a barrel bomb dropping on their house) can be verified, according to the State Department.", "Steps in vetting process", "The U.S. refugee admissions process has been in place since 1980 and was strengthened after 9/11.", "PolitiFact has outlined its many steps this way:", "Before refugees even face U.S. vetting, they must first clear an eligibility hurdle. The United Nations is the main authority that determines who counts as a refugee, who should be resettled (about 1 percent) and which countries would take them. This can take four to 10 months.", "Once the cases are referred to the United States, refugees are vetted through a process that involves multiple federal intelligence and security agencies. Typically, about half of refugees are turned down, according to the State Department.", "Refugees undergo several rounds of security clearance checks. Their names, biographical information and fingerprints are run through databases coordinated by the FBI, the State Department, the Department of Homeland Security and the Department of Defense.", "For Syrian refugees, there’s one additional step. Their filings with the UN and initial documents submitted to the U.S. program are reviewed. Information about where they came from, what caused them to flee and what their experiences were like are cross-referenced with classified and unclassified information.", "McClintock’s claim about \"haphazard vetting\" comes as the U.S. grapples with how to ensure Syrian refugees are fully-vetted. Advocates for the stronger vetting, including the congressman, have described Syria as \"a hot-bed for terrorism.\"", "Experts on this process, however, say the United States has successfully vetted refugees from similarly challenging countries in the past.", "\"We’ve also resettled thousands in recent years from the Central African Republic, Somalia, and the Democratic Republic of Congo, all of which have faced similar terrorist threats and have unstable governments that present challenges for the vetting process. But we’ve done this successfully time and time again without incident,\" Geoffrey Mock, the Syrian country specialist for Amnesty International USA, told PolitiFact in 2015.", "Our ruling", "California Rep. Tom McClintock recently claimed refugee vetting was very haphazard,\" under the Obama Administration. \"In many cases, we simply accepted the word of applicants.\"", "Federal law enforcement told Congress in 2015 that there are gaps in the available data for Syrian refugees, which represented a small but growing share of the refugees admitted to the United States under Obama.", "All sides in this debate acknowledge no vetting system is foolproof.", "McClintock’s claim about a \"haphazard system,\" however, ignores the facts.", "The United Nations examines refugee applications and designates a small fraction as eligible. From there, refugees under consideration by the U.S. undergo a strict process that can last up to three years and involves multiple federal intelligence and security agencies.", "Their names, biographical information and fingerprints are run through databases coordinated by the FBI, the State Department, the Department of Homeland Security and the Department of Defense.", "Of the more than 3 million refugees admitted to the country since 1980, none has carried out a fatal terrorist attack on U.S. soil.", "Advocates for the process say this is evidence the vetting works and is already robust.", "Given the challenges with Syrian refugee vetting, there’s an element of truth in McClintock’s statement. But his claim ignores critical facts that would give a different impression.", "We rate it Mostly False.", "MOSTLY FALSE – The statement contains some element of truth but ignores critical facts that would give a different impression.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "https://www.sharethefacts.co/share/233732a3-c823-44cc-826f-c09a823214e9", "Rep. Tom McClintock, interview with Capital Public Radio, Jan. 31, 2017", "Interview, Jennifer Cressy, spokeswoman, Rep. Tom McClintock, Feb. 2, 2017", "Cato Institute, Terrorism and Immigration: A Risk Analysis, September 2016", "Migration Policy Institute, Ten Facts About U.S. Refugee Resettlement, October 2015", "Karen Ferguson, executive director, Northern California International Rescue Committee, interview on Insight, Capital Public Radio, Feb. 2, 2017", "PolitiFact, Ben Carson: 'There is currently no ability to vet' Syrian refugees, Nov. 19, 2015", "PolitiFact Wisconsin, Federal government doesn't give information on Syrian refugees who come to Wisconsin?, Jan. 6, 2017", "PolitiFact California, MOSTLY TRUE: Odds of fatal terror attack in U.S. by a refugee? 3.6 billion to 1, Feb. 1, 2017", "Politico Magazine, \"I Went Through America’s Extreme Vetting,\" Jan. 28, 2017", "Capital Public Radio, Sacramento Man Arrested On Suspicion Of Terrorism Connection, Jan. 7, 2016", "The Washington Times, Iraqi refugee admits terrorist intentions in black eye for Obama’s resettlement program, Oct. 18, 2016", "New York Times, Refugees Entering the U.S. Already Face a Rigorous Vetting Process, Jan. 29, 2017", "Washington Free Beacon, Obama Plan to Cut Refugee Screening Time Raises Concerns About Terrorism, May 3, 2016", "The Washington Times, Obama vetting procedures allowed Iraqi terrorists into U.S., Jan. 31, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]