["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In what could be a prelude to the Republican presidential debate season, a handful of potential GOP contenders shared a stage at a recent conservative confab hosted by the deep-pocketed Koch brothers.", "Sens. Marco Rubio of Florida, Rand Paul of Kentucky and Ted Cruz of Texas cordially sparred on a host of issues at the Freedom Partners retreat on Jan. 25. One area of division was about whether to expand the Earned Income Tax Credit. The program is designed to incentivize low-income individuals to work by giving them a tax refund (technically a refundable tax credit) on money that is earned. For the very poor, the refund increases the more money they make, which encourages more work.", "Expanding the Earned Income Tax Credit is one area where there’s some agreement between President Barack Obama and Rep. Paul Ryan, R-Wis., the GOP’s go-to member for fiscal issues.", "But Rand Paul said Washington needed to pump the brakes on those proposals.", "\"When you look at the earned income tax credit, it has about a 25 percent fraud rate,\" Paul said. \"We're looking at $20 billion to $30 billion. And this is from estimates from the (Government Accountability Office), from the government themselves.\"", "We decided to check to see if Paul’s numbers add up. There are definitely problems with the Internal Revenue Service’s administration of the Earned Income Tax Credit, but they’re not all issues of fraud, as Paul claimed.", "In multiple reports, the Treasury Inspector General for Tax Administration has dinged the IRS for failing to take steps to prevent improper payments.", "Since 2002, the IRS has been required to report estimates of improper payments to Congress. In that time, \"the IRS has made little improvement in reducing improper Earned Income Tax Credit payments,\" the inspector general wrote in 2013.", "The Earned Income Tax Credit is the only IRS program that is considered a high-risk for improper payments, the inspector general said in 2014. At the root of the problem is the complex nature of the tax credit: It is available to only low-income individuals, and it fluctuates based on earnings, number of children and other factors. The churn into and out of the program is high — about one-third of all recipients are first-timers, or their eligibility changes year-to-year due to swings in their income. This creates confusion among both recipients and administrators.", "The IRS said it is difficult to balance reducing improper benefits with encouraging people who qualify to use the credit.", "How prevalent are these improper payments? According to the inspector general, 22 to 26 percent of all payments are improper.", "And how much does that cost taxpayers? The entire program totaled $63 billion in 2013, meaning improper payments ranged from $13.3 billion to $15.6 billion.", "So Paul’s percentage was right, but he overstated the actual annual cost.", "Paul’s statement, his spokesman Brian Darling said, also included another tax credit highlighted by the auditor’s 2014 report, the Additional Income Tax Credit, which similarly provides refunds for some working families with children. The inspector general found improper payments between $5.9 billion and $7 billion in 2013. Combined, improper payments from the two programs would likely top $20 billion.", "Not all improper payments, however, are \"fraud,\" as Paul put it. There are six issues that have led to improper payments, one of which is fraud. But none of them \"can be considered the primary driver of the (Earned Income Tax Credit) improper payments,\" the report said.", "Improper payments had two root causes: authentication and verification.", "For example, an authentication problem would be if a parent claims a child that doesn’t live with the parent most of the time. A verification problem would be if a person claims to have a lower income than they have. About 70 percent of improper payments are due to authentication problems.", "\"The biggest source of error has to do with family status,\" said Eric Toder, co-director of the Tax Policy Center and former director of research at the IRS. \"The size of the EITC has to do with how many kids you have, and the definition of ‘child’ means they’re living with you half the time. And in many low-income homes, kids go back and forth between one parent or another, and it’s not obvious who should be claiming the child, or they’re claiming the child they shouldn’t be.\"", "Of course, there are also ways to make mistakes filing income taxes under both scenarios. The IRS doesn’t keep track of how many improper payments are due to fraud and how many are due to human error. Paul’s spokesman said the distinction is negligible.", "\"At a minimum it is a fraud on the taxpayer, because they are the source for improper payments,\" Darling said.", "Why have there habitually been issues stopping these improper payments?", "Unlike other federal assistance like food stamps, which require an in-person application process to weed out potential fraud, the tax credit is handled entirely by the tax system.", "Another issue is the typical benefit per family is small. The average payout is about $3,000. The IRS might prioritize more costly fraud instead of targeting small-time scofflaws, Toder said.", "Attempts have been made in the past to increase the number of auditors to target fraud among these populations, Toder added. Other policy changes have attempted to fix the error rate, to little success.", "Our ruling", "Paul said the earned income tax credit has a 25 percent \"fraud rate\" at a cost to taxpayers of $20 billion to $30 billion.", "There is a history of improper payments with the Earned Income Tax Credit that has not been resolved, for various reasons, since the IRS began reporting it in 2002. It’s listed as the only IRS program deemed to have a high risk of improper payments.", "But Paul’s characterization of the problem as \"fraud\" is way too specific. Not every improper payment constitutes fraud, and the exact percentage of fraud is not known. Also, the amount of improper payments is less than Paul said -- between $13.3 billion and $15.6 billion.", "The statement is partially accurate but leaves out important details, so we rate the claim Half True.", "ABC News, \"Transcript: Freedom Partners Forum: Ted Cruz, Rand Paul and Marco Rubio In Conversation with ABC’s Jonathan Karl,\" Jan. 26, 2015", "Email interview with Brian Darling, spokesman for Sen. Rand Paul, Jan. 28, 2015", "U.S. Government Accountability Office, \"Improper Payments: Inspector General Reporting of Agency Compliance under the Improper Payments Elimination and Recovery Act,\" Dec. 9, 2014", "Treasury Inspector General for Tax Administration, \"The Internal Revenue Service Is Not in Compliance With Executive Order 13520 to Reduce Improper Payments,\" Aug. 28, 2013", "Treasury Inspector General for Tax Administration, \"Report: The IRS Must Do More to Reduce Improper Payments,\" Oct. 22, 2013", "Treasury Inspector General for Tax Administration, \"The Internal Revenue Service Fiscal Year 2013 Improper Payment Reporting Continues to Not Comply With the Improper Payments Elimination and Recovery Act,\" March 31, 2014", "Treasury Inspector General for Tax Administration, \"Existing Compliance Processes Will Not Reduce the Billions of Dollars in Improper Earned Income Tax Credit and Additional Child Tax Credit Payments,\" Sept. 29, 2014", "Eric Todder, co-director of the Tax Policy Center, Jan. 28, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]