["About this rating", "Gem 65 8-in-1 Multicooker from batchcodes 1728, 1730, 1731, 1734, and 1746 are being recalled and replaced after a small number of them overheated.", "Instant Pot pressure cookers are not affected by the recall; only Gem 65 8-in-1 Multicooker models with specific batch codes are affected.", "In February 2018, a Michigan woman's widely-shared account of a mishap with aGem 65 8-in-1 Multicooker spread across social media. Vanessa LaClair wrote:", "I received my Instant Pot Gem Multi Cooker as a christmas gift.", "And I've used it about 4 times and loved it. Needless to say, as I was preparing dinner today I noticed the bottom seemed to be comming apart. so curiously I picked it up and seen the bottom had melted and burnt the wires!", "They claim this to be a safe product on the website, But this could have cost me my home and at worst my family! Please check yours to see if you have one of these 4 digit batchcodes 1728, 1730, 1731, 1734, and 1746.", "if you contact Instant Pot they will tell you to stop using it immediately, but I searched everywhere online and there is no recall.", "While not directly referencing her complaint, the company clarified on its Facebook community page four days later that it had received \"a small number of reports\" about the Gem 65 8-in-1 Multicooker, was overheating and causing damage to its underside:", "We believe the problem only affects batchcodes 1728, 1730, 1731, 1734, and 1746. To verify the 4-digit batchcode, locate the silver label on the underside of the product. The batchcode is the 4-digit number located at the bottom right of the label.", "[...]", "We anticipate providing updated information and next steps regarding receiving a replacement Gem 65 8-in-1 Multicooker within the next few weeks. In the meantime, we are asking all our customers with a Gem 65 8-in-1 Multicooker from batchcodes 1728, 1730, 1731, 1734, and 1746 to immediately stop use of the product.", "We received additional information from the company about the claim, noting that \"Instant Pot pressure cookers\" were not in the minority of affected products:", "We have received a number of reports of the Gem 65 8-in-1 Multicooker overheating, resulting in localized melting damage to the underside of the product. We believe the problem only affects batchcodes 1728, 1730, 1731, 1734, and 1746. To verify the 4-digit batchcode, locate the silver label on the underside of the product. The batchcode is the 4-digit number located at the bottom right of the label. We want you to know that we take any problem with our products extremely serious as safety and quality are our primary concern, and we are working cooperatively with the US Consumer Product Safety Commission (CPSC).", "We anticipate providing updated information and next steps regarding receiving a replacement Gem 65 8-in-1 Multicooker shortly. In the meantime, we are asking all our customers with a Gem 65 8-in-1 Multicooker from batchcodes 1728, 1730, 1731, 1734, and 1746 to immediately stop use of the product.", "If you have any questions, please do not hesitate to contact our Customer Care team at 1.800.828.7280 x2. We are truly sorry for the inconvenience.", "In a follow-up statement, the company assured customers with models in those batches that the devices would be replaced free of charge and that they continued working with the CPSC:", "Thank you for your patience as we work cooperatively with the Consumer Product Safety Commission (CPSC) on the Gem 65 8-in-1 Multicooker.", "We are working as quickly as possible while ensuring we respect the CPSC process. We can assure you, you will soon receive instructions on how to receive a free replacement Gem 65 8-in-1 Multicooker. In the meantime, we again ask that you stop using your Gem 65 8-in-1 Multicooker.", "We anticipate receiving additional information soon, and we will provide an update regarding replacement products as soon as possible.", "We are truly sorry for the inconvenience.", "The company issued a recall in March 2018 after the U.S. Consumer Product Safety Commission reportedly received 107 complaints conerning the Gem 65 8-in-1 device. Five of those complaints mentioned instances of damaged property. Users were asked to return their devices to Walmart to get free replacement cookers.", "Meyer, Zlati.  \"Instant Pot Recalls Cooker over Potential Fire Hazard.\"\r\nUSA Today.  2 March 2018.", "Update [25 February 2018]: Added clarification on models; changed image to reflect said clarification; changed truth rating from True to Mixture.", "Update [5 March 2018]: Added note regarding product recall for the Gem 65 8-in-1 cookers.", "Kim LaCapria is a former writer for Snopes.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]