["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Korean War Marine veteran Alen Elfman salutes with other veterans as the Morris F. Dixon, Jr., Detachment Marine Corps League presents the colors during Veterans Day Services Nov. 11th, 2016, in Palm Harbor, Fla. (Jim Damaske/Tampa Bay Times)", "For over a year, Democrats have said they want to expand Medicaid to provide more health insurance coverage for the poor.", "North Carolina has participated in the program since 1970, but is one of 17 states that hasn’t expanded its coverage in recent years.", "Gov. Roy Cooper and others say expanding Medicaid would provide coverage for hundreds of thousands of North Carolinians. And, according to Cooper, tens of thousands are military veterans.", "\"It is embarrassing that 30,000 veterans in North Carolina have no health insurance and if we expand Medicaid 23,000 of them will,\" Cooper said in an interview with The News & Observer that was posted on Twitter.", "Cooper isn’t the first North Carolina Democrat to make this claim. In September, state Senate candidate JD Wooten made a similar statement in a campaign video.", "\"My opponent, Rick Gunn, blocked the expansion of Medicaid — costing half a million people health insurance, including at least 23,000 veterans,\" Wooten said in a caption posted with the video.", "PolitiFact looked at several elements in Wooten’s claim — Did Gunn vote to block a Medicaid expansion bill? Did that vote prevent 500,000 people from acquiring health insurance? Were 23,000 veterans among those affected? — before rating the claim Mostly True.", "With that in mind, let’s focus on the first part of Cooper claim. Is it true that 30,000 veterans are without health insurance? PolitiFact couldn’t find statistics for 2018, 2017 or 2016. And the U.S. Department of Veterans Affairs doesn’t track the number of uninsured veterans, a spokeswoman told PolitiFact on Thursday.", "However, we found credible data from 2015 and 2014. Based on those reports, Cooper’s estimate appears to be on point.", "A PAIR OF STUDIES", "Contacted by PolitiFact, Cooper’s office cited one of the same sources mentioned in the Wooten fact check: a 2016 study on the effects of the Affordable Care Act on veterans.", "The study was conducted by the Robert Wood Johnson Foundation, a nonprofit philanthropic organization that focuses on health care; and the Urban Institute, a think tank that researches the effects of economic and social policies.", "(When contacted by PolitiFact, the NC Department of Health and Human Services also cited this Urban Institute report. The NC DHHS doesn’t track uninsured veterans, said Chris Mackey, the department’s director of communications.)", "The study says there were 30,000 uninsured veterans in North Carolina as of 2014. It had been 43,000 in 2013.", "Cooper’s office also cited a 2017 report by the Kaiser Family Foundation, a leading authority on health care research.", "North Carolina was home to 26,680 uninsured veterans in 2015, according to a chart in Kaiser’s report on Medicaid’s Role in Covering Veterans. The chart represents Kaiser’s most recent estimate, according to Craig Palosky, Kaiser’s director of communications.", "So Cooper’s number seems reasonable. It’s possible the number of uninsured veterans has fluctuated since 2015. But available estimates put his claim on the money, or within 3,320 veterans.", "WHO IS UNINSURED?", "Don’t all veterans have insurance through the military or the VA? Not necessarily.", "Unless veterans were dishonorably discharged, the VA website says most are eligible for some sort of coverage. There are variables that determine the extent of a veterans’ coverage. But most who served at least 24 continuous months after enlisting in September 1980 or entering active duty in October 1981 are eligible for some sort of coverage.", "However, there are so many other considerations. And in 2016, about 510,000 veterans lacked insurance, according to the U.S. Census Bureau.", "\"Eligibility for the VA health care system is based on veteran status, service-connected disability status, income level and other factors. Moreover, not all eligible veterans actually use VA for their health care, and some may not realize they are eligible for VA health care,\" the Census bureau wrote in a report published in 2017.", "The Census Bureau also found that the number of low-income veterans on Medicaid increased between 2013 and 2016.", "\"Between 2013 and 2016, the percentage of working-age veterans who had Medicaid increased most for those who lived in poverty. The number of working-age veterans with Medicaid also increased during this period,\" the bureau reported.", "The VA says veterans with questions can call its health benefits helpline at 1-877-222-8387 Monday through Friday between 8 a.m. and 8 p.m. Eastern Standard Time.", "OUR RULING", "Cooper said 30,000 veterans in North Carolina have no health insurance. PolitiFact doesn’t know how many veterans lack health insurance as of 2019.", "While we wish Cooper had used the word \"estimate\" in his statement, his claim comes pretty close to estimates by two reputable organizations. One group said there are 30,000 as of 2014, and the other said there were about 26,600 as of 2015. It’s possible those numbers have fluctuated since then. With that in mind, we rate this claim Mostly True.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "A tweet by Adam Searing, Research Faculty Georgetown University and its Center for Children and Families.", "Email correspondence with Ford Porter, spokesman for Gov. Roy Cooper.", "Email correspondence with Chris Mackey, the director of communications for the North Carolina Department of Health and Human Services.", "The \"Health Benefits\" webpage on va.gov.", "Story by The News & Observer, \"The legislative session ends ‘when we get Medicaid expansion,’ says an aide to Gov. Cooper,\" posted Jan. 30, 2019.", "Fact check by PolitiFact, \"Wooten says blocked Medicaid affected half a million North Carolinians and veterans,\" published Sept. 5, 2018.", "Report by the U.S. Census Bureau, \"Health Insurance Coverage of Veterans,\" published Sept. 14, 2017.", "Report by the Urban Institute and funded by the Robert Wood Johnson Foundation, \"Veterans and Their Family Members Gain Coverage Under the ACA, but Opportunities for More Progress Remain,\" published September 2016.", "Report by the Kaiser Family Foundation, \"Medicaid’s role in covering veterans,\" published June 29, 2017.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]