["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Sen. David Vitter entered the Louisiana governor’s race this year as the clear front-runner. But a prostitution scandal from years ago has left Vitter, a veteran Republican with widespread name recognition in the deep red state, in a difficult race against a lesser-known Democrat, state Rep. John Bel Edwards.", "In Louisiana’s open primary on Oct. 24, Edwards finished first among four candidates; Vitter was a distant second. Two weeks later, Edwards’ campaign released an ad called \"The Choice.\" It highlights Vitter’s connection to \"D.C. Madam\" Deborah Palfrey, which was revealed in 2007 when an investigator working for Hustler obtained phone records from Palfrey and identified Vitter’s number.", "Vitter’s connection to Palfrey isn’t new. For years he avoided the issue after obliquely addressing it in 2007. It apparently had little effect on his 2010 bid for a second term in the Senate, which he won easily. But his connection to the D.C. Madam has percolated in this year’s governor’s race as new allegations emerged.", "Edwards’ ad, released the day before early voting began for the general election, put the issue on TV screens throughout the state. After it was released, \"Meet the Press\" host Chuck Todd said it \"might be the most vicious negative ad ever.\"", "The ad features a female narrator who says:", "The choice for governor couldn’t be more clear. John Bel Edwards, who answered our country’s call and served as a ranger in the 82nd Airborne Division, or David Vitter, who answered a prostitute’s call minutes after he skipped a vote honoring 28 soldiers who gave their lives in defense of our freedom. David Vitter chose prostitutes over patriots. Now the choice is yours.", "The ad makes two claims about Vitter: He skipped a vote for a resolution honoring American soldiers killed in the line of duty, and he answered a call from Palfrey’s phone soon after. It then concludes that Vitter \"chose prostitutes over patriots,\" suggesting the two are related.", "The basics are not hard to substantiate.", "Then-U.S. Rep. David Vitter did, in fact, miss the vote in question. On Feb. 27, 2001, the House overwhelmingly passed a resolution to honor 28 soldiers killed in 1991 during Operation Desert Storm, with 395 votes in favor. Two congressmen answered \"present\" but did not vote. Vitter was one of 35 marked absent.", "We asked Vitter’s campaign where he was that day, but the campaign declined to answer.", "There were no other roll-call votes that day, according to House records, nor were there any the day before, the first day after a congressional recess.", "That vote was recorded at 5:27 p.m. ET. Thirty-nine minutes later, at 6:06 p.m. in Washington, a call was placed from Palfrey’s cell phone to Vitter’s, according to her cell phone records. It lasted about a minute.", "However, the presence of a call on a phone bill doesn’t mean that Vitter picked up, rather than his voicemail. (If you find this fascinating, we recommend the podcast \"Serial,\" which explores such issues in detail.)", "Vitter has never directly admitted or denied patronizing Palfrey’s service, though he’s come close. In 2007, after media outlets reported Hustler’s findings, he apologized in a statement for a \"very serious sin\" but didn’t elaborate. He’s been similarly evasive during this year’s governor’s race.", "In an ad his campaign released after \"The Choice,\" Vitter says, \"Fifteen years ago, I failed my family,\" but it elaborates no further. Asked this week during a debate if he took the call, Vitter refused to answer.", "Likewise, Vitter’s campaign did not respond to our questions about the ad. Edwards’ campaign did not respond to a request for additional evidence beyond what’s cited in the ad. (Palfrey died in 2008.)", "With Vitter unwilling to talk, we wondered if he was even in Washington that day, considering that Feb. 27, 2001, was Mardi Gras.", "That’s a big deal in Louisiana, and Vitter has expressed great personal fondness for the holiday. Considering that Carnival coincided with Congress’ winter break, it was possible that Vitter was back in Louisiana.", "But he was in Washington that night. As Louisiana State University Professor Robert Mann noted in a recent Salon column, President George W. Bush addressed a joint session of Congress at 9 p.m. Vitter is visible in the audience about 24 minutes in and a half-hour later.", "Moreover, a House report, detailing members’ use of congressional funds for office and travel expenses, shows that Vitter claimed an airfare expense that day. Flight records from the Bureau of Transportation Statistics show five direct flights from New Orleans to Washington-area airports that day prior to Bush’s speech. Arrival times ranged from 10 a.m. to 4:30 p.m.", "There, our reporting on this track reached a dead end.", "Our ruling", "Edwards’ ad says Vitter took a call from a prostitute minutes after skipping the vote. The only thing we don’t know is if Vitter answered his phone. Even if he didn’t, he has still been connected to the D.C. Madam.", "\"The Choice\" doesn’t quite close the deal in suggesting that Vitter missed the vote because of his dealings with a prostitute, which is what it suggests when it says he \"chose prostitutes over patriots.\"", "But the key parts of the statement in question — that Vitter \"answered a prostitute’s call minutes after he skipped a vote\" — are accurate. We rate this statement Mostly True.", "This story was published in collaboration with The Lens, a nonprofit, public-interest newsroom that covers the New Orleans area. Donate now to support The Lens. The Lens will be covering live results of the Nov. 21 election.", "Times-Picayune, \"Vitter had five calls with D.C. Madam,\" July 11, 2007", "Hustler press release, via the Times-Picayune, July 11, 2007", "Roll Call records, U.S. House of Representatives Clerk", "Statement of Disbursements of the House of Representatives, via the Boston Public Library", "Salon, \"David Vitter hooker shocker: New charges that Louisiana pol missed vote honoring soldiers while scheduling prostitute rendezvous,\" Nov. 6, 2015", "Presidential Economic Address, via C-SPAN, Feb. 27, 2001", "Airline On-Time Statistics, Bureau of Transportation Statistics", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]