["The doctored image of a CNN report was published here in a Facebook post on August 27, 2019. It contains a purported screenshot of a CNN broadcast hosted by anchor Wolf Blitzer which combines a supposed photo of Duterte with a Breaking News ticker saying: “President of Amazon asked help from Rodrigo Duterte”.", "Underneath the screenshot is text saying: “Why is this not being reported in Mainstream media?!”", "Below is a screenshot of the post:", "The misleading post’s Tagalog language caption translates to English as: “Wow! The president of the Country of Amazon!", "“Approached our beloved President Rody Rodrigo Duterte Roa Duter30 to ask for help", "“Why did the Mainstream Media did not report on this? WE KNOW WHY! THEY ARE YELLOWS!!! YELLOW SHIT", "“LIKE if you support the Federation Government”.", "“President Rody Rodrigo Duterte Roa Duter30” refers to Philippine President Rodrigo Duterte who was elected in May 2016.", "He is also known as “Rody”, and “Duter30” is used as a hashtag by his supporters on social media, for example here.", "“Yellows” is a pejorative term used to describe the supporters and members of the Liberal party, the main political opposition.", "The Federation government refers to the Philippines’ shift to federalism, which Duterte has pushed for.", "The post has also been shared on Facebook here with a similar claim.", "The claim the Amazon asked Duterte for help is false. There is no country called “Amazon”.", "The Amazon is an area spanning Brazil, Bolivia, Peru, Ecuador, Colombia, Venezuela, Guyana, Suriname and French Guiana, which contains “half of the planet’s remaining tropical forests,” according to the World Wildlife Foundation here.", "Parts of the Amazon rainforest have been burning over the summer, prompting many countries to offer help. Here is an AFP report about the fires.", "A reverse image search on Google for the image in the misleading post found this site which creates memes. The template shows an identical image of Wolf Blitzer seen in the misleading posts, with a different doctored CNN banner.", "Below is a screenshot of the website:", "Presidential spokesman Salvador Panelo told AFP Duterte had not received any requests for help from the heads of any of the countries affected by the Amazon fire.", "“None,” he said in a phone call on September 11, 2019 when asked this question: “Has President Rodrigo Duterte received any request for help from any of the countries affected by the fire in the Amazon?”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]