["About this rating", "An off-the-cuff suggestion led to a Michigan university's drawing attention for implementing an unusual \"last resort\" measure to ward off possible mass shooting attacks.", "Local news outlets first reported that faculty and students at Oakland University, near Detroit, had acquired hockey pucks as a means of self-defense in the event of an armed assault.", "At least 2,500 pucks had reportedly been distributed on campus (where a no-weapons policy is in effect) since March 2018, when the idea was first suggested during a training session for teachers.", "\"It was just kind of a spur-of-the-moment idea that seemed to have some merit to it and it kind of caught on,\" averred campus Police Chief Mark Gordon, who said during the class that if hiding or escaping is impossible in the event of a shooting, teachers should be prepared to use any item as a weapon or a means of distraction.  However, he cautioned, this approach should be considered \"an absolute last strategy.\"", "Tom Discenna, a professor of communication and president of the faculty union, noted that the idea was based on just \"having something, a reminder that you’re not powerless and you’re not helpless in the classroom.\"", "The pucks distributed on campus also bore numbers that allowed users to contribute to a separate fundraising campaign for the purchase of interior locks for Oakland classrooms.", "We contacted the university seeking an update on the campaign without response, but at least some students expressed skepticism about using pucks against prospective shooters.", "\"If I was to give you a puck, and I had a gun, would I be able to take you out? Easily, yeah,\" said Jacob Gora, a senior. \"I mean, a puck is not going to distract me or stop me from shooting someone.\"", "Zaniewski, Ann.   \"Oakland University Using Hockey Pucks to Protect Against Active Shooters.\"\r\n    Detroit Free Press.   27 November 2018.", "\"OU Professors Trained to Fight Active Shooters Using Hockey Pucks.\"   YouTube (uploaded by WXYZ-TV).  \r\n      27 November 2018.   https://youtu.be/-Wqv28HhUug", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]