["The photo was published in this Twitter post on January 7, 2020.", "The caption reads: “Image is more powerful than screams of Greta. A silent girl is holding a koala. She looks straight at you from the waters of the ocean where they found a refuge. She is wearing a breathing mask. A wall of fire is behind them. I do not know the name of the photographer #Australia”.", "Below is a screenshot of the misleading post:", "As of January 7, bushfires have killed at least 25 people, destroyed more than 1,800 homes and burned millions of hectares of land across Australia, according to this AFP report.", "The photo has also been shared tens of thousands of times in Instagram posts in multiple languages, including here and here in English, here and here in French and here in Turkish, alongside hashtags about the Australian bushfires in January 2020.", "It was also shared here and here on Twitter, and here on Facebook alongside a similar claim.", "The claim is false; the image was digitally created by an artist based in Lake Illawarra in the Australian state of New South Wales.", "A reverse image search on Google found the image published here on Instagram and here on Facebook by the artist Thuie on December 22, 2019.", "Its been a sombre few days as fires are ripping through neighbouring areas. So todays art is dedicated all the brave FIREFIGHTERS who are trying to save Mother Earth and all her children. Countless trees, hundreds of koalas, homes and a couple of good humans lost to this disaster and it’s a reminder to all that the gift of Christmas, cannot be wrapped and put under the tree. #prayingforrainandamiracle #banksiiantics #photoshop Update **: This post has now gone viral please make sure that you mention it is a photoshop edit (this is what my account is known for) Thankyou Update: I can see that the wonderful IG is spreading awareness with this image, please if you can help with donations to either (or many others) Australian Red Cross Disaster Recovery and Relief Salvation Army Disaster Appeal St Vincent de Paul Society Bushfire Appeal (NSW community. NSW RFS Donations Page Make an online donation to the NSW RFS Trust Fund or a participating brigade", "A post shared by  Thu + Banksii + Denali (@thuie) on Dec 22, 2019 at 2:01am PST", "The Instagram post's caption states in part: “Its been a sombre few days as fires are ripping through neighbouring areas.", "“So todays art is dedicated all the brave FIREFIGHTERS who are trying to save Mother Earth and all her children.", "“Update **: This post has now gone viral please make sure that you mention it is a photoshop edit (this is what my account is known for) Thankyou”.", "Speaking to AFP’s French-language Fact Check team on January 6, 2020, Thuie said the image was created primarily from a photo of her daughter standing in water.", "“My work was intended to represent what we are going through right now, the fires, the people affected by these fires and the masks that those who live in endangered areas must wear, and the fact that animals are as affected as humans,” the artist said.", "New South Wales Premier Gladys Berejiklian said more than 130 fires were burning in the state of New South Wales on January 6, according to this AFP report.", "Below is a screenshot comparison of the photo in the misleading posts (L) and the one posted by Thuie (R):", "Another reverse image search on Google found a mirror image of the koala in the misleading posts published here on stock photo website Unsplash in May 2016.", "Below is a screenshot comparison of the image of the koala in the misleading posts (L) and that on Unsplash (R):", "Reverse image searches on other elements of the image found the smoke and fire originated in two separate Unsplash stock photos, seen here and here.", "Below are two sets of screenshot comparison of the smoke and fire in the image in the misleading posts (L) and two corresponding stock images (R) with similar features circled in red by AFP:", "Misinformation about the Australian bushfires crisis has circulated online as the deadly blazes continue to devastate the country’s southeastern region into the new year, as reported by AFP Fact Check here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]