["About this rating", "The idea of genetically modified super soldiers is hardly a new one, but it's always been in the realm of science fiction or fantasy. But what if it were real? That was a question posed by Polish vlogger Agon Hare, who runs the Project Nightfall social media viral video network.", "\"How far can humans go in playing God,\" Hare asks at the end of a Feb. 27, 2021, Facebook video. His hypothetical question and video about the prospect of super soldiers populating China's military forces was spun off from a comment included in a Dec. 3, 2020, opinion piece in The Wall Street Journal by John Ratcliffe, the former Director of National Intelligence under former U.S. President Donald Trump.", "In the piece, Ratcliffe attempted to make the case that China poses the \"greatest threat to America today.\" He wrote (emphasis ours):", "China also steals sensitive U.S. defense technology to fuel President Xi Jinping’s aggressive plan to make China the world’s foremost military power. U.S. intelligence shows that China has even conducted human testing on members of the People’s Liberation Army in hope of developing soldiers with biologically enhanced capabilities. There are no ethical boundaries to Beijing’s pursuit of power.", "But Ratcliffe didn't offer any evidence for the statement that the Chinese government is working to genetically alter its soldiers. An analysis of such a possibility published by the BBC on Feb. 8 raised doubts about whether it's even possible with technology currently available to alter the genes of an adult to enhance that person's performance. (The BBC also reported that China denied Ratcliffe's allegations, calling them a \"miscellany of lies.\")", "The BBC article noted that China isn't the only country that has considered the possibility of using technology to somehow make soldiers stronger. Others include France and the U.S. — in 2014, then-President Barack Obama said the U.S. was working on creating \"Iron Man\" in a now-defunct project that would have built protective armor suits for soldiers.", "Both Hare's video and the BBC's analysis bring up the case of He Jiankui, a Chinese scientist who made headlines in 2018 for genetically editing twin baby girls to shield them from contracting HIV. China, like most countries have laws banning gene editing to produce enhanced babies, and Jiankui's work landed him in jail.", "Even if Jiankiu's work is indicative of future potentialities, the BBC analysis noted that it's not so simple as choosing desirable attributes and splicing in genes for them, \"Jurassic Park\" style:", "Christophe Galichet, a senior research scientist at the Francis Crick Institute in London, calls [clusters of regularly interspaced short palindromic repeats, or CRISPR, gene editing technology] a \"revolution.\"", "But, he says, there are limits. He compared it to using find-and-replace on text - you can easily swap precise phrases about, but what works at one point in the text might not make sense in another.", "\"It's wrong to think that one gene will have one effect,\" he said. \"If you take a gene, you could have an individual with greater muscles or being able to breathe at high altitude. But maybe further down the line the individual will develop cancer.\"", "At this time we don't have evidence to support the claim that the Chinese government is experimenting on its soldiers to genetically enhance them and create \"super soldiers.\" We sent a question to the Office of the Director of National Intelligence asking whether the Biden administration backs the claim made by its predecessor's DNI. We will update this story if we receive a response.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]