["About this rating", "In early September 2018, Nike released a new commercial that featured controversial former NFL quarterback Colin Kaepernick. While the advertisement may have prompted some consumers to go out and buy a new pair of sneakers (the company's online sales increased 31%), others vehemently disagreed with Kaepernick's involvement and showed their displeasure by posting photographs and videos (purportedly) showeing them burning various pieces of Nike apparel.", "So how did Nike respond to this backlash? According to a viral Facebook post, the company released a new pair of sneakers designed to look as if they had been burned in order to clap back on these protesters:", "This post does not picture an official product offered by Nike.", "The photograph captures a pair of custom Nike Monarchs that were hand-painted by artist Kelsey Amy, the proprietor of Shme Customs. Although this image of these \"burned\" sneakers didn't go viral until September 2018, when they were incorrectly associated with protests against Nike, Amy explained in an Instagram post that she had actually created these shoes months earlier for two customers who requested a pair of grilling-inspired sneakers:", "The \"Burnt Ends\" Nike Monarchs", "Made these a few months ago and realized I ever shared them ??‍♀️ Made these for the guys over @traegergrills and Matt Pittman of @meatchurch for an event at Nike in the beginning of June. Had to lace the guys with some Monnie heat to ensure their grilling abilities were up to par! Once the guys had the shoes they came up with the \"burnt ends\" nickname which I thought fit the shoes perfectly. @mache275 is the originator of the burnt shoe theme and @justwincustoms who has done some incredible iterations as well. Wanted to get the Monnie in on the action, hopefully it did the theme justice!", "Amy uses a variety of sneakers to create her one-of-a-kind artworks, but the Nike Monarch appears to be one of her favorites. These \"Burnt Ends\" Nike Monarchs were the twenty-fourth installment of the \"Make Monarchs Great Again\" project.", "Here's a look at some of Amy's other creations based on the Nike Monarch:", "Abad-Santos, Alex.   \"Why the Social Media Boycott Over Colin Kaepernick Is a Win for Nike.\"\r\n    Vox.   6 September 2018.", "Bostock, Bill.   \"People Are Destroying Their Nike Shoes and Socks to Protest Nike's Colin Kaepernick Ad Campaign.\"\r\n    Business Insider.   4 September 2018.", "BBC News.   \"Nike Sales Defy Kaepernick Ad Campaign Backlash.\"\r\n    10 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]