["About this rating", "In November 2019, we received multiple inquiries from readers about news reports that claimed U.S. President Donald Trump had threatened to withdraw federal aid to combat and prevent wildfires in California after he went out of his way to offer his Russian counterpart Vladimir Putin some U.S. assistance in fighting wildfires in Siberia.", "On Nov. 5, Newsweek published an article with the headline, \"Russia Says Trump Once Offered to Help Putin Fight Wildfires -- Now He's Threatening to Withdraw Aid to California.\" The article reported that:", "President Donald Trump seems more willing to help Russia fight wildfires than California, considering he just threatened to cut off federal aid to the state months after offering to aid Russia in battling blazes in parts of Siberia. On Sunday, Trump slammed California Governor Gavin Newsom for his handling of the wildfires and vaguely warned that he would end the federal funding. Newsom declared a statewide emergency last week in an effort to mobilize resources.", "\"Every year, as the fire's rage & California burns, it is the same thing—and then he comes to the Federal Government for $$$ help. No more. Get your act together Governor. You don't see close to the level of burn in other states,\" Trump wrote on Twitter...", "The president's remarks about California's governor come after he offered last summer to help Russia fight a similar battle against wildfires. According to the Kremlin, Trump made the offer to Russian President Vladimir Putin during a phone call in early August. At the time, the wildfires were so large that Greenpeace Russia said they were creating an \"ecological catastrophe.\" Putin reportedly expressed his \"sincere gratitude\" to Trump for the offer and said that if necessary he would take him up on it.", "Trump has a history of publicly criticizing officials in California (in particular Democrats such as Gov. Gavin Newsom) and attributing wildfires in the state to purportedly bad \"forest management.\" He has repeatedly threatened to withdraw federal emergency assistance for the state, including in November 2018, when he tweeted \"Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more [federal] payments!\"", "There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!", "— Donald J. Trump (@realDonaldTrump) November 10, 2018", "Two months later, he declared on Twitter: \"Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives & money!\"", "Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives & money!", "— Donald J. Trump (@realDonaldTrump) January 9, 2019", "On Nov. 3, as the 2019 California wildfire season developed, Trump criticized Newsom in a series of tweets that read:", "\"The Governor of California, Gavin Newsom, has done a terrible job of forest management. I told him from the first day we met that he must 'clean' his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers...Every year, as the fire’s [sic] rage & California burns, it is the same thing -- and then he comes to the Federal Government for $$$ help. No more. Get your act together Governor. You don’t see close to the level of burn in other states...But our teams are working well together in...putting these massive, and many, fires out. Great firefighters! Also, open up the ridiculously closed water lanes coming down from the North. Don’t pour it out into the Pacific Ocean. Should be done immediately. California desperately needs water, and you can have it now! [Emphasis added].\"", "In those tweets, Trump clearly indicated that continued federal financial assistance to California (specifically to Newsom) would be contingent upon state officials changing their approach to forest management. That constituted a threat to withdraw federal aid to California for wildfires, and Newsweek was right to describe it as such.", "In August 2019, the Russian government published a statement about a phone call between Trump and Putin on July 31. That statement read as follows:", "\"Vladimir Putin had a telephone conversation with US President Donald Trump this evening at the American side’s initiative. The US President offered help in putting out wildfires in Siberia. The President of Russia expressed sincere gratitude for the kind attention and the offer of help and assistance. Vladimir Putin said he will accept the offer if it becomes necessary. He also told his American colleague that a powerful group of aircraft had been formed in Siberia to fight the wildfires. According to the Emergencies Ministry, solutions have been found to problems with the refuelling and deployment of airplanes and helicopters.", "\"The President of Russia regards the US President’s offer as a sign that it is possible that full-scale bilateral relations will be restored in the future. The presidents of Russia and the United States agreed to continue contacts in the form of telephone conversations as well as personal meetings.\"", "We asked the White House whether they could corroborate, even broadly, the Russian government's characterization of the call. Unfortunately, we did not receive a response.", "At the time, a White House spokesperson did not contradict that version of events and told news outlets that, during his conversation with Putin, Trump had \"expressed concern over the vast wildfires afflicting Siberia.\" This characterization, combined with the Russian description of an offer to help, means it's perfectly plausible that Trump did make such an offer.", "We found confirmation that he did in a video of an Aug. 1 press conference during which Trump said the following when reporters asked him about the phone call:", "\"Mostly we discussed the forest fires in Siberia, and other parts of Russia. And I said, look, we have the greatest equipment, if we could help you let us know. Large sections are burning, and so I said to President Putin, if we can help you, let me know.\"", "Hutzler, Alexandra.  \"Russia Says Trump Once Offered to Help Putin Fight Wildfires -- Now He's Threatening to Withdraw Aid to California.\"\r\n  Newsweek.  5 November 2019.", "Mac Guill, Dan.  \"Did Trump Order FEMA to 'Send No More Money' for California Wildfire Aid.\"\r\n  Snopes.com.  10 January 2019.", "Office of the President of Russia.  \"Statement -- Telephone Conversation With US President Donald Trump.\"\r\n  31 July 2019.", "Samuels, Brett.  \"Trump Offered Putin US Assistance Fighting Wildfires in Serbia, Kremlin Says.\"\r\n  The Hill.  31 July 2019.", "Watson, Kathryn.  \"Trump and Putin Spoke About Wildfires and Trade, White House Says.\"\r\n  CBS News.  2 August 2019.", "UPDATE [Nov. 7, 2019]: Added Trump's statement from an Aug. 1 press conference confirming that he offered firefighting assistance to Russia during a phone call with Putin. Updated status from \"Mixture\" to \"True.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]