["Serco runs the enforcement of the UK’s test and trace system, including the app.", "This is not true. Serco has had no involvement in the app. Its contracted work for England’s Test and Trace system involves running call centres and testing facilities.", "Recently introduced laws mean if you are told to self-isolate and do not, you will get a £1,000 pound fine administered by Serco.", "It is true a law was recently introduced to fine those breaking isolation orders from Test and Trace. However, Serco does not administer these fines.", "In August, Serco were given £108 million to run the test and trace system.", "Serco was awarded this contract for running some contact tracing call centres.", "This was spent on each employee only contacting two people each.", "This refers to an average figure part-way through the contract and includes workers who were not employed by Serco.", "Serco and Qinetiq are owned by the monarchy.", "This is not true.", "The Pirbright Institute was responsible for foot and mouth.", "A pipe connected to the Pirbright Insitute’s Surrey facility was found to be the likely source of a 2007 foot and mouth outbreak.", "The Pirbright Institute has the main patent for coronavirus, which was granted by Serco.", "The Pirbright Institute’s coronavirus patent is not related to the virus causing the current outbreak, and we can find no evidence that it was granted by Serco.", "The Pirbright has an office in Wuhan China.", "We can find no Pirbright office in Wuhan, China.", "The Gates Foundation has 200,000 shares in Serco.", "The Gates Foundation bought 200,000 shares in 2019, bringing its total ownership to 3.74 million shares.", "We’ve been asked about a video of a public speech on Facebook, in which the speaker makes several claims about the outsourcing company Serco and the Covid-19 pandemic.", "There are too many claims in the video for us to check it all, so we are addressing the main ones which focus on the response to the current pandemic in the UK.", "“The infrastructure of our entire test and trace system, the enforcement is run by a company called Serco...The Test and Trace app, it comes from Serco.”", "As we have previously said, Serco has played no role in the creation or operation of the Test and Trace app. They were contracted to operate facilities at some testing sites, and run contact tracing call centres in England. Following a reorganisation of the system, Serco provides about half the staff assigned to trace the contacts of “non-complex” cases and ask them to self-isolate. We’ve written more about Serco and non-complex cases here.", "“The law changed two weeks ago, if you are asked to isolate for any reason...you can get a thousand pound fine, and if you break the rules you can get up to a ten thousand pound fine. This is administered by Serco.”", "It is true that in September, a fine of £1,000, rising to £10,000 for repeated offences, was introduced for people who refused to self isolate when told they had tested positive, or come into contact with someone who had. As with all coronavirus legislation, enforcing this fine is down to the police.", "“In August, they got £108 million to run test and trace, and for the first few months everyone was just sat around watching Netflix. They contacted an average of two people each. £108 million we spent on that.”", "Serco was awarded a £108 million contract to set up and run some contact tracing call centres until 23 August. The claim that the money was spent on tracing “two people each” may have come from a Sunday Times article, which claimed that Serco’s contact tracers, along with those employed by another outsourcer, Sitel, traced on average around two contacts each between May and August.", "“Serco is owned by CCL, the Crown Corporation Limited. Who owns the Crown Corporation Limited? The Crown Estate. Who owns the Crown Estate? The Crown… Qinetiq... are also owned by the Crown.”We can’t find any evidence of a company called “Crown Corporation Limited” associated with the Queen. The monarchy’s business interests are part of the Crown Estate, which is not one of Serco’s or Qinetiq’s primary shareholders. The “Crown Commercial Service”, an executive agency sponsored by the Cabinet Office, awarded the contact tracing contract to Serco, which may be the source of this confusion.“The Pirbright Institute in Surrey was responsible for foot and mouth… Pirbright have the main patent on coronavirus. Guess who granted the patent? It was Serco, because they run the patent office… Pirbright, guess where it has a massive office...? Wuhan.” Pirbright’s research facility in Surrey, UK was linked to a foot and mouth outbreak in 2007 after a pipe connected to the building was discovered to be the likely source. We have written before about how the coronavirus patent held by Pirbright is not for the virus that causes Covid-19 but for another virus that affects birds.", "Serco works with the US patent office to process patent applications, but these are assessed by examiners employed by the US Patent and Trademark Office.", "Pirbright has collaborated with Chinese scientists, but we could find no evidence of a Pirbright office in Wuhan.", "“The Gates Foundation...does anyone know how many shares they have in Serco?... 200,000 shares, worth about $20m.”", "The video claims that the Gates Foundation has 200,000 shares in Serco. The Gates Foundation purchased 200,000 shares in Serco in 2019, taking the company’s total ownership to 3.74 million shares, reported to be worth about £5.3 million or $6.6 million at the time.", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as partly false\n            because there are a number of incorrect claims in this post.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]