["The Statue of Unity is all set to be unveiled by Prime Minister Narendra Modi on October 31, the birth anniversary of Sardar Vallabhbhai Patel. Controversy has erupted over the project with tribal organisations protesting against the event and calling for its boycott, claiming that land for the project had been acquired unjustly.", "On social media, an image of Patel’s statue in the background, with a poor family shown in the foreground, has been shared by journalist Dilip Mandal who tweeted, “Had Sardar Patel been alive today, would he have agreed to displacing tribals from their homes and farm lands for building his statue?” (translated). His tweet has been retweeted close to 200 times. It was also shared by Shilpa Bodkhe, who describes herself as secretary of Maharashtra Pradesh Mahila Congress Committee.", "The image has also been shared by an Aam Aadmi Party (AAP) supporter on Twitter.", "The same image has also been used in an article published by a website, BoltaUP. The image has been shared by several social media users with the hashtag #StatueofDisplacement.", "The photograph shared on social media is photoshopped. Alt News cropped the picture in the foreground and using the reverse image search tool, found that the photograph of a mother and her children has been lifted from another source and superimposed on the photograph of the statue of Sardar Patel.", "The original photograph was clicked in 2010. It is available on the website of Reuters. The photograph was taken in Ahmedabad, Gujarat by Amit Dave. Alt News could not trace the source of the photograph of the statue of Sardar Patel.", "With the date of the inauguration drawing near, propaganda on social media has once again reared its head. While the protests by tribal organisations over the project cannot be ignored, using unrelated images to create a visual perception is unwarranted and trivializes the grave concerns of the displaced.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]