["About this rating", "Kasich said that in 1978 he began a career in politics with grassroots support, including women who left their kitchens to help campaign for him.", "Kasich's comments reflected current campaign efforts or voting habits; Kasich's remarks described voting and not running a campaign.", "On 22 February 2016, a clip featuring remarks made by presidential candidate John Kasich circulated widely on social media. A short snippet (or a transcribed quote taken from it) from earlier that day suggested that Kasich declared female voters had \"left their kitchens\" to cast ballots for him:", "How did I get elected? I didn’t have anybody for me. We just got an army of people, and many women who left their kitchens to go out and to go door to door to put up yard signs for me.", "The video spliced together Kasich's comments with those of a town hall attendee, creating the impression of a direct statement and response. After Kasich spoke, she said she would come out to vote for him, but wouldn't be leaving her kitchen to do so.  That interpretation was quickly disseminated across the web:", "Gov. John Kasich is still in the race and still trying to frame himself as the moderate, compassionate Republican, but on Monday, the governor issued two glaring reminders of his very un-moderate contempt for women. During a campaign event, in a video that went viral almost instantaneously, Kasich made a comment about his female supporters that was as bizarrely unnecessary as it was condescending.", "“How did I get elected?” Kasich said. “I didn’t have anybody for me. We just got an army of people, and many women who left their kitchens to go out and to go door to door to put up yard signs for me.” He did not specify if they untied their aprons or put on their shoes.", "Later, a woman in the audience decided to confront him, sort of, on this. “I’ll support you,” she said. “But I won’t be coming out of the kitchen.”", "It's 2016. A woman's place is...wherever she wants it to be. https://t.co/lkXdirHlap", "— Hillary Clinton (@HillaryClinton) February 22, 2016", "Ohio Governor John Kasich, who defunded Planned Parenthood yesterday, said Monday morning at a town hall in Virginia that he got elected governor to the state Senate because women “came out of their kitchens to support me.” Oh? “I didn’t have anybody for me,” Kasich said, during a town hall at George Mason University in Fairfax this morning. “We just got an army of people who—and many women who left their kitchens to go out and go door to door and put yard signs up.”", "Not all reporting seized upon the use of the word \"kitchens\" alone. Some also included context:", "Quickly, a highly misleading, a 22-second edited version of Kasich's remarks began circulating, with the implication being that Kasich was an out-of-touch throwback who in his mind at least still consigned women to the kitchen. The edited clip included a woman in the audience later in the rally telling Kasich she would be supporting him but she wouldn't be coming out of her kitchen to do it.", "Early on in the fray, reporters attempted to clarify the comments' context:", "Here's the full verbate on John Kasich's women/kitchen comment... pic.twitter.com/rYRZTwzPl2", "— Kailani Koenig (@kailanikm) February 22, 2016", "Here's Kasich spox @chrisschrimpf on \"kitchen\" remark: \"to try and twist his comments\" is \"just desperate politics\" pic.twitter.com/KGYsVWXVdm — Hallie Jackson (@HallieJackson) February 22, 2016", "Jezebel updated their coverage with a clarification:", "The full verbatim quote from the rally shows that Kasich was either talking about his race to the state Senate in 1978, or winning a seat in the U.S. House of Representatives in 1982. We assure you women were working outside of the kitchen in both those years.", "The New York Times was among outlets that carried the quote in its larger context, observing that Kasich credited women for helping launch his political career:", "“How did I get elected? I didn’t have anybody for me,” he said at a town-hall-style forum at George Mason University. “We just got an army of people — and many women who left their kitchens to go out and go door to door and to put yard signs up for me, all the way back when, you know, things were different.”", "Mr. Kasich was elected to the Ohio Senate in 1978, when he was 26.", "“Now you call homes and everybody’s out working,” Mr. Kasich added. “But at that time, early days, it was an army of the women that really helped me to get elected to the State Senate.”", "The paper also quoted Kasich on the reaction tweet:", "Asked later Monday about the Twitter post by Mrs. Clinton’s campaign, Mr. Kasich told reporters, “I completely agree.”", "Before an event at the University of Virginia in Charlottesville, Mr. Kasich said the town-hall-style meetings he now holds on the campaign trail used to be in kitchens and living rooms, and said women have played a large role in his political career.", "He noted that his campaign manager, his lone appointment to Ohio’s Supreme Court, and his lieutenant governor are all women.", "After the short clip made the social media rounds, Kasich's complete remarks were published to YouTube:", "In light of the broader context, some outlets revised their coverage of Kasich's statement in order to provide a more accurate portrayal of the remarks. Kasich himself later admitted that the wording was clumsy.", "While it was true Kasich described women \"coming out of kitchens\" to support him, he was describing a grassroots campaign effort at the start of his career in 1978, not election days in any recent years. A portion of the remarks mentioned an \"army of women\" who were responsible for getting his career off the ground. After the context of the quote was added, some outlets revised their original reports, and others noted that women weren't exclusively homemakers in 1978.", "While there were plenty of career women in 1978 (51 percent of women were in the labor force to at least some degree in 1978, compared to 57 percent in 2014) Kasich's remarks were edited to appear far more regressive than they did in context, and most initial takes were based on nothing more than a partial quote.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]