["About this rating", "The online retailing giant Amazon.com came under scrutiny in March 2019 when reports emerged that their product listings had included \"child sex dolls for pedophiles.\" On 23 March, the right-leaning website PJ Media reported that:", "In a stunning discovery, Amazon has sex dolls that look like children for sale on their site. A company called DVKFP has sex dolls, that are clearly meant to target pedophiles and represent children, listed on Amazon including a promise for 'hidden delivery.'", "One clearly shows an underdeveloped child's body with no breasts and little girl headband while another has photos of what looks to be a young teen tied up with rope with torn clothes and a bloody gag in her mouth.", "The article included screenshots of the dolls, and its author, Megan Fox, showed what appeared to be an authentic Amazon listing for one of the dolls in a live video she broadcast on 23 March. After her article was published, Fox updated it to reflect the fact that Amazon had removed the listings for the dolls from their website.", "A spokesperson for Amazon confirmed in a statement sent to Snopes that the dolls had indeed been listed but had since been removed, writing: \"All Marketplace sellers must follow our selling guidelines and those who don’t will be subject to action including potential removal of their account. The products in question are no longer available.\"", "According to Fox's account, provided in her live 23 March video, the items were removed from the website \"within three minutes\" of her article's publication, which suggested that Amazon acted relatively promptly after they became aware of the products.", "We asked the company for a precise explanation of why the items highlighted by PJ Media had been removed, and whether those product listings constituted a violation of Amazon's rules, but we did not receive a response to those particular questions.", "According to Amazon's policies and rules, the company prohibits the sale of the following kinds of items (among others):", "The company warns of the following possible consequences for a seller who attempts to list one of the aforementioned product types and notes that the decision as to whether a product violates Amazon's rules is largely at the discretion of the company:", "\"Violations of Amazon's listing policies may result in actions such as:", "Amazon reserves the right to make judgments in its sole discretion about whether or not a listing is appropriate.\"", "It's not clear what the specific basis was for Amazon's decision to remove the two dolls discovered by PJ Media. As of 28 March, the seller who had listed the dolls was still active as an Amazon vendor. We asked the company why the seller in question had not been suspended or had their selling privileges revoked, but we did not receive a response to that particular question.", "As of 28 March, it was not illegal in the United States to buy or sell sex dolls that resemble children. However, on 27 March the Florida State Senate scheduled the third reading of a bill (SB 160) which would prohibit \"knowingly selling, lending, giving away, distributing, transmitting, showing, or transmuting; offering to commit such actions; having in his or her possession, custody, or control with the intent to commit such actions; or advertising in any manner an obscene, child-like sex doll.\"", "In 2018, the U.S. House of Representatives passed H.R. 4655, known as the CREEPER Act, which would have banned the importation or transportation of \"child sex dolls,\" which the bill defined as \"an anatomically-correct doll, mannequin, or robot, with the features of, or with features that resemble those of, a minor, intended for use in sexual acts.\" The bill was sent to the U.S. Senate and referred to the Senate Judiciary Committee in June 2018, but it did not advance from there.", "The bill argued that child sex dolls should be banned on the grounds that a correlation exists between the use and possession of such dolls and the consumption and production of child sex abuse imagery, that would-be predators could use such dolls to learn how to rape children, and that the dolls are \"intrinsically related to abuse of minors, and they cause the exploitation, objectification, abuse, and rape of minors.\"", "However, critics of such legislation have argued that the dolls are not \"obscene material\" in and of themselves, and that therefore a ban on them would be an unconstitutional violation of the First Amendment right to free speech. Others have argued that no research-based consensus yet exists that the use of sex dolls facilitates or encourages the abuse of real children, as opposed to potentially making such crimes less likely.", "Fox, Megan.   \"Amazon Selling Child Sex Doll for Pedophiles.\"\r\n    PJ Media.   23 March 2019.", "Book, Lauren.   \"SB 160.\"\r\n    Florida Senate.   12 February 2019.", "Donovan, Daniel.   \"H.R. 4655 -- The CREEPER Act.\"\r\n    U.S. House of Representatives.   14 December 2017.", "Levy, Alex F.   \"The 'CREEPER Act' Would Be Yet Another Unconstitutional Law From Congress.\"\r\n    Technology and Marketing Law Blog.   28 June 2018.", "Nolan Brown, Elizabeth.   \"There's 'No Evidence That Having Sex with Robots Is Healthy' and No Evidence That It's Not.\"\r\n    Reason.   6 June 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]