["A photograph of PM Modi bowing to a woman is being shared with the claim that she is Priti Adani, wife of Gautam Adani, chairperson of Adani Group. The text inscribed on the image reads, “देश की बागडोर एक नई जमात ने संभाली है. (A new group has taken over the reins of the country).”", "ADANI KE सेवक, जिन्हें प्रधानमंत्री के रूप में भी जाना जाता है, गौतम अडानी की पत्नी प्रीति अडानी के सामने झुकते हैं।", "Posted by Anshdeep Singh on Wednesday, 17 February 2021", "The image is massively widespread on Facebook.", "“भाइयो यह महिला उद्योगपति अडानी की पत्नी है जो इंसान झुका हुआ(बिका हुआ) है, वो हमारे देश का PM है”, read the message shared with the viral photo in 2019. A Facebook post by one Vijay Arora had garnered more than 800 shares.", "Many other individual users posted the photograph on Twitter with an identical narrative.", "@nikku_yadav_ji @priyankasinghsp @yadavsn319 @yadavshyamSP @YRBSamajwadi @sanjayamethiSP @raiashokyadav @raiashokyadav @Yogendr25095627 @PilotSuryasen @PilotSuryasen @yadavkanchansp @IamNishaYa_ @dnyadav यह महिला उद्योगपति अडानी की पत्नी है… झुकी हुई गर्दन को पहिचाने ज़रा… pic.twitter.com/zQkGgxJvI2", "— Subhash Yadav (@Subhash35065741) October 15, 2019", "This image has been circulating with the same claim at least since November 2014.", "A Google reverse image search revealed that the woman in the photograph is the Mayor of Tumkur or Tumakuru, a city in Karnataka. Alt News found a Reddit post from September 2014 which carried the same image with the title, “Modi greeting Tumkur mayor (after leaving ISRO to launch that food park)”.", "Furthermore, a tweet by one Rahul Kaushik also identified the woman as Geeta Rudresh, then mayor of Tumkur.", "Alt News was able to corroborate the same with a newspaper clipping published on September 25, 2014. The caption below the photograph stated that Metropolitan Mayor Geeta Rudresh met Prime Minister Narendra Modi on his arrival in Tumkur on Wednesday for the inauguration of food park.", "In conclusion, a photo of PM Modi showing respect to then-Mayor of Tumkur city was shared on social media with the false claim that he was bowing in front of Gautam Adani’s wife, Priti Adani.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]