["The video was published here on Facebook by a Singapore-based user on May 18, 2020. It has been viewed more than 36,000 times.", "The one-minute 32-second footage shows people crowding around the back of a truck filled with frogs and placing some into plastic bags.", "The post’s Tamil-langauge caption translates to English as: “Video title: Vegetable sales on a China street, soon after the lifting of curfew.”", "China ended its lockdown of Wuhan on April 8, 2020, some 76 days after the novel coronavirus was first detected in the city in late December 2019.", "Since the outbreak, China has said it has “comprehensively banned” the trade and consumption of wild animals, which is widely believed to be responsible for the ongoing pandemic.", "As of May 21, 2020 the number of coronavirus cases globally has surpassed five million, according to the AFP tally.", "The video was also shared alongside a similar claim here, here, here, here and here on Facebook; here, here, here and here on Youtube; and here, here, here and here on Twitter.", "The claim is false.", "Closer examination of the video revealed the truck carries a Thai license plate local to Khon Kaen, a province in central-northeastern Thailand.", "Below is a screenshot of a keyframe of the video in which the license plate can be seen:", "Additionally, AFP identified a voice at the video’s 19-second mark that says \"100 baht per kilogram\" in a northeastern Thai dialect. Baht is the official currency of Thailand.", "Thailand has no borders with China, meaning the car could not have been travelling between border villages in the two countries.", "AFP Fact Check also reported on the same hoax here after the same claim emerged in Arabic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]