["Posts across social media alleging that hundreds of shredded Pennsylvania mail-in ballots were discovered in the back of a trailer are being used to push unfoundedclaims of voter fraud ahead of Election Day.", "A viral video shows a person entering the back of a truck and picking up one of the  \"shredded ballots.\" The man then zooms in on one of the papers, which reads \"President Trump wants you to return this form,\" along with an image of the president.", "\"This looks like a bunch of recyclables, right? Right?\" the person says in the video. \"No, it's a Pennsylvania application for a mail-in ballot, and they do have people's addresses on the back of them that were never mailed out.\"", "The video, posted by USA Headline News, which has been shared over 500 times, is headlined \"Thousands of shredded Trump ballots addressed and not mailed out.\" A tweet with almost 24,000 shares features the same video, writing that the \"evidence\" was submitted by a fan to a Barstool Sports company called Old Row.", "The claim was also posted by The Right Scoop on Oct. 7, with the headline, \"DESTROYED: Tons of Trump mail-in ballot applications SHREDDED in back of tractor trailer headed for Pennsylvania.\"", "USA TODAY reached out to the USA Headline News and The Right Scoop for comment.", "Fact check: What's true and what's false about voting by mail in 2020", "Frames from the video reveal that the ballot applications are blank. And while the applications feature an image of President Donald Trump's face on them, there is no evidence the \"applications were for Trump,\" as the tweet states.", "A clear image of the ballot request similar to the one shown in the video has been posted toTwitter byseveralusers in Ohio and North Carolina. The ballot applications were not requested by voters and are part of a nationwide effort by the Republican Party to encourage mail-in voting.", "Voters in Texas received the same ballot applications, which feature Trump's photo on them, WFAA reported. One side of the flyer is an application for avote-by-mail ballot and the other side includes a quote from Trump: \"I will be an absentee voter. We have a lot of absentee voters. It works, so we are in favor of absentee.\"", "North Carolina Republican Party press secretary Tim Wigginton told CNN that the state party has sent several statewide mailers to make it easier for voters to participate and that the party and Trump \"oppose an all-mail election process where voters are mailed ballots without a prior request and authentication.\"", "Thea McDonald, deputy national press secretary for the Trump campaign, told CNN that the flyer shows how it \"is working to ensure voters in every state know how their state's sorting system works so that every eligible voter can cast their ballot and have their vote counted.\"", "Fact check: No proof of alleged voter fraud scheme or connection to Rep. Ilhan Omar", "Toward the end of the video, a frame features a sign that says R.R. Donnelley, a company that provides marketing and business communications, commercial printing and mail services. The narrator notes he is at a company facility in Seymour, Indiana.", "A spokesperson for the company told PolitiFact that the viral video is \"residual print production waste in a trailer that was returned from a recycling facility\" adding that recycling print production waste is a \"normal practice associated with a direct mail project of this extent.\"", "The Bucks County Courier Times reported that official Pennsylvania mail-in ballots do not contain pictures of any candidate and that applications for mail-in ballots require voters to submit personal information that is only shared with the Pennsylvania Department of State or county board of elections.", "Fact check: Pennsylvania mail-in votes need 2 envelopes to be counted", "The claim that thousands of mail-in ballot applications \"for Trump\" were found shredded in the back of a truck is FALSE, based on our research. A company confirmed that the video is of printing waste, not ballots that were not delivered. The applications are blank.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]