["“As you are aware, the Lake Chad Basin, which used to be a region of productivity, food security and wealth for an estimated 40 million citizens living around the lake basin, has shrunk significantly from its original size due to climate change,” President Buhari said in his speech to the UN on September 23.", "“We will continue to lead in efforts to have solid partnerships for the ecological restoration and recharge of Lake Chad.”", "Yesterday, President @MBuhari addressed the @UN Climate Action Summit 2019, “We will take concrete steps to harness climate innovative ideas by including youths in decision-making processes as part of our over-all climate governance architecture.\"#ClimateActionSummit #PMBAtUNGA pic.twitter.com/qUV7aqvBly", "The statement drew criticism online from some Twitter users who said that the latest research contradicted the president.", "“The most resent (sic) study below shows LAKE CHAD IS NOT SHRINKING stop disgracing us sir!” Olushola Olufolabi, a staunch Buhari critic, wrote in a tweet shared 150 times, and archived here.", "“Your only knowledge of climate change starts and stops at Lake Chad .. What is really your obsession with that lake and shrinking ?? Even when many reports says it is not in any way shrinking ..Baba shift ur attention to more important aspect of climate change..” wrote another user, Akhogba Era.", "Lake Chad borders northeast Nigeria, Niger, Cameroon, and Chad, serving millions of people from all four countries. The region is a hotbed for the Boko Haram insurgency that has displaced over two million people in the past decade and the area remains a stronghold for jihadists.", "We went through a recent authoritative report funded by the German and Dutch governments and found that while the lake is considerably smaller than it was 50 years ago, it has stopped shrinking in recent years.", "“Whilst the lake contracted significantly due to drought in the 1970s and 1980s, our research finds that the lake is currently not shrinking,” says the report, which was published in May by German think-tank Adelphi.", "“These droughts led to the lake shrinking from a high point of 25,000 km² in the 1960s, when it was the world’s sixth largest freshwater body and a thriving commercial hub for the entire Sahel, to just 2,000 km² in the 1990s.”", "The report went on to state that “by displacing communities and undermining state legitimacy, the droughts helped set in motion a train of events which is still being felt today. Whereas the lake’s shrinking has indeed fed into the current crisis, the lake has since expanded to roughly 14,000 km².”", "As for the current size of the lake, this “has proven relatively stable over the past two decades. Indeed, the total water storage has actually increased, if one includes groundwater as well as surface water, which runs counter to the prevailing narrative of a lake in terminal decline.”", "According to the authors -- Janani Vivekananda, Dr Martin Wall, Dr Florence Sylvestre, Chitra Nagarajan -- the report “is the first of its kind on the Lake Chad region and a pioneer among climate-fragility risk assessments globally”.", "It is said to be the product of an intensive two-year period of research across all four countries, “drawing on long-term hydrological data from the Lake Chad basin, ground measurements, brand new analysis of 20 years of satellite observations”, and hundreds of interviews with local residents.", "Last year, UN Secretary-General Antonio Guterres told an international conference on Lake Chad that its water level had shrunk by 90 percent compared to the 1960s.", "“Lake Chad was once a major source of livelihoods for millions of people living throughout its basin,” Guterres said in a message to the conference in Abuja, delivered by the UN’s West Africa representative Mohammed Ibn Chambas.", "“Today, the lake’s water level has shrunk 90 per cent compared with what it was in the 1960s, and its surface area has decreased from 22,000 square kilometres to a mere 1,350 square kilometres.”", "If that figure given by Guterres last year for the estimated size of the lake sounds vastly different from the recent report, that’s because it is -- 1,350 square kilometres versus 14,000.", "But we found that Guterres was quoting a figure given in a 2002 UN report, which was in turn citing research published in 2001. The latest data available does suggest the lake has expanded significantly since then.", "Buhari did not cite a timeframe in his speech to the UN and it is correct to say that the lake has shrunk significantly since its peak in the 1960s. But as the recent report argues, it is wrong to say that the lake is still shrinking.", "Irrespective of the size of Lake Chad, however, climate change is still having a profound negative effect on the region and calls for increased international attention are justified.", "“Climate change is having profound adverse impacts on the conflict, intensifying existing dynamics and creating new risks. But an alleged shrinking of the lake is not the problem,” the report said.", "“High levels of rainfall and wide temperature variability are undermining people’s lives and livelihoods. Temperatures in the region are rising one and a half times faster than the global average. And climate projections predict that weather conditions will only become more extreme and more unpredictable.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]