["One post, archived here, has been shared nearly 500 times since it was published on May 10, 2020. “Aisha Buhari is the first female in the world to become first female President without an Election, she took over Nigeria President (sic) after the de-facto president of Nigeria Abba kayri's dead (sic) on 2nd of April 2020 in Cuba due to coronavirus pandemic,” it claims.", "The post adds that President Buhari “died on 27th of January 2017 from Brain tumour illness in London hospital UK and was secretly taking (sic) to Saudi Arabia where he was buried in shallow grave”.", "Similar claims have been shared here, here and here.", "In 2017, Buhari -- who has served as president of Nigeria since 2015 -- was hospitalised in Britain, prompting rumours of his death in Nigeria. Separatist leader Nnamdi Kanu said the president had been replaced by a body double, a claim AFP Fact Check debunked here.", "Buhari was re-elected in 2019, and has been seen in public carrying out duties after the misleading posts were published. He was photographed chairing a meeting on May 13, 2020, where he unveiled former UN envoy, Ibrahim Gambari, as his new chief of staff.", "Ibrahim Gambari is the new Chief of Staff to President @MBuhari. He succeeds Abba Kyari, who passed away on April 17, 2020. pic.twitter.com/3KLK3AYOew", "Gambari replaced Abba Kyari, the president’s former chief of staff who died last month from COVID-19. Kyari was regarded as one of the strongest members of Buhari’s cabinet. Some Nigerians referred to him as de facto president.", "His death sparked rumours about who would become the president's new chief of staff. Some of the names circulated in the media included that of the president’s nephew, Mamman Daura, as well as First Lady, Aisha Buhari.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]