["About this rating", "As a prominent political activist and supporter of left-wing causes, Hungarian-born billionaire financier George Soros has frequently been the target of smear campaigns, and none more odious than the persistent — and false — claim that Soros, a Jew, was a Nazi sympathizer, collaborator, and/or paramilitary officer during World War II.", "That Soros was only nine years old (born in 1930) when the war broke out and all of 14 when Nazi Germany surrendered in May 1945 hasn't dampened his detractors' enthusiasm for spreading these rumors, including the absurd claim, which first surfaced in November 2016, that Soros literally served as an officer of the paramilitary Schutzstaffel (SS) in Germany.", "Here are two examples via Twitter:", "George Soros. A SS in the National Socialist German workers party. Nazi party. He served under Hitler. The Democratic Party soul. pic.twitter.com/pLTfFtGtB1", "— G.I. Joe ?? (@toombstone) November 26, 2016", "GEORGE SOROS- REMEMBER THIS THE NEXT TIME THE SOROS-FUNDED LIBERALS CALL YOU A RACIST, FACIST, OR NAZI! pic.twitter.com/qU7FwGzHcQ", "— Phx Ken (@PhxKen) June 15, 2017", "This allegation continues to make the social media rounds in the form of a black-and-white photograph of a young man — supposedly Soros — wearing an SS uniform (see above), accompanied by some version of this caption:", ".. I give you George Soros. A SS in the National Socialist German workers party. Nazi party. He served under Adolf Hitler and Heinrich Himmler. He said it was the best time of his life. The destruction and agony around him was euphoric to him. This man was making policy with Hillary Clinton. And some of you think Trump is dangerous. Wow!", "Wow, indeed. But given his age, Soros couldn't have joined the SS (whose minimum age requirement was 17) even if he had wanted to. Moreover, as a Hungarian Jew he couldn't have met the SS requirement for pure \"Aryan\" heritage. Quite to the contrary, Soros and his entire family were obliged to hide their identities and pose as Christians to avoid being forcibly housed in ghettos, interned in concentration camps, deported, or killed during the 10-month Nazi occupation of Hungary beginning in 1944.", "The miscaptioned photo is easily debunked using a reverse image search. The young man in the Waffen-SS uniform is actually Oskar Groening, a Nazi who served at the Auschwitz concentration camp from 1942 through the end of the war. More than 70 years after this photograph was taken, Groening was found guilty of being an accessory to the murder of at least 300,000 Jews.", "Was Soros a Nazi Collaborator?", "It is also claimed that Soros survived the German occupation of Budapest by becoming a Nazi \"collaborator.\" Fox News pundit Glenn Beck alleged in November 2010, for example, that the 14-year-old Soros \"help[ed] the government confiscate the lands of his fellow Jewish friends and neighbors,\" and, worse (in Beck's view), was unrepentant about it:", "So when George Soros was 14, his father basically bribed a government official to take his son in and let him pretend to be a Christian. His father was just trying to keep him alive. He even had to go around confiscating property of Jewish people.", "Now, imagine you are Jewish and you have to go and confiscate the property of your fellow Jews. And you are pretending to not be a Jew and if anybody finds out, you're dead. He actually had to endure watching people sent off to their eventual murders, watching people gathering their stuff, sending them off knowing that they were going to go to their death.", "\"I don't want to question the 14-year-old,\" Beck disingenuously stated during a series of broadcasts devoted to painting Soros as an evil \"puppet-master\" of the left. \"I would have, however, liked to question the 80-year-old man who has never once said he regretted it,\" he added.", "Central to Beck's case were quotes and clips from a 1998 60 Minutes interview (which can be viewed in its entirety here), an excerpt from which was also used as the centerpiece in a commentary on the conspiracist web site InfoWars.com in which host Alex Jones claimed that the teenaged Soros \"helped round up thousands of people\" and \"stole hundreds of millions of dollars\" from Hungarian Jews on behalf of the Nazi occupiers.", "Conservative author Dinesh D'Souza (who has gone so far as to compare the 14-year-old George Soros to Nazi war criminal Josef Mengele) revived the \"Nazi collaborator\" claim in his 2017 book The Big Lie: Exposing the Nazi Roots of the American Left, doubling down on it in a social media campaign to promote book sales:", ".@georgesoros, now a principle financial backer of violent #Antifa thugs, admits his collaboration with Hitler and says he has no regrets: pic.twitter.com/P1Xl1vo87T", "— Dinesh D'Souza (@DineshDSouza) September 2, 2017", "Other conservative and alt-right media figures followed suit:", "Soros was Nazi collaborator. He laughed about it. https://t.co/N41dkcDG6y", "— Mike Cernovich ?? (@Cernovich) September 13, 2017", "#Nazi collaborator #GeorgeSoros in his own words, while other Jews his age had died fighting Nazis in the Warsaw Ghetto... pic.twitter.com/xXp9JYQZts", "— James Woods (@RealJamesWoods) August 18, 2017", "Media Matters sugar daddy is George Soros, WHO IDENTIFIED JEWS TO THE NAZIS, as he admitted on 60 Minutes -- https://t.co/lOUQKWnCqL", "— Ann Coulter (@AnnCoulter) June 12, 2015", "Yet the simple truth is that George Soros neither said nor did anything resembling what he has been accused of. In no sense was Soros, who turned 14 years old not long after the Germans occupied Hungary in 1944, a \"Nazi collaborator.\" At no time did he confiscate (or help confiscate) the property of Jews, \"identify Jews to the Nazis,\" or help \"round up\" people targeted for deportation or extermination by the Germans (to answer just a few of the accusations leveled against him). And although Soros did attest during the infamous 60 Minutes interview that he regrets nothing about the time of German occupation, he also said it is precisely because he didn't do any of the things attributed to him that his conscience is clear.", "The 60 Minutes Interview", "The 60 Minutes interview is problematic in many regards, not least because Soros's testimony comes across as confused and contradictory. After assenting to Kroft's (inaccurate) statement that he \"helped in the confiscation of property from the Jews,\" a minute later Soros says he was only a spectator and played no role in that confiscation:", "Kroft: \"My understanding is that you went ... went out, in fact, and helped in the confiscation of property from the Jews.\"", "Soros: \"Yes, that's right. Yes.\"", "Kroft: \"I mean, that's — that sounds like an experience that would send lots of people to the psychiatric couch for many, many years. Was it difficult?\"", "Soros: \"Not, not at all. Not at all. Maybe as a child you don't ... you don't see the connection. But it was — it created no — no problem at all.\"", "Kroft: \"No feeling of guilt?\"", "Soros: \"No.\"", "Kroft: \"For example, that, 'I'm Jewish, and here I am, watching these people go. I could just as easily be these, I should be there.' None of that?\"", "Soros: \"Well, of course, ... I could be on the other side or I could be the one from whom the thing is being taken away. But there was no sense that I shouldn't be there, because that was — well, actually, in a funny way, it's just like in the markets — that if I weren't there — of course, I wasn't doing it, but somebody else would — would — would be taking it away anyhow. And it was the — whether I was there or not, I was only a spectator, the property was being taken away. So the — I had no role in taking away that property. So I had no sense of guilt.\"", "Soros's biographer, Michael T. Kaufman, described Soros as \"visibly dumbfounded\" by Kroft's \"prosecutorial\" line of questioning during the interview. Kaufman addressed the claim that Soros was involved in confiscating Jewish property in his book, Soros: The Life and Times of a Messianic Billionaire (Knopf, 2002).", "While it's true, Kaufman wrote, that one of the jobs delegated to young George's temporary protector (a Hungarian bureaucrat named Baumbach) was taking inventory of Jewish properties already confiscated by the Nazis, the extent of Soros's participation was accompanying Baumbach on one of those assignments:", "Shortly after George went to live with Baumbach, the man was assigned to take inventory on the vast estate of Mor Kornfeld, an extremely wealthy aristocrat of Jewish origin. The Kornfeld family had the wealth, wisdom, and connections to be able to leave some of its belongings behind in exchange for permission to make their way to Lisbon. Baumbach was ordered to go to the Kornfeld estate and inventory the artworks, furnishings, and other property. Rather than leave his \"godson\" behind in Budapest for three days, he took the boy with him. As Baumbach itemized the material, George walked around the grounds and spent time with Kornfeld's staff. It was his first visit to such a mansion, and the first time he rode a horse. He collaborated with no one and he paid attention to what he understood to be his primary responsibility: making sure that no one doubted that he was Sandor Kiss [Soros's assumed identity]. Among his practical concerns was to make sure that no one saw him pee.", "George's father, Tivadar Soros, provided a similar account of the incident in his 1965 autobiography, Masquerade: Dancing Around Death in Nazi Occupied Hungary (note: Tivadar Soros gave the name of the ministry official as \"Baufluss,\" but Soros confirmed to us that the correct name is Baumbach):", "Baufluss was charged by the ministry with inventorying confiscated Jewish estates. He was home only at weekends; the rest of his time he spent taking inventory in the provinces. During the week George passed his time alone in Baufluss' s apartment. Lacking anything else to do, he caught the attention of some of his schoolmates, who lived in the building across the way. Communicating by hand signals, they seemed surprised to see him holed up in somebody else's house. The following week the kind-hearted Baufluss, in an effort to cheer the unhappy lad up, took him off with him to the provinces. At the time he was working in Transdanubia, west of Budapest, on the model estate of a Jewish aristocrat, Baron Moric Kornfeld. There they were wined and dined by what was left of the staff. George also met several other ministry officials, who immediately took a liking to the young man, the alleged godson of Mr Baufluss. He even helped with the inventory. Surrounded by good company, he quickly regained his spirits. On Saturday he returned to Budapest.", "\"He even helped with the inventory,\" Tivadar Soros wrote. It's a detail one doesn't find in Kaufman's book. Some may rush to cite this as proof that Soros was indeed a \"collaborator,\" but given that it occurred on only one occasion, and that Soros was under an imperative to play the part of Baumbach's godson while in the company of actual Nazi collaborators, it demands stretching the meaning of \"collaborator\" beyond all reasonable limits.", "Moreover, these biographical passages demonstrate that Steve Kroft's claim on 60 Minutes that Soros \"accompanied his phony godfather on his appointed rounds, confiscating property from the Jews\" is flat-out false. Tivadar Soros wrote that most of young George's time under Baumbach's care was spent alone in the latter's apartment. Both Tivadar and Kaufman report that George only resided with Baumbach for a short time — a matter of weeks — before Tivadar, concerned that his son's real identity was in danger of exposure, shipped him off to spend the summer of 1944 with his mother (who herself was living under an assumed name at a lakeside resort some distance from Budapest). George Soros spent no further time with Baumbach.", "Did Soros Serve Jews with Death or Deportation Notices?", "Another \"Nazi collaborator\" trope holds that young George Soros helped send fellow Jews to their deaths by delivering deportation notices on behalf of Budapest's Jewish Council (Judenrat in German), an organization tasked by the Nazis with helping enforce Nazi policies on the Hungarian Jewish population:", "People Soros deported to Auschwitz", "Soros served Jews with \"death notices\" to go to Auschwitz\nhttps://t.co/mWVzcN2SlJ:", "— KellyLeeMedia (@jasian12345) August 23, 2017", "YOUNG SOROS delivered notices for Nazis informing Jews of deportation\nLater promoted to listing their confiscated property\n'Happiest youth'", "— armageddon #bluehand (@davis_blackwood) November 15, 2016", "However, as in the case of the \"confiscation\" rumors already discussed, here we find innocuous facts about George Soros's adolescence twisted and exaggerated into a grotesque lie. According to Soros's father, school-age Jewish children were required to run errands for the council. Among those errands (he came to find out) was delivering deportation notices to prominent Jews. But although George did, in fact, spend all of two days as a Jewish Council errand boy, he didn't perform his assigned tasks exactly as ordered, taking it upon himself to warn the recipients of the notices that they ought not to comply:", "As Jews couldn't go to school any more and their teachers couldn't teach, they were ordered to report to council headquarters. The children were enlisted as couriers under the command of their teachers. My younger son, George, also became a courier. On the second day he returned home at seven in the evening.", "'What did you do all day?'", "'Mostly nothing. But this afternoon I was given some notices to deliver to various addresses.'", "'Did you read what they said?'", "'I even brought one home.'", "He handed me a small slip of paper, with a typewritten message:", "SUMMONS", "You are requested to report tomorrow morning at 9 o'clock at the Rabbinical Seminary in Rokk Szildrd Street. Please bring with you a blanket, and food for two days.", "THE JEWISH COUNCIL", "'Do you know what this means?' I asked him.", "'I can guess,' he replied with great seriousness. 'They'll be interned.'", "Children are often good guessers. I wondered whether he knew what being interned meant. Did this child of mine realize that these people would be deported to Germany and very possibly murdered? I felt too ashamed of the world I had brought him into to enlighten him.", "'The Jewish Council has no right to give people orders like that,' I told him. 'You are not to work there any more.'", "'I tried to tell the people I called on not to obey,' he said, clearly disappointed that I wouldn't let him work any more. He was beginning to enjoy his career as a courier: it was all a big adventure.", "Did Soros Say Helping the Nazis was the Happiest Time of His Life?", "In a foreword George Soros wrote for a 2001 reprint of Masquerade, he described the ten months of the Nazi occupation as \"the happiest times of my life\":", "I was fourteen years old. We were in great peril, but my father was seemingly in command of the situation. I was aware of the dangers because my father spent a lot of time explaining them to me but I did not believe in my heart of hearts that I could get hurt. We were pursued by evil forces and we were clearly on the side of the angels because we were unjustly persecuted; moreover, we were trying not only to save ourselves but also to save others. The odds were against us but we seemed to have the upper hand. What more could a fourteen-year-old want? I adored and admired my father. We led an adventurous life and we had fun together.", "Predictably, this statement has been repurposed by Soros's political enemies, usually in tandem with the false claim that he was a Nazi collaborator, as an admission of moral bankruptcy:", "Soros =Funds BLM + Antifa + United Nations hate-fest NGO's. \"Happiest days of my life were helping the Nazi's in Hungary in 1944\" said Soros https://t.co/TbtZmNs833", "— Lloyd (@pood57) September 9, 2017", "George Soros: (Helping Nazis) \"Was The Happiest Time of my Life\" https://t.co/B8G1ZiY4Ze", "— California4TRUMP (@Tra777) September 5, 2017", "But at no time did Soros say \"helping Nazis\" was the happiest time of his life. As he has reiterated on numerous occasions, what he was referring to was the exhilaration of surviving the most perilous situation he and his family would ever face, under the guidance and tutelage of his father, whom George Soros saw as a heroic figure. \"It was his finest hour,\" Soros said of his father in his 2007 book, The Age of Fallibility:", "1944 became the formative experience of my life. I was fourteen and I had boundless admiration for my father. I absorbed and adopted his view of the world wholesale. As I have often said, the year of German occupation was a strangely positive experience for me. We were confronted by mortal danger and people perished all around us, but we managed not only to survive but to emerge victorious because we were able to help so many others. We were on the side of the angels and we triumphed against overwhelming odds. What more can a fourteen-year-old ask for?", "Anti-Defamation League Statement", "One of the ironies of these attacks on Soros based on his survival of the Nazi occupation is that they use his own (and his father's) candid remembrances of the experience to vilify him. As Holocaust survivor and Anti-Defamation League Director Abraham Foxman stated in response to Glenn Beck's attempted takedown of Soros in 2010, regardless of how one feels about the adult George Soros and his politics, the attacks are morally repugnant and unacceptable:", "Glenn Beck's description of George Soros' actions during the Holocaust is completely inappropriate, offensive and over the top. For a political commentator or entertainer to have the audacity to say – inaccurately – that there's a Jewish boy sending Jews to death camps, as part of a broader assault on Mr. Soros, that's horrific.", "While I, too, may disagree with many of Soros' views and analysis on the issues, to bring in this kind of innuendo about his past is unacceptable. To hold a young boy responsible for what was going on around him during the Holocaust as part of a larger effort to denigrate the man is repugnant.", "The Holocaust was a horrific time, and many people had to make excruciating choices to ensure their survival. George Soros has been forthright about his childhood experiences and his family's history, and there the matter should rest.", "Phillip, Abby.   \"The Moral Guilt of Oskar Groening, the 'Accountant of Auschwitz.'\"    The Washington Post.   21 April 2015.", "Kaufman, Michael T.   Soros: The Life and Times of a Messianic Billionaire.    New York: Knopf, 2002.   ISBN 9780375405853, p. 37.", "Soros, George.   The Age of Fallibility: Consequences of the War on Terror.    New York: PublicAffairs, 2007.   ISBN 9781586485337, p. 30.", "Soros, Tivadar.   Dancing Around Death in Nazi Occupied Hungary.    New York: Arcade Publishing, 1965 (reprinted 2011).   ISBN 9781611450248.", "Anti-Defamation League.   \"Glenn Beck's Remarks About Soros And The Holocaust 'Offensive And Over The Top.'\"    11 November 2010.", "BBC News.   \"'Auschwitz Bookkeeper' Oskar Groening Sentenced to Four Years.\"    15 July 2015.", "Biography.com.   \"George Soros.\"    23 August 2016.", "The Jewish News of Northern California.   \"Glenn Beck Attack on George Soros Outrages Jewish Leaders.\"    12 November 2010.", "Updated [19 September 2017]: Added more details and sources.", "Correction [4 February 2018]: Corrected misspelling of Tivadar Soros's first name.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]