["President Uhuru Kenyatta made claims about the covid-19 positivity rate in August and September national speeches, his claims didn't add up.", "In national speeches in August and September, Kenyatta said the positivity rate for Covid-19 had fallen from 13% in June. But this rate was only reached in July.", "The president was closer to the mark with his estimate of an 8% positivity rate in August.", "Several experts told Africa Check that reaching a 5% Covid-19 positivity rate is not the only recommendation by the WHO to guide the reopening of an economy. Other factors must be considered.", "In late September 2020 the Kenyan government called a national conference to chart its “post-Covid future” as it gradually reopens its battered economy.", "Afterwards, president Uhuru Kenyatta announced a further easing of the restrictions in place since March to counter the spread of Covid-19.", "The academic year had been abandoned, but schools would now reportedly reopen in October 2020, with teachers already recalled.", "As the country waits for more guidance from the presidency, we fact-checked three claims Kenyatta made in an August 2020 national speech, variations of which he repeated in his 28 September address.", "Health experts have indicated that levels of the positivity rate countrywide have fallen from a high of 13% in June ...", "Kenyatta said that health experts had “indicated that levels of the positivity rate countrywide have fallen from a high of 13% in June to 8% in August” and described this as “very encouraging”.", "In September the president repeated a slightly different version of this claim: “Yes, the COVID positivity rate has fallen from 13% in June, 7% in August and is now at 4.4% in September.”", "The positivity rate is the number of positive cases calculated as a percentage of the number of people tested, Dr Patrick Amoth, acting director-general in Kenya’s health ministry, told Africa Check.", "“If you test 1,000 people and 100 people turn [out] positive, the positivity rate is 10%,” he said. (For a deeper discussion of this rate, see here.)", "Africa Check has contacted the president’s spokesperson Kanze Dena-Mararo for the source of Kenyatta’s figures. We will update this report with her response should we hear back.", "The best testing data available is the national surveillance data from all approved Covid-19 testing laboratories, Dr Abdhalah Ziraba, an epidemiologist at the African Population and Health Research Center in Nairobi, told Africa Check. Kenya’s health ministry releases this information in its daily briefings.", "Ziraba told Africa Check that daily, weekly or monthly positivity rates could be reported, but “often, for practical reasons, weekly averages are preferred”.", "“There is less noise in the data, and they are not too infrequent, while monthly averages are prone to loss of details of how things are changing,” he said.", "Official situation reports from the government initially plotted positivity data daily before switching to weekly graphs.", "Africa Check compiled this data using the health ministry’s daily reports, daily press releases and its social media updates. The data shows that the highest seven-day positivity rate for June 2020 was 8%, in the last week of the month, and not 13% as the president said.", "To cross-check this, we also used the seven-day moving average and compared it with other international data.", "We therefore rate the president’s claim as incorrect.", "SOURCE: KENYA MINISTRY OF HEALTH. FOR A GRAPH OF THIS DATA CLICK HERE", "… [positivity rates have fallen] to 8% in August.", "On 2 September, Dr Amoth, acting director-general for health, tweeted that the positivity rate for July 2020 was 13%, matching that reported by the ministry.", "For August 2020, the weekly positivity rates were 11%, 10%, 7% and 6%, according to the ministry’s daily report of 15 September. (Note: These are calculated as seven-day moving averages by the ministry. These are considered more reliable. The table above does not have a moving average. We have also rounded up the rates.)", "The average of these weekly positivity values in August came to 8.5%. We therefore rate the president's claim here as mostly correct.", "… we have a chance to reach the 5% positivity rate recommended by the World Health Organization for a total reopening of our economy and country.", "In April the World Health Organization released guidelines on controlling the Covid-19 pandemic. Subsequent communications from the global health agency have advised on schools, workplaces and mass gatherings.", "The WHO said decisions to introduce, adapt or lift public health or social measures should be carefully assessed. Some of the considerations should include the ability to detect a resurgence and to manage extra patients in health facilities.", "Less than 5% of samples testing positive for at least two weeks was only one of the indicators that could be used to decide if the epidemic was under control.", "Dr Ziraba, epidemiologist at the African Population and Health Research Center, said that a 5% positivity rate was low enough to have “minimal transmission if people are interacting and going back to their normal routines, where the risk is manageable, the healthcare system can cope with whatever infections can come up, and we are unlikely to have a flare up”.", "“The positivity rate is not a magic bullet for the control of Covid-19,” Dr Amoth, of Kenya’s health ministry, told Africa Check. Before a decision was made, a number of other factors were considered, he said.", "This included the number of Covid-19 patients admitted to hospitals and the number of patients in critical care.", "Dr Isaac Ngere, an epidemiologist in the department of global health at Washington State University in Kenya, agreed that other indicators and not only the positivity rate mattered.", "These included mortality and the ability of the health system to manage a surge, he said.", "According to the WHO, the 5% positivity rate can only be interpreted if there is thorough testing, with one thousandth of the population tested every week. Kenya’s 2019 census put the country’s population at 47.6 million, so to comply with the WHO recommendation the country would need to test at least 47,600 people a week.", "Amoth conceded Kenya could be doing more tests. “If you are doing very few tests, the positivity rate will not add much value to your interventions.”", "He said “challenges in the global supply chain in getting reagents” was one of the reasons for the current level of testing in the country.", "Falling cases might not necessarily indicate that the pandemic was being successfully managed, Ngere said.", "Depending on who was being tested, a declining positivity rate backed by good contact tracing and testing was desirable, and a sign of a slower progression of the epidemic, he said.", "“However, this may not be so if the persons being tested are considered low risk. Currently, Kenya tests groups considered to be high risk: truckers, travellers, symptomatic persons referred from hospitals across the country and contacts of cases. This would therefore mean that the true population positivity could be the same or lower”.", "Yes, the WHO does recommend a 5% positivity rate as a threshold for easing public health restrictions due to the pandemic. But it is not the only measure that should be used.", "We therefore rate the president’s claim as misleading.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]