["“शाम होते ही #शराब के नशे में चूर हो जाने वाली से #कांग्रेस को उम्मीद हो सकती है मगर देश को नहीं है (Congress can have their hopes on those who get drunk every evening but the country cannot. -translated)”A video of Priyanka Gandhi speaking angrily with people at what seems like a public gathering has gone viral on social media. The text circulated along with the video suggests that she can’t be trusted as a politician since she is an alcoholic. Humlog, a Facebook page has posted the video with the same text. It has been viewed more than 98,000 times and shared more than 3,900 times so far.", "It has also been shared by several other individuals on Facebook and Twitter with an identical narrative. An individual page, Vimal Sharma has posted the same video which has garnered more than 1,40,000 views and 6,000 shares.", "Alt News found the same video tweeted by ANI on April 12, 2018. It was captioned, “Priyanka Gandhi gets angry at the candlelight march, says ‘Nobody will push each other. You should know the reason for which you are here. If you cannot behave go home. Now, all of you will silently walk till there”.", "WATCH: Priyanka Gandhi gets angry at the candlelight march, says ‘Nobody will push each other. You should know the reason for which you are here. If you cannot behave go home. Now, all of you will silently walk till there’ pic.twitter.com/Hlu9cSKOJG", "— ANI (@ANI) April 12, 2018", "The incident was also reported by several mainstream media outlets as well. Priyanka Gandhi was at the midnight candlelight march led by the Congress President Rahul Gandhi to protest the Kathua and Unnao rape cases. According to a India Today report, she lost her cool when the crowd did not let her pass and her children were also pushed around at the march. Moreover, a report published by Hindustan Times stated, “The police had a hard time controlling the crowd (some of them were even drunk) as many had crossed over the barricades and even broke through them. Traffic movement too came to a halt near the India Gate due to the crowd.”", "Video of Priyanka Gandhi rebuking members of an unruly crowd at a candlelight march organised by INC was circulated on social media with a false narrative that she was in an intoxicated state. This instance of fake news about Priyanka Gandhi comes after her appointment as AICC general secretary for Uttar Pradesh East.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]