["This Facebook post has been shared more than 19,000 times since it was published on August 12, 2019.", "Translated from Urdu, its caption reads in part: “Today women of Pakistani Azad Kashmir presented bangles to Pakistani army (to say) that you are not able to fight, put on these bangles, women are being raped in occupied Kashmir and you are eating rotis here.”", "Here is a screenshot of the misleading Facebook post:", "“Azad Kashmir”, or Free Kashmir, refers to the section of Kashmir administered by Pakistan.", "“Occupied Kashmir” refers to the section of Kashmir administered by India.", "Kashmir has been divided between India and Pakistan since 1947, and both countries have fought two wars over the territory. More background on the region’s history can be found in this AFP explainer.", "The same photo has been posted on Twitter with similar claims here, here and here.", "A keyword search reveals that this photo was first published online in 2013.", "Pakistani news website Hamariweb published the photo here on May 13, 2013, titled: “Women gave Bangles to Rangers in Karachi.”", "Here is a screenshot of the page carrying the photo:", "A one-minute, 13-second video, published here on DailyMotion in 2013 with a title: “Women give bangles to coward Pakistan police and Pakistan rangers during election day (2013),” shows scenes similar to the one seen in the photo.", "What appears to be the same woman and soldier shown in the photo are seen at the 14-second mark of the footage.", "Below is a screenshot of the video:", "The caption accompanying the video says it depicts a protest in Karachi against claims of vote rigging in the aftermath of Pakistan’s general election of May 11 of that year. An AFP report on that poll can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]