["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic Gov. Gavin Newsom said California's homelessness crisis “has persisted for decades” and made a claim that suggests it was worse 15 years ago.", "Gov. Newsom's figures are technically right based on federal homelessness reports.", "But his statement ignores a key change in how those reports count homeless people. In the past, they tallied a large number of “hidden homeless,” those living temporarily at a friend’s home or motel. Today, those people are no longer counted, meaning Newsom’s comparison is problematic, at best.", "Gov. Gavin Newsom dedicated his second State of the State address almost entirely to California’s deepening homelessness crisis. He said the problem today requires \"a coordinated crisis-level response,\" one that gets \"the mentally ill out of tents and into treatment\" and produces affordable housing to ensure no Californian is homeless.", "But Newsom also said the crisis \"has persisted for decades\" and made a claim that suggests it was worse 15 years ago.", "\"Back in 2005, when we did that first point-in-time count, there were over 188,000 thousand people that were deemed homeless in the state of California. … That’s 35,000 more than we have today,\" Newsom said during his address, held at the state Capitol.", "Those figures caught our attention.", "Has the state’s homeless population really dropped by 35,000 over the past decade and a half? We set out on a fact check.", "‘Apples To Oranges’ Comparison?", "The U.S. Department of Housing and Urban Development tracks homeless figures for each state based on point-in-time counts conducted every two years by local agencies. For 2005, HUD listed California’s homeless population at 188,299, matching Newsom’s figure.", "Last month, HUD released its 2019 report showing California had 151,278 homeless people, or about 37,000 fewer than in 2005. That also generally lines up with the governor’s statement.", "But we found there’s been a major change in how homeless people are counted since 2005. At that time, some communities, including Los Angeles County, would count the \"the hidden homeless,\" or those who were temporarily living in a motel or on someone’s couch, in addition to those who lived on the streets, in cars, shelters or abandoned buildings.", "HUD stopped allowing the practice of counting the hidden homeless several years ago.", "That makes comparing past data to today’s \"apples to oranges,\" said Bob Erlenbusch, executive director of the Sacramento Regional Coalition to End Homelessness. \"It’s not even close.\"", "Sharron Rapport, director of the California Policy Corporation for Supportive Housing, said a significant number of people who were counted as homeless residents in the past are no longer tallied.", "\"There may not be an actual decrease of 35,000 people experiencing homeless. It could just be that we counted them differently before,\" said Rapport, who serves on the governor’s homelessness task force.", "Advocates for homeless people have criticized HUD’s methodology for not counting these less-visible individuals. They have said point-in-time counts, which are conducted on a single night at the end of January and largely by volunteers, tally only a fraction of the total homeless population.", "\"We know there’s an epidemic, right? You would have to be blind to not understand the nature of the epidemic,\" Margaretta Lin, executive director of the Dellums Institute for Social Justice said in a CityLab news article in 2019. \"But HUD defines homelessness as people who are literally homeless. People who are in a motel for that night or couch surfing for that night, under the HUD definitions, they are not considered homeless.\"", "While the change in HUD’s methodology partially explains the lower homeless population, Rapport said California is also doing a better job housing people without a permanent home than it did in the past.", "Los Angeles County, for example, is now housing 133 homeless people per day, a significant increase from the past, Los Angeles Mayor Eric Garcetti said at a forum last week on homelessness. The mayor noted, however, that an estimated 150 people per day are becoming homeless in the county.", "A More Visible Crisis", "Setting the numbers aside, Rapport said there are several reasons homelessness is more visible now compared with 15 years ago. For one, it’s in more communities.", "\"It used to be more concentrated in specific areas. Now it is more dispersed,\" Rapport said. \"We see homelessness in every part of our state. … It’s not just in our urban centers, it’s in our suburban areas, it’s in our rural areas. People notice it more, I think, because of that.\"", "The high-profile Hepatitis A outbreaks that spread in homeless communities in San Diego and Los Angeles, along with more media coverage of the topic have also raised awareness, she said.", "When we asked about Newsom’s statement, the governor’s office told us it’s \"not a perfect\" comparison. But, they said, the federal reports are the only comprehensive source available.", "They added that Newsom was not trying to suggest that the crisis has improved, just the opposite.", "Our Ruling", "Newsom claimed: \"Back in 2005, when we did that first point-in-time count, there were over 188,000 thousand people that were deemed homeless in the state of California. … That’s 35,000 more than we have today.\"", "His figures are technically right based on homelessness reports issued every two years by the U.S. Department of Housing and Urban Development.", "But his statement ignores a key change in how the reports count homeless people. In the past, they tallied a large number of \"hidden homeless,\" those living temporarily at a friend’s home or motel. Today, those people are no longer counted, meaning Newsom’s comparison is problematic, at best.", "We rated the governor’s claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "RELATED:", "Transcript And Analysis: California Gov. Gavin Newsom's 2020 State Of The State", "One year in, Gov. Gavin Newsom shows bold action, but California’s homelessness crisis deepens", "‘A Real Emergency’: Newsom Issues Executive Order To Use State Land, Travel Trailers, Hospitals For California Homeless Crisis", "A promise stalled: Eight months in, Gov. Gavin Newsom has yet to hire a homelessness czar", "Gov. Gavin Newsom, State of the State Address, Feb. 19, 202", "Bob Erlenbusch, executive director, Sacramento Regional Coalition to End Homelessness, phone interview Feb. 19, 2020", "Sharon Rapport, director, California Policy Corporation for Supportive Housing,  phone interview Feb. 19, 2020", "U.S. Housing and Urban Development Department, The 2019 Annual Homeless Assessment Report to Congress, accessed February 2020", "U.S. Housing and Urban Development Department, HUD's 2005 Continuum of Care Homeless Assistance Programs Homeless Populations and Subpopulations, accessed February 2020", "CityLab, Is There a Better Way to Count the Homeless?, March 4, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]