["By Angelo Fichera", "Posted on November 10, 2020", "Viral social media posts claim that the website RealClearPolitics rescinded a projection that Joe Biden had won Pennsylvania. But the website never called the state in the first place; many other media outlets have made that call.", "Prominent social media accounts helped spread a viral, false claim that a well-known politics website had withdrawn a projection declaring former Vice President Joe Biden the winner of Pennsylvania in the 2020 presidential election.", "But the website referenced, RealClearPolitics, had never called a winner in the state in the first place.", "The race in Pennsylvania has instead been called by many other outlets, including the Associated Press and Fox News. Biden leads by about 46,000 votes in the state (as of Nov. 10).", "The Associated Press explained on Nov. 7 that it made its call when Biden held a 34,243-vote lead, “after it determined that the remaining ballots left to be counted would not allow Trump to catch up.”", "In a tweet, former New York City Mayor Rudy Giuliani, President Donald Trump’s attorney, claimed that “Real Clear Politics just took PA away from Biden and made it a toss up.”", "The claim was quickly debunked by RealClearPolitics President and Co-founder Tom Bevan, who responded to Giuliani’s tweet.", "“This is false,” Bevan wrote. “We never called Pennsylvania, and nothing has changed.”", "But the same erroneous claim was shared by many others — including by Sean Spicer, Trump’s former press secretary (who later corrected himself) — and spread by thousands across social media.", "“Joe Biden is no longer the President-elect according to RealClearPolitics,” a tweet-screenshot posted on Instagram wrongly declared. It garnered nearly 15,000 likes.", "With Pennsylvania’s 20 electoral votes, Biden has won at least 279 electoral votes in many projections. The Associated Press and Fox News have put him at 290 with Arizona.", "RealClearPolitics still lists Biden at 259 electoral votes compared to Trump’s 214. An archived version of the website’s live election results page shows the site had the same figures on the day that Biden was projected the winner by other news outlets.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Bevan, Tom (@TomBevanRCP). “This is false. We never called Pennsylvania, and nothing has changed.” Twitter. 9 Nov 2020.", "“Live Results | 2020 ELECTION: PRESIDENT.” RealClearPolitics. Archived 7 Nov 2020.", "“Live Results | 2020 ELECTION: PRESIDENT.” RealClearPolitics. Accessed 10 Nov 2020.", "“Pennsylvania | Elections 2020.” Fox News. 10 Nov 2020.", "“Pennsylvania Elections – Summary Results.” Pennsylvania Department of States. Accessed 10 Nov 2020.", "Slodysko, Brian. “EXPLAINER: Why AP called Pennsylvania for Biden.” Associated Press. 7 Nov 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]