["About this rating", "In August 2015, former president Jimmy Carter announced that he had cancer which had spread from his liver to other parts of his body. However, after less than four months of treatment, the 39th president was able to announce to his fellow congregants at Maranatha Baptist Church in Plains, Georgia, that he was free from cancer, as the Washington Post reported:", "Carter’s announcement came four months after he had disclosed a daunting diagnosis: a form of melanoma that had spread across parts of his brain and that only a decade earlier would have qualified as a near-certain death sentence. But in this case, a combination of radiation treatments and a new immune-based therapy have raised the odds of survival, according to doctors and medical experts ...", "Carter, 91, had a small cancerous mass removed from his liver on Aug. 12, and shortly afterward, doctors found four spots of melanoma on his brain. He has been in treatment since then and has been receiving a newly approved drug aimed at helping the immune system recognize and fight cancer cells.", "Almost three years later, several posts went viral on social media that contained language very similar to Carter's original 2015 cancer announcement. For example, on 20 August 2018 a Twitter user with the handle @clae48 posted a \"Prayers for President Carter\" graphic bearing the logo of the Columbus, Ohio, ABC affiliate WSYX:", "PRAYERS FOR CARTER --", "President Jimmy Carter has announced his recent liver surgery found cancer that has spread to other parts of his body.", "Spread the word and pray for our 39th President by sharing this image made by ABC 6. pic.twitter.com/yiKrzi9TPG", "— clae (@clae48) August 21, 2018", "That tweet was shared 26,000 times within a week, and two days later a Facebook user named Sheree Williams posted the same graphic with the same message, garnering 156,000 shares in one week and prompting inquiries from our readers:", "The August 2018 rumors were outdated information. The text of the social media posts, as well as the graphic, were both taken from a 13 August 2015 Facebook post by WSYX. In August 2018, the station added an \"editor's note\" emphasizing that the original post dated from 2015 and was not a \"current story.\"", "The former president did not experience a re-emergence of his cancer in August 2018, as the Carter Center pointed out in a public response to the misleading memes. The 93-year-old Carter still has \"no cancer,\" the center confirmed:", "Stories in the last day on social media stating that Jimmy Carter has cancer again are based on old news reports in 2015. There are no updates to our last statement about his health, and a recent scan showed no cancer.", "— The Carter Center (@CarterCenter) August 22, 2018", "Carter, Jimmy.   \"Statement grom Former U.S. President Jimmy Carter.\"\r\n    The Carter Center.   11 August 2015.", "Dennis, Brady and Chico Harlan.   \"Good News from Jimmy Carter. He's Cancer-Free.\"\r\n    The Washington Post.   6 December 2015.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]