["About this rating", "A video supposedly showing a person with \"reptilian\" eyes is frequently shared on social media:", "This video does not document the existence of a reptilian humanoid race. This video actually showcases the digital editing of Instagram user @Nickels.", "This video was originally posted to Nickels Instagram page in March 2019. While that posting did not include any disclaimers to notify viewers that what they were witnessing was a work of computer-generated imagery (CGI), and not a reptilian race of humanoids, Nickels is well-known for his digital creations. In March 2019, for example, a video went viral that supposedly showed YouTube star Logan Paul getting a camera implanted into his forearm. A similar video showed musician Nessly with a autotune device implanted in his arm.", "These videos are all the result of digital editing. Paul does not have a camera installed in his arm, Nessly can't autotune his voice by singing into his wrist, and the person featured in the above-displayed video does not have reptile eyes.", "While these videos may seem like obvious fakes to some viewers, they can be mistaken for authentic when presented out of context. The \"reptilian eye\" video, especially, plays into a centuries-old conspiracy theory about the world being secretly ruled by a lizard people. In fact, when the \"reptilian eyes\" video went viral in December 2020, it was attached to a piece of text claiming that this person was from a \"draconian/Illumaniti bloodline.\"", "I got draconian/Illumaniti bloodline. Reptilians they call us. Had to put night vision on cause you won't see it since my eyes are dark. But yea hope i don't die for showing this. I mean nobody knows who I am so I'm safe for now. might go to instagram live later. Show ya'll this Draco shit. Not the Soulja boy Draco either.", "Conspiracy theories about a secret race of lizard people have persisted for years, despite zero evidence to support it. \"Sightings\" are typically made up out of whole cloth or, as in the case above, on doctored videos.", "Still, this hasn't stopped people from searching. In December 2020, investigators in Nashville, Tennessee, said that the person responsible for the Christmas Day bombing had even made comments about powerful politicians actually being part of a race of lizard people, prompting investigators to consider it as a possible motive for the incident.", "NBC News reported:", "Investigators are exploring several conspiracy theories as potential motives behind the Christmas Day bombing of an AT&T building in Nashville, including evidence that the bomber believed in lizard people and a so-called reptilian conspiracy, two senior law enforcement officials told NBC News Wednesday.", "Investigators are expected to conclude their crime scene work this week, but it could take several more weeks until they key in on the motive of Anthony Quinn Warner, who died in the bombing.", "Authorities have been probing Warner’s digital devices – which one official says comprises a significant trove of pictures, videos, and writings – since Saturday looking for any clues on what drove the man to set off a powerful bomb inside his recreational vehicle that took down communications networks and injured several people in downtown Nashville.", "Specifically, investigators are looking into the suspect’s previous trips to an undisclosed location in Tennessee where he would camp out in his RV and according to the suspect’s statements to others, hunt possible aliens, the officials said.", "In addition, investigators are aware of statements the suspect made about an internet conspiracy that powerful politicians and Hollywood figures are actually lizards or other reptiles who have extraterrestrial origins and are taking over society, the officials said.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]