["The aftermath of Mandsaur rape saw a flood of fake news on social media. Newest to the addition of lies are fake quotes attributed to Congress leaders in an attempt to portray them as sympathetic to the alleged rapist.", "Several posts on social media claim that Congress Madhya Pradesh MP Jyotiraditya Scindia called for a CBI enquiry in the rape of the 8-year-old girl from Mandsaur, citing the possibility of the rapist Irfan being innocent. Serial purveyor of fake news, Indiaflare.com, published an article on the fake quote. This is the same website that had earlier circulated a morphed image of Muslims demanding the release of Mandaur rapist, when in fact the rally was taken out in protest of the brutal crime.", "It has been shared more than 2,000 times from the Facebook page BJP All India.", "Posted by Bjp All India on Sunday, 1 July 2018", "The fake quote has more than 2,800 shares on Yogi Adityanath Ki Sena. Several other right-wing pages – Modi Sena, Vote 4 BJP, We Support Yogi Adityanath, among others – have also shared the fake quote.", "Congress spokesperson Randeep Surjewala clarified to Alt News that Scindia has been misquoted. “He never made this statement but called for a CBI enquiry to punish all those involved in the crime.”", "Jyotiraditya Scindia demands CBI probe Mandsaur rape case #ITVideo For more videos: https://t.co/NounxnP7mg pic.twitter.com/huHgZOTmaS", "— India Today (@IndiaToday) June 30, 2018", "Another post by Facebook page Jay Modiraj alleges that while BJP supports capital punishment of the rapist, Congress is demanding a CBI enquiry.", "Indiaflare.com has also attributed a manufactured quote to Randeep Singh Surjewala, claiming that the Congress spokesperson said, “Mohammed Irfan cannot be considered a rapist because Islam permits the rape of women from another religion. He should be released.” This was the same narrative pushed by the fake news website in its article on ‘Muslims demanding the release of Mandsaur rapist.’ The fake quote attributed to Surjewala has been shared on Join and Support PM Modi (2019) by one Anurag Tiwari, whose account seems fake as there is no activity on the profile. It has more than 500 shares.", "“This is another instance of fake news by BJP trolls. I have never made such a statement. A rapist is a rapist and needs to be punished in accordance with the law. A rapist cannot be adjudged on the basis of caste or religion,” Surjewala told Alt News.", "3. Rahul Gandhi: “Muslims can’t rape”", "A fake quote ascribed to Congress President Rahul Gandhi claims that he too supported the rapist. “Muslims cannot rape. This is a scheme by BJP to malign the reputation of our Muslim brothers,” is the false statement being peddled on social media. It was posted by a Facebook page BJP Khargone Barwani and has attracted more than 8,700 shares.", "भाईयो क्या के रहा है ये पप्पू । इसके बारे मे दो सब्द कहे", "Posted by BJP Khargone Barwani on Monday, 2 July 2018", "The fake quote has also been shared by BJP All India, attracting more than 2,700 shares.", "“Rahul Gandhi never made this comment. Such obnoxious trolling and manufacturing of lies will not deter us from speaking the truth to those in power,” said Surjewala.", "Earlier, Congress spokesperson Priyanka Chaturvedi was targeted on social media with a fake quote claiming that she said it is the “right of Muslims to rape”. The manufactured statement attracted rape threats to Chaturvedi and her daughter. This isn’t new, but an identical trend was recognised in June in the run-up to Pranab Mukherjee’s address to RSS cadres in Nagpur. Among the number of false statements ascribed to him, right-wing pages on social media claimed that the former President termed Manmohan Singh as Congress’ “slave” and said that “Sonia Gandhi hates Hindus”.", "Manufacturing fake quotes is a common trend in the current state of affairs. It is a tactic to malign a certain section of the society and/or individuals belonging to a different political sphere to play on people’s fears. Social media users are advised to verify with credible media sources and/or visit social media handles of public personalities to check if they have made the comments attributed to them or not.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]