["Recently, a claim about mosques in Nepal has been doing the rounds on social media. It alleges that Nepal’s Supreme Court banned loudspeakers in mosques. Twitter user Deepak Sharma’s tweet promoting the claim drew more than 9,500 retweets and was liked over 2,000 times at the time of writing. (Archive link)", "नेपाल में अब नहीं लगेंगे मस्जिदों पे लाउडस्पीकर ! नेपाल सुप्रीम कोर्ट ने इसे अपराध की श्रेणी में रखा!", "— Deepak Sharma (@TheDeepak2020In) December 21, 2020", "A Twitter handle created in the name of Sadhvi Prachi, a BJP leader affiliated to the Vishwa Hindu Parishad, also made a similar claim in a tweet. We found three Twitter handles claiming to be the politician’s official account. None of these is verified accounts.", "Kalpana Shrivastava, who describes herself as a lawyer, also tweeted this claim. (Archive link)", "नेपाल में लगे Mस्जिदों पर लाउडस्पीकर हटाने की SC में अर्जी मंजूर,नेपाल लाऊड स्पीकर मुक्त। प्रयास जारी रहेगा तुम सिर्फ ट्विटर अकॉउंट बन्द करवाने में लगे रहो खालिस्तानियों और हम हर अवैध स्पीकर हटवा कर रहेंगें क़ानूनी प्रक्रिया के तेहत।", "— कल्पना श्रीवास्तव (@Lawyer_Kalpana) December 21, 2020", "Facebook page ‘Hindu Rashtra Bharat‘ posted something similar and shared a few documents.", "This claim is gathering a lot of traction on Twitter and Facebook.", "This slideshow requires JavaScript.", "We could not find any media reports to corroborate the viral claim. We also searched the Supreme Court of Nepal’s website and found no such information there either.", "Alt News reached out to South Asia Check editor Deepak Adhikari who said that the court’s decision has been wrongly presented. The Supreme Court of Nepal ruled to keep the volume of mosque loudspeakers low, not ban them altogether.", "Deepak Adhikari also contacted Nepal Supreme Court spokesman Bhadrakali Pokharel on our behalf. “This is a temporary stay order. The judge gave this decision while hearing on a petition. He made a decision to keep the sound of loudspeakers in mosques low. They have not banned loudspeakers. The court gave this order on November 29. The next hearing on this petition was given on December 10. The defence did not appear and the hearing was cancelled,” Pokharel informed. Adhikari told us that the matter is still in court.", "The documents shared on Facebook were from the November 29 hearing.", "This slideshow requires JavaScript.", "India Today and Dainik Bhaskar have also published fact-check reports on the viral claim.", "Therefore, the Supreme Court of Nepal had decided to lower the volume of mosque loudspeakers. The matter which is still in court was altered on Indian social media. False claims suggested that the Nepalese Supreme Court banned loudspeakers in mosques.", "[Note: This article will be updated as the case progresses in court.]", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]