["About this rating", "A common home remedy posted on various parenting webs ites states that grape juice can act as a preventative tool against a viral infection in your stomach should you or a family member be exposed to someone with a contagious viral stomach infection. The most commonly shared version of this claim comes from the web site “Must Have Mom,” which suggests two mechanisms comprise these supposedly preventative properties of grape juice: the regulation of pH and the presence of antiviral chemicals:", "The grape juice works by changing the pH in your intestinal tract so that the virus can’t multiply. It also harbors various strong anti-viral chemicals in it. Along with the Vitamin C and anti-oxidants in the juice, it’s supposed to flush and kill the virus and/or severely lesson [sic] the symptoms.", "When you get a stomach virus, it actually isn’t in your stomach, it’s all in your large and small intestines. The effects of what it’s doing to those makes you sick to your stomach (changing the acidity in your stomach). Keeping the pH of the intestines slightly more alkaline is supposed to stop the virus from taking hold and thus making you sick.", "The pH mechanism is almost certainly bunk. The two main viral causes for gastroenteritis are the norovirus and rotavirus, both of which enter the body through the mouth and infect either the stomach or (more commonly) the intestines. Any pH influence that grape juice may or may not have on the stomach or intestines pales in comparison to the wildly varied pHs the virus would have already survived on its course to one's gut.", "The antiviral chemical mechanism may have a bit more to it, but the the science behind is not exactly a settled issue. In the late 1970s, a study utilizing cell cultures seemed to demonstrate that grape juice had the ability to inhibit or reduce the infectability of various viruses. This process was attributed to a class of chemicals called polyphenols found in high concentrations in the skin of grapes, as reported in a 1977 Science News article:", "Since chemicals known as naturally polymerized phenols appear to provide the antibacterial property of wines, probably by binding to bacterial proteins, [authors] Konwalchuk and Speirs believe that these chemicals may also provide the antiviral activity in grapes and grape products by binding to viral proteins. With such binding, viruses might lose their infectivity. Indeed, phenols have been found in abundance in the skins of grapes, the part of grapes that contains most antiviral activity, have been identified in grape juice, and have been observed in large amounts in red wines but in lesser amounts in white wines.", "The authors cautioned, however, that the results were not sufficient to make the claim that the discussed properties of grapes were relevant to the prevention of disease in humans:", "Since the antiviral section of grapes and grape products were only shown at the test-tube level, Konowalchuk and Speirs caution that the results cannot yet be extrapolated to the human situation — that is, prove that grapes and grape products protect people against viral diseases.", "The problem is that scientists do not know the specific mechanism that would initiate grape compounds’ antiviral properties, and therefore we still do not know if the conditions utilized in vitro would be at all relevant in humans. This issue was covered in a skeptical rebuttal to the work of Konowalchuk and Speirs in a 1979 paper published by the Journal of Food Protection, in which researchers observed that the antiviral effects of grape compounds seemed to be temporary and that viruses would likely be reactivated in the body:", "These laboratory experimental approaches have failed to produce evidence that ingested grape juice would be valuable for antiviral prophylaxis or therapy in man. We think the potential purchaser would do best to continue to judge the product on its merits as a food.", "A more recent 2010 review of the beneficial properties of grapes published in the journal Nutrition Reviews didn’t rule out the idea of grape products as preventatives, but it made clear that the science on the topic hasn’t progressed much since the 1970s:", "No human clinical trials have been conducted in this area, but in vitro work suggests grape juice may exhibit antiviral activity. In monkey cell cultures, researchers have reported reductions in infectivity titers to undetectable levels within minutes of exposure to 25–2,000 mg/mL of proanthocyanidins [a class of polyphenols] from grape juice. [...] This antiviral activity is hypothesized to involve an effect on host cell surface involving an alteration in viral receptor sites.", "As mentioned in this same review, mounting evidence does suggest myriad other potential health benefits from compounds found in grapes:", "Accumulating evidence suggests that consumption of grapes and grape products can positively influence risk factors associated with cardiovascular health, cancer, neurodegenerative disease, and age-related cognitive decline.", "Grapes' viability as a viral prophylactic, however, has yet to be rigorously tested and demonstrated.", "Khutoryanskiy, Vitaliy V..   \"Supramolecular Materials: Longer and Safer Gastric Residence.\"\r\n    Nature Materials.   23 September 2015.", "Vidlovky, Lisa M., and Fernandez, Maria Luz.   \"Biomedical Effects of Grape Products.\"\r\n    Nutrition Reviews.   07 October 2014.", "Cliver, D.O., and K. D. Kostenbader, Jr.   \"Antiviral Effectiveness of Grape Juice.\"\r\n    Journal of Food Production.   February 1979.", "Konowalchuk, J, and Speirs, J. I.   \"Virus Inactivation by Grapes and Wines.\"\r\n    Applied and Environmental Microbiology.   December 1976.", "Science News.   \"Grape Products: Virus Killers.”\r\n    26 February 1977.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]