["A screenshot of the fake Zuckerberg video", "Weeks after a doctored video of House Speaker Nancy Pelosi was posted on Facebook, another fake video, this time depicting the company’s founder and CEO, Mark Zuckerberg, has appeared on Instagram.", "Facebook received flack when it didn’t remove the Pelosi clip from its platform after fact-checkers and journalists revealed it was deliberately slowed down to make it sound like she was slurring her words. The social media company, instead, chose to de-prioritize it in newsfeeds.", "Now the Zuckerberg clip, which was also posted to Facebook, takes it a step further, and is what experts consider to be a \"deepfake\" – a video that manipulates the likeness of a person and makes it look like they are doing or saying something that they didn’t.", "The video, posted to Facebook-owned Instagram on June 7 by artist Bill Posters, shows Zuckerberg sitting at a desk with a CBSN broadcast banner along the bottom that says \"We’re increasing transparency on ads,\" making it look like it was taken from a news segment.", "In the video, the likeness of Zuckerberg says, \"Imagine this for a second: One man with total control of billions of peoples stolen data, all their secrets, their lives, their futures, I owe it all to Spectre. Spectre showed me that whoever controls the data, controls the future.\"", "Mark Zuckerberg reveals the truth about Facebook and who really owns the future... see more @sheffdocfest VDR technology by @cannyai #spectreknows #privacy #democracy #surveillancecapitalism #dataism #deepfake", "A post shared by  Bill Posters (@bill_posters_uk) on Jun 7, 2019 at 7:15am PDT", "The video was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The deepfake was created by artists Bill Posters and Daniel Howe in collaboration with technology startups including CannyAI, Respeecher and Reflect, as part of an art installation called \"Spectre,\" according to Posters website.", "The installation displays videos of deepfake celebrities, including dead and living artists, the website says, to show how certain technologies can manipulate and alter data. The exhibit was on display at the Sheffield Doc/Fest in the United Kingdom from June 6-11.", "The original clip of Zuckerberg is from a 2017 video address he delivered explaining nine steps Facebook planned to take following findings that Russia interfered with 2016 U.S. elections using Zuckerberg’s social media platform.", "Omer Ben-Ami, co-founder of Canny AI, one of the video’s creators, told PolitiFact that the company develops a technology for video dialogue replacement using two videos, one of the person and another of the audio to be used.", "He said the company’s proprietary AI \"then trains on both videos and learns to reconstruct each facial movement of the actor,\" Ben-Ami wrote in an email \"...the initial training for this takes 12-24 hours.\"", "For the Zuckerberg video, Ben-Ami said the original clip was selected by the artists, Posters and Howe, and they found a voice actor to read from a script.", "\"They then sent us the video they chose of Zuckerberg and the video of the voice actor,\" Ben-Ami said, \"and within less than a day our system created the video of Zuckerberg facial movement synced to the voice actor.\"", "He added, \"For this specific exhibition we wanted to support Spectre's artists and also educate people about what can be done with the tech already today – this was a safe space where it was clear to the viewer the video was manipulated.\"", "Hany Farid, a professor of computer science and digital forensics expert at the University of California, Berkeley, agreed that the manipulation is clear. The resulting video, he said, looks like a lip sync.", "\"I believe that the Instagram video is a so-called lip sync deepfake in which Zuckerberg’s mouth has been resynthesized to be consistent with a new audio track. I believe that this new audio track is itself synthesized most likely from a system that learned to synthesize speech from previous recordings of Zuckerberg,\" Farid wrote in an email. \"This is not a particularly good fake and there are clear artifacts on the audio and video.\"", "PolitiFact reached out to Facebook for comment about this video clip, but we did not get a response before publication. We will update the story should Facebook reply. A spokesperson for CBS, meanwhile, reached out to PolitiFact to say that it has requested that Facebook, \"take down this fake, unauthorized use of the CBSN trademark.\"", "A video posted on Instagram appears to show Facebook founder and CEO Mark Zuckerberg telling the world that he controls \"billions of people’s stolen data\" in order to control the future.", "The clip was created by artists as part of an art installation called \"Spectre\" and is a \"deepfake\" video that used a real clip of Zuckerberg and manipulated the audio to make it appear as if he said things that he actually didn’t.", "We rate this fake video Pants on Fire!", "UPDATE, June 13, 2019: This story has been updated to include a statement from a CBS spokesperson regarding its request that Facebook, \"take down this fake, unauthorized use of the CBSN trademark.\"", "Instagram video, June 7, 2019", "YouTube, Facebook CEO Mark Zuckerberg discusses 'next steps in protecting election integrity', Sept. 21, 2017", "New York Times, On Russian Meddling, Mark Zuckerberg Follows a Familiar Playbook, Sept. 22, 2017", "PolitiFact, Viral video of Nancy Pelosi slowed down her speech, May 24, 2019", "VICE, This Deepfake of Mark Zuckerberg Tests Facebook’s Fake Video Policies, June 11, 2019", "CNN, A deepfake video of Mark Zuckerberg presents a new challenge for Facebook, June 11, 2019", "BillPosters.ch, Gallery: ‘Spectre’ Launches (Press Release), Accessed June 12, 2019", "Sitegallery.org, Sheffield Doc/Fest x Site Gallery – Alternate Realities Artist Commission Winner Announced, April 18, 2019", "Email interview, Hany Farid, professor of computer science and digital-forensics expert at University of California, Berkeley, June 12, 2019", "Email interview, Omer Ben-Ami, co-founder of Canny AI, June 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]