["This Facebook post contains three photos of women in hijabs and has been shared more than 27,000 times since it was first posted on March 17, 2019.", "The caption states: “Do you know.. They killed 50 Muslims while praying yesterday and today over 350 accepted Islam in New Zealand”.", "Below is a screenshot of the post:", "The post was shared two days after 50 worshippers in two mosques were shot dead in the city of Christchurch, New Zealand, on March 15. An Australian man has been charged over the murders. Here is an AFP report from March 20 about the incident.", "The same photos and claim was posted on a page entitled ‘Die for Islam’ here on March 18, 2019. The post has been shared more than 1,400 times.", "AFP established that one of the photos, in which a woman is pictured wearing a pale hijab and glasses, was not captured in New Zealand by conducting a reverse image search on Google.", "The photo appeared in a news story published by the Arkansas Democrat Gazette on February 15, 2016.", "The article’s headline reads: “Arkansas Christian earns attention with hijab”.", "Below is a screenshot of the article:", "The photo caption reads: “Nancy Allen of Conway wears a hijab, a head covering worn by Muslim women, to show support for them and for freedom of religion. Allen said she has gotten much more positive feedback than negative. - Photo by Kelvin Green.”", "AFP established that another image included in the post, which features a woman wearing in a dark blue hijab and a beige coat, has appeared online on multiple web pages since at least January 2018.", "Here is a screenshot of some of the results from a reverse image search of the photo on Google on March 20, 2019:", "This article, published on medium.com on January 31, 2018, included the same photo alongside an advert for hijabs for sale.", "Below is a screenshot of the article:", "The same photo was used by the same Medium author in articles here and here later in 2018.", "Through the same reverse image search process, AFP established the third image of a woman wearing a black hijab has appeared online since at least July 2018.", "The image was used in a Facebook post here on July 24, 2018.", "Here is a screenshot of the post:", "The image shows a Koran with a Spanish title: \"Del Noble Coran\".", "The same image was used with an identical caption here in a Facebook post shared on November 22, 2018.", "Except for the photos, none of the misleading posts offered any evidence to support the claim that 350 people in New Zealand had accepted Islam after the attacks.", "AFP debunked a video with a similar claim here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]