["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Twitter account associated with the group Anonymous posted this image on Aug. 13, 2014.", "The hacking collective known as Anonymous is trying to shine a light on the roots of the racial violence in a St. Louis suburb.", "On Aug. 13, the group published hours of alleged police dispatch tapes from the day Ferguson, Mo., police shot and killed unarmed teen Michael Brown.", "That same day, one of a handful of Twitter accounts claiming to be associated with the Anonymous group posted comments they say came from the wife of Ferguson Police Chief Tom Jackson.", "Speaking of people in Ferguson, a woman identified as Catherine Nardi wrote: \"They are feral and violent. They murder each other. They murder their unborn babies. They murder white people. They hate police officers and murder some of them, even black ones. They destroy neighbors and entire cities with garbage and drugs. They live their lives off the hard-earned tax dollars of other Americans. Yet somehow they are victims. What insanity is that?\"", "The comments have been retweeted more than 5,400 times.", "But the person in the Facebook message, Catherine Nardi, is not the wife of the Ferguson police chief.", "Nardi lives in St. Petersburg, Fla., not Missouri, according to public records. She is married to Henry Nardi, who is not the police chief of Ferguson. We reached out to Nardi via Facebook, but she did not respond. A woman answering a phone number associated with her hung up on a reporter. (Nardi removed her Facebook profile after this fact-check first published.)", "According to the St. Louis Post-Dispatch, Jackson’s wife is named Patricia, not Catherine. We were unable to reach Jackson’s wife.", "As for the specific words in the message, we did not find them on Nardi’s Facebook page or anywhere else.", "Our ruling", "A post from a group claiming that it is associated with Anonymous said that the wife of the Ferguson, Mo., police chief said African-Americans in Ferguson \"are feral and violent,\" among other things.", "The tweet references a Facebook post that is not from Jackson’s wife. The woman in the picture lives in Florida not Missouri.", "We rate this claim Pants on Fire.", "Twitter @occupythemob, tweet, Aug. 13, 2014", "Facebook page of Catherine Nardi, accessed Aug. 14, 2014", "St. Louis Post-Dispatch, City names new police chief, Feb. 13, 2010, accessed via Lexis-Nexis", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]