["By Saranac Hale Spencer", "Posted on December 14, 2018", "A $23.9 million mansion was falsely identified as Rep. Nancy Pelosi’s home in a viral meme. Pelosi actually lives in the same neighborhood in a $2.3 million house.", "A photo of a turreted mansion with views of San Francisco Bay that sold for $23.9 million in 2015 has been circulating online.", "The problem is that the picture has been plastered with this false statement: “This is mega millionaire Nancy Pelosi’s mansion on San Francisco bay. This elitist snob called a thousand dollars ‘crumbs’, that was given out in bonuses by employers after Trump’s tax cuts. What an entitled pig she is. (Notice she’s surrounded, and protected by a wall)”", "The house, which is located at 2724 Pacific Avenue in the Pacific Heights section of San Francisco, doesn’t belong to Pelosi. It is owned by 2728 Pacific LLC. A lawyer who represents the company declined to name the investors, but she did confirm that neither Pelosi nor any of her immediate family are involved.", "Pelosi does live in that neighborhood, though. She and her husband, Paul, bought a house in the Pacific Heights section for $2.3 million in 2007.", "That house and some other properties, including a vineyard and two commercial properties in San Francisco, are listed on Pelosi’s most recent financial disclosure. There is no mention of the turreted mansion or 2728 Pacific LLC.", "As for the other claims made in this meme, Pelosi is one of the wealthiest members of Congress. According to a list compiled by OpenSecrets.org that is based on financial disclosures from 2015, Pelosi was ranked the seventh richest with an estimated net worth of $100.1 million.", "And the claim that Pelosi called $1,000 bonus checks “crumbs” is based on a criticism she made of GOP tax changes, comparing the benefits that would flow to corporations versus the bonuses they were giving to workers. We wrote about that earlier this year.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Report for: 2724 Pacific Avenue. San Francisco Planning Department. Accessed 12 Dec 2018.", "Report for: 2640 Broadway. San Francisco Planning Department. Accessed 12 Dec 2018.", "Financial Disclosure Report, 2017, for Nancy Pelosi. Clerk of the House of Representatives. 14 May 2018.", "Richest Members of Congress, 2015. OpenSecrets.org. Accessed 14 Dec 2018.", "Farley, Robert. “Pelosi’s ‘Crumbs’ Comment in Context.” FactCheck.org. 2 Feb 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]