["By Sydney Nixon", "Posted on February 26, 2021", "A computer-rendered image has been mischaracterized on social media posts as a photo taken from Mars, purportedly showing Earth, Venus and Jupiter in vertical alignment. Although the same image was previously debunked in 2012, the claim resurfaced after the Perseverance rover landed on Mars in mid-February.", "Perseverance, the NASA rover, landed on Mars on Feb. 18. As part of NASA’s multibillion-dollar Mars 2020 mission, Perseverance has been tasked with seeking out “signs of ancient life” and bringing back samples of rock and soil.", "Within minutes of landing, Perseverance produced two low-resolution images of the Martian surface. These images sparked a burst of viral posts on Facebook regarding other sights — mostly in jest — showing a McDonald’s and a Dollar General store on the Mars landscape.", "On Feb. 21, a Facebook account called AstrophileDaily.com — which says it is “dedicated to sharing latest news in science, especially astronomy, physics and technology” — shared this image, which it claims to depict “Earth, Venus and Jupiter as seen from Mars.” The post has since amassed nearly 2,000 shares, and 3,000 reactions.", "But the image and description are deceiving and did not come from the Mars Perseverance mission.", "Derrick Pitts, chief astronomer at The Franklin Institute, told us in an email that the photo was “most likely generated from a desktop planetarium program.”", "He also directed us to an article from 2012 in Discover Magazine titled “An unreal Mars skyline.”", "When NASA’s earlier rover, Curiosity, landed on Mars in August 2012, the same image of Earth, Venus and Jupiter began orbiting on social media. Discover debunked claims about the image, noting various clues that it wasn’t authentic, including the “rendered by software” colors of the sky and landscape.", "The article’s author, Phil Plait, wrote: “I have a lot of experience looking at space images, and you just get a sense of what’s real and what isn’t. This one screams fake.”", "The final giveaway is the tiny “NE,” as in northeast, on the lower left corner of the image. Images rendered by planetarium software programs, like Starry Night and SkySafari, include coordinates along the horizon to contextualize the user’s point-of-view, Plait said.", "The article concluded, “the picture itself isn’t a hoax! It’s just a computer generated image probably meant to represent a real scene.”", "Actual images of Mars from Perseverance are easy to view on the NASA website. See one below:", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Achenbach, Joel, et al. “NASA rover Perseverance lands on Mars in mission to search for past life.” Washington Post. 18 Feb 2021.", "Derrick Pitts. Chief astronomer, The Franklin Institute. Email sent to FactCheck.org. 24 Feb 2021.", "Kaufman, Mark. “Mars Rover Landing a Success—What Happens Now?” National Geographic. 7 Aug 2012.", "“Mars 2020 Perseverance Rover.” NASA Science. Accessed 26 Feb 2021.", "NASA’s Perseverance Mars Rover. “Hello, world. My first look at my forever home. #CountdownToMars.” Twitter. 18 Feb 2021.", "Plait, Phil. “An unreal Mars skyline.” Discover Magazine. 10 Aug 2012.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]