["As WhatsApp’s privacy policy receives immense backlash, a viral text circulating on the messaging application claims that its services are ending tomorrow at 6 pm. The message warns that those who do not forward the text, their accounts will get deactivated. Once the message is forwarded 20 times, the blue ticks which presently indicate when a message is delivered will turn green, the text further claims.", "The complete message reads, “Tomorrow at 6 pm they are ending WhatsApp and you have to pay to open it, this is by law. This message is to inform all of our users, our servers have recently been very congested, so we are asking you to help us solve this problem. We require our active users to forward this message to each of the people in your contact list to confirm our active users using WhatsApp if you do not send this message to all your contacts WhatsApp will then start to charge you. Your account will remain inactive with the consequence of losing all your contacts. Message from Jim Balsamic (CEO of Whatsapp) we have had an over usage of user names on WhatsApp Messenger. We are requesting all users to forward this message to their entire contact list. If you do not forward this message, we will take it as your account is invalid and it will be deleted within the next 48 hours. Please DO NOT ignore this message or WhatsApp will no longer recognise your activation. If you wish to re-activate your account after This is the last message from Whatsapp™️. Kindly send this to 20 people to register urself in Free-Whatsapp mode. If you send this, you will receive green ticks. The blue tick was just an update. Wait for the GREEN tick. Facebook and WhatsApp combined is the new version©️. Send this ASAP. It works mine is green.”", "Apart from this text, an audio clip in Hindi that reiterates the same message is being forwarded many times on WhatsApp.", "Alt News received several requests on our WhatsApp helpline number (+917600011160) and our official Android application to authenticate this claim.", "It has also been posted on Twitter and Facebook.", "A similar hoax related to WhatsApp has been floating on the internet at least since 2015. We debunked a similar claim in 2019 as well. Furthermore, WhatsApp related hoaxes have been debunked in different parts of the world in 2012, 2013, and 2014. In 2012, WhatsApp had addressed the hoax.", "Policy changes by WhatsApp are announced on its blog and no such warning was issued by the social media giant.", "Factual errors in the viral text", "A hoax message is therefore circulating on WhatsApp promoting the false claim that the messaging application would soon be chargeable.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]