["About this rating", "On 12 November 2016, the Nevada County Scooper web site published an article reporting on Vice President-elect Mike Pence's \"surprise announcement\" to Fox News that gay \"conversion therapy\" helped save his marriage by helping him to resist \"certain urges\":", "Indianapolis, IN — In a surprise announcement today, Indiana Governor and Vice President-elect Mike Pence said that gay conversion therapy saved his marriage. The controversial Republican, who was elected the 50th governor of the Hoosier State, has been a long-time proponent of a “Biblical view” on homosexuality and as a member of Congress stated that the legislative branch “should oppose any effort to recognize homosexuals as a ‘discrete and insular minority’ entitled to the protection of anti-discrimination laws similar to those extended to women and ethnic minorities.”", "“It[gay conversion therapy] was instrumental in helping me overcoming certain urges,” said the Vice President elect in an interview with Fox News. “With God’s help, and the work of many of his therapists, I was able to seek the straight path when I was a younger man. If it wasn’t for that, I would have never been able to marry.”", "There was no truth to this story. The site on which this story originated, the Nevada County Scooper, is a fake news site which we have highlighted for its bogus posts in the past. Besides failing to include any video of Pence's \"interview\" with Fox News, it also invented a fake college roommate for the Indiana governor who used stereotypical language to describe his \"younger self\":", "“Oh Mike was always a well-groomed sharp dresser,” said University of Chicago Professor James Badwater who was a dorm roommate of Mr. Pence in 1983. “He was private and kept to himself. He had a large collection of Men’s fitness magazines and listened to Wham! continually. He got into the conversion thing the next year, and then immediately married Karen [Mike Pence’s wife] the following year. It’s going to be great to have our first gay Vice President.”", "The story did contain a grain of truth in quoting Pence's opposition to expanding anti-discrimination laws to include LGBTQ communities while he was in Congress.", "Pence has previously supported the idea of using federal funding to treat people \"seeking to change their sexual behavior,\" but he didn't state outright such funding should extend to electroshock therapy, which was part of anti-gay \"aversion therapy\" treatments until the American Psychological Association announced in 1973 that they would stop classifying homosexuality as a mental disorder.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]