["Republican presidential candidate Donald Trump makes a point at the third GOP debate, hosted by CNBC in Boulder, Colo., Oct. 28, 2015. (Mark J. Terrill/AP)", "The third GOP presidential debate would have been a lot longer if it weren’t for Donald Trump, he said.", "In his closing remarks at the Oct. 28 debate, the real estate mogul touted his deal-making skills, saying he and fellow candidate Ben Carson negotiated with CNBC to cut the debate down to two hours instead of three.", "\"We called in, we said, that’s it, we’re not doing it,\" Trump said. \"They lost a lot of money, everybody said it couldn’t be done. Everybody said it was going to be three hours, three-and-a-half, including (CNBC). And in about two minutes, I renegotiated it down to two hours so we could get the hell out of here.\"", "Moderator John Harwood disagreed and said, \"Just for the record, the debate was always going to be two hours.\"", "But Trump held his ground: \"That is absolutely not right. You know that. That is not right.\"", "So is Trump right, or is Harwood? We found that Trump is embellishing his story.", "Three hours?", "CNBC first announced the debate Sept. 30, but the negotiations over logistics didn’t happen until mid October. A September press release said \"candidates will take the stage at 8PM ET for two hours of debate.\"", "While this bolsters Harwood’s claim, this count didn’t include commercial time -- so there would be a certain amount of time for advertising on top of the two hours of actual debate.", "But CNBC never anticipated the whole program would last anywhere near three or more hours. CNBC said the total anticipated commercial time was just 15 minutes, so the whole program (pre-negotiations) would have lasted around two hours and 15 minutes.", "Two weeks later, some GOP candidates complained about the debate logistics -- notably that there would be no opening or closing remarks, according to news reports. The Trump and Carson campaigns went so far as to send a letter to CNBC’s Washington bureau, threatening to drop out if their demands weren’t met.", "\"Mr. Trump and Carson do agree to a 120 minute debate that includes commercial breaks and opening and closing statements,\" the Oct. 15 letter reads. \"Mr. Trump and Mr. Carson do not, and will not, agree to appear at a debate that is more than 120 minutes long including commercial breaks.\"", "The letter also indicates that Trump’s campaign was aware the program would last about two hours, even with commercials.", "\"Specifically, we write because the agenda sent to the campaigns recently by CNBC in partnership with the Republican National Committee (RNC), and reiterated on yesterday’s call, indicated that there would be ‘two hours of debate time’ plus four commercial breaks lasting between two and four minutes each,\" the letter said.", "The next day, CNBC agreed to cap the program at 120 minutes and for candidates to have 30 seconds at the beginning and the end.", "We can’t speak to how much of a role Trump directly played in the negotiation. We asked spokespeople at CNBC and the Republican National Committee about this, but neither would talk on the record. However, it’s fair to infer that his threatening to drop out of the debate probably put some pressure on leadership with the RNC and CNBC.", "In any case, Trump and the Republicans didn’t negotiate down an hour and a half; they negotiated 15 minutes. So in saying \"the debate was always going to be two hours,\" Harwood’s statement was closer to accurate than Trump’s.", "Our ruling", "Trump said the CNBC debate was supposed to be three hours, and he \"renegotiated it down to two hours.\"", "Trump played a role -- but not the sole role -- in negotiating the debate program down to two hours, but the plans were for it to last around two hours and 15 minutes -- not three hours or more.", "We rate Trump’s statement Mostly False.", "CNBC, Third Republican debate, Oct. 28, 2015", "CNBC, Presidential debate press release, Sept. 30, 2015", "CNBC, \"Trump and Carson threaten to opt out of CNBC debate,\" Oct. 15, 2015", "Washington Post, \"Trump beats chest over length of CNBC debate,\" Oct. 28, 2015", "Politico, \"How Trump almost blew up the third GOP debate,\" Oct. 16, 2015", "CNN, \"CNBC, Republicans finalize debate format,\" Oct. 16, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]