["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of California signs the Coronavirus Aid, Relief, and Economic Security (CARES) Act after it passed in the House on Capitol Hill on March 27, 2020, in Washington. (AP)", "No version of the Coronavirus Aid, Relief, and Economic Security Act grants pay raises for members of Congress.", "The House and Senate are slated to receive $35 million from the stimulus. The money will go toward offsetting the costs of maintaining congressional law enforcement and child care staff, as well as improving teleworking capabilities.", "The $2 trillion economic relief package that President Donald Trump signed March 27 is aimed at giving aid to Americans affected by the COVID-19 pandemic. But some widely shared posts on Facebook claim the legislation helps Congress more than workers.", "While the stimulus, officially known as the Coronavirus Aid, Relief, and Economic Security (CARES) Act, will dole out $1,200 checks to every adult making less than $75,000 per year, a March 26 post says the cash is pennies compared to the pay raise that legislators are giving themselves.", "\"Congress wants $25 million for raises. That’s $46,700 each,\" the text post reads. \"Now who’s thinking of you.\"", "Another post, published March 20, asserts that the House of Representatives voted to award its members an extra $8,000 per month instead of giving aid to senior citizens. A March 25 post is even more specific, claiming the congressional pay raise is on page 134 of the stimulus.", "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) Collectively, they’ve been shared more than 140,000 times.", "(Screenshot from Facebook)", "The CARES Act is the largest economic relief bill in U.S. history. The legislation offers economic support in the form of small business loans, tax cuts, and health-related spending. In addition to sending cash to everyday Americans, the law will give aid to the airline industry, which has been hard-hit by the coronavirus pandemic.", "We’ve seen a lot of misinformation about the stimulus, so we wanted to look into these Facebook posts to see if there’s any truth to them.", "While the CARES Act does allocate money to some Capitol employees, there is nothing in the legislation that gives a pay raise to members of Congress. Several fact-checkers have debunked the claim.", "\"The CARES Act does not provide either a pay raise or any funding for Member salaries,\" said Evan Hollander, communications director for the House Appropriations Committee, in an email. \"Likewise, no version of the legislation — House or Senate — ever included provisions for a Member pay raise or funding for salaries.\"", "We checked page 134 of the stimulus package as it appeared on March 25, when one of the Facebook posts was published. It contains information about grants given to states that have \"short-time compensation programs,\" which are alternatives to layoffs for employers that experience a reduction in available work. Under the programs, employees who have their hours cut are permitted to collect a percentage of unemployment benefits to make up for lost wages.", "RELATED: The Senate stimulus bill: What’s in it for you", "The March 25 version of the CARES Act said nothing about pay increases for Congress. Neither does the final version of the stimulus.", "Hollander said there is $25 million in the stimulus to \"support the House’s capability to telework,\" including equipment purchases and improvements to the network. There is also money for reimbursing the staff of the House Child Care Center, covering the costs of food service contracts and paying the House sergeant-at-arms.", "Meanwhile, the Senate is slated to get $10 million from the stimulus. $1 million will go to the sergeant-at-arms to remain available for coronavirus response while $9 million will be reserved for \"miscellaneous items,\" including reimbursement for workers at the Senate Employee Child Care Center.", "The Facebook posts are inaccurate and make a ridiculous claim. We rate them Pants on Fire!", "Associated Press, \"NOT REAL NEWS: Debunking Yet More False Coronavirus Content,\" March 27, 2020", "Associated Press, \"Pelosi forecasts House OK of Senate’s $2.2T virus aid plan,\" March 25, 2020", "Congress.gov, H.R.748, March 25, 2020", "Congress.gov, H.R.748 - CARES Act, March 27, 2020", "Cornell Law School Legal Information Institute, \"Congressional Pay Limitation: Twenty-Seventh Amendment,\" accessed March 30, 2020", "Email from Evan Hollander, communications director for the House Appropriations Committee, March 30, 2020", "Facebook post, March 20, 2020", "Facebook post, March 25, 2020", "Facebook post, March 26, 2020", "Factcheck.org, \"False Claim of Congressional Pay Raises in Stimulus Bill,\" March 25, 2020", "PolitiFact, \"The coronavirus relief bill: What’s in it for health care, governments and business,\" March 27, 2020", "PolitiFact, \"No, Pelosi wasn’t caught trying to add abortion funding into coronavirus bill,\" March 16, 2020", "PolitiFact, \"No, your Census response won’t affect whether you get a federal stimulus check,\" March 23, 2020", "PolitiFact, \"The Senate stimulus bill: What’s in it for you,\" March 26, 2020", "Roll Call, \"Coronavirus economic relief package provides $93 million cash infusion for Legislative Branch,\" March 25, 2020", "USA Today, \"Fact check: Did the House give itself a pay raise in the coronavirus relief package?\" March 29, 2020", "U.S. Congressional Research Service, \"Congressional Salaries and Allowances: In Brief,\" Dec. 30, 2019", "U.S. Department of Labor Employment & Training Administration, Short-Time Compensation, accessed March 30, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]