["A picture is circulating on social media in which a group of men is seen offering namaz (prayer) on a railway track. Along with this picture is text which says ‘Rail route blocked for Namaz. Sad that students who were travelling in this train got delayed and couldn’t appear for the NEET exams (translated).’ The text is in Tamil language.", "pic.twitter.com/MDKEYU28QC", "— Jaganathan G (@yogees46) May 8, 2018", "It is claimed that this particular route was blocked for namaz which resulted in students travelling in this train unable to appear for the NEET medical entrance exam. The photograph does not mention when or where this incident has occurred. However, it is being shared widely on WhatsApp.", "அடேய் #பழையெழரை .@PTTVOnlineNews .@karthickselvaa இப்படி நமாஸ் பண்ணி ரயில் தாமதமாக வந்ததால் நீட் எழுத முடியாத மாணவி அப்படின்னு செய்தி போடுங்க முடிந்தால் … #பிணசெய்திகளுக்கு பார்ப்பீர் #பழையெழரை …", "CC: .@noyyalan .@karthik_klt .@thiruneeru .@SaffronDalit .@HLKodo pic.twitter.com/WQgTHqBQ3u", "— MajorSimhan(R) (@MajorSimhan) May 7, 2018", "This image is not from Tamil Nadu and has nothing to do with the NEET exam which recently became a matter of controversy after examination centres were reallocated for students from Tamil Nadu.", "It was clicked in New Delhi in June 2017. Anindya Chattopadhyay who is a photojournalist with Times of India took this photograph of devotees offering the Alvida Namaz (last prayer of Ramzan) at the New Delhi Railway Station which was published by Times of India on June 23, 2017. Thus, this photograph is not a recent one.", "Earlier as well, this event of devotees offering namaz on a railway track was used to sow seeds of division between communities. Popular right-wing page ShankhNaad had posted this video in June 2017. It was shared more than 7000 times. It was also shared by Madhu Kishwar on her Twitter profile. In both these instances, the attempt was to create a fear psychosis by projecting a sort of religious takeover of the country by the Muslim community through this exercise.", "This carries open threat–Muslims offer ‘Alvida namaz’ on railway track near Achchan Mian Masjid https://t.co/vdkubsgngI via @timesofindia00", "— MadhuPurnima Kishwar (@madhukishwar) June 25, 2017", "Speaking to Alt News, Anindya Chattopadhyay confirmed that he had clicked this photograph and said, “This practice (of offering namaz) has been going on for years. I have been clicking pictures of this event for the last 5 years. Achchan Miya mosque is a very popular mosque. The practice began with muslim officials of Railways offering prayer at the mosque which lies on the railway track. Later on, other people also joined. Every year, the train is halted for 15-20 minutes to allow namaz. It has become a tradition”. Times of India had also published a video of devotees offering prayer on the railway track which lies near Achchan Mian mosque.", "The issue of religious activity in public spaces has always been contentious and needs deliberation. However, in this particular case, an old picture of a tradition of offering prayer that has been practiced for years was portrayed as an act of religious aggression.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A purported video of a Muslim man beating a temple priest with a bat is…", "A picture depicting the Pakistani flag apparently bigger in size and apparently placed higher than…", "Amid the ongoing war between Israel and Hamas, a video of a fleet of cars…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…"]