["The Delhi High Court, on February 18, issued notices to the News Broadcasting Standards Authority and media houses News18 and Times Now regarding publishing extracts of climate activist Disha Ravi’s private chats. The court looked into a petition filed by senior advocate Akhil Sibal representing Ravi who was arrested by Delhi police on February 14 for ‘editing’ a toolkit supporting the farmers’ protest.", "A claim viral on social media suggests that Sibal is charging Rs 5-7 lakhs for every court appearance on Ravi’s case. Below is a tweet by columnist Abhijit Iyer Mitra that received over 22,000 likes and close to 6,000 retweets.", "Disha Ravi hires Akhil Sibal – that’s between 5 to 7 lakhs per appearance. Do the maths.", "— Abhijit Iyer-Mitra (@Iyervval) February 19, 2021", "A screenshot of Mishra’s tweet has been shared by several Facebook users.", "The claim is in fact widespread on Facebook.", "For all those trolls mocking Disha Ravi and saying that at the age of 21, she has accomplished nothing but indulgence in…", "Posted by Khalid Baig on Thursday, 18 February 2021", "The claim was also shared by Twitter user @abdullah_0mar who is followed by BJP leaders Piyush Goyal and Kapil Mishra. It was tweeted by @SaffronSunanda who is also followed by Mishra.", "This slideshow requires JavaScript.", "Pro-BJP propaganda website The Frustrated Indian wrote an article that read, “But then again, coughing up an estimated 5 to 7 lakh rupees per appearance to Akhil Sibal is only possible under one condition – that of the lawyer waiving his fees in totality and fighting for Disha Ravi pro bono, which is highly unlikely. Who then, is paying for Disha Ravi’s rather flamboyant legal representation? Is it the Khalistani organisations like Poetic Justice Foundation and Sikhs for Justice, or some other vested interest groups who seek to globally defame India and destabilise the Modi government?”", "In a conversation with Alt News, Akhil Sibal informed that he is representing Disha Ravi pro bono. “I was approached by her lawyer Vrinda Bhandari and have appeared twice for her regarding the media trial petition,” he said.", "“I took on the case because this was an important issue to agitate before the court. We know the menace of media trials. Private messages should not be leaked during an ongoing case. It sets a dangerous precedent for due process and affects the privacy of the individual. The law has to take its course. The presumption of innocence recognised by law should not be affected,” he added.", "Advocate Vrinda Bhandari also clarified that the claims are untrue. “He decided to help on such short notice. He has taken up the case pro bono,” she told Alt News.", "Social media has been rife with misinformation surrounding Disha Ravi. This is the latest in a plethora of false claims suggesting Ravi is a single mother and hails from the Christain community.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]