["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "U.S. Rep. Nancy Pelosi, D-Calif., defended the health care law on Sunday's \"Meet the Press.\"", "David Gregory opened NBC’s Meet the Press on Sunday with a pointed question for House Minority Leader Nancy Pelosi about a \"crisis of confidence\" among Democrats in President Barack Obama.", "\"Has it reached a point where Democrats don’t believe the president can pull this off and can make Obamacare work?\" Gregory asked.", "Two days before the show, 39 House Democrats joined Republicans to pass the Keep Your Health Plan Act, which would allow insurers to continue to offer individual market health insurance policies that do not meet the standards of the health care law through 2014. It would also allow insurance companies to sell the plans to new customers. The bill passed 261-157.", "Obama announced a narrower \"fix\" a day earlier, letting insurers offer plans to existing policyholders through 2014 if state insurance regulators allow it. The White House said Obama would veto the House proposal.", "Pelosi said the Democratic defections on that bill weren’t as remarkable as D.C. watchers made them out to be.", "\"No, I remind you that 39 voted for this resolution the other day. The number has been in the 30s when it was to agree with them on the mandate for businesses, the mandate for individuals,\" Pelosi said, \"so this is approximately the same number.\"", "It’s clear from Pelosi’s statement she was not talking about the more than 40 House votes to repeal or gut Obamacare, which have not attracted sizable Democratic support. She isolated two votes on two measures: one to delay the health care law’s employer mandate, and another to delay the individual mandate.", "We wanted to know if she was right that the number of Democratic votes on those measures was about the same as the Friday, Nov. 15 vote.", "Back in July, the Obama administration announced it would postpone until 2015 the part of the law requiring larger employers to offer health insurance coverage to employees or face fines. A Treasury Department blog post cited \"concerns about the complexity of the requirements and the need for more time to implement them effectively.\"", "House Republicans, some peeved Obama did this without going through Congress, eyed a new, populist anti-Obamacare strategy. They figured they could earn more Democratic votes by tying a bill that would codify the delay for big employers, since Obama already okayed it. They also scheduled a vote to delay the individual mandate for everyday Americans.", "\"Is it fair for the president of the United States to give American businesses an exemption from his health care law’s mandates without giving the same exemption to the rest of America? Hell no, it’s not fair,\" the New York Times quoted House Speaker John Boehner as telling House Republicans behind closed doors.", "On July 17, the House took two votes. The first, on the delay for the employer mandate, passed 264-161, with 35 Democratic yeas.", "The second vote on delaying the individual mandate was not as close to the vote on policy renewals. It passed 251-174, with 22 Democrats joining the Republican majority.", "We created a Google spreadsheet outlining which Democrats voted for the two July proposals and the proposal they just considered.", "Twenty-one House Democrats voted for all three measures: Ron Barrow (Ariz.), John Barrow (Ga.), Julia Brownley (Calif.), Cheri Bustos (Ill.), Bill Enyart (Ill.), Elizabeth Esty (Conn.), Pete Gallego (Texas), Joe Garcia (Fla.), Daniel Maffei (N.Y.), Sean Maloney (N.Y.), James Matheson (Utah), Mike McIntyre (N.C.), Patrick Murphy (Fla.), Williams Owens (N.Y.), Gary Peters (Mich.), Scott Peters (Calif.), Collin Peterson (Minn.), Nick Rahall (W.V.), Raul Ruiz (Calif.), Paul Schneider (Ill.), and Kyrsten Sinema (Ariz.)", "When we noted the disparity to Pelosi spokesman Drew Hammill, he said, \"She was making the point that people have made these votes on this before.\"", "Pelosi does have a point about the Democratic votes on the employer mandate being close to the recent roll call on insurance policies, but she’s off on the vote to delay the individual mandate. That attracted only about half as much support from Democrats (22 versus 39).", "Her statement is partially accurate, so we rate it Half True.", "Email interview with Drew Hammill, spokesman for Nancy Pelosi, Nov. 17, 2013", "ABC News, \"House votes to delay employer and individual mandates by one year,\" July 17, 2013", "ABC News, \"House votes to fully repeal Obamacare for third time,\" May 16, 2013", "The New York Times, \"Seeing opening, House GOP pushes delay on individual mandate in health law,\" July 10, 2013", "Office of the Clerk of the U.S. House of Representatives, roll call votes on HR 2667 and HR 2668, July 17, 2013", "Slate, \"Hey, which Democrats voted for Fred Upton’s bill?\" Nov. 15, 2013", "Google spreadsheet, Democratic votes for Republican health care proposals, created Nov. 17, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]