["About this rating", "On 25 August 2014, the National Report published an article positing that the creator of the popular AMC TV drama Breaking Bad had announced the series would be returning for a sixth season of new episodes:", "Breaking Bad fans around the world are celebrating the stunning, glorious and amazing news announced today: Walter White is not dead, and there will indeed be a sixth season of the wildly-popular, award-winning AMC drama.", "This shocking and exciting news comes not from an internet message board or the rumor mill but from series creator Vince Gilligan. In an exclusive CNN interview late Sunday evening, Gilligan dropped the bombshell.", "“Walter White is not dead, and neither is Breaking Bad,\" said the 47-year-old writer, director, and executive producer of the groundbreaking show.", "By the following day links and excerpts referencing this article were being circulated via social media, with many of those who encountered the item mistaking it for a genuine news article.  However, the article was just another bit of fake news from the National Report that was republished on other sites as well.  All of these sources are fake news sites who publish outrageous fictional stories with clickbait headlines such as \"IRS Plans to Target Leprechauns Next,\" \"Boy Scouts Announce Boobs Merit Badge,\" and \"New CDC Study Indicates Pets of Gay Couples Worse at Sports, Better at Fashion Than Pets of Straight Couples.\"", "The National Report's disclaimer page notes that all of the site's articles are fiction:", "National Report is a news and political satire web publication, which may or may not use real names, often in semi-real or mostly fictitious ways.  All news articles contained within National Report are fiction, and presumably fake news.  Any resemblance to the truth is purely coincidental.", "On 14 October 2014 another fake news site, Empire News, published an article with the very same premise:", "If you were are fan of the hit AMC TV show Breaking Bad, then I hope you're sitting down for this news. Vince Gilligan, the creator of the much-loved series, has announced that on top of working on creating spin-off series Better Call Saul, he and his writers have begun working on a sixth season for Breaking Bad.", "\"It's true, we did decide to come back for another round with Walt,\" said series creator Gilligan. \"Better Call Saul is going to be able to stand on its own, but there is more to Walt's story. He hasn't died just yet.\"", "The item was just as much as a bit of fiction as the previous one.  Empire News is another one of the many fake news sites that publishes sensationalized made-up stories such as \"Body Found Under Motel Bed,\" \"George W. Bush Arrested for Cocaine Possession,\" and Congress Approves Bill That Will Offer Free Automobiles to Welfare Recipients.\"  Their disclaimer page notes that Empire News \"is a satirical and entertainment website.\"", "Season two of Better Call Saul, the follow-on prequel series about Breaking Bad's conniving \"criminal lawyer\" character Saul Goodman, has featured appearances from several Breaking Bad characters such as the Cousins and Hector Salamanca.  Some sharp-eyed fans of the latter show noticed that first letter of each of the episode titles in Better Call Saul’s second season are an anagram for the phrase “FRING’S BACK,” heralding the potential reappearance of Breaking Bad drug lord Gus Fring:", "@BetterTalkSaul on vacation this week, and have nothing but time lol pic.twitter.com/KvHF8WY4JV", "— Shaquita (@sirena6783) March 28, 2016", "As Variety noted of the tease:", "The second season finale appeared to tease something that fans of “Breaking Bad” have been anticipating ever since the prequel series was announced: the reintroduction of Emmy-nominated favorite Giancarlo Esposito as drug lord Gus Fring.", "Of course, we didn’t actually see Esposito or Fring in the episode. There is simply an ominous note left for Mike (Jonathan Banks) warning him off of taking any extreme measures against Hector Salamanca (Mark Margolis) — who was also a crucial character on “Breaking Bad.”", "Theories that the note was written by Fring, or at the very least one of his associates, were exacerbated by the discovery that the first letter of each of the ten-episode titles in “Saul’s” second season are an anagram for “FRING’S BACK.” That’s no coincidence.", "Variety spoke with showrunners Peter Gould and Vince Gilligan about why they chose to tease Fring in this fashion.", "Peter Gould: \"If we knew for sure one way or the other I’d be more comfortable saying that we want them to marinate in that. I have to say, we did not think the clues in the titles would be decoded as quickly as they were. We’re still mulling over season three. Now that the cat is out of the bag, we’re certainly thinking Gus Fring had a hand in what happened with Mike at the end of season two. Having said that, Gus Fring works in mysterious ways, he casts a long shadow, he works indirectly.\"", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]