["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook meme posted by a liberal Democratic group puts a new twist on an old claim that the state of Wisconsin is \"broke.\"", "The post by Occupy Democrats includes a photo of Republican Gov. Scott Walker and this statement:", "\"Last year, Republican Wisconsin Governor Scott Walker signed a $541 million tax cut for millionaires and corporations. Today, Wisconsin’s budget is $283 million in the red, funding for education is being slashed, government programs are being gutted, and the state is about to miss a $108 million debt payment -- because it is dead broke.\"", "In the comments below the meme, the group posted: \"Governor Scott Walker is committing political malpractice against the people of Wisconsin.\" Readers are directed to a Feb. 18, 2015 Washington Post story that looks at the state’s finances.", "Occupy Democrats was founded by Omar Rivero, an unsuccessful 2014 Democratic nominee for the Florida state House. The group frequently posts provocative memes that draw considerable attention. The March 15, 2015 \"dead broke\" post continues to make the rounds and had been shared more than 18,000 times as of July 1, 2015.", "The group did not respond to an email asking for backup for the claim.", "The claim Wisconsin is \"broke\" is familiar  -- though in the past we have heard it from the other side of the aisle. Walker and other Republicans have used it to describe the condition of the state’s finances when they took office in 2011.", "When we reviewed those claims -- from Walker in 2011 and Assembly Majority Leader Jim Steineke in June of 2015 -- we rated them False. The state wasn’t out of money and its financial condition didn’t match the definition of \"broke,\" which suggests at or near bankruptcy.", "What’s more, the state had numerous tools available to deal with any shortfall -- even if some of the options, such as tax increases, were declared off limits by Walker and Republicans.", "So what about the Occupy Democrats claim that various actions by Walker have left the state \"dead broke\"?", "Behind the claim", "Before the group gets to its central point, it lays out a list of assertions that amount to its evidence. Some of them -- education being \"slashed\" and government programs \"gutted\" -- are offered without specifics. In the cases where details are provided, the picture is not always so clean.", "Take the tax cut.", "Walker did sign a $541 million tax cut approved by the Republican-controlled Legislature on March 24, 2014.", "The package cut property and income taxes for families and businesses, and zeroed out all income taxes for Wisconsin manufacturers. It also reduced the amount of state taxes withheld from workers’ paychecks.", "Thus, the package wasn’t directed exclusively at \"millionaires and corporations,\" as Occupy Democrats claimed. Citing a memo from the Legislative Fiscal Bureau, Walker spokeswoman Laurel Patrick noted \"the largest percentage of tax reductions went to those making between $15,000 and $20,000.\"", "At the time the 2014 tax cut was approved, projections showed that the state was on track to have a $1 billion budget surplus in June 2015.", "Times changed, and so do budget projections.", "In November 2014, the Walker administration said that surplus had melted into a $132 million shortfall. In January 2015, the nonpartisan Legislative Fiscal Bureau said the shortfall was $283 million because tax collections were $173 million lower than expected.", "To close the gap, in February 2015, Walker's administration said it would skip $108 million in debt payments in May 2015. That, too, was cited as evidence of being broke by Occupy Democrats. Other steps were taken as well, including refinancing of state debt.", "At the time, the Legislative Fiscal Bureau said  under the move the state would only pay the interest on certain obligations. Such a delay is allowed under terms of the borrowing, an administration spokesman said. However, taxpayers would need to make higher principal and interest payments in the future, starting with an additional $19.3 million in the two-year budget that began July 1, 2015.", "But this deferral strategy is nothing new. It has been employed for years by Walker and previous governors, including his predecessor Democrat Jim Doyle. It’s even got a nickname: \"Scoop and toss\" -- as in scoop up the debt and toss it into the future for others to address.", "So, while it’s true that Walker skipped a payment, it’s a financing move that’s not unusual, and not an indication of bankruptcy or similar financial calamity.", "Indeed, the move helped bring the 2013-15 budget into balance.", "That points us back to the group’s \"dead broke\" claim.", "In our earlier items, we noted that dictionaries define \"broke\" as \"having no money; bankrupt\" and \"without money; penniless.\"", "But the state is still paying its bills and there has been no indication that it's on the brink of bankruptcy or insolvency. Further, under federal law, the state is not allowed to make such a declaration.", "Said Patrick: \"There is no imbalance and Wisconsin is not ‘dead broke.’ \"", "Some may find such a statement from Walker’s office ironic. But that does not mean it is inaccurate.", "Our rating", "In a Facebook meme, the group Occupy Democrats says Wisconsin is \"dead broke\" because of various actions by Walker and Republicans.", "Yes, there were tax cuts, and cuts to many programs along the way. All are evidence of changing policy priorities, with Republicans in charge. But they are not evidence the state is \"dead broke.\" What’s more, this claim has been rated False enough times that to keep making pushes it to  ridiculous.", "We rate the claim Pants on Fire.", "Occupy Democrats Facebook page", "The Washington Post, \"Scott Walker cut $541 million in taxes last year. Now his state will miss a $108 million debt payment,\" Feb. 18, 2015", "Milwaukee Journal Sentinel, \"Scott Walker signs $541 million tax cut legislation,\" March 24, 2014", "Milwaukee Journal Sentinel, \"Scott Walker defers debt principal payment to balance books,\" Feb. 17, 2015", "Milwaukee Journal Sentinel, \"Bite from state road borrowing nearly triples since 1999,\" Feb. 13, 2015", "State of Wisconsin Legislative Fiscal Bureau memo on borrowing, Feb. 13, 2015", "Email exchange with Walker spokeswoman Laurel Patrick, July 2, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]