["By D'Angelo Gore, Eugene Kiely, Lori Robertson and Robert Farley", "Posted on March 25, 2021", "In his first press conference since being inaugurated 64 days ago, President Joe Biden got some facts wrong:", "Biden took questions from reporters on March 25.", "Biden falsely claimed that his predecessor “eliminated” and “didn’t use” more than $700 million in funding to address migration from Central American countries that Biden helped secure when he was vice president.", "“They’re coming because of the circumstances in country, in country,” Biden said of the thousands of people who are illegally entering the U.S. through Mexico. “The way to deal with this problem, and I started to deal with it back when I was … vice president, putting together a bipartisan plan of over $700 million to do the root causes of why people are leaving. What did Trump do? He eliminated that funding. He didn’t use it. He didn’t do it.”", "Biden appeared to be referring to funding for the “U.S. Strategy for Engagement in Central America,” which was as high as $750 million during the Obama administration in fiscal year 2016.", "It’s true that the annual budget for that initiative declined significantly during Trump’s presidency, but it wasn’t completely “eliminated” or unspent, as Biden said. According to the Congressional Research Service, the nonpartisan research arm of Congress, appropriations for the program declined to $685 million in FY 2017, $615 million in FY 2018, $528 million in FY 2019, $533 million in FY 2020 and $506 million in FY 2021.", "Biden may have been referencing money that Congress authorized for use in Honduras, Guatemala and El Salvador that the Trump administration either reallocated to other initiatives or temporarily suspended in 2019.", "As a January CRS report said: “From FY2016 to FY2020, Congress appropriated more than $3.1 billion to improve security, governance, and socioeconomic conditions in Central America as part of a whole-of-government initiative to address the drivers of irregular migration. However, in March 2019 — less than two years into the initiative’s on-the-ground implementation — the Trump Administration suspended most foreign aid to El Salvador, Guatemala, and Honduras. The Administration proceeded to reprogram approximately $396 million of aid appropriated for the Northern Triangle countries in FY2018, reallocating the funds to other foreign policy priorities within, and outside of, the Latin American and Caribbean region.”", "The report indicated that the Trump administration “withheld most of the assistance Congress appropriated for Central America in FY2019 while it negotiated a series of agreements intended to stem the flow of migrants and asylum-seekers from the Northern Triangle to the United States.” As a result, the report said, the State Department and the U.S. Agency for International Development were forced to close down or cancel some projects and planned activities.", "But CRS also said that — amid criticism from members of Congress who argued the funding freeze was counterproductive — aid to the Northern Triangle countries that was previously held back began to be released late in 2019, and “all of the previously suspended assistance for the region” had been “programmed” by June 2020.", "Biden used the wrong statistics when saying that “nothing has changed” regarding “children” trying to enter the U.S. at the southern border. To be sure, there have been spikes before in unaccompanied children arriving at the border, but the uptick in Biden’s first full month in office was significant.", "Biden: Truth of the matter is nothing has changed. As many people came, 28% increase in children to the border in my administration. 31% in the last year of – in 2019, before the pandemic, in the Trump administration. It happens every single solitary year. There is a significant increase in the number of people coming to the border in the winter months of January, February, March.", "Biden’s figures don’t pertain to an “increase in children to the border,” as he said. Instead, they pertain to the total number of apprehensions at the border — including single adults and family units. Those figures were cited in a Washington Post opinion piece by immigration experts who, similar to the president, said the rise in total apprehensions reflected “a pattern of seasonal changes,” in which immigrant apprehensions increase in the cooler months of the year.", "We get slightly different figures using Customs and Border Protection data. There was a 29% increase in total apprehensions from January to February, when the level reached 96,974. In 2019, the January-to-February bump was 39%.", "As we’ve written, the recent increase in border apprehensions did begin prior to the election under then-President Donald Trump. But the spike in unaccompanied children in the first full month of Biden’s administration is noteworthy — and, with a backlog of processing those children out of border custody facilities, it’s the main aspect of border immigration that has garnered media and political attention.", "The number of unaccompanied children being apprehended at the border also began rising in October, before the election, but it spiked 63% from January to February, reaching 9,297 kids.", "The Washington Post opinion piece noted that the apprehensions of unaccompanied children “appears to be more than just a seasonal pattern.”", "CBP data show the fiscal year 2021 numbers of unaccompanied children apprehended are on track to rival or surpass a spike that occurred in 2019.", "The president went on to say the “vast majority, the overwhelming majority of people coming to the border and crossing are being sent back,” mentioning “single people.” That’s correct. But then he added, “We’re sending back the vast majority of the families that are coming.” That’s not the case for the month of February, the most recent data from CBP.", "The administration expelled 41% of family units in February. (See the figures for Title 42 expulsions.)", "Single adults, who make up the vast majority of those apprehended on the border, have been largely expelled under Title 42, a public health law.", "We asked the White House about Biden’s claim, but we haven’t received a response.", "When told Senate Minority Leader Mitch McConnell said Biden has gone too far left, the president responded by saying “over 50%” of Republican voters supported the American Rescue Plan Act.", "But public polling offers a more mixed reaction among Republicans to the new law than the president lets on.", "Biden: I would like Republican, elected Republican support, but what I know I have now is, I have electoral support from Republican voters. Republican voters agree with what I’m doing. And so unless Mitch says the last thing I did, the last piece of legislation I did was so far left, well, then he ought to take a look at his party. Over 50% of them must be over that edge, as well because they support what I did.", "This has become a talking point for the president. He stated something similar on March 19, when he said “we didn’t get any help in the Senate or the House, but you have 55% of the Republicans in America supporting it,” referring to the COVID-19 relief bill.", "For sure, there are polls that show more than 50% of Republicans supported the bill earlier this month when it was before Congress.", "A Morning Consult/Politico poll conducted from March 6 to March 8 found 59% of Republicans surveyed said they “strongly support” (29%) or “somewhat support” (30%) the COVID-19 aid package.", "Similarly, a Data for Progress poll conducted from March 5 to 7 found 54% of Republicans supported the bill.", "However, other polls found Republican support below 50% — not “over 50%,” as Biden said.", "A CNN poll from March 3 to 8 found only 26% of Republicans supported the bill (see Table 031).", "A Pew Research Center survey from March 1 to 7 found that 41% of Republicans and Republican-leaning independents said they supported the bill. That poll showed a pronounced partisan divide in particular on the cost of the legislation — which was the primary reason for Republican opposition in Congress.", "Sixty-one percent of Republicans told Pew that the $1.9 trillion bill, which Biden signed into law on March 11, spends too much.", "Lastly, we found a CBS News/YouGov poll taken from March 9 to 10 found 46% of Republicans supported the American Rescue Plan Act. “Among Republicans, there is more support for it among those with lower household incomes than among those with higher incomes,” CBS News wrote.", "Comparing his tax priorities to those of Republicans, Biden revived two talking points from the campaign: the misleading claim that 83% of the tax cuts in the Republican tax law championed by Trump went to the top 1%; and the false claim that middle-income families pay a higher tax rate than “the average person making $1 billion a year.”", "Biden said he found it “kind of interesting that my Republican friends were worried” about “the cost” of tax cuts and relief checks in the $1.9 trillion American Rescue Plan Act. The law, he said, “puts money in people’s pockets. Ordinary people.”", "The law provides an average tax cut to middle-income earners of $3,720 this year, according to an analysis by the Tax Policy Center. The law also includes stimulus payments for most Americans, and extends unemployment compensation.", "Biden said he didn’t remember hearing Republicans express similar concerns about the cost of the Republican-backed Tax Cuts and Jobs Act, which is projected to add nearly $2 trillion to the deficit over 10 years, according to the Congressional Budget Office.", "“Did you hear them complain when they passed a close to $2 trillion Trump tax cut, 83% going to the top 1%?” Biden said.", "This is a well-worn but misleading claim. As we have written, in order for the legislation to be passed via reconciliation, most of the individual income tax provisions are set to expire by 2027, while the corporate tax cuts would remain, making the tax benefit distribution more lopsided for the top 1% than in earlier years.", "So, while the top 1% got 20.5% of the total tax benefits in 2018, and 25.3% of the tax benefits in 2025, the share of the total tax savings that accrues to the top 1% in 2027 is 82.8%, according to an analysis by the Tax Policy Center.", "Republicans say they expect a future Congress will extend the individual tax cuts, rather than allowing taxes for many to increase, but of course there is no assurance that will happen.", "Biden went on to claim Republicans “reduc[ed] taxes to a point that people who are making, you know if you are a husband and wife, school teacher and a cop, you’re paying at a higher rate than the average person making $1 billion a year is. Something’s wrong.”", "Actually, that claim is wrong.", "It is another version of a claim Biden made during the campaign, that the top 1% of taxpayers, on average, pay a lower effective tax rate than middle-income people.", "In general, people in higher-income categories pay a higher tax rate.", "According to an analysis by the Tax Policy Center, the top 0.1% — those making over $3,452,300 a year — paid an average federal tax rate of 31.3% in 2019. That’s a higher rate than any other income category below it. By comparison, for example, those in the middle 20% of earners — with an expanded cash income of $50,001 to $87,300 — paid an average federal tax rate of 12.4%, according to the TPC analysis.", "The Tax Policy Center did not break down its analysis for billionaires, but they would obviously be a fraction of those in the top 0.1%.", "“On average the top 0.1 percent of income pays more,” Howard Gleckman, a senior fellow at the Tax Policy Center, told us via email. “Are there outliers? Sure. But would be very rare.”", "As Gleckman told us back in 2019, “You can invest all your money in tax-exempt bonds and pay no federal income tax on the interest. Investors can avoid paying tax on capital gains by simply not selling the assets (but they’d also have no income). But in general, the federal tax system is very progressive. The more you make, the more you pay.”", "William McBride, vice president of federal tax and economic policy at the Tax Foundation, told us Biden may be referring to an analysis by economists Emmanuel Saez and Gabriel Zucman of the University of California at Berkeley that concluded the average effective tax rate (for federal, state and local taxes) paid by the richest 400 families in the U.S. was 23%, slightly lower than the 24.2% rate paid by the bottom half of American households.", "McBride notes, however, that the Saez/Zucman data “excludes refundable tax credits so that the tax burden is overstated at the lower end of the income spectrum. When they are included, average effective tax rates for federal taxes go from 3.3% for the lowest quintile up to 30.3% for the top 0.1% (about 120,000 households).”", "McBride said the Saez/Zucman estimates for the top 400 households “rely on their assumptions about returns imputed from underlying wealth and income shares, which have been challenged by other economists like Gerald Auten and David Splinter. They find that the top 0.01 percent (a bit more than the top 400) paid an average combined tax rate of nearly 50 percent in 2018.”", "In a post challenging some of the methodology of the Saez/Zucman report, Gleckman of the Tax Policy Center said that while it is true that the Tax Cuts and Jobs Act “cut the taxes of high earners by more on average than for low- and moderate-income households, as a share of after-tax income,” that doesn’t mean, as a Washington Post headline put it, that “billionaires paid a lower tax rate than the working class.”", "Even though he pulled a card out of his pocket to read aloud statistics on the rise in cloture motions, Biden got the numbers wrong.", "Biden: That it used to be that from between 1917 and 1971, the filibuster existed, there were a total of 58 motions to break a filibuster, that whole time. Last year alone, there were five times that many. So it’s being abused in a gigantic way.", "Cloture motions are filed to set a time limit on debate and bring a bill to the floor for a vote. The motion must receive 60 votes to pass — not a simple majority.", "The Senate website lists all cloture motions since 1917, when the Senate first adopted the cloture rule. We counted a total of 58 from 1917 through 1970, the figure Biden cited. But last year alone there were 118 — which is more than double 58, not five times greater.", "It appears that the president meant to say in the last Congress — not “last year alone.” In 2019 and 2020, which was the 116th Congress, there were 328 cloture motions filed — which is more than five times the motions filed from 1917 through 1970.", "But cloture motions aren’t necessarily filed “to break a filibuster,” as Biden said. That used to be the primary use, but not in modern times — a fact noted in a Congressional Research Service report on filibusters and cloture motions.", "“In recent times, by contrast, Senate leadership has increasingly made use of cloture as a normal tool for managing the flow of business on the floor, even when no evident filibuster has yet occurred,” the CRS report said. “It would be erroneous to assume the presence or absence of cloture attempts is a reliable guide to the presence or absence of filibusters.”", "Also, both parties are responsible for the escalating use of cloture motions. There were 504 filed in six years (2009-2014) when the Democrats were in control, and 657 in six years (2015-2020) when the Republicans were in charge.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]