["“Just wanted to remind you all that in the movie I am Legend the year was 2021 and people turned into zombies because of the wrong vaccines,” reads a March 19, 2021 Facebook post shared more than 18,000 times.", "More examples of the claim are available here, here and here. They come as the US vaccine rollout accelerates but skepticism of the shots remains, and disinformation about them is spreading online.", "“I Am Legend” is a 2007 adaptation of the eponymous Richard Matheson novel published in 1954, which focuses on the lone survivor of a strange pandemic that turns people into mutants. The book first came to the big screen in 1964 and again in 1971.", "The 2007 version’s IMDb description reads: “Years after a plague kills most of humanity and transforms the rest into monsters, the sole survivor in New York City struggles valiantly to find a cure.”", "The Warner Bros. plot summary calls the creatures “vampire-like mutants” rather than zombies, as the posts claim.", "The movie opens on a scene with Emma Thompson as Dr Alice Krippin, a scientist renowned for curing cancer through a re-engineered measles virus.", "“The premise is quite simple,” Krippin explains. “Take something designed by nature and reprogram it to make it work for the body, rather than against it.”", "The virus -- not vaccine, as the posts claim -- then mutates and wipes out most of the population, turning the rest into monsters.", "The post-apocalyptic film is available on Netflix and takes place in 2012, with flashbacks to 2009. About 17 minutes in, lead Will Smith records his progress on a cure and mentions the date. “Dr Robert Neville, September 5, 2012, GA series, serum 391,” he says.", "Searching these versions of the movie script for “2012” also shows the line.", "The official Warner Bros. trailer for the movie released in 2007 says: “In five years, mankind's struggle for survival will be lost,” indicating that it is set in 2012.", "This trailer also includes the date at 0:28.", "More than half a million people in the US have died from Covid-19, the illness caused by the coronavirus. The US Food and Drug Administration has so far authorized three vaccines for emergency use to protect against the disease.", "The US Centers for Disease Control and Prevention says Covid-19 vaccines are “safe and effective” and recommends people get them as soon as they become eligible.", "Several safety monitoring systems are in place to track side effects of the shots.", "AFP Fact Check has debunked hundreds of false and misleading claims about the novel coronavirus, available in English here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]