["By D'Angelo Gore", "Posted on August 26, 2016", "In a TV ad, Republican Rep. Charles Boustany falsely states that “Barack Obama and Hillary Clinton refuse to declare war on ISIS,” and wrongly suggests that Obama and Clinton “banned oil exports.”", "Obama, who has said “we are at war” with ISIS, has authorized more than 11,000 targeted airstrikes against the Islamic State in Iraq and Syria since Operation Inherent Resolve began two years ago. He also asked Congress in 2015 to formally authorize military force against the terrorist group.", "For her part, Clinton, the Democratic nominee for president, also asked Congress last year to pass new legislation authorizing continued military action against ISIS.", "And neither Obama nor Clinton had a role in imposing a decades-long ban on U.S. crude oil exports that was lifted late last year when Obama signed a compromise spending bill to avoid a government shutdown.", "Boustany is a six-term congressman trying to stand out in a crowded race to replace Republican Sen. David Vitter of Louisiana, who is retiring from the Senate in January. Boustany’s campaign began airing the ad on Aug. 23.", "The ad, called “Ports,” opens with Boustany saying that “Barack Obama and Hillary Clinton refuse to declare war on ISIS, but they’re more than happy to wage war on Louisiana’s economy.” Here’s the problem: Obama and Clinton asked Congress to authorize military force against ISIS last year. Congress has not done so.", "In February 2015, Obama sent Congress a draft AUMF, or authorization for the use of military force, against ISIL, or the Islamic State of Iraq and the Levant, the administration’s preferred name for the terrorist faction.", "In his letter to Congress, Obama said that he was asking for congressional approval of military force even though he believed that an existing law gave him the authority to act.", "Obama, Feb. 11, 2015: The so-called Islamic State of Iraq and the Levant (ISIL) poses a threat to the people and stability of Iraq, Syria, and the broader Middle East, and to U.S. national security. It threatens American personnel and facilities located in the region and is responsible for the deaths of U.S. citizens James Foley, Steven Sotloff, Abdul-Rahman Peter Kassig, and Kayla Mueller. If left unchecked, ISIL will pose a threat beyond the Middle East, including to the United States homeland.", "I have directed a comprehensive and sustained strategy to degrade and defeat ISIL. As part of this strategy, U.S. military forces are conducting a systematic campaign of airstrikes against ISIL in Iraq and Syria. Although existing statutes provide me with the authority I need to take these actions, I have repeatedly expressed my commitment to working with the Congress to pass a bipartisan authorization for the use of military force (AUMF) against ISIL. Consistent with this commitment, I am submitting a draft AUMF that would authorize the continued use of military force to degrade and defeat ISIL.", "As Obama said, the U.S. has been conducting targeted airstrikes against ISIS territories in Iraq and Syria since 2014. As of Aug. 22, 2016, the U.S. had made 10,826 of the 14,602 total airstrikes on ISIS in those countries, according to a Defense Department report on Operation Inherent Resolve.", "Then, several months after Obama asked for the input of Congress, Clinton, by then a Democratic presidential candidate, also called for a vote on military action during a speech at the Council on Foreign Relations.", "Clinton, Nov. 19, 2015: Now, we should have no illusions about how difficult the mission before us really is. We have to fit a lot of pieces together, bring along a lot of partners, move on multiple fronts at once. But if we press forward on both sides of the border, in the air and on the ground, as well as diplomatically, I do believe we can crush ISIS’s enclave of terror.", "And to support this campaign, Congress should swiftly pass an updated authorization to use military force. That will send a message to friend and foe alike that the United States is committed to this fight. The time for delay is over. We should get this done.", "Nearly a month after Clinton gave her speech, Obama again urged Congress to act after a terrorist attack in San Bernardino, California, left 14 people dead and dozens more injured. In a nationally televised address from the Oval Office, Obama said:", "Obama, Dec. 6, 2015: Finally, if Congress believes, as I do, that we are at war with ISIL, it should go ahead and vote to authorize the continued use of military force against these terrorists. For over a year, I have ordered our military to take thousands of airstrikes against ISIL targets. I think it’s time for Congress to vote to demonstrate that the American people are united, and committed, to this fight.", "Eight months have passed since then, and Congress, which has the constitutional authority to declare war but hasn’t since 1941, has not acted on Obama’s proposal.", "Some Republican critics argued that the president’s proposal placed too many restrictions on the U.S. military to be effective. The draft AUMF says it “does not authorize the use of the United States Armed Forces in enduring offensive ground combat operations,” for example. On the other hand, some Democratic critics argued that that same language was “vague” and could involve combat troops in an extended ground war.", "As a result, no congressional authorization has been granted.", "So, Boustany, like other members of Congress, is free to criticize Obama and Clinton’s proposed strategies to defeat ISIS. But it’s wrong to say, as he did, that Obama and Clinton “refuse to declare war on ISIS.” They have.", "Much of the campaign ad focuses on what Boustany refers to as Obama and Clinton’s “war on Louisiana’s economy.”", "“When they pushed for a new oil and gas tax, I found a way to stop it,” Boustany says to the camera. “When they banned oil exports, I led the fight to change it.”", "Obama did propose a new $10.25 per barrel fee on oil companies in his budget for fiscal year 2017. The White House said the fee, which would have been phased in over five years, “raises the funding necessary to make these new investments” in transportation, “while also providing for the long-term solvency of the Highway Trust Fund to ensure we maintain the infrastructure we have.”", "The Republican-controlled House then passed a nonbinding resolution that Boustany sponsored “[e]xpressing the sense of Congress opposing the President’s proposed $10 tax on every barrel of oil.”", "But it’s not true that Obama and Clinton “banned oil exports,” as Boustany’s statement in the ad suggested.", "In 1973, Arab members of the Organization of Petroleum Exporting Countries imposed an embargo against the U.S. In response, Congress passed, and President Gerald Ford signed, the Energy Policy and Conservation Act of 1975, which directed the president to prohibit the export of most oil produced in the U.S. Only “certain crude oil exports” were allowed if “determined to be in the national interest,” according to the Congressional Research Service.", "That 40-year ban was finally lifted in December 2015 when Obama signed a $1.1 trillion spending bill that was negotiated to avoid a looming government shutdown.", "It’s true that prior to signing the bill, Obama and Clinton opposed a separate Republican-backed bill ending the exports ban. But “they” weren’t the ones who put the ban in place.", "Boustany campaign spokesman Jack Pandol told us the congressman wasn’t talking about Obama and Clinton personally when he said that “they banned oil exports.” The ad, though, only mentions two people by name — Obama and Clinton.", "Besides, even if it wasn’t Boustany’s intention, it’s not clear to those who view the ad that the use of “they” isn’t a reference to Obama and Clinton. The fact is that “they” had nothing to do with the ban on oil exports being imposed in the first place.", "https://www.sharethefacts.co/share/95b7dc80-96da-416d-91e8-3d24b720ee1b", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]