["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Arianna Huffington referenced an unscientific online poll in this tweet about the latest product from Apple.", "The unveiling of the Apple Watch, a bit of wearable tech that puts a lot of iPhone features on your wrist for easy viewing, prompted an intriguing tweet from media mogul Arianna Huffington.", "The founder of the Huffington Post wrote, \"As it is 20% of young adults use their devices during sex. Prepare for ‘Honey, I'm checking how many calories we're burning on my #iWatch!’ \"", "We don’t know if wearable tech will mesh with moments when little — if anything  — is worn, but the statistical reference to smartphones and sex raised the eyebrows of one of our fans, New York Times Upshot reporter Josh Barro, who tweeted asking for a fact check.", "We asked Huffington for her source and she pointed us to a Huffington Post article from about a year ago. Indeed, Jumio, a firm involved with mobile credit and debit card payment systems, commissioned a distinctly non-random online survey of mobile consumer habits. Topping the press release was the finding that 9 percent of adults say they have used a smartphone during sex. For those 18 to 34, the percentage rises to 20 percent. (Huffington said use, while the study asked \"have used.\")", "We asked Jenny Davis, the media contact for the survey, if there were any other details. In particular, we wanted to know what people were doing with their phones at times when their attention might be focused elsewhere.", "\"That’s the question everybody has,\" Davis said. \"The survey didn’t go further. I’ve always thought a follow-up study would be interesting. Are they playing music? Are they taking pictures?\"", "Or looking up recipes, who knows?", "The online report of the poll, we should note, included this word of caution. \"This online survey is not based on a probability sample and therefore no estimate of theoretical sampling error can be calculated.\"", "That’s an important distinction for anyone who knows anything about polling, and means that you shouldn’t consider the results scientific or all together meaningful.", "Our ruling", "Huffington said that 20 percent of young adults use mobile devices during sex. That, for the most part, accurately reflects the findings of an unscientific online poll.", "While the poll itself is dubious, there is no better information available to contradict the poll of Huffington's claim. Maybe the new Apple Watch will have an app for that one day.", "We rate the claim Mostly True.", "Arianna Huffington, tweet, Sept. 9, 2014", "Huffington Post, Nearly 20 Percent Of Young Adults Use Their Smartphones During Sex: Survey, July 12, 2013", "Jumio, Americans Can’t Put Down Their Smartphones, Even During Sex, June 11, 2013", "Jumio, 2013 MOBILE CONSUMER HABITS STUDY, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]