["About this rating", "A popular pop culture superstition holds that a white BIC disposable lighter is bad luck. While there are many reasons why people believe this, the most commonly offered reason is that several members of the \"27 club\" (musicians who all passed away at the age of 27) — including Kurt Cobain, Jimi Hendrix, Janis Joplin, and Jim Morrison — all allegedly had this product in their pockets when they died.", "This rumor was summed up in a 2013 post on High Ideas as follows:", "Everyone knows that white lighters are Bad Luck. Most people understand it as a fact, even though they may not believe it. But does anyone know the real reason behind it? There are multiple reasons in history why white lighters are considered bad luck. The first reason, is because when disposable lighters first came out, they only came in two colors. Black, and White. Now, when people would try to pack bowls down with their lighters, the ash would often get stuck to the bottom of their lighters. So when they were being investigated by police, white lighters would show signs of smoking and ash burns, and black lighters wouldn't. Another reason revolves around Four Famous Musicians (and Fellow Stoners), Jim Morrison, Jimi Hendrix, Janis Joplin, and Kurt Cobain. All four of them were left-handed, and they all died at the age of 27. The coincidence was that all four of their autopsies showed that when they died, they had White Bic Lighters in their pockets. So next time that you are in a sesh, and someone pulls out a White Lighter, throw that shit away or brake it. I have had several personal cases where bad things happened, and every single time we had used a white lighter. Still don't believe me? Keep using your white lighters and you will find out soon.", "We're skeptical of the notion that an inanimate object can by itself bring good or bad fortune to its bearer, so this article will be limited to examining whether Hendrix, Morrison, Joplin, and Cobain were all carrying white cigarette lighters at the time of their deaths:", "The First Disposable Lighters", "The biggest knock on this theory is that the white disposable BIC lighter simply didn't exist when Hendrix, Morrison, or Joplin died. The first disposable BIC lighter wasn't produced until 1973, more than a year after Morrison's 3 July 1971 death, and Hendrix and Joplin had both passed away even earlier, in 1970.", "While it simply isn't possible for Morrison, Hendrix, or Joplin to have been in possession of a white BIC lighter at the time of their deaths, they could have been carrying some other brand of disposable lighter, such as the Cricket:", "However, this is also unlikely. The Cricket was available in the 1960s in France, but it wasn't commonly found in the United States until after the brand was acquired by Gillette and introduced to American customers in 1972, well after the deaths of Hendrix and Joplin. (Jim Morrison had been living in France just prior to his death and expired in his Paris apartment, so he quite possibly could have encounter Cricket lighters prior to their introduction to the American marketplace.)", "Furthermore, we looked through several biographies and obituaries offering the circumstances of the passings of Joplin, Hendrix, and Morrison, and found no mention of lighters being in their possession at the time of their deaths. In fact, mention of white lighters seems to appear only in articles that propagate the rumor.", "Kurt Cobain", "Of the four musicians frequently associated with this rumor, only Kurt Cobain could unquestionably have been carrying a white BIC lighter at the time of his death (since he committed suicide in 1994, long after BICs had gained prominence in the United States).", "According to a set of photographs released by the Seattle Police Department in 2014, Cobain had two lighters in close proximity to him on the day of his death. However, neither of those lighters was in his pocket, and neither was white. One multi-colored lighter was discovered in his heroin kit, and another lighter that appears distinctly pink in photographs was found nearby:", "The official Los Angeles medical examiner-coroner's autopsy report for Janis Joplin is available online and makes no mention of any cigarette lighter (of any brand, color, or type) having been found on or around her body.", "Jim Morrison died in the bathtub of his Paris apartment and therefore couldn't have had any lighter on his person when he expired (since he was not in the habit of bathing fully clothed). Also, Morrison was determined to have died of \"heart failure,\" so French authorities deemed an autopsy unnecessary and did not perform one. Therefore, no autopsy report ever existed to document the presence of a lighter found near his body or in his clothing, as claimed.", "Jimi Hendrix's death certificate (listing his cause of death as \"inhalation of vomit\" and \"barbiturate intoxication\") is available online, but we could not locate a full copy of his autopsy report. Nonetheless, we found no secondary references to that report indicating it included any mention of a (white) cigarette lighter on or about Hendrix's body.", "In short, there's extremely little chance, and zero evidence documenting, that any of the four musicians mentioned above had white disposable lighters in their pockets at the time they breathed their last.", "Talevski, Nick.   \"Rock Obituaries — Knocking on Heaven's Door.\"\r\n    Omnibus Press, 2006.", "Vickers, Marques.   \"Entombing Our Icons: The Jimi Hendrix, Bruce and Brandon Lee and Lake View Cemetery Memorials.\"\r\n    Marquis Publishing, 2015.", "Fisher, Greg.   \"Dozens of New Photos Released from Kurt Cobain Death Probe.\"\r\n    CBS News.   27 March 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]