["“Whatever happened between me and nun, it is not rape. It is the Holi Ritual of enlightenment to feel the Magical Existence of Holi Jesus at the end of the act”. Madhu Kishwar tweeted an image comprising of the aforementioned text along an image of rape accused Bishop Franco Mulakkal. The image also has the logo of ANI.", "Awesome! May more & more skeletons come pouring out of the safe vaults of Christianity so people are disabused of their naive notions about the Church pic.twitter.com/PQqHmrnEsL", "— MadhuPurnima Kishwar (@madhukishwar) September 17, 2018", "A complaint of rape was filed against Bishop Franco Mulakkal in June by a nun belonging to the Catholic congregation of missionaries of Jesus in Jalandhar.", "Another Facebook user had earlier posted the same image with the identical narrative. His post received 4,500 shares at the time of writing.", "The above image of the Bishop with the aforementioned statement was also circulated by several other individuals on Twitter.", "Alt News did a Twitter search using the keywords, “Holi Ritual of enlightenment” and found the original source of this information. Unpaid Times was the first to tweet the screenshot of the claim and attributed to the Bishop. The Twitter biography of Unpaid Times clearly states that it is an “Indian Satirical News Website”. However, as it happens every so often, many people fall for such satire and circulate the information believing it to be true. Even in this case, social media users passed off the satirical attempt by Unpaid Times as factual information.", "‘Whatever happened between me and nun, it is not rape. It is the Holi Ritual of enlightenment to feel the Magical Existence of Holi Jesus at the end of the act’: Bishop Franco Mulakkal, accused of Rape. pic.twitter.com/F6E7hVMK3q", "— The UnPaid Times (@UnPaidTimes) September 12, 2018", "There are further clues in the above image to suggest that the ‘news’ is not genuine. If one looks closely, the morphed image has a watermark of “breakyourownnews.com” which is a website to generate such ‘stories’. The image circulated by the Unpaid Times is the default news format of the website. Moreover, the spelling of ‘Holy’ in the screenshot was misspelt as ‘Holi’ was also a giveaway. The Print also had fact-checked the claim.", "Another tweet from a parody account, Times How was retweeted by Rajiv Malhotra and @Being_humor, an account run by person called Vinay Sharma. It had accumulated close to 3500 retweets and 4900 ‘likes’ so far.", "Social media users should be circumspect about the unsubstantiated claims made on social media. In this instance, a close inspection of the image would have shown a website’s watermark and revealed that it wasn’t an actual media report.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]