["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Secretary of State Mike Pompeo listens as President Donald Trump speaks during a coronavirus task force briefing at the White House on March 20, 2020, in Washington. (AP/Vucci)", "The State Department announced Feb. 7 that it had “facilitated the transportation of nearly 17.8 tons of donated medical supplies to the Chinese people.”", "The same day, the WHO director general said, “There is limited stock of (personal protective equipment) and we need to make sure we get it to the people who need it most in the places that need it most,” citing health care workers and caretakers.", "A State Department spokesperson told us efforts aimed at responding to the threat of the coronavirus overseas also help mitigate the spread in the U.S.", "National shortages of masks, gowns and other personal protective equipment have exacerbated concerns that U.S. doctors and nurses are not getting the supplies needed to help COVID-19 patients.", "The surging demand for masks led President Donald Trump to charge, without evidence, that the equipment earmarked for New York’s hospitals has been \"going out the back door.\" But some people are pointing the blame back at Trump, who downplayed the threat of the virus early on despite warnings from experts about the health care system’s readiness.", "One claim we’ve heard from politicians, TV commentators and social media users is that the U.S. gave away medical supplies that are now sorely needed at home.", "\"On February 7, the (World Health Organization) warned about the limited stock of PPE,\" said a March 31 Facebook post, using an acronym for personal protective equipment. \"That same day, the Trump administration announced it was sending 18 tons of masks, gowns and respirators to China. Now our health care workers are dying because of no PPE.\"", "The post from Blue Dem Warriors was flagged as part of Facebook’s efforts to combat potential false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) In this case, the information is largely accurate.", "The State Department announced on Feb. 7 that it had \"facilitated the transportation of nearly 17.8 tons of donated medical supplies to the Chinese people, including masks, gowns, gauze, respirators, and other vital materials.\"", "The Facebook post cited as its source of information a CNN editorial criticizing the shipment.", "The move came more than two weeks after the first U.S. coronavirus case was detected in Washington state on Jan. 21. Secretary of State Mike Pompeo tweeted Feb. 7 that the delivery would \"help save lives\" in China, which had reported more than 31,000 cases by then.", "We have coordinated with U.S. organizations to transport more humanitarian relief to people in Wuhan. Personal protective equipment and other medical supplies donated by these organizations can help save lives in #China and help protect people from the #coronavirus. pic.twitter.com/57SN2TXfLP", "Pompeo touted the assistance again in remarks to reporters on March 31, saying it was an example of American generosity and part of an effort to keep the virus contained to China.", "The materials sent to China, Pompeo said, were donated by Samaritan’s Purse, the Church of Jesus Christ of Latter-day Saints, and other private organizations. Boeing and Intermountain Healthcare were also involved, according to a Feb. 15 State Department press release.", "On Feb. 7, the State Department also pledged to commit up to $100 million in existing funds to assist China and other countries. A State Department spokesperson told us the $100 million promise has been fulfilled with funds from the U.S. Agency for International Development.", "The U.S. aid to date also includes about $110 million in humanitarian assistance for up to 64 different countries and roughly $64 million in refugee-related assistance for the United Nations.", "The spokesperson told us the security and health of Americans comes first, but that \"the spread of COVID-19 is a threat to our shared international security\" and that efforts aimed at responding to the virus abroad are also meant to help mitigate the spread in the U.S.", "We won’t weigh in on whether the distribution of donated protective equipment to China was the right move. But the Facebook post is correct that the U.S. announced the delivery in February. Other fact-checkers said the same about a similar claim from Rep. Maxine Waters, D-Calif.", "The Facebook post also notes that the timing of the China shipment coincided with a press conference in which the World Health Organization sounded the alarm about a \"limited stock\" of personal protective equipment.", "That’s accurate. WHO Director-General Tedros Adhanom Ghebreyesus warned on Feb. 7 of a potential supply shortage across the globe and especially in China. The warning was for the world, not the U.S. in particular.", "\"The world is facing severe disruption in the market for personal protective equipment,\" Ghebreyesus said. \"Demand is up to 100 times higher than normal and prices are up to 20 times higher.\"", "Ghebreyesus said the situation was made worse by people outside of patient care using masks, for example. He said health workers and caretakers should be first to receive items from the limited stock, and that health workers in China needed \"the bulk of PPE supplies.\"", "\"WHO discourages stockpiling of (personal protective equipment) in countries and areas where transmission is low,\" he said.", "The Facebook post closes by saying \"our health care workers are dying because of no PPE.\"", "News reports indicate that some health workers — who are at an increased risk of exposure — are among the more than 200,000 infected Americans and over 4,500 who have died. Doctors and nurses have made shortages known and are tweeting the hashtag #GetMePPE.", "Some medical supplies are now coming into the U.S. from abroad. The White House arranged for the transport of tons of equipment from China, and the New England Patriots recently lent its team plane to pick up 1.2 million N95 masks from China for Massachusetts’ health workers.", "We asked the State Department whether any of the donated materials sent to China in February made their way back to the U.S., and whether the donations would have gone straight to U.S. hospitals had they not been shipped overseas. We didn’t get answers to those questions.", "A Facebook post said: \"On February 7, the WHO warned about the limited stock of PPE. That same day, the Trump administration announced it was sending 18 tons of masks, gowns and respirators to China.\"", "The State Department announced the delivery of nearly 18 tons of donated materials on Feb. 7, the same day that the WHO sounded the alarm about the world’s supply of personal protective equipment. The donated materials came from private groups.", "We rate this statement True.", "Facebook post, March 31, 2020", "#GetMePPE on Twitter, accessed April 2, 2020", "The Wall Street Journal, \"A Million N95 Masks Are Coming From China—on Board the New England Patriots’ Plane,\" April 2, 2020", "U.S. Department of State, \"Secretary Michael R. Pompeo Remarks to the Press,\" March 31, 2020", "Snopes, \"Did the Trump Administration Send 18 Tons of PPE to China in Early 2020?\" March 31, 2020", "Politico, \"Pence task force freezes coronavirus aid amid backlash,\" March 31, 2020", "CNN, \"Trump administration sent protective medical gear to China while he minimized the virus threat to US,\" March 30, 2020", "The Huffington Post, \"U.S. Shipped Tons Of COVID-19 Supplies To China As Trump Dismissed Threat Here,\" March 30, 2020", "The New York Times, \"Nurses Die, Doctors Fall Sick and Panic Rises on Virus Front Lines,\" March 30, 2020", "The New York Times, \"White House Airlifts Medical Supplies From China in Coronavirus Fight,\" March 29, 2020", "Mother Jones, \"The US Sent Tons of Medical Supplies to China Even as Senators Warned of Virus Threat Here,\" March 29, 2020", "U.S. Department of State, \"The United States Is Leading the Humanitarian and Health Assistance Response to COVID-19,\" March 27, 2020", "U.S. Department of State, \"Briefing on U.S. Foreign Assistance in Response to COVID-19,\" March 26, 2020", "The American Hospital Association, \"AHA, AMA and ANA Letter to the President to Use DPA for Medical Supplies and Equipment,\" March 21, 2020", "U.S. Department of State, \"China’s Expulsion of U.S. Journalists,\" March 18, 2020", "The Washington Post, \"Covid-19 hits doctors, nurses and EMTs, threatening health system,\" March 17, 2020", "U.S. Department of State, \"Public-Private Cooperation To Combat the Novel Coronavirus,\" Feb. 15, 2020", "U.S. Department of State, \"The United States Announces Assistance To Combat the Novel Coronavirus,\" Feb. 7, 2020", "Donald J. Trump on Twitter, Feb. 7, 2020", "Secretary Pompeo on Twitter, Feb. 7, 2020", "The World Health Organization, Transcript from a press conference on the novel coronavirus, Feb. 7, 2020", "The World Health Organization, \"Novel Coronavirus(2019-nCoV) Situation Report – 18,\" Feb. 7, 2020", "Chris Murphy on Twitter, Feb. 5, 2020", "PolitiFact, \"Hospital demand for masks is soaring. Here’s how hospitals use them against coronavirus,\" April 1, 2020", "Statement from the State Department, April 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]