["The General Assembly on April 3 narrowly approved an amendment by Gov. Bob McDonnell that will ban insurers participating in an upcoming federal health care exchange in Virginia from offering policies that cover most abortions.", "The action was disappointing to NARAL Pro-Choice Virginia. The group said, among other things, that McDonnell’s proposal would force the exchange to offer more restrictive coverage than most private insurance plans.", "\"McDonnell’s amendment prohibits Virginians participating in the new health exchange from purchasing any insurance plan that includes coverage for abortion -- coverage that currently exists as a standard benefit in nearly 90 percent of private plans sold in the U.S.,\" NARAL said in a March 26 news release.", "Two Democrats running for lieutenant governor -- state Sen. Ralph Northam of Norfolk and Aneesh Chopra, former U.S. chief technology officer of the United States -- quickly sent out similar statements.", "We decided to check NARAL’s claim that abortion coverage is standard in almost 90 percent of the private plans now being sold. We should note McDonnell’s amendment has an exception that allows insurance companies on the exchange to cover abortions in instances of rape, incest or when a mother’s life would be endangered by continuing a pregnancy.", "NARAL said it got the figure from a 2004 report by the Guttmacher Institute, an organization based in New York City that specializes in research on reproductive health issues. Although Guttmacher supports access to abortion and birth control, its research has been cited by both sides of the abortion debate.", "NARAL cited a Guttmacher synopsis that says the study examined abortion coverage through private insurance in 2002. It found that 87 percent of typical employer-based policies back then covered \"medically necessary or appropriate abortions.\"", "Rebecca Wind, a spokeswoman for the Guttmacher Institute, said the definition of \"medically necessary or appropriate abortions\" is whatever a physician deems is required to protect the \"health or mental health of the patient.\"", "Guttmacher said its figure on private insurance coverage for abortion did not consider plans that offered benefits only in limited circumstances such as cases of rape, incest or to protect  the life of a mother.", "But the Guttmacher memo also noted another survey examining the issue came up with different results. That study, by Kaiser Family Foundation, found in 2003 that 46 percent of workers with employer-based insurance had coverage for abortion.", "The Guttmacher and Kaiser studies conducted early last decade offer the only detailed looks available on abortion coverage. Experts have not reconciled the difference in results.", "We spoke to Jon Gabel, a researcher who helped compile the 2003 Kaiser survey and now is a senior fellow at NORC, a social science research foundation at the University of Chicago. He said the 46 percent Kaiser cited refers to workers who were covered  for \"elective abortions\" that did not involve a medical emergency. Gabel said he interpreted Guttmacher’s study as an examination of abortion coverage for medical necessity.", "Guttmacher, in a 2011 memo, essentially said the two studies asked different sets of questions that may have led to the different results. Guttmacher did not defend its original finding as definitive. \"The actual level of coverage is probably somewhere between the estimates made by Guttmacher and Kaiser, meaning that most Americans with employer-based insurance currently have coverage for abortion,\" the memo said.", "Our ruling", "NARAL said McDonnell’s amendment banning an upcoming health care exchange from offering insurance plans that include abortion denies Virginians \"coverage that currently exists as a standard benefit in nearly 90 percent of private plans sold in the U.S.\"", "NARAL bases its claim on a 9-year-old study by the Guttmacher Institute that found 87 percent of typical of typical employer-based insurance policies covered \"medically necessary or appropriate abortions.\" Contrary to NARAL’s contention, the findings do not reflect coverage \"that currently exists.\" The research focused on policies that were offered in 2002.", "Guttmacher never updated its report. The only other major research on abortion coverage was conducted by Kaiser in early 2003 and produced a different result. It found that 46 percent of workers with employer-based insurance had coverage for abortions.", "Experts have struggled to reconcile the two numbers. Guttmacher, in 2011, said that the \"actual level of coverage is probably somewhere between\" its estimate and that of Kaiser.", "So NARAL is citing as gospel an old figure that even its authors undercut. We rate its claim Mostly False.", "NARAL Pro-Choice Virginia, \"NARAL Pro-Choice Virginia condemns McDonnell’s latest attack on women’s health,\" March 26, 2013.", "E-mail fro Alena Yarmosky, spokeswoman for NARAL Pro-Choice Virginia, March 26.", "Guttmacher Institute, \"Memo on private insurance coverage of abortion,\" Jan. 19, 2011.", "Guttmacher Institute, \"U.S. Insurance coverage of contraceptives and the impact of contraceptive coverage mandates, 2002,\" March/April 2004.", "E-mails from Rebecca Wind, spokeswoman for the Guttmacher Institute, March 27-28, 2013.", "Interview with Rebecca Wind, March 27, 2013.", "Interviews with Paul Fronstin, director of the health research program at the Employee Benefits Research Institute, March 29; April 1, April 4, 2013.", "E-mail from Jon Gabel, senior fellow at NORC at the University of Chicago, March 28, 2013.", "PolitiFact Ohio, \"Sen. Sherrod Brown critical of House bill’s potential impact on insurance coverage for abortions,\" May 16, 2011.", "FactCheck.org, \"Surgery for seniors vs. abortions?\"  Aug. 3, 2009.", "Legislative Information System, \"HB 1900 Governor’s recommendation,\" accessed March 28, 2013.", "Kaiser Family Foundation, \"Employer Health Benefits 2003 annual survey,\" pages 109-110, accessed March 28, 2013.", "Richmond Times-Dispatch,\"McDonnell seeks to bar abortion coverage in health exchange,M March 27, 2013.", "E-mail from Trey Nix, spokesman for Aneesh Chopra’s Lieutenant Governor campaign, March 26, 2013.", "E-mail from Brad Komar, spokesman for Sen. Ralph Northam’s Lieutenant Governor campaign, March 26, 2013.", "E-mails from Chris Lee, spokesman for the Kaiser Family Foundation, March 27-28, 2013.", "Chopra for Virginia, \"Chopra denounces Governor McDonnell’s proposed abortion ban amendment,\" March 26, 2013.", "Northam for Lieutenant Governor, \"Senator Northam denounces McDonnell for playing politics with women’s health,\" March 26, 2013.", "FactCheck.org, \"FactCheck mailbag, week of April 6-April 12,\" April 13, 2010.", "PolitiFact Virginia, \"McDonnell says Virginia will join 23 states with ultrasound requirements before abortions,M March 21, 2012.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]