["The video has been shared in multiple social media posts, including a tweet from February 4, 2021 which has viewed more than 13,000 times.", "“See Trump's momentum when he signed his name and...what exactly did he sign?” the tweet's Chinese-language caption reads.", "The clip shows former US president Donald Trump appearing to sign a document before holding it up to reveal the letter “Q” and a skull on the left page, while the adjacent pages reads “THE BEST IS YET TO COME”.", "“Q” is a representative letter for QAnon, a conspiracy theory movement that claims  Trump is waging a secret war against a global liberal cult of Satan-worshipping paedophiles. AFP has debunked several false claims pushed by QAnon followers, as seen here and here.", "“The best is yet to come” was a phrase used by Trump in a farewell address the day before his successor President Joe Biden took office on January 20, 2021.", "“I go from this majestic place with a loyal and joyful heart and optimistic spirit and a supreme confidence that for our children and for our country, the best is yet to come,” he said.", "The video has also circulated here and here on Twitter.", "Many social media users pointed out the video was “fake”.", "“There's really a Q! Excellent!” one person commented. Another wrote, “The video is fake, the original video is about an executive order against Obama's healthcare reform.”", "The clip is in fact doctored from an White House video from 2017.", "A Yandex reverse image search and keyword searches on Google found this YouTube video published by White House’s archived channel for Trump on October 13, 2017.", "The corresponding images from the Twitter video can be found from the 15:19 mark of the video.", "Below are screenshots comparing the doctored video (L) and original footage (R):", "The White House's YouTube video is titled: “President Trump Signs an Executive Order to Promote Healthcare Choice and Competition”.", "Trump's executive orders have long been doctored by online users, reported such as here by US televsion broadcaster CNN and here by US magazine Time.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]