["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "On the July 11, 2010, edition of NBC's Meet the Press, Republican strategist Ed Gillespie sought to contrast favorably economic performance under President George W. Bush to that under President Barack Obama.\n\nGillespie -- a former top aide to Bush -- said \"the fact is, under the Bush tax cuts, we did have 52 months of ... uninterrupted job creation, longest in the history of the country, and revenues were at an all-time high in 2007. The problem wasn't lack of revenue. The problem still remains today too much federal spending, and this administration's not addressing that.\"\n\nWe thought it would be worth checking two of Gillespie's claims.\n\n• Did Bush preside over 52 months of uninterrupted job creation? Close, but not quite.\n\nAccording to the Bureau of Labor Statistics, the economy added more jobs than it lost during 50 out of 52 months between September 2003 and December 2007. The economy lost jobs over two months during that stretch -- between June 2007 and July 2007 (20,000 jobs) and between July 2007 and August 2007 (71,000).\n\nThat falls slightly short of being \"uninterrupted.\" Gillespie would have been correct if he'd said that jobs grew for 46 consecutive months.\n\nWe might add that over the course of Bush's presidency -- a total of 96 months -- the economy created 1.08 million jobs. That may sound like a lot, but compared to every other post-World War II president prior to Obama, it's the lowest average annual percentage increase in jobs created. (See our calculations here.)", "That said, Obama's figures are worse than any of his postwar predecessors'. The economy has shed between 2.4 million and 3.1 million jobs during the 18 months he's been in office, depending on whether you start counting with the January 2009 figures or the February 2009 figures.\n\n• Were revenues at an all-time high in 2007? Strictly speaking, yes.\n\nAccording to the Urban Institute-Brookings Institution Tax Policy Center, total federal tax receipts hit $2.57 trillion in 2007, before declining in 2008 and 2009, when the current recession was under way. (Tax revenues almost always sink during a recession.) The 2007 level was the highest recorded since 1934, when statistics were first collected.\n\nSo on that score, Gillespie's right. But using this particular statistic neglects a key factor -- the size of the economy as a whole. Though recessions and expansions produce volatility in tax collections, as do changes in tax policy, one would expect that a bigger economy would generally produce greater tax revenues than a smaller one. And indeed, in the 57 tax years between 1951 and 2007, tax collections grew 49 times on a year-to-year basis -- a consistent trend despite frequent changes in tax rates and periodic recessions.\n\nYou can easily factor out the size of the U.S. economy if you divide revenue by gross domestic product, or GDP. The Tax Policy Center has also calculated these numbers.\n\nIn 2007, tax revenues represented 18.5 percent of GDP. That's high by historical standards but hardly a record. It only ties for 16th place going back to 1934, and within the 14-year stretch between 1996 and 2009 it only rises to 7th place.\n\nSo if Gillespie's point is that Bush's tax cuts led to record revenues, they did -- for 2007 at least -- but that was a record aided by a the largest, non-recession economy in American history.\n\nUltimately, Gillespie two comments are generally accurate, but they would have benefited from some additional historical context. We realize that this is not always possible during a fast-paced television show, so on balance, we rate his statement Mostly True.", "NBC, Meet the Press transcript, July 11, 2010\n\nBureau of Labor Statistics, Employees on nonfarm payrolls by industry sector and selected industry detail, accessed July 11, 2010\n\nTax Policy Center, Historical Source of Revenue as Share of GDP, accessed July 11, 2010\n\nE-mail interview with J.D. Foster, senior fellow with the Heritage Foundation, July 11, 2010", "E-mail interview with Bob Williams, senior fellow with the Urban Institute-Brookings Institution Tax Policy Center, July 11, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]