["A video has been doing rounds on social media where a group of men in skull caps can be seen pelting stones on what looks like a place of worship. The clip is viral with the claim that members of the Muslim community were hurling stones at a temple in Atali village, Faridabad in Haryana. Its corresponding message reads – ” कल शाम को अटाली गांव फरीदाबाद में शांतिप्रिय मुस्लिम लोगो द्वारा मंदिर में कीर्तन कर रही महिलाओ पर पथराव। एक जागरूक महिला ने वीडियो बनाया जो की पूरे हिंदुस्तान में फेल चूका है। किसी न्यूज़ चॅनेल पे ये नहीं दिखाया जाएगा। (A group of peace-loving Muslims pelted stones on a temple yesterday evening in Atali, Faridabad, while some women were performing kirtan in the temple. A woman recorded the entire thing and the video went viral in the entire country. No news channel will show this.)”", "कल शाम को अटाली गांव फरीदाबाद में शांतिप्रिय लोगो द्वारा मंदिर में कीर्तन कर रही महिलाओ पर पथराव? एक जागरूक महिला ने वीडियो बनाया जो की पूरे हिंदुस्तान में फेल चूका है। किसी न्यूज़ चॅनेल पे ये नहीं दिखाया जाएगा। ‘ pic.twitter.com/FlhPmRL3L9", "— Akash RSS (@Satynistha) July 7, 2019", "The video has been circulating since 2015. Posted by one Ajit Tripathi, it was shared more than 24,000 times and viewed over 6 lakh times.", "कल शाम को अटाली गांव फरीदाबाद में शांतिप्रिय मुस्लिम लोगो द्वारा मंदिर में कीर्तन कर रही महिलाओ पर पथराव। एक जागरूक महिला ने वीडियो बनाया जो की पूरे हिंदुस्तान में फेल चूका है। किसी न्यूज़ चॅनेल पे ये नहीं दिखाया जाएगा। ‘SHANTIPRIYE’?", "Posted by Ajit Tripathi on Thursday, 2 July 2015", "The video is now massively viral with the same claim.", "Another message posted along with the same video says, “आजकल ये डरे हुए सुवर के पिल्ले कहीं शिवलिंग पर पेशाब कर रहे हैं, कहीं मंदिर तोड़ रहे हैं अब देखिए फरीदाबाद में मंदिर में पूजा कर रहे लोगों पर पथराव कर रहे हैं…जल्दी इनकी पहचान करवा कर इन्हें scholorship दिलवाइये और IAS बनवाइयेयही हैं डूबते भारत का भविष्य ( Nowadays, these scared piglets are at one place urinating on Shivalingas and at another destroying temple. See, now they are throwing stones at people worshipping in a temple in Faridabad. Identify them quickly and get them a scholarship and make them IAS. They are the future of drowning India.)”", "There are variants of the claim attached to this video. Some posts say that Muslims are attacking a Hindu temple, whereas a YouTube video claims that the attack was on a Gurudwara in Atali, Faridabad.", "Several people have reached out to Alt News, asking about the veracity of the claim that Muslims in Atali, Faridabad attacked a Hindu temple.", "Alt News found that the video is from Jaipur, Rajasthan and not Atali, Faridabad, as claimed on social media.", "Furthermore, the incident shown in the video took place in 2015.", "Upon scrolling through comments posted below individual tweets, we found one which suggested that the video is from Jaipur.", "Furthermore, a close analysis of the structure indicated that it could be a mosque and not a temple.", "Based on the clues, Alt News searched Google Maps for pictures of mosques situated across Jaipur. We found that the building shown in the video matches with Jama Masjid in Kagzi colony, Sanganer, Jaipur.", "We then compared the photographs of Jama Masjid with the building seen in the video. In side-by-side comparisons posted below, the images on the left are from the viral video, while the ones on the right are of Jama Masjid taken from Google Maps.", "We also found a Facebook post by one Prince Aahan on July 2015 which said that the stone-pelting took place in the Sanganer, Jaipur mosque. He claimed that the Barelvi community attacked the place of worship of Tablighi Jamaat.", "Jaipur ke paas Kal sanganer ki masjid men jo hua us se tamam musalmanaun ka sar sharm se jhuk jana chahiye Barelwi maslak walaun ne tableeghi jamath walaun ki masjid per ander aker pathrao kiya Dekho yeh hai Hamare Musalmana", "Posted by Prince Aahan on Wednesday, July 1, 2015", "Alt News contacted Mohammed Shaheed Raza, a 25-year-old resident of the locality, who said, “The video of the place which is going viral on social media is minutes away from my residence. The incident took place around 2015 when boys among the Muslim community got into a conflict. The claim that is now circulating with the video is false“. We spoke to another local who corroborated the same story.", "An old video of stone-pelting in a mosque in Jaipur was shared on social media with the false claim that members of the Muslim community attacked a Hindu temple in Atali, Faridabad when women were performing kirtan inside the place of worship.", "Donate Now", "Aqib is monitoring and researching mis/disinformation at Alt News", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]