["“कृपया। तुमच्याकडे जेवढे ग्रुप आणि कॉन्टॅक्ट नंबर असेल त्यांना हि बातमी पटकन पाठवा लगेच ताबडतोब. आत्ताच अक्कलकोट मध्ये लहान मुलांना घेऊन जाणारे चोर पकडले आहे, मिरजगी ता.अक्कलकोट. लहान मुलांना पळविणे व किडणी, लिव्हर, हार्ट कडून मारून टाकने यांची टोळी 3000 हुन जास्त आहे तरी आपल्या मुलांन वर लक्ष ठेवा नवीन मानुस दिसला की लगेच पोलिसांना कळवा. लहान पोर उचलणारे सोलापुरात दाखल झाले आहेत” (Request! Immediately forward this to all your contacts and groups. Just now, in Mirajgaon, Akkalkot district, they have caught thieves who kidnapped young kids. Kidnapping kids and then killing them by removing their kidneys, livers, hearts – this gang has more than 3000 members. Therefore, keep a watch on your kids and if you see a new person inform the police immediately. Those who kidnap young kids have entered Solapur- translated)", "This message is being forwarded across Whatsapp groups, urging people to protect their children from kidnappers in Maharashtra’s Mirajgaon, Akkalkot and Solapur district. The message has also been shared with identical text by some users on Facebook.", "The last few days have witnessed a spate of rumours that child abduction gangs are active across the country, wreaking havoc and resulting in mob violence. The fear-mongering recently caused lynchings in Andhra Pradesh, Telangana, Tamil Nadu, Karnataka and Uttar Pradesh, among other states. Police has also arrested some people for spreading rumours and creating a fear psychosis. In most or all of these cases, the same set of photographs has been circulated to instill fear and suspicion.", "This set of photographs was used to spread the rumour that kidnappers across Bihar, Jharkhand and Odisha are abducting children to harvest their organs.", "Alt News had debunked these viral claims using the Google reverse image search option. Even though the origin of some of the images could not be ascertained, we found that one of them was of an unrelated incident from 2017. This is an image which shows five arrested men. Some messages claimed they are child abductors from Tamil Nadu while others claimed they are from Karnataka. A report by The News Minute had dispelled these rumours, reporting that Bengaluru police has clarified via Twitter that these pictures are fake.", "Fake one", "— BengaluruCityPolice (@BlrCityPolice) May 3, 2018", "Another video which was earlier attributed to child abduction in Tamil Nadu is now being shared with a Marathi caption, urging people to spread the message that children are in danger.", "To establish the origin of the video, Alt News broke it up into individual frames with InVid software for videos, and reverse searched the image via Google. A video demonstration of the fact-check can be seen below.", "Alt News found that this is an old video from 2016 made for awareness purposes by an organisation named Roshni Helpline. The video ends with the text: “Every year, over 3000 children go missing in Karachi, Pakistan. Keep an eye on your child.” The abduction was staged to educate people about rampant child abduction in Karachi. The original video is posted below.", "The hysteria began with WhatsApp rumours of child tracking and abduction in May 2017 which resulted in the lynching of seven people in Jharkhand. It has spilled over into 2018 as well. Earlier this month, a football vandalism video from Switzerland was used to claim that Muslims attacked cars in U.K. The same video was again used with a different narrative to show Muslims attacking tourists in Kashmir.", "A similar pattern has now been observed, wherein a set of disparate images has been put together and circulated widely, intensifying rumours of child abduction gangs on the prowl and consequently creating a fear psychosis. Readers are advised to exercise caution and refrain from forwarding such messages if received.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]