["About this rating", "Every fast food chain gets its own urban legend these days, from claims of worms in McDonald's hamburgers to roaches in Taco Bell tacos to snakes in Burger King's ball pits, we're determined to demonize corporate purveyors of cheap, industrial food products.  It appears to be KFC's turn in the spotlight again (their original legend about the fried rat having become a bit long in the tooth), and they have become the proud owners of a legend intended to reflect another modern fear: genetically engineered food:", "Versions of this legend have been circulating for decades now, as indicated by the e-mail's reference to Kentucky Fried Chicken's \"recent\" name change, an event that took place in 1991. Earlier versions of the tale featured six-legged chickens (\"How do they taste?\" \"Dunno; no one's ever been able to catch one\") or birds so plumped by chemicals that their gigantic breasts made it impossible for them to keep their balance well enough to walk.", "It's easy to see why this legend has suddenly made such a strong resurgence.  Our continual progress in understanding and manipulating the genetic codes of plants and animals has fueled debate over the environmental and health concerns raised by the creation and growth of transgenic food crops and the marketing of food products derived from animals that have been given artificial hormones.  Additionally, to those who already feel that our killing and eating other animals is morally wrong, this legend highlights the complete disregard most humans hold for the rights of animals and the increasingly inhumane conditions under which food animals are raised.  \"The government that's supposed to be looking out for our health and safety doesn't really care about us\" theme also makes an appearance here: a private company has supposedly created a genetically altered form of an animal that is raised and eaten by the hundreds of millions every year, and all the government has done about the situation is to require them to stop using the word 'chicken' to describe this product?", "Nothing like the Frankensteinian laboratory scenario described here is taking place, however.  Raising chickens that have been genetically modified so that they are born without beaks, feathers, or feet, or with additional legs is still beyond the reach of modern science for the time being (although selective breeding has been used to enhance some features, such as breast size), nor did the University of New Hampshire perform a \"study of KFC.\"  As well, the claims about Kentucky Fried Chicken's name change are easily belied:", "Links on KFC's web site clearly describe the company's product as \"chicken\" numerous times, something they could hardly get away with if the government were prohibiting them from using that word. And the KFC web site can also still be reached through the domain name kentuckyfriedchicken.com.", "KFC no more raises all of its own chickens than McDonald's maintains vast herds of beef cattle to produce all of their hamburgers, or IHOP farms huge tracts of wheat to use in making their pancakes. These companies are in the restaurant business, not the agricultural or farming business, and they buy their food products from suppliers who service many other customers as well. None of these chains could possibly operate the enormous facilities that would be required to supply themselves with all the raw food products they needed: KFC sells the equivalent of 736 million chickens annually, and they would have to own some monstrously huge \"chicken farms\" in order to supply themselves with well over half a billion chickens every year.  (As well, KFC is but one component of Yum! Brands, a corporation that also includes the Taco Bell and Pizza Hut chains of restaurants.  All of these outlets serve chicken and obtain their supplies through the same sources, which would require Yum! Brands to operate an even more massively huge series of \"mutant chicken\" farms to keep its restaurants fully supplied.)", "Kentucky Fried Chicken decided to change its name to KFC in 1991 for several reasons, none of which had anything to do with governmental regulations about mutant animals:", "A move to de-emphasize \"chicken\" because KFC planned to offer a varied menu that included other types of food.  (The Boston Chicken corporation took the same approach for the same reason, changing the name of its retail food outlets to Boston Market.)", "A desire to eliminate the word \"fried,\" which had negative connotations to the increasingly health-conscious consumer market.", "A trend towards the abbreviation of long commercial titles as demonstrated by other companies' employing shortened forms of their names, such as The International House of Pancakes (IHOP) and Howard Johnson's (HoJo).", "Nonetheless, the \"Great KFC Mutant Chicken Myth\" grew so prominent online that KFC eventually addressed it on their web site:", "The Internet is good for lots of things: cat videos, questionable medical diagnoses, and wildly imaginative urban legends, including the KFC mutant chicken myth. This myth has been perpetuated over several decades by a widely circulated email hoax. The hoax claimed that Kentucky Fried Chicken changed its name to KFC because it was forced to eliminate the word “chicken” from its brand name—purportedly because KFC meat came from “mutant chickens” with extra legs and no beaks.", "We can set the record straight: no mutated or genetically engineered chickens are involved in making our delicious KFC chicken. Just 100% real chicken from US farms, which have to pass over 30 quality checks and USDA inspection before being hand-prepared by one of our cooks. Ultimately, less than 10% of chickens meet KFC’s high standards for quality, which includes no artificial hormones or steroids—a federal regulation.", "No mutated chickens are involved in making our delicious fried chicken", "As with all chicken sold in the United States, KFC chickens are bred using age-old techniques to produce healthy birds and the high-quality products that our customers expect. They’re also raised humanely in a cage-free environment on trusted American family farms—the same that supply your local supermarket—based on standards established in consultation with our Animal Welfare Advisory Council. In addition, KFC chicken farms must adhere to parent company Yum! Brands’ Supplier Code of Conduct, which helps maintain the ethical sourcing and supply of our food.", "So let’s put the Great KFC Mutant Chicken Myth to rest, shall we? Though urban legends about mutated KFC meat are good for a laugh, on a KFC chicken farm, the chicken is 100% real—just like the Colonel’s time-honored secret recipe.", "How concerned we should be about genetically engineered food products is one thing, but no amount of concern or protest is going to \"make KFC start using real chicken again\": \"real chicken\" is what KFC has been using all along.", "Sightings:   A scientist breeds headless, boneless chickens on a high-tech farm in the 1967 Italian film Death Laid an Egg   (La Morte ha fatto l'uovo).", "Allin, Richard.   \"Freeing Us from Fat?\"\r\n    Arkansas Democrat-Gazette.   21 June 1994   (p. E1).", "Hsu, Karen.   \"Chicken Hoax Takes Flight.\"\r\n    The Boston Globe.   11 January 2000   (p. B1).", "Keegan, Peter O.   \"KFC Shuns 'Fried' Image with New Name.\"\r\n    Nation's Restaurant News.   25 February 1991   (p. 1).", "Kirschembaum, Alan I.   \"The 'Original Recipe' for International Success.\"\r\n    Business Dateline.   May 1992   (p. 17).", "Lileks, James.   \"Urban Myth Believers — The Bucket Stops Here.\"\r\n    [Minneapolis] Star Tribune.   16 January 2000.", "Power, Christopher.   \"And Now, Finger-Lickin' Good for Ya?\"\r\n    Business Week.   18 February 1991   (p. 60).", "Precker, Michael.   \"KFC Rumor Takes Wing on the Internet.\"\r\n    The Dallas Morning News.   19 January 2000.", "Seto, Benjamin.   \"New Names Is Their Game.\"\r\n    The Fresno Bee.   13 March 1995   (p. E1).", "Weise, Elizabeth.   \"Caught in the Grips of an E-Mail Hoax.\"\r\n    USA Today.   19 January 2000.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]