["Cher’s prolific use of Twitter to criticize President Donald Trump has prompted an obscure website to claim the singer is moving to Canada because of his policies.", "\"BREAKING: A Hollywood Star Is Moving To Canada Because Of President Trump,\" said a headline for a story published July 14, 2017 on conservativearmy88.com.", "\"Many Hollywood celebrities announced that they will move in another country if Donald Trump won the elections. Well, the elections were held 7 months ago and he won, but no celebrity kept the promise,\" the post said. (The presidential election was held more than seven months ago, Nov. 8, 2016).", "The article speculated on Cher’s relocation, even though the headline presented a more affirmative claim.", "\"However, singer Cher may be the first to move to Canada because of the President. As Trump announced he wants to change the Obamacare, she took it to Twitter to express her anger,\" the post said.", "Several celebrities did say they would leave the United States, including to Canada, if Trump was elected. On her part, Cher joked she would move to another planet, Jupiter.", "In reply to a Twitter user, Cher wrote on June 16, 2015, the day Trump announced his candidacy: \"IF HE WERE TO BE ELECTED,IM MOVING TO JUPITER 😖\"", "We reached out to the singer via social media for comment but did not get a response. Cher’s website lists a series of upcoming performances in Las Vegas and Washington for the rest of the year. And while her Twitter feed features a series of tweets criticizing Trump and his policies, a search of the word \"Canada\" in her tweets did not yield any message saying she had moved up north.", "Cher also attended the Women’s March on Washington on Jan. 21. \"I want to let people know that I'm here for them and I believe in this movement,\" Cher told the Los Angeles Times.", "It’s also worth noting that conservativearmy88.com’s website does not have any information identifying who runs it, its mission, where it’s based or other information that credible news organizations publish on their website. Its post don’t have author names and are all posted by a site administrator, \"admin.\"", "Conservativearmy88.com’s Facebook page lists a Hotmail email address. We reached out but did not get a response.", "While several celebrities claimed they would move to Canada if Trump won the presidency, Cher joked she would to Jupiter. Cher’s still on planet Earth, but there’s no indication she’s in Canada.", "We rate conservativearmy88.com’s post False.", "Conservativearmy88.com, BREAKING: A Hollywood Star Is Moving To Canada Because Of President Trump, July 14, 2017", "Conservativearmy88.com’s Facebook page, accessed July 25, 2017", "Twitter, @Cher, June 16, 2015 tweet, search of @Cher’s account for \"Canada\"", "CBS News, Stars who threatened to leave the U.S. if Trump was elected", "Billboard.com, Musicians on Moving to Canada: Who's Going, Who's Staying, Who's Offering Shelter?, Nov. 9, 2016", "The Hollywood Reporter, 20 Stars Who Pledged to Flee the Country If Trump Was Elected: Where Are They Now?, Nov. 10, 2016", "CNN, Celebs moving if Donald Trump wins, Nov. 8, 2016", "Page Six, Cher: If Trump wins, ‘I’m gonna have to leave the planet’, Nov. 5, 2016", "Cher.com, Upcoming events, accessed July 25, 2017", "Los Angeles Times, Cher with Jesse Jackson at the Women's March on Washington, Jan. 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]