["This Associated Press photo, from Scott Walker's visit to New Hampshire, shows the sweater in question.", "When Gov. Scott Walker took his presidential ambitions to New Hampshire, he shared a penny-pinching story that would have been right at home in bargain-hunting Wisconsin.", "At the center of the story: A new sweater, a dollar and Menomonee Falls-based Kohl’s.", "The department store chain is well known for its deep discounts -- ones so deep that the company has faced legal challenges over its pricing practices in Kansas, Massachusetts and California. At issue in the California case, for instance, was complaints that the retailer listed \"normal\" prices for products but never sold them for that price.", "Walker likes to point out that shortly after he was married, his wife, Tonette, was mortified because he didn’t know the drill at Kohl’s. In Concord, N.H., he told the crowd at a March 14, 2015 workshop about a \"critical mistake\" he made while shopping at a Kohl’s store.", "\"I went to a Kohl's department store and I bought something for the price it was marked at,\" Walker said, adding that he’s now been \"trained well\" about how to shop at Kohl’s.", "So well that he pointed to the brownish-colored sweater he was wearing and declared: \"We paid one dollar for it with our Kohl’s Cash.\"", "A buck?", "Now, we grant this is not the most important topic in politics today. But we decided to fact check it for two reasons.", "First, we heard from readers from around the country who thought it was an unbelievable story -- as in, literally impossible to believe. Second, it goes to what has been a major theme of Walker’s visits to some of the early primary states -- that he is just an average guy.", "In Wisconsin, voters have long heard about Walker’s brown bag lunches and his ham-and-cheese sandwiches have become a fixture on his Twitter account.", "At the presidential level, all of this becomes a pointed contrast his far-better heeled GOP rivals, including former Florida Gov. Jeb Bush.", "When we asked a spokeswoman for Walker’s exploratory campaign group, Our American Revival, about the $1 sweater, we didn’t receive a response.", "So we did what any Midwesterner would do, and went bargain hunting.", "Could we score a sweater just like the nifty henley that Walker donned in New Hampshire? And, more importantly, could we do it for next to nothing?", "Walker indicated on Twitter that he bought the sweater while in the Granite State.", "He didn’t identify the location, but there is a Kohl’s in Hooksett, about 13 miles from Concord. We called the store, and an employee in menswear said all of the store’s henley sweaters were mixed with other items on clearance racks.", "Based on photos of Walker in the sweater, it appears to be a \"Chaps Twisted Button Mock Sweater\" in a color called \"walnut twist.\" We couldn’t find that sweater available on the Kohl’s web site, so we visited the Kohl’s store in Glendale to paw through the clearance racks.", "There we found plenty of Chaps sweaters marked between 80 and 90 percent off -- an even deeper cut than the 70% Walker cited when describing the deal. Some of the sweaters we found were originally priced at $70 and marked down to $7.", "Now, that’s not $1. But Walker did say he used his \"Kohl’s Cash\" -- a coupon of sorts that is generated based on how much a customer purchased in an earlier visit to the store.", "Thus, he could have easily gotten one for $1 out-of-pocket. We rate the claim True.", "Now, just ask us how much Walker’s daily ham sandwich costs.", "Video, Scott Walker appearance in Concord, N.H., March 14, 2015", "Milwaukee Journal Sentinel, \"In New Hampshire, Scott Walker talks troop deployment to fight Islamic State,\" March 14, 2015", "Milwaukee Journal Sentinel, \"Kohl’s loses appeal in California false-advertising lawsuit,\" May 30, 2013", "The Boston Globe, \"In N.H., Scott Walker stresses humble roots,\" March 14, 2015", "ABC News, \"Wisconsin Gov. Scott Walker: What Shopping at Kohl’s Has to Do With His White House Hopes,\" Jan. 24, 2015", "The Daily Beast, \"Bush & Walker’s Granite State road trip,\" March 15, 2015", "@ScottWalker Twitter account", "Kohls.com", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]