["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Elmer Maldonado, top, a migrant from Honduras, hugs his 1-year-old son at a shelter, March 22, 2021, in Harlingen, Texas. They spent a week in immigration custody after crossing the Rio Grande through Texas to request asylum. (AP)", "Border Patrol data shows that in February the majority of families were not expelled; they were let in and placed in immigration proceedings.", "So far, February is the only full month of the Biden administration for which data is available.", "In January, more than half of families were expelled, but most of that period covered the Trump administration.", "President Joe Biden in his first press conference as president sought to relieve concerns about the numbers of people arriving at the southern border, claiming that the vast majority are \"being sent back,\" including families.", "\"Thousands, tens of thousands of people who are over 18 years of age and single people, one at a time coming, have been sent back, sent home,\" Biden said March 25. \"We’re sending back the vast majority of the families that are coming. We are trying to work out now with Mexico their willingness to take more of those families back.\"", "Data reported by Customs and Border Protection shows that he’s right about adults coming alone — most encountered by Border Patrol agents are being expelled under a public health law invoked by the Trump administration and still in effect under Biden.", "But Biden’s claim about families facing the same outcome is wrong, according to the latest monthly data from U.S. Customs and Border Protection.", "February’s numbers are all we have so far on enforcement actions during Biden’s tenure. (Most of January’s data came during the Trump administration.) The numbers cover how many people were apprehended and placed into deportation proceedings as well as the number of people who were turned away under a public health law invoked last year.", "Border Patrol in February encountered close to 19,000 \"family unit aliens\" (this can include a child and at least one parent), and around 7,900 were expelled. So more than 11,000 — the majority — were let in and placed in immigration proceedings.", "The White House did not provide data that supports his claim. (March data is expected in early April.)", "\"Given that migration flows and Mexican capacity fluctuates, one month of statistics doesn’t reflect the full picture,\" said Vedant Patel, a White House spokesperson.", "The administration’s policy remains that families are expelled, and when expulsion is not possible due to Mexico’s inability to receive the families they are placed into U.S. immigration proceedings, Patel said.", "He also said that many families placed in immigration proceedings are ultimately deported when it’s determined that their case for asylum doesn’t have grounds.", "Even if the families let in eventually leave, \"it likely won’t occur for years given the extreme backlogs in immigration court that have long predated the Biden presidency,\" said Aaron Reichlin-Melnick, a policy counsel at the American Immigration Council.", "The situation at the border has been \"complicated and rapidly-changing,\" Reichlin-Melnick said. In January, more than half of families were expelled, but in February that stopped being the case, he said.", "Biden said, \"We’re sending back the vast majority of the families that are coming.\"", "Border Patrol data shows that in February the majority of families were not expelled, they were let in and placed in immigration proceedings. So far, February is the only full month of the Biden administration for which data is available.", "In January, more than half of families were expelled, but most of that period covered the Trump administration.", "Biden’s claim is inaccurate. We rate it False.", "C-SPAN, President Joe Biden’s press conference, March 25, 2021", "Email interview, Aaron Reichlin-Melnick, a policy counsel at the American Immigration Council, March 25, 2021", "Email interview, Vedant Patel, a White House spokesperson, March 25, 2021", "Email interview, CBP press office, March 25, 2021", "CBP.gov, Southwest border data", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]