["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rhode Island State House", "In the midst of a General Assembly hearing Feb. 23, Richard Ferruccio, the former president of the Rhode Island Brotherhood of Correctional Officers, took a minute to defend himself and the state’s prisons.", "When discussing House Bill 7420, which would raise penalties for residents who tamper with cellphone and radio towers, Rep. Edith Ajello voiced concerns.", "Ajello said she felt the new penalties were \"extreme.\"  Why raise the sentence to up to 10 years in prison when the facilities are already overcrowded? she asked.", "Ferruccio shot back.", "\"We do not have an overcrowding problem. As a matter of fact, Rhode Island has one of the lowest incarceration rates in the country,\" Ferruccio said. \"It is not the doom and gloom\"  that people think.", "Ferruccio’s sources — a Wikipedia page, an article from Governing Magazine, which cited data from the Bureau of Justice, and a WorldAtlas.com article — all backed up this part of his claim. Rhode Island has one of the lowest incarceration rates in the country.", "We also did our own research. The National Institute of Corrections, an agency housed within the U.S. Department of Justice, reports the incarceration rates in each state every year. Their most recent report from 2014 says Rhode Island has a rate of about 55 percent less than average with 178 people incarcerated per every 100,000. It is the second lowest, with Maine reporting 153 per every 100,000. The national average is 392 per 100,000.", "(However, the NCIC numbers also showed us that the Ocean State has a probation rate that is 91 percent higher than the national average, second only to Georgia.)", "Now, for the second part. Are the state’s prisons overcrowded?", "No, Ferruccio said, sending us an email claiming that the prisons are just 76-percent full. J.R. Ventura, a spokesman for the Department of Corrections, said that figure was off by less than 1 percent, mainly because Ferruccio failed to include female inmates. On average there are 136 women a day in the prisons.", "Including women, there were 3,060 inmates were in Rhode Island’s prisons on March 15, or 76.7-percent of capacity. Those rates have been falling in recent years from 83.6 percent in 2013 to 80.6 percent in 2014.", "Other state prison systems are operating way above capacity. In Colorado, prisons are at 115 percent of capacity. In Louisiana,  the average is 119 percent, according the federal government.", "But these are averages and in Rhode Island the medium and maximum-security units run  at about 93 percent capacity. So, is that \"crowded\"?", "\"Absolutely no, we are not overcrowded,\" Ventura said. \"There’s a lot of people in the Max and Medium facilities, but we are not overcrowded.\"", "Overcrowding was a significant problem in the state in the 1970s and a U.S. District Court judge ruled that the crowding was unconstitutional.  In a settlement called the Palmigiano agreement, the state agreed to limits for each facility. As long as the numbers don’t exceed those limits, the prisons are not overcrowded, Ventura said.", "\"Our numbers have remained steady and far below capacity since 2008. We are able to manage our daily operations safely and effectively.\" he said.", "OUR RULING:", "Ferruccio said Rhode Island has one of the lowest incarceration rates in the country. His numbers were spot on. Except for Maine, Rhode Island has the lowest incarceration rate. However, the state also has a very high probation rate, which he did not mention.", "He also said the prisons do not have an overcrowding problem. He is correct. The Department of Corrections confirmed that the prisons are not \"crowded\" by the Palmigiano standards.", "We rate this claim True", "NICIC.gov, \"Corrections Statistics by State\" accessed March 10, 2016.", "Interview, Richard Ferruccio, former president of the Rhode Island Brotherhood of Correctional Officers, March 3, 2016.", "Rhode Island State General Assembly Capitol TV, \"House Committee on Judiciary 2-23-2016\" 100:00 mark.", "Governing.com, \"Prison Populations and State Incarceration Rate Data\" accessed March 10, 2016.", "WorldAtlas.com, \"Highest Incarceration Rates By State\" accessed March 10, 2016.", "Wikipedia.com, \"List of U.S. states by incarceration rate\" accessed March 10, 2016.", "BJS.gov, \"Prisoners in 2014,\" accessed March 14, 2016.", "DOC.RI.GOV, \"Offender Statistics & Reports,\" accessed March 10, 2016.", "Interview, J.R. Ventura, Rhode Island Department of Corrections, March 15, 2016.", "Nicholas Palmigiano et al. v Bruce G. Sundlun et al. (1994)  \"Settlement Agreement,\" viewed March 15, 2016.", "State of Rhode Island General Assembly § 42-26-13, \"Title 42 State Affairs and Government,\" viewed March 15, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]