["“Indisputable photographic evidence that antifa violently broke into Congress today to inflict harm & do damage. NOT @realDonaldTrump supporters,” pro-Trump attorney Lin Wood wrote on January 6, 2021 in a tweet that included two images.", "“Do not be fooled. Trump supporters are peaceful. It was antifa that created the violence in our cities over the past several months,” said Wood, on a day when the president’s backers clashed with police in Washington.", "Wood’s account was subsequently suspended by Twitter.", "He also spread a video on social media site Parler that allegedly provided other evidence of Antifa involvement, but the man in the clip told AFP that he is in fact a supporter of the president.", "The Antifa claim appeared on Facebook here, here and here, on Instagram here and here and on Twitter here, here and here.", "The president’s supporters stormed a session of Congress held on January 6 to certify Joe Biden's victory in the 2020 election, which Trump repeatedly and falsely claimed was plagued by widespread fraud, including in a speech shortly before the breach of the Capitol.", "Lawmakers later reconvened and voted to formally certify Biden’s win. Facing mounting political pressure, Trump acknowledged on January 7, 2021 that his presidency was ending and promised a smooth transition to the Democratic administration.", "Since the November 3, 2020 presidential election, AFP Fact Check has debunked several of Trump’s false statements about the vote, including his premature declaration of victory and a press conference in which he made unfounded claims that the ballot was “rigged” against him.", "Antifa, short for anti-fascist, is a structureless movement that says it is dedicated to fighting fascism online and in public. It is a favored target of American conservatives, including Trump.", "The Federal Bureau of Investigation’s Washington Field Office said it has “no credible intelligence” on Antifa playing a role in criminal activity at the US Capitol.", "“At this time, we have no credible intelligence suggesting ANTIFA involvement in Wednesday’s criminal activity,” the office said in an email on January 11, 2021.", "“However, the investigation is ongoing and we are aggressively working to identify all individuals involved, no matter their association.”", "Washington’s Metropolitan Police Department agreed.", "“We do not have any information to suggest Antifa was behind the insurrection of the US Capitol,” a spokesperson said by email.", "The image on the left in Wood’s tweet shows a bearded man whom AFP photographed inside the US Capitol on January 6. His identity is unclear. The one on the right pictures a man with a similar appearance above a link to the phillyantifa.org blog, posts on which detail information about right-wing opponents.", "The blog does include the photo on the right, but not because the man is affiliated with Antifa.", "Rather, the image appears in a September 2018 post identifying him as Jason Tankersley, whom it describes as the “founder of Maryland Skinheads and a longtime neo-nazi who, in the past few years, has attempted to rehabilitate his image.”", "The caption of an undated photo on the Southern Poverty Law Center’s website meanwhile says Tankersley is “of the Maryland State Skinheads,” without mentioning a specific role in the group.", "Other posts claim a man in a horned fur hat, who was also photographed by AFP inside the Capitol building, had previously taken part in a Black Lives Matter protest, and linked him to Antifa.", "The man was described in the caption of this AFP photo from November 5, 2020 as presenting himself as a “shamanist and consultant for the Trump supporters” gathered in Phoenix, Arizona. The image shows him holding a sign that refers to the pro-Trump QAnon conspiracy theory.", "And this Associated Press photo caption gives his full name as Jake Angeli and says he is a Trump supporter who spoke at a rally in Phoenix on November 7.", "A video also circulated online alongside the claim that it shows a man admitting Antifa stormed the US Capitol.", "The claim -- which Wood helped spread on Parler, and which also appeared on Bitchute -- is false, and the man in the clip, who is a supporter of the president, said he received a flood of death threats.", "“I just got back from storming the Capitol. We stormed it, we were successful,” the man says in the video.", "He goes on to refer to involvement by Trump supporters, not Antifa.", "“For all you bitches on Facebook going crazy right now talking about it was Antifa fucking being infiltrating and that it wasn’t us -- it was us. We proudly took back our Capitol,” he says.", "The man in the video has been named on social media as hair stylist Kristopher Drew.", "Reached by phone, he said that he is not Antifa, that the original video he posted had been “cut up by people,” and that he did not enter the Capitol building.", "“I’m not a fucking Antifa, I’m a patriot,” he said.", "“I never went in the building, I was... outside, but I said ‘we’ stormed the Capitol, as like the group of people.”", "For him, the claim about the clip has turned into a nightmare.", "“People are threatening me, and trying to hurt me every chance they get,” he said. “People are sending me death threats every five minutes. I can’t take it.”", "Representative Matt Gaetz, a Florida Republican, spread the claim of Antifa involvement in the Capitol breach in remarks on January 6, 2021 in which he cited an article from The Washington Times as evidence.", "But the article now includes the following correction: “An earlier version of this story incorrectly stated that XRVision facial recognition software identified Antifa members among rioters who stormed the Capitol Wednesday. XRVision did not identify any Antifa members. The Washington Times apologizes to XRVision for the error.”", "AFP Fact Check has debunked a series of other false or misleading claims related to the 2020 election here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]