["About this rating", "In March 2016, President Obama made a trip to Cuba (becoming the first U.S. president to journey there since Calvin Coolidge in 1928) that marked an historic diplomatic development in American and Cuban history:", "The wheels of Air Force One touched down at Jose Marti International Airport for the first time ever at 4:19 p.m., kicking off a history-making presidential visit and breaking decades of tense relations with communist Cuba.", "It's the same single-runway airport the CIA once bombed in the 1960s, and whose broken-down Russian-built airplanes and colorful, antiquated terminals give testimony to the impact of 50 years of U.S. sanctions and diplomatic isolation.", "On 23 March 2016, the humor web site The Onion published the photograph and headline shown above, reporting that hundreds of Cuban citizens had clung to the outside of President Obama's plane as it departed from Havana in an attempt to flee their country.  Although most social media users are familiar with The Onion (and its genuinely satirical nature), multiple e-mails we received from readers and other social media posts indicated that not everyone got the joke.", "Social media users have often unwittingly shared fake news articles published by web sites that exist solely to traffic in outlandish false stories, but The Onion began in the pre-Internet days as a printed humor publication and evolved to become the premier online satirical web site (i.e., a site that aims to make readers laugh, not to be fooled).", "Despite its long tenure as a humor site, The Onion is still mistaken for a real news outlet on occasion. Before fake news sites invaded social media with their ubiquitous fabricated tales, users mistaking The Onion for real news inspired a popular blog that captured such errors.", "The Onion's item about Cuban refugees clinging to Air Force One consisted of a photograph and headline with no content, as did a previous (and similarly confusing) share from the site holding that SeaWorld houses orcas in large plastic bags while cleaning their tanks. A previous Onion article about a SeaWorld show that was \"Just Elephant Drowning in Large Tank of Water with No Explanation\" prompted a number of social media users to object to the imaginary described practice, as did another item about a teen whose parents intended to euthanize her because she was only \"capable of texting and rolling her eyes\".", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]