["The claim was published here on Facebook on March 1, 2020.", "The post, which has been shared more than 460 times, includes a photo of the District General Hospital in Negombo, a major city in western Sri Lanka.", "Below is a screenshot of the misleading Facebook post:", "The post’s Sinhala text translates to English as: “Four corona patients in Negombo hospital / Three Sri Lankans among them, / Although everyone is slowly forgetting, it is only now that this virus has started spreading in our country. It's better for everyone to be safe.”", "A similar claim was also made here, here, here and here on Facebook.", "The posts were published within days of South Korea and Italy, two countries with large Sri Lankan expat communities, reporting spikes in confirmed coronavirus cases.", "But the claim that four patients were hospitalised in Sri Lanka is misleading.", "Dr. Ashan Pathirana, Sri Lanka’s Health Promotion Bureau Registrar clarified that while two Sri Lankans who returned from Italy were recently hospitalised in Sri Lanka, neither tested positive for the coronavirus.", "“Two Sri Lankans who had returned home from Italy were hospitalised on Saturday with a cough and fever but they have both been tested negative as of last evening,” he told AFP during a phone conversation on March 2, 2020.", "Dr. Pathirana also urged Sri Lankans to refrain from sharing unverified information that may lead to the marginalisation of Sri Lankans who return home from South Korea or Italy.", "Sri Lanka’s only confirmed coronavirus was a Chinese national who fell ill in early January 2020. The individual left Sri Lanka on February 19, 2020 after making a full recovery.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]