["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The bill in question, A416, is not new. It was first introduced in 2015 during the Ebola outbreak and has not gained any traction in the New York State Assembly.", "It has no co-sponsors and has never once been heard by committee despite being introduced in the 2015-16, 2017-18, 2019-20 sessions, and the current session.", "A dormant, years-old bill in New York that would allow officials to detain contagious patients during a health emergency has reemerged amid the COVID-19 pandemic and has quickly become the subject of rapidly spreading conspiracy theories, some of which claim it’s a scheme by Gov. Andrew Cuomo to throw people in detainment camps.", "\"New York is trying to pass a bill that would allow them to round up non mask wearers and people who don’t want to take the vaccine into concentration camps,\" one popular post on Facebook reads. \"Then with a court order they can force vaccinate you.\"", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "This is wrong, and a faulty interpretation of the bill in question, A416.", "While the legislation may be applicable in the COVID-19 era, the bill has been dormant since it was drafted and proposed during the 2015 Ebola outbreak, before a vaccine for the disease was approved.", "The bill specifies that it applies to infected people and their contacts who refuse to quarantine in a health emergency.", "Like other evergreen bills that get introduced year after year with little regard, the legislation has never been heard by committee. It was introduced for the state's 2021-22 legislative session, but it was also introduced in the 2015-16, 2017-18 and 2019-20 sessions and has never had a co-sponsor.", "Assembly bill 416 was introduced by Assemblyman N. Nick Perry, D- Brooklyn, and is described as: \"An act to amend the public health law, in relation to the removal of cases, contacts and carriers of communicable diseases who are potentially dangerous to the public health.\"", "Frank Shea, Perry’s communications director, said the assemblyman proposed the legislation in 2015 after a nurse who worked closely with Ebola patients in Africa refused to quarantine upon returning to the United States. It was designed to be similar to existing laws that allow for the detainment of mental health patients who are deemed to be a danger to themselves or others.", "The bill says that during a health emergency, officials would have the authority to detain in a medical or \"other appropriate facility\" any infected persons and their contacts who are deemed a threat to the public. It also says that, if the detentions last longer than three business days, the state would need a court order.", "\"The assemblyman thought that we needed a mechanism for the government to say that we can’t have someone with this type of communicable disease who says ‘the hell with the rest of you’ and travels on our trains and buses and goes into our schools,\" Shea said.", "Its creation had nothing to do with the COVID-19 crisis, he added, and despite being reintroduced, Perry hasn’t pushed the bill or solicited sponsorships.", "Republican U.S. Rep. Lee Zeldin of Suffolk released a statement rebuking the bill on Jan. 3, and initially claimed that it was scheduled \"to be taken up by the New York State Assembly’s Health Committee on Wednesday, January 6, 2021.\"", "But that isn’t true. The Assembly has no committee hearings on its schedule that day, the first day of session.", "On Jan. 3 Politico reported that it received no reply from Zeldin’s office about where he got the information that the Health Committee was taking up the bill. Zeldin’s statement appears to have been amended shortly after to say that the bill will instead be \"referred\" to the committee that day.", "Cuomo’s office, meanwhile, says they weren’t aware of the bill until recently.", "\"No, the governor doesn’t want to open up concentration camps,\" Cuomo’s senior adviser, Rich Azzopardi, told PolitiFact. \"We didn’t even know this bill existed.\"", "Perry says he’s receiving threats over the bill and wrote in an emailed statement that he’s open to amendments that would address concerns raised by critics. In this statement, he urged a careful reading of the bill.", "\"There is no intent, no plan, or provisions in my bill to take away, or violate any rights, or liberties that all Americans are entitled to under our Constitution, either state or federal,\" the statement says. \"A proper reading of the bill would find that significant attention was paid to protect individual rights which could be affected by exercising the authority granted in this bill.\"", "Social media posts claim that New York officials are trying to pass a bill that would allow them to round up non-mask wearers and those who don’t want to get vaccinated into \"concentration camps\" to eventually force vaccinations for COVID-19.", "This is wrong. While the bill, A416, may be applicable in the COVID-19 era, it has sat dormant since it was introduced in 2015 during the Ebola outbreak and has not gained any traction in the New York State Assembly. The legislation specifies that it applies to infected people and their contacts who refuse to quarantine in a health emergency.", "The bill has no co-sponsors and has never once been heard by committee despite being introduced in the 2015-16, 2017-18, 2019-20 sessions, and the current session.", "We rate this False.", "Facebook post, Jan. 4, 2020", "NYSenate.gov, Assembly Bill A416, Accessed Jan. 4, 2021", "Phone/Email interview, Frank Shea Communications Coordinator Office of Assemblyman N. Nick Perry, Jan. 4, 2021", "CNN, Maine nurse won’t submit to Ebola quarantine, lawyer says, Oct. 29, 2014", "WKBW, Years-old bill that would allow state to detain contagious patients extremely unlikely to gain any traction in Albany, Jan. 4, 2021", "Politico, Long dormant Assembly bill becomes subject of conspiracy theories, Jan. 3, 2021", "World Health Organization, Ebola virus disease, Feb. 10, 2020", "Public Now, Rep. Zeldin Slams Proposed NYS Bill Granting Governor Authority To Detain New Yorkers For Being \"A Danger To Public Health\", Jan. 3, 2021", "Congressman Lee Zeldin, Rep. Zeldin Slams Proposed NYS Bill Granting Governor Authority to Detain New Yorkers For Being \"A Danger to Public Health\", Accessed Jan. 5, 2021", "Phone interview, Rich Azzopardi senior adviser for Gov. Andrew Cuomo, Jan. 5, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]