["Armed with spaghetti models and a Sharpie-doctored map, President Donald Trump defended his efforts to declare that once upon a time, Alabama was poised to face Hurricane Dorian’s wrath.", "He even went so far as to say that there was a 95% chance that Alabama was on the hurricane’s path.", "But Trump’s receipts don’t check out. This is the story of how the president mangled government models of the storm to blow the forecast way out of proportion and misinform Americans.", "The White House did not answer our questions", "But by the end of the day the White House issued a statement by Rear Admiral Peter J. Brown, Homeland Security and Counterterrorism Advisor, who defended Trump. Brown said that he shared with Trump the spaghetti models that showed possible storm impacts outside the official forecast cone and that forecasts showed the possibility of tropical storm force winds hitting Alabama.", "Over several days, Trump heard criticism from the media and meteorologists about his weekend warnings that even Alabama would \"get a piece of\" Dorian or \"will most likely be hit (much) harder than anticipated.\"", "So, as he briefed reporters on the latest updates Sept. 4, he asked acting Department of Homeland Security Secretary Kevin K. McAleenan to display a chart of the \"original\" forecast.", "#Sharpiegate was born: The hurricane’s cone had been extended in black ink to include a section of southeast Alabama, even though it didn’t match anything produced by the government’s hurricane forecasters.", "Speaking again to reporters Sept. 4, Trump said he \"didn’t know\" who altered the map. Trump also had this to say, alluding to yet another model that he thought would prove his point:", "\"I know that Alabama was in the original forecast. They thought it would get it as a piece of it. It was supposed to go — actually, we have a better map than that, which is going to be presented, where we had many lines going directly — many models — each line being a model.  And they were going directly through. And, in all cases, Alabama was hit — if not lightly, in some cases pretty hard. Georgia, Alabama — it was a different route. They actually gave that a 95% chance probability.\"", "Forecasters did not give Alabama a 95% chance of being hit, and the \"better map\" Trump shared hours later in a tweet also did not show most models hitting Alabama.", "Trump’s tweet showed an Aug. 28 model of spaghetti plots for the hurricane’s path appearing in countless jiggly lines aimed at the southeastern United States.", "\"This was the originally projected path of the Hurricane in its early stages. As you can see, almost all models predicted it to go through Florida also hitting Georgia and Alabama. I accept the Fake News apologies!\"", "This was the originally projected path of the Hurricane in its early stages. As you can see, almost all models predicted it to go through Florida also hitting Georgia and Alabama. I accept the Fake News apologies! pic.twitter.com/0uCT0Qvyo6", "The spaghetti plots show various models up to 10 days out and requires professional interpretation. The National Hurricane Center examines those models and then comes up with a five-day forecast.", "\"The 'spaghetti tracks' from the forecast model are useful for hurricane forecasters to consider,\" said Judith Curry, an atmospheric scientist and founder of the Climate Forecast Applications Network. \"But they are easily misinterpreted by the public.\"", "And apparently, the president.", "\"There was absolutely not ever a 95% chance that Alabama would get hit, let alone ‘pretty hard’ or ‘in all cases,’\" said Brian McNoldy, a tropical cyclone researcher at the University of Miami who has been critical of Trump’s statements about Hurricane Dorian and other topics.", "A spaghetti plot shows multiple computer models that predict a storm’s path up to 10 days. There are about 100 models from various sources including the government and private firms. Some meteorologists only pay attention to some of them. The key is not to pluck out a particular strand but to look for consensus and watch the trend over time.", "While the graphic Trump tweeted did show a few lines going through Alabama, McNoldy said the lines \"are not all equals and should not be interpreted as such.\"", "\"Even so, only a small handful were there, hardly a 95% chance or ‘in all cases,’ \" he said.", "The fine print of the graphic says \"If anything on this graphic causes confusion, ignore the entire product.\"", "As for Trump’s potentially Sharpied cone map, that also looks like a case of exaggerating one of many five-day forecasts.", "One map from Aug. 30 showed the outer edge of the five-day cone just barely nipping the southeast corner of Alabama. Most from around that time showed the cone centered over Florida and the southeast Atlantic coast.", "The edge of the cone represents a two-thirds probability of the center of the storm tracking within it, using average track errors from the previous five years, McNoldy said.", "By the weekend, there was growing consensus that Hurricane Dorian would turn north before it eventually reached Florida, Curry said.", "\"There was never a substantial probability of it reaching Alabama,\" she said.", "There was a period of time when the Gulf really was threatened in the extended range beyond five days, said Keith G. Blackwell and Andrew Murray, two University of South Alabama meteorologists.", "But the five-day forecasts from the National Hurricane Center focused on Florida and then the southeastern coast days before Trump started on Alabama. (Trump has since highlighted an Alabama National Guard warning on Twitter about the storm forecast. The view was not shared by the meteorologists we reached.)", "The National Oceanic and Atmospheric Administration’s advisory showing tropical storm force wind probabilities did show at certain points a chance that Alabama would face strong winds over the next few days. For example, a 2 p.m. Aug. 30 update showed anywhere from a 5 to 30% chance that Alabama would face winds at 39 miles per hour.", "Ultimately, there was a very small chance that Dorian could have reached Alabama, but Trump overstated what earlier predictions showed.", "\"In no way was Alabama a likely target, but there was a small chance that Dorian could have entered the Gulf of Mexico,\" Colorado State University atmospheric scientist Phil Klotzbach said. \"But, I think the key point is that NOAA never discussed that scenario, because it was likely at least one week out from when this guidance was available.\"", "Trump tweeted that originally \"almost all models predicted\" Dorian would hit Alabama.", "He linked to a spaghetti models map that showed various models through the next 10 days. While some of those models showed Dorian hitting Alabama, Trump has grossly overstated what it showed.", "The National Hurricane Center takes these models and then comes up with a five-day forecast. It’s ridiculous for him to use the models to conclude that it showed almost all predicted the storm would hit Alabama, which matches our definition of Pants on Fire.", "NBC, Why does Trump’s hurricane map look different than others? Sept. 4, 2019", "PolitiFact, Fact-checking Trump’s falsehoods about Hurricane Dorian, Updated Sept. 4, 2019", "Snopes, Did Trump Display an Altered Hurricane Dorian Map Showing Alabama in Its Path? Sept. 4, 2019", "President Donald Trump, Tweet, 10:51 a.m. Sept. 1, 2019", "White House, Remarks by President Trump After Marine One Arrival, 11:14 a.m. Sept. 1, 2019", "National Weather Service Birmingham, Tweet, 11:11 a.m. Sept. 1, 2019", "Broadcast Meteorologist James Spann, Tweet, 11:31 a.m. Sept. 1, 2019", "White House, Remarks by President Trump in Briefing on Hurricane Dorian, 12:31 pm. Sept. 1, 2019", "Fox News, President Trump attends FEMA briefing on Hurricane Dorian, Sept. 1, 2019", "President Donald Trump, Tweet, Sept. 2, 2019", "National Oceanic and Atmospheric Administration, Search hurricanes, Accessed Sept. 3, 2019", "National Oceanic and Atmospheric Administration, Hurricane Michael upgraded to a Category 5 at time of U.S. landfall, April 19, 2019", "National Oceanic and Atmospheric Administration, Extremely active 2017 Atlantic hurricane season finally ends, Nov. 30, 2019", "National Hurricane Center, Hurricane Irma Aug. 30-Sept. 12, 2019, June 30, 2018", "National Hurricane Center, Hurricane Maria Sept 16-30, 2017, Feb. 14, 2019", "National Weather Service, Hurricane Camille,", "CNN, Trump doesn't think he's 'ever even heard of a Category 5' hurricane. Four such storms have threatened the US since he took office, Sept. 2, 2019", "AP FACT CHECK: Trump’s bluster on hurricanes, guns, economy, Sept. 2, 2019", "Washington Post, Hurricane Dorian, one of the Atlantic’s most intense storms on record, baffles the president, Sept. 2, 2019", "CNN’s Daniel Dale, Tweet, Sept. 1, 2019", "White House, Remarks by President Trump at the White House Historical Association Reception, Sept. 14, 2017", "White House, Remarks by President Trump Before Meeting with Bipartisan Members of the House Committee on Ways and Means, Sept. 26, 2017", "White House, Remarks by President Trump in Briefing on Hurricane Maria Relief Efforts, Oct. 3, 2017", "Govinfo, Remarks in a Meeting With Governor Ricardo A. Rosselló Nevares of Puerto Rico and Federal Emergency Management Agency Administrator W. Brock Long To Discuss Hurricane Maria Relief Efforts and an Exchange With Reporters, Oct. 19, 2017", "Factbase, Speech: Donald Trump Holds a Political Rally in Panama City Beach, Florida - May 8, 2019", "ABC3340, Showers, Some Thunderstorms Over East Alabama, Sept. 1, 2019", "Tampa Bay Times, 3 reasons Hurricane Dorian has been so hard to forecast, Sept. 2, 2019", "National Weather Service Atlanta, Tweet, Sept. 1, 2019", "National Hurricane Center, Tweet, Sept. 1, 2019", "NOAA, Tropical storm form winds probabilities, Sept. 3, 2019", "NOAA, Statements to PolitiFact, Sept. 3, 2019", "Email interview, David Greenberg, professor of History and of Journalism & Media Studies at Rutgers University, Sept. 3, 2019", "Weather.com, Questionable Hurricane Forecast Map Used by President Trump, Sept. 5, 2019", "New York Times, Trump Insists He Was Right About Hurricane Dorian Heading for Alabama, Sept. 4, 2019", "White House, Remarks by President Trump at the Announcement of State Opioid Response Grants, Sept. 4, 2019", "Tampa Bay Times, Trump unleashed a Twitter storm as Dorian blew past Florida, Sept. 5, 2019", "President Donald Trump, Tweet, Sept. 5, 2019", "Email interview, Judith Curry, Georgia Institute of Technology School of Earth and Atmospheric Sciences, professor emeritus, Sept. 4, 2019", "Email interview, Phil Klotzbach, research scientist at the Department of Atmospheric Science at Colorado State University, Sept. 4, 2019", "Email and telephone interview Brian McNoldy, Senior Research Associate University of Miami Rosenstiel School of Marine & Atmospheric Science, Sept. 5, 2019", "Email interview,  Keith G. Blackwell, Associate Professor Emeritus of Meteorology  University of South Alabama and Andrew Murray, Senior Instructor in Meteorology, Meteorology Program, Department of Earth Sciences Coastal Weather Research Center University of South Alabama, Sept. 5, 2019", "Telephone interview, Greg Robinson, Alabama Emergency Management Agency spokesman, Sept. 5, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]