["By Angelo Fichera", "Posted on January 16, 2019", "A viral meme attributes a bogus quote to Clemson University’s quarterback about his team’s visit to the White House.", "President Donald Trump hosted the Clemson University football team at the White House this week to celebrate the Tigers winning the college football national championship.", "The Tigers were treated to a smorgasbord of fast food from McDonald’s, Burger King, Wendy’s and Domino’s — a spread that Trump, who personally paid for the dinner amid the government shutdown, called “great American food.” Not everyone agreed.", "For his part, though, Clemson quarterback Trevor Lawrence said on Twitter that the trip to the White House was “awesome!”", "But Lawrence also took to social media to make clear that he never said a quote attributed to him in a now viral meme.", "“President Trump got all our favorite foods, it was the best meal we ever had. Then we go and see the coastal elite media trashing it for not being organic vegan,” the bogus quote reads. “We’re football players, not bloggers. This was a perfect blue collar party.”", "Using his verified Twitter account, Lawrence reshared a now-deleted tweet of the meme and added: “I never said this by the way… I don’t know where it came from.”", "I never said this by the way… I don’t know where it came from.", "However the trip to the White House was awesome! https://t.co/dhYzZpSNUD", "— Trevor Lawrence (@Trevorlawrencee) January 15, 2019", "The university’s assistant athletic director for football communications, Ross Taylor, confirmed in an email to FactCheck.org that “Trevor did not say the quote.”", "The Twitter user who shared the meme that Lawrence responded to later conceded the quote was false. “I made a mistake,” the user tweeted. “Someone sent me the meme. I didn’t fact check. That’s on me.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Lawrence, Trevor (@Trevorlawrencee). “I never said this by the way… I don’t know where it came from. However the trip to the White House was awesome!” Twitter. 15 Jan 2019.", "“Remarks by President Trump Welcoming the 2018 College Football Playoff National Champion Clemson Tigers to the White House.” WhiteHouse.gov. 15 Jan 2019.", "Taylor, Ross. Assistant athletic director for football communications, Clemson University. Email sent to FactCheck.org. 16 Jan 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]