["By Saranac Hale Spencer", "Posted on January 30, 2018", "Q: Did Dolly Parton say, “Trump in one year is already better than 16 years of Bush, Obama put together?”", "A: No. A public relations consultant said that on a Breitbart radio show.", "Brett Decker, a consultant at a Washington D.C. public relations firm, favorably compared President Donald Trump’s first year in office with the accomplishments of the last two presidents during an interview on a Breitbart radio show.", "“Trump in one year is already better than 16 years of those guys put together,” he said, referring to Presidents George W. Bush and Barack Obama.", "That was on Jan. 5. By the end of the month, that quote had been attributed to country music singer Dolly Parton by a dozen dubious websites and shared more than 17,000 times on Facebook. Users of the social media site rightly flagged it as suspicious.", "The same quote was also falsely attributed to the actress Michelle Pfeiffer.", "Many of the stories about Parton claimed that she is liberal and had supported Hillary Clinton in the past — but Parton doesn’t share her political views publicly.", "To make that claim, the websites copied a section from a story that was posted on a website called American News, which had taken her actual comments about Hillary Clinton during the 2016 campaign out of context.", "During an Aug. 26, 2016 interview on CNN, Parton was asked about her song “9 to 5” and said, “That (song) was about equal pay for equal work. And we’ve come a long way, but we’re still talking about it.”", "She later said: “We’re doing good. We got a woman that could go in the White House, so we’ve certainly come a long way in that respect.”", "However, she didn’t say which candidate she preferred. “I don’t know where they’re going to land, but I think they’re both nuts,” she said. The American News story selectively quoted Parton as saying Clinton is “nuts.”", "Parton has often tried to stay apolitical. On “Fox and Friends” in October, Parton described herself this way: “Everybody knows I don’t do politics — because my mother was a Democrat and my daddy was a Republican, so I’m a hypocrat.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "Sources", "Decker, Brett. “Breitbart News Tonight.” 5 Jan 2018.", "“Singer Dolly Parton: “Trump In One Year Is Already Better Than 16 Years’ of Bush, Obama ‘Put Together’, This Stupid Liberals Doing Everything To Impeach Him But We Standing With Trump now And Forever. Do You Support Her?” Conservative-club.com. 25 Jan 2018.", "King, Alexandra. “Dolly Parton on 2016 candidates: ‘I think they’re both nuts.'” CNN. 26 Aug 2016.", "“Dolly Parton on Donald Trump, New Tour and ‘Simple’ Music.” Rolling Stone. 10 Mar 2016.", "“Dolly Parton on Emmys Trump-Bashing by Fonda, Tomlin: ‘I Don’t Do Politics.'” Fox & Friends. 16 Oct 2017.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]