["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate former Vice President Joe Biden speaks during a community event, Tuesday, Aug. 20, 2019, in Prole, Iowa. (AP)", "Joe Biden said that President Donald Trump has failed to condemn racist leaders like David Duke, a former Ku Klux Klan leader, and white nationalist Richard Spencer.", "In a speech in Iowa Aug. 20, Biden said:", "\"David Duke, head of the Ku Klux Klan, former head of the Klan. When that group came out of the woods, the fields, carrying those torches he said, ‘That’s why we voted for Donald Trump.’ He said he would take the country back. The white nationalist, Richard Spencer, he hailed Trump. He said, ‘This is the white nationalism we have been looking for.’ Did you hear him condemn either one of those people? Ever utter a word of condemnation?\"", "Biden didn’t answer his own question, but he was clearly stating Trump hasn’t condemned either racist leader.", "Biden accurately quoted Duke’s comments about Trump, and Spencer did hail Trump.", "But Biden exaggerates when he says Trump hasn’t condemned Duke at all.", "Trump’s condemnation of Duke goes back decades, though sometimes Trump has been more forceful than other times. Trump has also criticized demonstrations in which Spencer participated. But then Trump also said that there were \"very fine people, on both sides\" at the Charlottesville, Va., march.", "In 2016, we fact-checked a claim that \"Trump refuses to denounce the KKK.\" We rated the statement Mostly False.", "The ad distorted Trump’s record by cherry picking one interview in which CNN’s Jake Tapper asked Trump about Duke in February 2016. Duke founded a Louisiana chapter of the KKK in 1974, but left in 1980 because of its tendency towards violence. Since then, Duke has been a noted white supremacist.", "Tapper asked Trump if he would condemn Duke and say that he didn’t want the vote of white supremacists.", "Trump replied: \"Well, I have to look at the group. I mean, I don't know what group you're talking about. You wouldn't want me to condemn a group that I know nothing about. I would have to look. If you would send me a list of the groups, I will do research on them. And, certainly, I would disavow if I thought there was something wrong.\"", "Trump later blamed a bad ear piece, saying he could barely hear the questions. In the days that followed, Trump rejected Duke’s support in interviews on Good Morning America and Morning Joe, calling him a \"bad person who I disavowed on numerous occasions over the years.\"", "The Biden campaign pointed to that interview when we asked them for evidence to support Biden’s claim. The campaign also referred us to instances when Trump denied knowing anything about Duke or gave testy disavowals.", "We found Trump denounced Duke years before his interview with Tapper.", "In 1991, CNN’s Larry King asked Trump what Duke’s success with white voters in a failed bid for the Louisiana governorship represented.", "Trump replied: \"I hate seeing what it represents, but I guess it just shows there's a lot of hostility in this country. There's a tremendous amount of hostility in the United States.\"", "In 2000, Trump declined to run a Reform Party presidential bid in part because the party attracted Duke’s support. Trump also called Duke \"a bigot, a racist, a problem.\"", "During his 2016 bid, Trump disavowed Duke, but it was not as strongly worded as some of his earlier rebukes.", "In 2015, when asked about a quasi-endorsement by Duke, Trump replied that he wouldn’t want his endorsement. Asked if he would repudiate Duke, he replied: \"Sure, I would do that, if it made you feel better. I don’t know anything about him. Somebody told me yesterday, whoever he is, he did endorse me. Actually I don’t think it was an endorsement. He said I was absolutely the best of all of the candidates.\"", "In 2016, when asked about Duke’s endorsement of him, Trump said he wasn’t aware of it.", "\"I didn’t even know he endorsed me,\" he said. \"David Duke endorsed me? Okay, all right. I disavow, okay?\"", "Sometimes Trump sounded exasperated by the question.", "\"I totally disavow the Klu Klux Klan,\" he said in a debate. \"I totally disavow David Duke. I’ve been doing it now for two weeks, ... you’re probably about the 18th person that’s asked me the question.\"", "We didn’t find any instance when Trump was asked to denounce Spencer by name. But Trump has criticized events where Spencer, the head of a white-identity think tank, played a key role.", "In November 2016, a New York Times journalist asked Trump about a recent conference in Washington D.C. of people who pledged allegiance to Nazism. Trump said, \"Of course I condemn. I disavow and condemn.\"", "At the conference, Spencer saluted supporters with, \"Hail Trump.\"", "Spencer was one of the leaders behind the Unite the Right rally in Charlottesville, Va., in August 2017 where a white supremacist rammed a car into a counterprotester, killing her.", "Trump’s statement on Aug. 12, 2017, cast blame on \"many sides\", detracting from his overall message condemning bigotry.", "\"We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides,\" he said. \"It's been going on for a long time in our country.\"", "In the following days, Trump condemned bigotry and neo-Nazis and white nationalists. But in the same breath he also told reporters, \"You also had people that were very fine people, on both sides.\"", "In other instances, Trump has condemned hate groups or racism without singling out any racist leader.", "Following the mass shooting in El Paso, Trump condemned the shooter, who he said posted a manifesto \"consumed by racist hate.\"", "Biden said Trump hasn’t condemned Duke and Spencer. That’s an exaggeration.", "Trump didn’t condemn Duke when asked about him in an interview with Tapper on CNN in 2016. But decades before, he had clearly condemned the former KKK leader -- and he did so after the Tapper interview, too. Some of his disavowals have been brief.", "We can’t find an example of Trump condemning Spencer by name or being asked to do so, but he has criticized gatherings where Spencer, a white nationalist, played a major role, including Charlottesville.", "But Trump has at times detracted from his own denunciation of racism. Most notably, Trump said there were \"very fine people, on both sides\" at the Charlottesville march. At other times his denunciations have seemed reluctantly made. But he has made them.", "We rate this statement Mostly False.", "Joe Biden, Iowa speech, Aug. 20, 2019", "Vox, \"Why we voted for Donald Trump\": David Duke explains the white supremacist Charlottesville protests, Aug. 12, 2017", "The Atlantic, His Kampf, June 2017", "The Atlantic, 'Hail Trump!': White Nationalists Salute the President-Elect, Nov. 21, 2016", "Donald Trump, Press conference, Feb. 26, 2016", "Donald Trump, Tweet, Feb. 28, 2018", "CNN State of the Union, Transcript, Feb. 28, 2016", "CNN, Donald Trump stumbles on David Duke, KKK, Feb. 29, 2016", "NBC’s Today Show, Donald Trump, Feb. 29, 2016", "Good Morning America, \"Donald Trump Speaks Out on the KKK, Super Tuesday,\" March 1, 2016", "MSNBC Morning Joe, Donald Trump, March 3, 2016", "Real Clear Politics, Trump: Of Course I Denounce White Supremacists; Nobody Has Done More For Equality As I Have, March 1, 2016", "Washington Post The Fix, The Fox News GOP debate transcript, annotated, March 3, 2016", "CBS Face the Nation, Transcript, March 6, 2016", "NBC Meet the Press, Donald Trump, July 24, 2016", "New York Times reporter Julie Davis, Tweet, Nov. 22, 2016", "White House, Statement by President Trump, Aug. 14, 2017", "White House, Remarks by President Trump on Infrastructure, Aug. 15, 2017", "White House, Remarks by President Trump on the Mass Shootings in Texas and Ohio, Aug. 5, 2019", "White House, Remarks by President Trump Before Marine One Departure, Aug. 7, 2019", "NBC, \"Donald Trump Says He Will Not Run for President in 2000,\" Feb. 14, 2000", "Donald J. Trump Presidential Exploratory Committee, \"Statement of Donald J. Trump,\" Feb. 14, 2000", "Bloomberg, \"Donald Trump: The Full 'With All Due Respect' Interview,\" August 27, 2015", "PolitiFact, Pro-Rubio super PAC ad tying Trump to KKK misses the mark, March 9, 2016", "PolitiFact, \"Donald Trump's absurd claim that he knows nothing about former KKK leader David Duke,\" March 2, 2016", "PolitiFact, In Context: Donald Trump’s ‘very fine people on both sides’ remarks (transcript), April 26, 2019", "PolitiFact, In Context: President Donald Trump’s statement on ‘many sides’ in Charlottesville, Va., Aug. 14, 2017", "PolitiFact, Are there white nationalists in the White House? Aug. 15, 2017", "Email interview, Andrew Bates, Joe Biden campaign spokesman, Aug. 22, 2019", "Email interview, Zach Parkinson, Donald Trump campaign spokesman, Aug. 22, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]