["About this rating", "A video supposedly showing a man catching a stranger's cellphone mid-air while riding on a roller coaster went viral on social media on Sept. 4, 2019:", "The video racked up more than 1.5 million views within two days of its initial posting. While many marveled at the skill (or luck) portrayed in this footage, others were skeptical. Was the internet being duped by another doctored piece of media?", "The video was taken on the Shambhala ride at the Port Aventura amusement park in Spain. YouTube user SirSammy 15 of New Zealand shared the footage with the following description:", "I caught a strangers phone in mid air on a roller coaster!", "I was in Spain at Port Aventura on shambhala ride and saw the person a few rows ahead drop their IPhone X. long story short I caught it. this roller coaster is moving at over 130kms ... was once Europe’s tallest and fastest coaster ... only recently beaten.", "Some of the roller coasters at Port Aventura are equipped with video cameras to capture the reactions of these thrill-seekers. This footage is then available for purchase at the end of the ride as a take-home souvenir. The Shambhala, the tallest in PortAventura Park, is one such \"videoride.\"", "After the video above went viral, the New Zealand Herald contacted SirSammy 15 (real name Samuel Kempf) for more information about the incident. Kempf said the person who dropped the phone gave him a big hug. And, as a thank you, the phone's owner purchased the above-displayed footage from Port Aventura as a souvenir:", "\"He couldn't believe it, he gave me a big hug,\" Kempf told Stuff.", "\"The funniest reaction was when we had got off the rollercoaster and you go down to look at the photos and videos they take and half the people there seemed to be watching our screen and then everyone started cheering and clapping when it happened.\"", "The owner of the phone bought the video as a thank you to the Kiwi.", "While SirSammy's roller coaster phone catch may seem miraculous, it isn't unprecedented. Our search for similar footage turned up two videos from the exact same roller coaster. The first, taken in 2013, shows a man catching a set of keys while riding this roller coaster:", "The other, also from 2013, shows someone catching a phone:", "We reached out to Port Aventura to see how often items are dropped — and caught — on the Shambhala ride, and we will update this article when more information becomes available. This may not happen more often than usual on the Shambhala, but because it is a \"videoride,\" more evidence may exist of these roller-coaster catches.", "New Zealand Herald.   \"Kiwi Man Catches Flying Phone on Rollercoaster.\"  \r\n  5 September 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]