["About this rating", "The strange story of Pan Am Flight 914 is frequently shared by UFO blogs and conspiracy-minded websites as if it has been stumping the experts for decades. This \"unsolved\" event reportedly involves a plane that took off from New York in 1955 with 57 passengers, disappeared for 37 years, then reappeared and landed in Miami as if nothing had happened.", "Various solutions have been offered to explain the riddle of Pan Am Flight 914, the most popular of which is that this plane flew through some sort of time-travel portal. The actual explanation is a bit more mundane: The saga of Pan Am Flight 914 is a work of fiction that originated with Weekly World News, a notorious tabloid that operated between 1979 and 2007 (the tabloid would later relaunch as an online-only publication).", "In June 2019, the YouTube page \"Bright Side\" renewed interest in this \"mystery\" with a viral video that has garnered more than 5 million views:", "The first seven minutes of this nine-minute video deal with the mystery supposedly surrounding the saga of Pan Am Flight 914. It isn't until minute seven that Bright Side mentions the possibility that this story could be a work of fiction. Judging by the influx in queries we received about this topic at the end of June 2019, we're guessing many viewers didn't watch the entire film.", "The story of Pan Am Flight 914 does not begin at a New York airport in 1955. It actually starts with an article published in Weekly World News three decades later:", "Weekly World News was an infamous tabloid known for publishing fantastically fictitious stories, such as this bit about a time traveler getting busted for insider trading, this story about a man suing himself after hitting himself with a boomerang, and these doctored images of \"giant\" skeletons. In other words, Weekly World News isn't exactly a reputable source of news.", "Weekly World News republished this story at least two more times, once in 1993 and again in 1999. Curiously, the publication used two different photographs of two different men as if they showed \"eye-witness\" air-traffic controller Juan de la Corte:", "Similar to today's misinformation purveyors, Weekly World News had the habit of using unrelated photographs to illustrate their stories. The image of the plane in this article, for instance, does not show Pan Am Flight 914 landing in Miami after 37 years. This is actually a stock photograph available via Alamy, which lists the plane as a DC-4:", "Lastly, we searched through newspaper archives for any contemporary articles relating to the disappearance of a plane. Unsurprisingly, we were unable to locate any credible news accounts about the disappearance of Pan Am Flight 914.", "Fans of the science-fiction TV series \"Twilight Zone\" may have experienced some déjà vu while reading this story. While the fictional story of Pan Am Flight 914 originated with the tabloid Weekly World News, it is reminiscent of a 1961 episode of the sci-fi show entitled \"The Odyssey Of Flight 33.\"", "Handlen, Zack.   \"The Twilight Zone: 'Twenty-Two'/'The Odyssey of Flight 33.'\"     The A.V. Club.   7 April 2012.", "Weekly World News.   \"Twilight Zone: Riddle of Flight 914.\"     May 1993.", "Weekly World News.   \"Twilight Zone: Riddle of Flight 914.\"     7 September 1999.", "Clontz, Derek.   \"Riddle of Flight 914.\"     Weekly World News.   7 May 1985.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]