["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "We’re marking two special days this week -- Labor Day and Patriot Day, the official name given to the day of mourning that marks the Sept. 11, 2001 terrorist attacks.", "The two days -- and Republican presidential contender Scott Walker -- converged in a meme going around Facebook that one of our readers saw and asked us to check out.", "In it, a picture of Walker is accompanied by this quote: \"Labor Unions don’t deserve to have a national holiday. They’ve done more damage to our economy than any recession ever did. Labor Day should be replaced by Patriots Day, celebrated every year on 9/11.\"", "The meme indicates Walker said this on Sept. 5, 2015.", "Only he didn’t.", "To be sure, Walker is no fan of organized labor, but there is no evidence he made such a statement. To the contrary, a closer look shows the meme was created by a group that mocks conservatives called \"Stop the World, the Teabaggers Want Off.\"", "Dig even deeper and you find a disclaimer that says the site is meant to be satire.", "They’re old pros at creating this kind of stuff -- and having readers unwittingly pass it around as if it is the truth. This Walker-focused meme has been shared some 2,800 times on Facebook.", "The \"Stop the World\" site is not new to PolitiFact readers. Our partners in other states have reviewed other fake statements involving GOP presidential contenders.", "Marco Rubio: PolitiFact Florida looked at a quote attributed to U.S. Sen. Marco Rubio of Florida: \"No, felons should not have their voting rights restored even after they have served their sentence.\"", "There was no evidence that Rubio had actually said the words attributed to him, although he has been critical about felons regaining voting rights. The claim was rated False.", "Ted Cruz: PolitiFact Texas looked at a meme that claimed U.S. Ted Cruz said this: \"While there may have been an age difference, Josh Duggar’s transgressions are far less an affront to God than what gays do to each other.\"", "Duggar, a reality TV star, resigned from the conservative Family Research Council after reports that he had sexually assaulted several girls, including two of his sisters, when he was 14.", "PolitiFact Texas rated the claim that Cruz had made the comment Pants on Fire.", "The myth-busting site Snopes has looked at a number of other outlandish fake quotes attributed to conservatives, including Sarah Palin, \"Duck Dynasty\" star Phil Robertson and former GOP presidential candidate Mitt Romney. All were made up.", "(Snopes has declared the Walker meme false.)", "Indeed, the group got more than the alleged Walker quote wrong. It also mixed up Patriot’s Day (April 19), which marks the first battles of the Revolutionary War, with Patriot Day, which is Sept. 11 -- the day of the terrorist attacks on the United States.", "Our rating", "A Facebook meme attributed a fake quote to Gov. Scott Walker saying Labor Day should be replaced by Patriots Day. Walker never said such a thing, and this site has a track record of falsely attributing statements to conservatives.", "We rate the claim Pants on Fire.", "Facebook page, Stop the World, the Teabaggers Want Off", "PolitiFact.com, \"‘Teabagger’ group makes splash with fake-quote memes,\" May 28, 2015", "PolitiFact Wisconsin, \"Occupy Democrats group says Wisconsin is ‘dead broke’ due to actions by Walker, GOP,\" July 6, 2015", "Snopes.com", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]