["After a pro-Trump mob stormed the U.S. Capitol on Jan. 6, posts began circulating online claiming that “The Simpsons” predicted the event.", "A viral Facebook post includes an image of the show’s Groundskeeper Willie character standing on the ledge of a building that looks similar to the Capitol. The image is shown next to a photo of Jake Angeli, the bare-chested QAnon-supporting man who was briefly seen on the Senate dais during the Capitol siege.", "Both Angeli and Groundskeeper Willie are dressed in a fur, horned hat, have a painted face, and tattoos in the post. Angeli has been a fixture at Arizona right-wing political rallies over the past year, the Arizona Republic reported.", "“The simpsons win again,” the caption reads.", "The post has been shared 22,000 times. USA TODAY has reached out to the poster for comment.", "Fact check:Video shows Trump family in tent before Jan. 6 rally", "Antonia Coffman, an executive consultant for \"The Simpsons,\" confirmed that the viral image of Groundskeeper Willie is not from the show.", "“The internet created the image and things circulated from there,” Coffman said in a statement.", "A Google image search of Groundskeeper Willie showed a similar photo of the character in the same stance, but he was not wearing a fur, horned hat, painted face or tattoos in the original image.", "Snopes, PolitiFact, and Reuters have also debunked the claim.", "Fact check:Face-painted Capitol Building trespasser in horns is a known QAnon supporter", "The claim that “The Simpsons” predicted the Capitol riot on Jan. 6 is FALSE, based on our research. An executive consultant for the show confirmed that the image of Groundskeeper Willie is fake.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more."]