["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sen. Tom Cotton, R-Ark., right, walks in the capitol complex on Sept. 24, 2018. (AP/Alex Brandon)", "A criminal justice bill with support from bipartisan lawmakers as well as President Donald Trump has sparked a round-robin Twitter dispute among senators.", "It began with a Nov. 16 report in the New York Times that Senate Majority Leader Mitch McConnell, R-Ky., had privately told Trump that he was not planning to bring up the bill, known as the First Step Act, in his chamber before the end of the year.", "The following day, Sen. Amy Klobuchar tweeted out the story, highlighting a comment in the article by Sen. Tom Cotton, R-Ark., one of the bill’s leading Republican opponents.", "\"Mr. Cotton (perhaps loudest critic of sentencing changes) urged colleagues to slow down, saying that the bill’s implications were too expansive to push through without hearings\" REALLY? We’ve had multiple hearings. Time for action. Pass #FirstStepAct\"", "“Mr. Cotton (perhaps loudest critic of sentencing changes) urged colleagues to slow down, saying that the bill’s implications were too expansive to push through without hearings” REALLY? We’ve had multiple hearings. Time for action. Pass #FirstStepAct https://t.co/kzZ9nyBfRR", "Later that day, Cotton replied to Klobuchar, tweeting, \"There have been no hearings on this bill. Why are proponents afraid of hearings & letting members find out what’s in it?\"", "There have been no hearings on this bill. Why are proponents afraid of hearings & letting members find out what’s in it? Maybe because it gives early release to “low level, nonviolent” criminals like those convicted of assaulting police, even with deadly weapons (USC 111(a))... https://t.co/lQnYGfF1o0", "Two days later, Sen. Mike Lee, R-Utah, took to Twitter to brush back his fellow Republican.", "\"I highly respect my colleague from Arkansas but everything in his tweet and this thread is 100% Fake News. … First, the House Judiciary committee passed the First Step Act out of committee on May 9 of this year, and the Senate Judiciary Committee passed the highly similar Sentencing and Corrections Act out of committee on Feb 15 of this year. These are not new policies.\"", "I highly respect my colleague from Arkansas but everything in his tweet and this thread is 100% Fake News. 1/ https://t.co/fFeHMxLpBf", "With three senators mixing it up on Twitter, we decided it was time for PolitiFact to step in. Was Cotton correct that the criminal justice bill has had \"no hearings\"? We found some significant shortcomings in Cotton’s argument.", "The specific bill under consideration in the Senate is the First Step Act. It was introduced on Nov. 15 by Sens. Charles Grassley, R-Iowa, and Dick Durbin, D-Ill.", "The bill seeks to reduce mandatory sentencing. The current version includes additional anti-recidivism funding, an expansion of early-release credits, a lowering of mandatory minimum sentences for non-violent drug offenses, and bans on shackling pregnant inmates and solitary confinement for juvenile offenders.", "The Nov. 15 version is based on a bill passed by the House on May 22. Some aspects of a separate bill were included in the Nov. 15 version -- a bill approved by the Senate Judiciary Committee, which Grassley chairs, on Feb. 15. That bill, the Sentencing Reform and Corrections Act, covers similar topics as the House bill.", "The current version of the bill was only released a day or two before the dispute erupted on Twitter. But for Cotton to say there have been no hearings is substantially misleading.", "For starters, the underlying House bill received a markup -- a type of hearing that concludes in a vote to advance or hold back the bill -- on May 9, 2018. The bill, as amended by the committee at the markup, advanced on a 25-5 vote.", "Then, on May 22, the bill went to the House floor under a \"suspension of the rules.\" This means that it would receive a vote following more-limited-than-usual debate, with two-thirds of the vote required for passage. After 40 minutes of floor debate, a vote was held. The measure exceeded the two-thirds margin, winning passage, 360-59.", "As for the Senate bill that was folded into the House version, it was considered in a markup by the Senate Judiciary Committee on Feb. 15, 2018. The committee advanced the measure by a 16-5 vote.", "Moreover, it’s not as if the substance of these bills emerged from nowhere.", "\"Both the House and Senate have considered and debated criminal justice reform for more than five years,\" said Conn Carroll, communications director for Lee. \"There’s nothing novel or surprising in this legislation, and the robust debate on the bill shows that everyone understands how it’s supposed to work.\"", "For instance, a House Judiciary Committee task force held a hearing on criminal sentencing in 2014, and the Senate Judiciary Committee held a similar hearing in 2015 on a previous version of the bill.", "In releasing the bill on Nov. 15, Grassley said that \"many of us on this committee have worked closely together for several years on this issue to reduce crime and improve fairness in sentencing.\"", "James Arnold, a spokesman for Cotton, said a markup is not a substitute for a hearing, particularly for a bill that he called \"the largest change to the federal criminal system in years, perhaps decades.\"", "\"A hearing is a forum in which the committee gathers testimony, information, and opinions from experts on a proposed bill, while a markup is a process where committees debate and rewrite the legislation to correct the errors identified in the hearing,\" Arnold said. \"Even if a markup was a hearing, there has been no markup on the substantially different version of the FIRST STEP Act that was introduced late the Friday before Thanksgiving.\"", "Carroll, the aide to Lee, countered, \"There have been very minor changes to the House bill and only select sentencing-related elements of the (existing Senate bill) have been added.\"", "Something else Cotton sidestepped: The path of the criminal justice bill is standard operating procedure for how bills work in Congress.", "Experts said it is common for bills to wend their way slowly toward consideration on the floor. There is not generally a final \"hearing\" once the final language in a bill is hammered out -- but there is floor debate, which would still happen if the criminal justice bill is brought up.", "\"Few important measures proceed to passage on the Senate floor without long debate and consideration of amendments,\" said Steve Smith, a Senate specialist at Washington University in St. Louis. In many cases, he said, a final bill may include pieces of several different bills that individually had hearings at various committees.  \"Moreover, bills are mere receptacles for legislative provisions, so even hearings on a specific bill number is not a very meaningful indicator that relevant hearings were held.\"", "Gregory Koger, a Senate specialist at the University of Miami, agreed.", "\"It is not common to hold a new hearing every time the text of a bill changes, and it is extremely common for bills to be modified between the committee and House or Senate floor as a broader range of legislators weigh in,\" Koger said. \"Holding hearings in every such case would be a waste of time, as the debate on the floor prior to passage provides the ultimate ‘hearing.’\"", "Cotton said that \"there have been no hearings\" on a criminal justice bill being considered in the Senate.", "Cotton’s point is misleading. He ignored years of congressional debate and hearings on the general topics of the bill, as well as the consideration and bipartisan passage of largely similar bills at the House committee level, by the full House, and by the Senate Judiciary Committee. Multiple hearings were held on earlier versions of the current bill in previous congresses. In addition, the bill which would undergo floor debate if it were to be cleared for a vote.", "We rate the statement Mostly False.", "UPDATED, Nov. 21, 2018, 10 a.m.: This story has been updated to include a comment from Cotton's office. The rating remains the same.", "Tom Cotton, tweet, Nov. 16, 2018", "Amy Klobuchar, tweet, Nov. 16, 2018", "Mike Lee, tweet, Nov. 18, 2018", "Text of the First Step Act, Nov. 15, 2018", "Congress.gov, main page for H.R. 5682 - First Step Act, accessed Nov. 20, 2018", "Congress.gov, main page for S.2123 - Sentencing Reform and Corrections Act of 2015, accessed Nov. 20, 2018", "House roll call vote on H.R. 5682", "C-SPAN, hearing on the federal criminal code, May 30, 2014", "Charles Grassley, \"Grassley Statement at a Judiciary Committee Hearing on the Sentencing Reform and Corrections Act of 2015,\" Oct. 19, 2015", "Senate Judiciary Committee, \"Grassley Discusses Criminal Justice Reform and Executive,\" Nov. 15, 2018", "New York Times, \"McConnell Tells Trump a Criminal Justice Bill Is Not Likely This Year,\" Nov. 16, 2018", "USA Today, \"Tom Cotton: Lame-duck Congress' rush for criminal justice reform plan will hurt, not help,\" Nov. 15, 2018", "CNN, \"Rebuffing Sessions, senators advance criminal justice reform bill,\" Feb. 15, 2018", "Email interview with Steve Smith, political scientist at Washington University in St. Louis, Nov. 20, 2018", "Email interview with  Gregory Koger, political scientist at the University of Miami, Nov. 20, 2018", "Email interview with Conn Carroll, communications director for Mike Lee, Nov. 20, 2018", "Email interview with James Anold, spokesman for Tom Cotton, Nov. 21, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]