["A viral photo that shows a Starbucks with President Donald Trump’s photograph on the floor for customers to step on as they order their Venti Caffè Mochas is a fake image designed to give viewers a jolt.", "\"Starbucks just placed Trump’s photo on floor so every customer have to step on it,\" reads the headline on a Feb. 16, 2017, post on AMPosts.com. It shows three men opening a Starbucks door to reveal what appears to be Shepard Fairey-style images of Trump as the welcome mat (the site added an arrow to point it out).", "The post redirects from a DepartedMedia.com address that Facebook flagged as potentially being made up, as part of the social media giant’s efforts to identify fake news. DepartedMedia.com is a site known for sharing fake news. The site is registered to an address in Chesterbrook, Pa.", "The image has been doctored, with Trump’s photo added after the fact. It comes from a Twitter account called @TrumpThe45th, which is associated with the websites. The account tweeted out the photo the same day as the Internet post.", "Starbucks is shame of our nation :( pic.twitter.com/EQ9mIfUmLt", "There has been a strong conservative backlash against the Seattle-based coffee purveyor recently, especially after the company announced it would hire 10,000 refugees over five years following Trump’s controversial travel ban. But despite being picked up by several other websites across the Internet, the image and its implications are a Trenta-sized fabrication.", "The picture is of a Starbucks, all right, but it was taken in March 2014, when a THIRD Starbucks opened in Downtown Disney at Disneyland in Anaheim, Calif. Trump hadn’t even announced his presidential campaign at the time. There are no photos on the floor, of Trump or anyone else.", "The original image came from a photo of a Starbucks opening in March 2014 at Downtown Disney in Anaheim, Calif., as posted on InsideTheMagic.net.", "Judging by the comments on the tweet and the Internet ubiquity of the photo, plenty of people were fooled by the visual chicanery. We didn’t hear back from DepartedMedia.com when we contacted them, but it’s clear the image is intentionally fabricated.", "We rate this claim a full-bodied Pants On Fire!", "https://www.sharethefacts.co/share/01f9df8f-f9ec-4d2d-9b60-6475dcfc08bb", "DepartedMedia.com, \"Starbucks just placed Trump’s photo on floor so every customer have to step on it,\" Feb. 16, 2017", "Twitter, Trump for President tweet, Feb. 16, 2017", "InsidetheMagic.net, \"New Starbucks opens in Downtown Disney at Disneyland with stylish look, interactive features complimenting classic menu,\" March 11, 2014", "Business Insider, \"Starbucks has become a target of Trump-loving conservatives — and that's great news for the brand,\" Feb. 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]