["“As candidates of the 2022 Kenya's presidential race begin to flex their political muscles, Deputy President Dr William Ruto who has spiritedly expressed interest for the highly coveted political seat today got a big boost in Nairobi after commercial sex workers who are believed to be thousands vowed to throw their support in favor of him (sic),”  reads a Facebook post published on September 28, 2020.", "Alongside the claim is an image of women holding up a banner from the Kenya Sex Workers Alliance. The message on it reads: “Thank you Ruto for supporting our hustle, we will give you for free.”", "The same claim was shared on Facebook (here and here) and on Twitter (here).", "‘Photoshopped banner’", "A reverse image search on Google found the same image has been used in various reports on protests by Kenyan sex workers in 2012, 2015, 2019 and 2020.", "While it is not immediately clear when the original image was taken, a closer look shows that the wording on the banner has been changed.", "The original banner,  under the name Kenya Sex Workers Alliance, reads: “Stop killing sexworkers they are human (sic)”. The second line reads: “Save us from our saviours only rights can stop the wrongs”.", "The Kenya Sex Workers Alliance (Keswa) released a statement on September 28, 2020 dismissing the claims.", "“KESWA wishes to clarify that the pics are fake and did not originate from us or any of our member organisations. The photos were from previous marches and demos to call to attention the plight and killings of sex workers in various parts of the country.", "“We want to reiterate our position as a national movement ... that we do not engage neither endorse any political party, candidate or person..”", "Kenya will be holding its next general election in 2022 and while the campaigns have not officially started, Ruto has been drumming up support for himself by backing-up small business owners financially and in kind.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]