["About this rating", "The word \"pandemicide\" gained widespread attention when it was used in February 2021 by journalist Laurie Garrett to characterize what she described as former U.S. President Donald Trump's \"negligence\" in the final weeks of his presidency, when a massive number of coronavirus deaths were recorded in the U.S.", "However, the earliest use of the word that we found was from August 2020 in an academic journal. That article in question was not specifically about Trump's pandemic response.", "In February 2021, social media users shared an article published by Foreign Policy magazine in which the author, Laurie Garrett, accused former U.S. President Donald Trump of \"pandemicide.\"", "For example, the article was shared by Trump's estranged niece Mary Trump, a psychologist and outspoken critic of her uncle:", "Garrett's piece prompted questions as to whether the term \"pandemicide\" in reference to mass death caused by presidential negligence during an infectious pandemic was a new one. Although Garrett didn't invent the word, we couldn't find references to it from earlier than the era of the Trump presidency.", "A Google search and search through newspaper archives didn't show that the word \"pandemicide\" was used to describe any previous historical events. We also didn't find the word currently listed in any dictionaries we consulted.", "But it has been used by at least four authors on three previous occasions, albeit relatively recent to the date of this writing.", "Garrett's piece argues that Trump should be held accountable for what she called the crime of \"pandemicide.\" She defines it as the massive loss of life during Trump's final weeks in office, when he was criticized for appearing to abandon presidential duties in favor of his quest to overturn the election win of his political rival, current U.S. President Joe Biden.", "While Trump was president, approximately 400,000 people in the United States died from the coronavirus. The last 100,000 deaths occurred over the course of his final 36 days in office. Garrett wrote:", "There is vast evidence of Trump’s negligence during the pandemic’s third wave. Had I been a member of the House of Representatives during the body’s impeachment deliberations, I would have added to Trump’s indictment the crime of pandemicide, naming him as responsible for most of the COVID-19 deaths that transpired while he, the nation’s leader, was preoccupied with damning Joe Biden’s election victory. Trump’s failure to, as he vowed in his oath of office, “faithfully execute the office of president of the United States” promulgated a scale of lives lost exceeding anything experienced in the country since the Civil War, 160 years ago.", "Before Garrett used the word, psychotherapist and author David Bookbinder used it in an opinion essay about Trump published in September 2020.", "But, as journalist Nancy Friedman observed, before either Garrett or Bookbinder employed the word, it was used in an August 2020 academic paper entitled \"Imperial Pandemicide.\" In that paper, published in the academic journal Social Science Quarterly, authors Douglas A. Van Belle and Thomas Jamieson (hailing from Victoria University of Wellington in New Zealand and University of Nebraska, respectively) examined the effects of COVID-19 on the domestic populations of former imperial powers.", "Friedman also noted that the word \"pandemicide\" doesn't follow a traditional formula and instead follows a new composition \"in which the front part of -icide compounds is the subject, not the object, of the killing.\"", "The U.S. reported 500,000 COVID-19 deaths in late February 2021 — a figure The Associated Press described as \"a staggering number that all but matches the number of Americans killed in World War II, Korea and Vietnam combined.\"", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]