["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In April 2020, readers brought it to our attention that website Potatriots Unite published an article positing that \"monsters\" like the Clintons were quadrupling the prices of ventilators and medical masks in order to get rich during the COVID-19 coronavirus disease pandemic:", "Clinton-Owned Medical Supply Company Quadruples Price for Ventilators and Masks", "As the country tries to find the best way to get the ventilators President Trump says we don’t need to the places that he says don’t need them most, monsters like the Clintons are ramping up efforts to get rich from a national emergency. According to our sources, which may or may not be reliable, Clinton Medical Supply and Bicycle Parts is raising the prices on essential equipment, including ventilators and coveted N95 masks, to more than four times the normal price: [...]", "This item was not a factual recounting of real-life events. The article originated with a website that describes its output as being humorous or satirical in nature, as follows:", "Everything on this website is fiction. It is not a lie and it is not fake news because it is not real. If you believe that it is real, you should have your head examined. Any similarities between this site’s pure fantasy and actual people, places, and events are purely coincidental and all images should be considered altered and satirical.", "To be clear: The COVID-19 pandemic is a serious threat. And although there was concern in the U.S. about reported price-gouging around items like hand sanitizer, \"Clinton Medical Supply and Bicycle Parts\" was not the subject of that concern because it did not exist.", "For background, here is why we sometimes write about satire/humor.", "Potatriotsunite.com.   \"Clinton-Owned Medical Supply Company Quadruples Price for Ventilators and Masks.\"\r\n    Accessed 9 April 2020.", "Rodrige, Chris Mills.   \"House Dems introduce anti-price gouging legislation.\"\r\n    The Hill.   8 April 2020.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]