["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "If the fiscal cliff talks don't come to a resolution by Jan. 1, people will have to start paying more in taxes because the Bush tax cuts will no longer be in effect.\n\nIn an attempt to give taxpayers a sense of the impact of not extending the cuts, the Obama administration has issued state-by-state estimates of how many families would be affected if the cuts expire.\n\nIn a report tailored for Rhode Island, the administration claims: \"If the House of Representatives fails to extend the middle-class tax cuts, 400,000 middle-class Rhode Island families will see their federal income taxes increase.\"\n\nRhode Island only has a million people (1,051,302 according to the latest census estimate). So 400,000 middle-class families seemed like a high number to us. We decided to check.\n\nThe latest data from the Census Bureau says there are 412,259 households in Rhode Island, but only 256,181 households with families. The rest are non-family households, mostly people living alone. That's a huge difference.\n\n(There's an identical problem with the national numbers the Obama administration is using. The White House says 114 million middle-class families across the United States would be affected. The number of families is actually 76 million.)\n\nThe second problem: Not all Rhode Island’s 256,000 families are middle-class families.\n\nThe federal poverty level is about $15,000 a year for a family of two. According to the latest census income data from 2011, 8.4 percent of Rhode Island families -- about 21,500 -- had an income of less than $15,000.\n\nSubtract that number from 256,000 and you get about 234,500 families.\n\n(If you do the same calculation on a national level, the 114 million middle-class families that the White House talks about is really fewer than 70 million families.)\n\nAnother complication: There is no official definition of middle class. People in a wide range of income levels consider themselves to be there.\n\n\"Everybody thinks he's middle class,\" said Nick Kasprak, an analyst with The Tax Foundation, a business-backed group that studies tax policy. Kasprak said the category is meaningless.\n\nIn addition, Kasprak said, everyone who already pays taxes will be in the same boat if a deal isn't reached, whether they would be considered middle class or not.\n\n\"The only people who are unaffected by the fiscal cliff are the people that don’t file a tax return,\" Kasprak said in an e-mail. Tax increases \"hit pretty much everyone\" who files. \"If you pay taxes at all, they will go up – there’s no cutoff line.\"\n\nWe contacted the White House to ask about its numbers, but no one would talk to us for the record.\n\nIn summary, the Obama administration is taking the number of households in the United States -- and Rhode Island -- and inaccurately categorizing them as middle-class families.\n\nThere's no need to exaggerate the numbers. Without an agreement on tax reform, a lot of people are going to be affected.\n\nBut saying that the number of middle-class Rhode Island families to be affected is 400,000 is a substantial exaggeration. We rate Mr. Obama's claim False.\n\n(With staff reports from Paul Edward Parker and Philip Marcelo. If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "WhiteHouse.gov, \"Extending the Middle-Class Tax Cuts: It's the Right Thing To Do,\" accessed Dec. 11, 2012\n\nFactFinder2.Census.gov, \"Your source for population, housing, economic, and geographic information,\" U.S. Census Bureau, Tables S1101 and S1901 for Rhode Island and the United States, accessed Dec. 10 and 14, 2012\n\nPolitiFact.com, \"Are You Middle Class?\" Sept. 30, 2008\n\nU.S. Department of Health and Human Services, \"2012 HHS Poverty Guidelines,\" accessed Dec. 11, 2012\n\nE-mail, Nick Kasprak, The Tax Foundation, Dec. 11, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]