["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Virginia Society for Human Life was cheered by the General Assembly’s passage of a measure that will bar insurers who participate in a new federally run exchange in Virginia from covering most abortions.", "The action -- which was proposed by Gov. Bob McDonnell -- only allows exchange policies to cover abortions in cases when the mother’s life is in danger, or the pregnancy was caused by rape or incest.", "Shortly after the April 3 vote, the society issued a statement saying it was \"extremely pleased that the members of the General Assembly have taken the important step to protect the taxpayers of Virginia from being forced to pay for abortions in insurance plans under the newly created federal health care exchanges.\"", "We wondered whether Virginia taxpayers really were on the verge of being \"forced to pay for abortion,\" and were spared from that requirement by McDonnell’s amendment. So we took a look.", "The claim is centered on the requirements of Obamacare, which calls for statewide health insurance exchanges starting next year that will compete for the business of people who don’t have coverage through their employers. The idea is that it will allow individuals to get favorable rates paid by people in large group plans. Those who cannot afford insurance will get a federal subsidy to help them join an exchange.", "Virginia lawmakers originally had anticipated creating a state-run exchange, and in 2011 passed a bill banning most abortions from being covered in the program. But late last year, McDonnell announced Virginia would not create an exchange, a move that by default will leave the state with a federally run system. Lawmakers passed the amendment this year to guarantee that most abortions in Virginia would not be covered by the federal exchange.", "Did excluding abortion coverage spare taxpayers from having to pay for it?", "We asked Olivia Gans Turner, the president for the Virginia Society for Human Life, to explain her group’s claim. She pointed to a section of the Obamacare law that allows a state to prohibit any plan within its borders from covering abortions except in the cases when a woman’s life is in danger or instances of rape or incest -- limited circumstances that have long been covered under federal law.", "That provision makes it clear that \"the only way for a state to not pay for abortions under insurance plans is to actually enact a law providing such a prohibition,\" Turner said.", "So Turner notes, as we have, that Obamacare gives states flexibility on whether to ban abortion coverage in exchanges.", "But whatever course states chose, there is no threat that public funds would be used for most abortions. That’s because Obamacare mandates a funding mechanism that will segregate premium payments for abortions from the federal subsidies some will receive to help cover the cost of care on the exchange.", "That system requires anyone who chooses to enroll in a plan covering abortion to make two payments. The first will go into an account for all non-abortion coverage in the plan. The second payment -- of at least $1 a month -- will go into a pool used only for abortion services, according to a July 9, 2012, report by the Congressional Research Service.", "Our ruling", "The Virginia Society for Human Life said a recently passed an amendment banning insurers participating in a state exchange from covering most abortions protected \"the taxpayers of Virginia from being forced to pay for abortions.\"", "The statement ignores the fact that if abortion services had been allowed, insurers would have had to charge separate premium payments for such coverage and segregate the money from all other premiums. That ensures the payments for abortions would come out of policy holders’ pockets -- not public funds.", "We rate the claim False.", "Virginia Society for Human Life, \"General Assembly prevents taxpayer funding of abortion on demand,\" April 3, 2013.", "Interview with Olivia Gans Turner, president of the Virginia Society for Human Life, April 8.", "Congressional Research Service, \"Abortion: Judicial History and Legislative Response,\" July 9, 2012.", "The Henry J. Kaiser Family Foundation, \"Access to abortion coverage and health reform,\" November 2010.", "PolitiFact Florida, \"Taxpayer funded abortions in the federal health care bill?\" March 17, 2011.", "PolitiFact Florida, \"Marco Rubio claims Gov. Crist’s veto of abortion bill clears the way for taxpayer funded abortions,\" June 14, 2010.", "PolitiFact, \"Does Barack Obama’s health care bill include $1 abortions?\" March 21, 2012.", "FactCheck.org, \"The abortion issue,\" April 1, 2010.", "FactCheck.org, \"Taxpayer-funded abortions in high risk pools?\"  July 22, 2010.", "The Guttmacher Institute,\"Insurance coverage of abortion: The battle to date and the battle to come,\" fall 2010.", "Richmond Times-Dispatch,\"Block on abortion coverage passes,\" April 4, 2013.", "The Heritage Foundation,\"Obamacare and Abortion: New rules further burden conscience,\"  March 22, 2012.", "Op-ed by Douglas Johnson, legislative director of the National Right to Life Committee, \"Now is the time to end taxpayer funding of abortion,\" Feb. 18, 2011.", "National Right to Life Committee, \"National Right to Life: This shows the law allows abortion funding,\" July 29, 2010.", "U.S. Department of Health and Human Service, \"Statement of HHS spokeswoman Jenny Backus on the Pre-Existing Condition Insurance Plan policy,\" July 14, 2010.", "Patient Protection and Affordable Care Act, pages, 64-68, accessed April 10, 2013.", "Henry J. Kaiser Family Foundation, \"Health Reform: Impact on Women’s health coverage and access to care,\" Nov. 2010.", "Heritage Foundation, \"Obamacare: Impact of taxpayer funding of abortion,\"  April 19, 2010.", "PolitiFact \"Abortions in Pennsylvania paid for with federal dollars? Not so.,\" July 16, 2010.", "The Henry J. Kaiser Family Foundation, \"Impact of health reform on women’s access to coverage and care,\" April 2012.", "The Heritage Foundation, \"Obamacare and Abortion: New Rules further burden conscience,\" March 22, 2012.", "Interview with Sara Rosenbaum, chair of the Department of Global Health at George Washington University, April 9, 2013.", "Interview with Carolyn Engelhard, assistant professor of public health services at the University of Virginia, April 10, 2013.", "NARAL Pro-Choice Virginia,\"Gov. McDonnell’s abortion coverage ban,\" accessed April 8, 2013.", "President Barack Obama’s Executive Order 13535, March 24, 2010.", "The Henry J. Kaiser Family Foundation, \"State exchange profiles: Virginia,\" April 1, 2013.", "Legislative Information System, HB 1900, accessed April 11, 2013.", "Legislative Information System, HB 2434, April 6, 2011.", "U.S. Department of Health and Human Services, \"Pre-regulatory model guidelines under section 1303 of the Affordable Care Act, \" Sept. 20, 2010.", "Congressional Research Service, \"High risk pools after PPACA and the coverage of elective abortion services,\" July 23, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]