["The video was shared on Facebook here on July 29, 2020.", "The video’s caption states: “Vehicle suspension testing machine installed successfully by BMC in MUMBAI…WHAT AN AMAZING TECHNOLOGY …”", "BMC refers to Mumbai's civic body, which has been criticised for potholes on the roads and poor drainage system during monsoon season.", "The 30-second video was also shared here, here, here and here on Facebook; and here, here, here and here on Twitter alongside a similar claim.", "The claim, however, is false.", "A logo in Mandarin can be seen in the bottom right-hand corner of the video. A keyword search on Google found a longer version of the video was shared here on Chinese video-sharing website Bilibili on June 12, 2020.", "Below is a screenshot comparison of the video shared in the misleading Facebook post (L) and the Bilibili video (R) with similarities highlighted in red to show the two video were shot from the similar spot:", "The Bilibili video’s simplified Chinese-language caption that states it shows a road in the south-eastern Chinese province of Guangdong.", "The same location can be seen here on Baidu Maps.", "That location in the video is Shijing Avenue in the city of Guangzhou in Guangdong province.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the Shijing Avenue’s photo found on Baidu Maps (R) with similarities highlighted in green:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]