["About this rating", "Several analyses have calculated that Trump, as of October 2019, incurred around $109 million in taxpayer spending related to his golf outings, which is close to the amount of money a president would make if he were being paid $400,000 annually for 278.5 years.", "However, no single, correct number exists regarding the cost of Trump’s golf outings due to the multiple ways one can approach this question. Further, the level of precision implied by the figure “278.5 years” is not reflective of reality, given the assumptions made in the calculations.", "On Aug. 16, 2019, Huffington Post White House correspondent S. V. Dáte tweeted that U.S. President Donald Trump had, at that point in time, spent “278.5 years of annual presidential salary in taxpayer money to play golf.” This statistic served as a headline to a viral Politicus USA article posted the next day.", "Assessing the validity of this statistic requires knowledge of two numbers: the president’s annual salary and the amount of money Trump has cost taxpayers via trips to golf clubs. The first number is easy: It’s $400,000, as stipulated by Congress. The second number is a bit more challenging to derive with precision. The number would necessarily include costs like transportation, security, and other logistical support, but how these items are calculated involves estimates or assumptions.", "Huffpost’s methodology was what they described as a “conservative approach” based on a Government Accountability Office (GAO) report of Trump’s first four outings to Mar-a-lago as president. One example of the kind of choices people estimating these costs have to make, they noted, concerns how much of the per-hour Air Force One cost to add to the golf outing calculation:", "The HuffPost analysis took a conservative approach to determining costs. For example, it used a per-hour rate of $15,994 for Trump’s use of the smaller Air Force One that he takes to Bedminster, New Jersey, even though that figure accounts only for fuel and maintenance, not the additional factors that GAO used when it determined the $273,000-per-hour cost of operating the larger plane.", "The 278.5 years of presidential salary would equate to $111,400,000 in total costs up to August 2019, when Dáte tweeted the statistic. This number, to give a sense of the range of estimates, was a bit higher than a figure promoted within the body of the Politicus USA article, which cited the Trump Golf Count website as calculating, at the time of their reporting, “207 golf trips ... at a cost to taxpayers of $108 million and counting.” Trump Golf Count is run by self-described data junkie Sophie Germain and dedicated to tracking the president’s golf time.", "At the time of our reporting here, October 2019, that website reports that Trump has spent $109,505,631 of taxpayer money on visits to golf properties broken down in this way:", "Trump Golf Count Cost Breakdown:", "Total Cost: $109,505,631", "Divided by $400,000, this total represents 273.8 annual presidential salaries — still below the headline claim of 278.5 years. These differences are negligible if you take into account how precise the above numbers actually are, however. As Washington Post fact-checker Glenn Kessler put it, such figures “are a great example of false precision. We do not know exactly how many days Trump has golfed, and we do not know how much has been paid by taxpayers for his golf outings.” That being said, Kessler noted that Germain's estimates were “in the ballpark” of figures released by the Government Accountability Office. Still, he argues that “one cannot fairly attribute all of these costs to golf, given the round-the-clock security required for a president.”", "The bottom line is that multiple analyses have calculated figures that are in rough agreement with either Germain's or Dáte’s claims that the cost is presently in the $109 million area, but numbers as precise as those stated in tweets mislead a reader into thinking a level of accuracy not reflective of reality has been achieved. The numbers vary, additionally, based on how one approaches the problem: Do you include all the maintenance costs for Air Force One? Do you include security costs that would be present regardless of golf outings? There is no one right answer, and as such there is no single number that can be verified as the number.", "For these reasons, we rank the claim that “Trump spent “278.5 years” of presidential salary on taxpayer-funded golf outings as a \"Mixture.\"", "UPDATE:", "As of Sep. 21 2020, according to Trump Golf Count, Trump has golfed 279 times during his presidency, costing taxpayers an estimated 141 million dollars. With the same caveats described above, this would amount to 352.5 presidential salaries as of late September 2020.", "Easley, Jason.   “Trump Has Spent 278 Years Of Presidential Salary On Taxpayer Funded Golf Trips.”\r\n    Politicus USA.   17 August 2019.", "Schwemle, Barbara L.   “President of the United States: Compensation.”\r\n    Congressional Research Service.   17 October 2012.", "Dáte, S.V.   “Trump’s Golf Costs: $102 Million And Counting, With Taxpayers Picking Up The Tab.”\r\n    Huffington Post.   22 May 2019.", "trumpgolfcount.com.   “A Message From Sophie.”\r\n    Accessed 17 October 2019.", "Kessler, Glenn.   “Have U.S. Taxpayers Spent $72 Million on Trump’s Golf Outings?”\r\n    Huffington Post.   As updated 5 February 2019.", "Update [21 September 2020]: Updated with the latest figures from Trump Golf Count.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]