["About this rating", "A photograph shows President Trump making an excited hand gesture on 11 September 2018.", "This photograph was taken as President Trump greeted a crowd of supporters at an airport; not at a memorial for the victims of the September 11 terrorist attacks.", "Dozens of photographs were taken of President Donald Trump on 11 September 2018 as the chief executive traveled to Shanksville, Pennsylvania, to honor the victims of United Airlines Flight 93 who were killed during the 9/11 terrorist attacks. One image from that day, however, drew slightly more attention than the rest -- a photograph showing the president making an excited hand gesture that was shared by a number of social media users and websites along with the claim that it was taken at a 9/11 memorial service:", "This photograph is real and it was taken on the 17th anniversary of the 11 September 2001 terrorist attacks. However, it was not taken at a memorial event in Shanksville.", "This photograph was snapped shortly after President Trump touched down at John Murtha Johnstown-Cambria County Airport in Johnstown, Pennsylvania, and pictures the president as he approached a group of soldiers and cheering supporters. New York Times photographer Doug Mills originally shared the image on Twitter with the caption \".@realDonaldTrump First Lady Melania Trump greet supporters as they arrive in Johnstown, PA to attend the Flight 93 September 11 Memorial Service in Shanksville, PA\"", "The president's hand-gesture can be glimpsed at the 8:35 mark of a WTAJ video of his arrival in Johnstown:", "This image was also shared with the claim that it showed President Trump \"on his way to a 9/11 memorial.\" While this may be technically true, it should be noted that Shanksville, where United Airlines Flight 93 crashed, is about a 30-minute drive from Johnstown.", "A number of social media users also employed this photograph in order to compare President Trump's demeanor on the anniversary of 9/11 to that of his predecessor:", "The image of President Obama and First Lady Michelle was taken by Associated Press photographer Pablo Martinez Monsivais during their Obamas' visit to the Flight 93 National Memorial on 11 September 2011, the 10th anniversay of the 9/11 attacks. So although both of these photographs may be real, their juxtaposition is misleading.", "Comparing photographs of different people, taken at different times and at different locations, is problematic for a number of reasons. As photographs only capture fleeting moments, the images used in these comparisons are often cherry-picked in order to present a specific narrative. For instance, a number of photographs of Trump that were actually taken in Shanksville show a much more somber president, such as this picture captured by Doug Mills, the New York Times photographer who also snapped the \"fist-pumping\" image:", "Admittedly, we were not able to find any images of President Obama's fist-pumping on 9/11. However, we could create a similar false narrative suggesting that former president Obama was being disrespectful on this somber day while President Trump was properly honoring the occasion, by cherry-picking another set of photographs. These images, for example, were both taken on an anniversary of the 9/11 attacks:", "This wasn't the only comparison circulating on social media attempting to show how Barack Obama was more presidential in his handling of these tragic anniversaries than President Trump was. The following image graphic, for instance, purportedly compares two tweets that were sent by these Presidents on 11 September 2018:", "Both of these tweets are real. Again, however, some cherry-picking is at play.", "President Trump posted 15 tweets on 11 September 2018. While these messages touched on a variety of topics, such as Russian collusion, small businesses, and \"Crazy Maxine Waters,\" he also shared a number of messages that elaborated on his \"17 years since September 11th!\" tweet:", "#NeverForget #September11th pic.twitter.com/POd8D1WfBa", "— Donald J. Trump (@realDonaldTrump) September 12, 2018", "The photograph of President Trump fist-pumping on 11 September 2018 is real. However, this photograph was taken upon his arrival at an airport, not at a memorial service, and shows the president greeting a group of an excited supporters.", "Wilson, Samantha.   \"Donald Trump Slammed for Fist-Pumping as He Arrived at 9/11 Memorial Service.\"\r\n    Hollywood Life.   11 September 2018.", "Mazza, Ed.   \"Twitter Users Torch Trump Over Fist-Pumping, Thumb-Raising 9/11 Commemoration.\"\r\n    The Huffington Post.   12 September 2018.", "Ryan, Lisa.   \"Donald Trump Is Having a Really Hard Time Honoring 9/11.\"\r\n    The Cut.   11 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]