["About this rating", "A college student received a failing grade from an instructor who told her that Australia was a continent, not a country.", "The grade was for one assignment, was later amended, and the university refunded the student for the cost of the course.", "A 27-year-old Idaho woman's run-in with a sociology professor who did not know that Australia was a country became fodder for media coverage in February 2018.", "Ashley Arnold's trouble with her professor for an online course at Southern New Hampshire University (SNHU) first came to light when she asked the school for help in a 2 February 2018 Twitter post, saying:", "I’m failing a 300 level college course because my professor thinks Australia isn’t a country. Please help @SNHU @snhuprez @DeanofSNHUdents #Australiaisacountry #getyourfactsstraight", "Arnold later told news outlets that she ran afoul of the instructor — whom she did not identify in order to avoid subjecting her to backlash — when she handed in a project for the final course she needed to complete her sociology degree.", "The university would not comment on Arnold's grades, citing privacy regulations. But Arnold says that when she received a failing grade on the assignment (comparing social media use between the U.S. and another country) the instructor explained:", "Australia is a continent; it is not a country. That error made it nearly impossible for you to accurately complete your week 2 research outline correctly.", "The instructor reportedly agreed to do \"independent research\" on the matter after Arnold referred her to a section of the Australian government's web site called \"About Australia\" that said \"Australia is an island continent and the world's sixth largest country (7,682,300 sq km).\"", "The instructor later replaced Arnold's failing grade with a B+. However, the professor reportedly warned her to \"make sure the date, the facts, and the information you provide in your report is about Australia the country and not Australia the continent.\"", "A spokesperson for the university told us:", "We deeply regret the interaction between our professor and our student and have apologized to the student and refunded her for the class. Following an investigation, we have replaced the instructor as we strive to adhere to the highest standards of integrity and accuracy in educating our students. To our friends and colleagues in Australia, we know that you are a country and a continent, best of luck in the Olympic games!", "We also contacted Arnold seeking comment, but we had not heard back by press time.", "Mack, David. \"This Student Failed Her Assignment Because Her Professor Said 'Australia Isn't A Country.'\"\r\nBuzzfeed. 8 February 2018.", "Australian Government. \"Our Country.\"", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]