["About this rating", "A video showing CNN reporter Drew Griffin and his news crew rushing to the rescue of a man who accidentally drove his truck into a small ravine flooded by Hurricane Harvey went viral on 30 August 2017:", "This footage was widely shared along with praise for Griffin and his crew, but almost immediately some viewers accused the news network of staging the rescue.", "This particular conspiracy theory, like many conspiracy theories, hinges on nothing more than an incorrect observation: Griffin was allegedly wearing shorts in one portion of the video, but pants in another. InfoWars.com attempted to explain the basis for this accusation:", "The video then cuts to the moment when the vehicle becomes marooned in the water. After about 20 seconds, Griffin is seen running towards the vehicle. He is wearing khaki shorts and trainers.", "However, in the next clip, where Griffin is seen pulling the man out of the water, he is now wearing dark pants and boots.", "Although InfoWars.com provides a set of images showing two men in CNN-branded red jackets — one wearing shorts and the other wearing pants — they did not explain how a wardrobe change would prove that this video had been staged, or how changing into pants from shorts would be necessary for the staging of such a video:", "Those peddling this claim apparently believe that the man spotted in shorts (around the :31 mark) was reporter Drew Griffin, not his field producer Brian Rokus. But upon reviewing the footage, this is not physically possible. Griffin can be seen running off screen to the left as he chases down the truck down the ravine. When the camera pans over, it shows a second man (Rokus, wearing shorts) who is already standing near the water. Judging by the time that passes between Griffin's departure from the screen, the direction that he was running, and the audio of his footsteps crunching against the grass, it is not possible for Griffin to be the man in shorts.", "What is even less clear is why CNN — a company that has been in the video news business for decades — would put out a hoax video that was so sloppily edited.", "Matt Dornic, CNN's vice president of communications, sent us a photograph of Griffin and Rokus on location. Both men are pictured wearing red CNN-branded jackets, as is standard for field reporting and producing:", "?Absolutely absurd and total BS. There are two different people wearing CNN rain jackets. Wish I could say I'm surprised but.. https://t.co/O0zyyfT8iC", "— Matt Dornic (@mdornic) August 31, 2017", "We were also able to view the raw footage of CNN's rescue, and can confirm that the only things of note edited out of the original footage were a few off-camera curse words and roughly 90 seconds of a blurry street sign.", "This conspiracy theory hinges on the idea that Drew Griffin changed from shorts to pants in the middle of his report. And although we still aren't sure how this detail would be relevant in the staging of a rescue, this video actually shows two different men, Griffin and his producer Brian Rokus, wearing similar red jackets.", "Ellefson, Lindsey.   \"CNN Correspondent Helps Rescue Man in Texas Flooding.\"\r\n    CNN   30 August 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]