["“If i walk to a store that does this i will walk back out. Cash is legal tender and if we cave into this rubbish we cave into the cashless society (...) BOYCOTT no matter how inconvenient it is,” the text that accompanies a June 30, 2020 post reads. The photo has been circulating on Facebook since May 31.", "“Use your cash, it's against the law for anyone to refuse the cash payment in exchange for goods and services. Take back the control of your life,” a similar post reads. Posts decrying businesses refusing cash amid the novel coronavirus pandemic can also be found on Twitter -- here, here, and here.", "The novel coronavirus pandemic brought growing concerns of transmission through banknotes. But according to a BIS Bulletin from the Bank for International Settlements, evidence suggests that the risk of a spread through cash payments is low when compared with other frequently-touched objects.", "Since May, Whole Foods has responded via its official Twitter account to questions about its policies on cash including here, and here.", "The company said that, as of April 20, some stores designated cash and cashless lanes “as an added safety measure and to make the checkout process easier for customers.” Whole Foods stores still accept cash, it added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]