["About this rating", "On 14 October 2016, the TDT Alliance web site and its shill Facebook outlet, \"Fox News The FB Page,\" posted an article reporting that WikiLeaks had published a photograph showing Hillary Clinton grabbing a man's genitals onstage:", "After a tumultuous week in the Presidential election Julian Assange has released another bombshell. Wikileaks has released a group of photos allegedly hacked from John Podesta's emails showing presidential candidate Hillary Clinton grabbing a man's crotch.", "\"You can clearly see,\" Assange told a French news outlet,\"Hillary has grabbed on the man's balls. All Donald Trump has done is talk about grabbing women and they call him a rapist. They tried the same thing with me. Look, tripping on the rug and your fingers accidentally winding up in a woman's coocoo is not rape. What Clinton did is.\"", "There was no truth to this story. TD Alliance is a fake news web site that does not publish factual stories, and its shill Facebook group, named \"The Fox News FB Page,\" is not affiliated with the real Fox News.", "Although the photograph in question (but not the Fox News mockup that includes it) is real, it does not feature Hillary Clinton. This photograph was taken in 2009 during a production of \"Broadway Backwards 4\" and shows actress Florence Henderson (of Brady Bunch fame) reaching towards a member of the male chorus line:", "The fourth annual “Broadway Backwards” concert benefiting New York’s Lesbian, Gay, Bisexual, and Transgender Community Center raised the roof of the American Airlines theater on Monday, February 9. No surprise that the audience was packed; with such performers and presenters as Whoopi Goldberg, Mario Cantone, Alan Cumming, Cheyenne Jackson, Christopher Sieber, John Tartaglia, Michael Urie, and beloved Florence Henderson on hand, the show — in which well-known songs from Broadway musicals are presented in a new, gayer context — was really something else.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]