["About this rating", "For decades, scientists have alleged a connection between aluminum and Alzheimer's disease, and whether such a link exists has been the subject of a long-standing debate within the scientific community. (Indeed, when silent film great Rudolph Valentino passed away from a perforated ulcer in 1926, rumor held that his demise was caused by his consuming food prepared in aluminum cookware.)", "The more specific claim about the health dangers cooking with aluminum foil often pops up in viral news stories, such as one published on clickbait site awm.com under the headline “Doctors Now Have Warning: If You Use Aluminum Foil, Stop It or Face Deadly Consequences,” which made the following argument:", "Simply put, if you cook with aluminum foil, you are playing with your health. The first thing you need to know is that aluminum is bad for your brain. It is a neurotoxic heavy metal that has been linked to Alzheimer’s disease for years.", "This claim rests on three assertions. First, that cooking with aluminum foil will liberate aluminum and be transferred to your food in a form that can be ingested; second, that this aluminum will reach your brain in concentrations high enough to be significant; and third, that high concentrations of aluminum in your brain put you at increased risk of Alzheimer’s.", "Will cooking with aluminum foil liberate aluminum? Yes, acids typically dissolve metals, and aluminum is no exception. A 2012 study published in the International Journal of Electrochemical Science, which is often cited in viral news stories because of its more alarmist claims about Alzheimer’s, investigated how much aluminum was liberated through the process of cooking food in foil. Not surprisingly, researchers found the amount varied depending upon factors such as temperature and acidity, but that some aluminum did, in fact, leach into food cooked in foil:", "Aluminum foil used in cooking provides an easy channel for the metal to enter the human body. The increase in cooking temperature causes more leaching. The leaching is also highly dependent on the pH value of the food solution, salt, and spices added to the food solutions.", "How much of that leached aluminum would stay in your body? Not much -- most research on the topic agrees that it’s much less than 1%. A 2011 report published in the journal Neuroscience stated that “healthy humans and laboratory rats absorb between 0.06% and 0.4% of ingested Al”.", "Could some of that ~0.4% of leached aluminum make it to your brain? Based on studies that directly injected rats with high doses of aluminum, the answer is yes, but not much. According to the World Health Organization, once the aluminum does make it into your bloodstream, a very small percentage (of an already small percentage of ingested aluminum) actually ends up in your brain: \"Approximately 60, 25, 10, 3 and 1% of the aluminium body burden is in the bone, lung, muscle, liver and brain, respectively.\"", "The amount of aluminum you would need to eat on a regular basis to see much of a buildup in your brain is unrealistically large. But, for the sake of argument, let’s say some of that leached aluminum does get into your brain. Will it increase your risk factor for Alzheimer’s?", "The debate over a connection between aluminum and Alzheimer’s has gone on for decades, originally inspired by the observation that the brains of Alzheimer’s patients have high concentrations of aluminum compounds and that a major symptom of the disease is the buildup of plaque that contains aluminum compounds.", "At the moment the field remains mixed on the role of aluminum as a possible risk factor for Alzheimer's. Both the Alzheimer's Society of Canada and the international Alzheimer's Association’s official stance is that aluminum is not a risk factor for the disease. A 2008 CDC toxicology report describes the scientific consensus as follows:", "Although a possible association was proposed over 40 years ago, this association is still highly controversial and there is little consensus regarding current evidence. A number of studies have found weak associations between living in areas with elevated aluminum levels in drinking water and an increased risk (or prevalence) of Alzheimer’s disease; other studies have not found significant associations.", "In contrast, no significant associations have been found between tea consumption or antacid use and the risk of Alzheimer’s disease; although the levels of aluminum in tea and antacids are very high compared to drinking water, aluminum from these sources is poorly absorbed. The available data do not suggest that aluminum is a causative agent of Alzheimer’s disease; however, it is possible that it may play a role in the disease development.", "More recent studies have come to light that may end up reinvigorating the debate, but both the connection of aluminum to Alzheimer’s and its mechanism for causing the disease are far from settled science. That being said, it’s incredibly unlikely you are exposing your brain to high concentrations of aluminum by cooking with aluminum foil in the first place.", "Bassioni, Ghada et al.    \"Risk Assessment of Using Aluminum Foil in Food Preparation.\"\r\n    International Journal of Electrochemical Science.    May 2012.", "Poirier, J. et al.    \"Double-Blind, Vehicle-Vontrolled Randomized Twelve-month Neurodevelopmental Toxicity Study of Common Aluminum Salts in the Rat.\"\r\n    Neuroscience.    12 June 2011.", "Krewski, Daniel et al.    \"Human Health Risk Assessment for Aluminium, Aluminium Oxide, and Aluminium Hydroxide.\"\r\n    Journal of Toxicology and Environmental Health. Part B, Critical Reviews..    7 April 2011.", "Rondeau, Virginie et al.    \"Aluminum and Silica in Drinking Water and the Risk of Alzheimer's Disease or Cognitive Decline: Findings from 15-year Follow-Up of the PAQUID Cohort.\"\r\n    American Journal of Epidemiology.    21 January 2010.", "Diamond, Jack.    \"A Report on Alzheimer’s Disease and Current Research.\"\r\n    Alzheimer Society of Canada.    2005/2008.", "Alzheimer's Association.    \"Alzheimer's Myths.\"\r\n    Accessed 17 November 2016.", "CDC Agency for Toxic Substances and Disease Registry.     \"Aluminum.\"\r\n    Accessed 17 November 2016.", "Wang, Zengjin et al.    \"Chronic Exposure to Aluminum and Risk of Alzheimer’s Disease: A Meta-analysis.\"\r\n    Neuroscience Letters.     1 January 2016.", "Updated.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]