["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As the U.S. inches closer than ever toward an available COVID-19 vaccine, misinformation about both the disease and how to prevent it are spreading online.", "One image being shared on social media makes a claim about China, where the first case of COVID-19 was reported in December 2019.", "\"Why did China recover without a vaccine?\" the image says. \"And why doesn’t anybody talk about it?\"", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First of all, China already has a COVID-19 vaccine.", "In late November, the chair of a Chinese pharmaceutical company said in an interview with a Chinese newspaper that nearly 1 million people in the country had used its COVID-19 vaccines.", "But experts have also credited the country for curbing the spread of the coronavirus by taking other measures. In a nutshell: China moved quickly compared to other countries. Wuhan, where the first case was reported in December 2019, was put on a strict lockdown for more than two months and 9 million people were tested for COVID-19 there within weeks. Public transportation was suspended and across the country 14,000 health checkpoints were established. Residents were severely restricted from moving outside their homes. And China effectively enacted a nationwide contact tracing system.", "By September, the executive director of the World Health Organization’s health emergencies program was congratulating the Chinese for working \"together tirelessly to bring the disease to this very low level.\"", "In October, The Lancet medical journal reported that China had managed to control the pandemic rapidly and effectively. The journal credited that feat to a few factors. The country already has a centralized epidemic response system. Few elderly Chinese residents live in nursing facilities, which were a major source of infection in some western countries. And because of the severity of the SARS outbreak in 2002, most adults there were cognizant of what could happen during the coronavirus outbreak.", "Chinese residents also broadly complied with mask rules unlike in the United States, where many Americans have refused to wear masks even as cases surge. In China, people were publicly shamed for not wearing masks.", "\"Drones equipped with echoing loudspeakers rebuked Chinese citizens who were not following the rules,\" according to the Lancet. \"‘Yes Auntie, this drone is talking to you,’ one device proclaimed to a surprised woman in Inner Mongolia. ‘You shouldn’t walk around without wearing a mask. You’d better go home and wash your hands.’\"", "While restrictions in China are now similar to those in place throughout Europe and the United States, NBC News reported, widespread compliance in China appears to be making a difference.", "As of Dec. 3, China had 93,203 cases and 4,744 COVID-19 deaths, according to Johns Hopkins University. That’s far fewer cases and deaths than in the United States, which has recorded more than 14 million cases and more than 275,250 deaths.", "Ali Mokdad, a professor of global health at the University of Washington, told NBC that China’s success is possible only through restrictions on individual freedoms that wouldn’t be tolerated here. Its approach has been criticized for being draconian.", "But the country is still grappling with COVID-19. After multiple locally-transmitted cases were identified in three cities in November, Chinese officials tested millions of people for the disease and initiated new lockdowns and shuttered schools.", "\"Recent flareups have shown that there is still a risk of the virus returning, despite being largely controlled in China,\" the Associated Press reported.", "The National Health Commission in China recently announced that \"strict containment measures should be taken\" in the winter and spring to prevent cases of COVID-19.", "The Facebook post says that China has recovered from the coronavirus without a vaccine.", "Through a number of severe restrictions, widespread testing, and high compliance among residents there, the country has largely succeeded in bringing the virus to heel but it has not returned to normal operations. In schools, for example, millions of children wear masks and have their temperature checked multiple times a day. And new cases of COVID-19 are still being identified in China.", "The country also has a vaccine, and Chinese officials say nearly 1 million people have been vaccinated.", "We rate this post False.", "Facebook post, Dec. 1, 2020", "Vox, In China, nearly 1 million people have reportedly gotten a coronavirus vaccine, Nov. 25, 2020", "The Lancet, China’s successful control of COVID-19, Oct. 8, 2020", "Johns Hopkins University of Medicine, COVID-19 dashboard, visited Dec. 3, 2020", "NBC News, As COVID-19 runs riot across the world, China controls the pandemic, Nov. 7, 2020", "The Associated Press, China tests millions after coronavirus flaresup in three cities, Nov. 23, 2020", "The Associated Press, The latest: China reports results of mass testing, Nov. 23, 2020", "National Health Commission of the People’s Republic of China, Dec 4: Daily briefing on novel coronavirus cases in China, Dec. 4, 2020", "National Health Commission of the People’s Republic of China, China to boost COVID-19 precautions during winter and spring, Nov. 26, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]