["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate and entrepreneur Andrew Yang has regularly touted his cross-partisan appeal, and he usually cites a particular data point to make that case.", "\"I'm one of only two candidates in the field that 10% or more of Donald Trump voters say they would support in the general,\" Yang said in a sit-down with The Washington Post on Oct. 22. Earlier, he said something similar to CBS News and in a tweet.", "A reader asked us to check whether this was true, so we took a closer look.", "When we checked with Yang’s campaign, they pointed to a survey by the Economist and YouGov conducted from July 21-23. The survey asked voters whether they planned to vote in a Democratic primary or caucus; if they said yes, they were asked who they would vote for.", "Of 1,500 total adult respondents, 460 said they were planning to vote in a Democratic primary or caucus. Separately, poll respondents had been asked who they voted for in 2016, Trump or Hillary Clinton. Of those 460, 41 said they had voted for Trump in 2016.", "Of those 41 voters, 10% said they would support Yang, ranking him second to Bernie Sanders at 14%. Other candidates close to double digits were Pete Buttigieg at 9% and Julian Castro at 8%; 12% said they weren’t sure.", "This tracks with what Yang said. But coming from the guy who says he wants to \"Make America Think Harder,\" Yang needs a course in how polling works.", "The Economist/YouGov poll has asked the same question every week since the July 21 to July 23 survey Yang cited. The later polls squash any notion that Yang has high support among Trump voters.", "Here’s a rundown of every Economist-YouGov poll with enough responses since late July, showing Yang’s percentage among past Trump voters compared to other top finishers. We located these in the fivethirtyeight.com polling archive.", "Of the 11 subsequent polls, Yang only matched or exceeded 10% twice. More often, Yang’s share of the Trump vote was much lower than that. In the most recent poll, Yang’s share of the Trump voter support was zero.", "In fact, the July poll Yang cites is the only time Yang finished in the top two among Democrats.", "And while Yang says he was only one of two candidates to surpass 10%, if you look across all of the polls, eight candidates actually achieved that — Yang, Biden, Sanders, Pete Buttigieg, Elizabeth Warren, Marianne Williamson, Michael Bennet and Steve Bullock.", "The full breakdown of the polls is attached at the bottom of this fact-check.", "Ignoring all of the above (even though you shouldn’t), polling experts say the figure Yang cites is meaningless, because of the small sample of participants surveyed.", "In most of the Economist/YouGov polls, about 30 to 40 people said they voted for Trump in 2016 but would be voting in a Democratic primary or caucus in 2020. Ten percent of that (which is near Yang’s high-water mark) would represent three to four people.", "Steve Smith, a Washington University political scientist who runs his own online panel survey, said that corresponds to a standard margin of error of about plus or minus 15 percentage points. That renders the question useless to anyone who cares about statistics, polling or math.", "When we checked with Joe Williams, the YouGov polling director, he said he agreed with our overall analysis of Yang’s assertion.", "When we contacted the Yang campaign, it said it stood by its talking point.", "Yang said, \"I'm one of only two candidates in the field that 10% or more of Donald Trump voters say they would support in the general\" election.", "This claim comes from one poll in July that sampled 41 Trump voters who said they planned to vote in a Democratic primary or caucus. The question has been asked by the same pollster weekly since July, and those results have never been replicated.", "Even if they had, the margin of error for a sample size that small is about 15 percentage points, rendering them essentially meaningless.", "The math isn’t hard on this one. We rate Yang’s claim Pants on Fire!", "Washington Post, \"Transcript: The 2020 Candidates: Andrew Yang,\" Oct. 22, 2019", "CBS News, \"Andrew Yang on why he'll beat Biden and lure Trump voters,\" Sept. 4, 2019", "Andrew Yang, tweet, Sept. 14, 2019", "Economist/YouGov polls, July 21-23, July 27-30, Aug. 3-6, Aug. 10-13, Aug. 17-20, Aug. 24-27, Sept. 1-3, Sept. 8-10, Sept. 14-17, Sept. 22-24, Sept. 28-Oct. 1, Oct. 6-8, Oct. 13-15", "Fivethirtyeight.com, polling archive, accessed Oct. 22, 2019", "Email interview with Steve Smith, political scientist at Washington University in St. Louis, Oct. 23, 2019", "Email interview with Joe Williams, YouGov director of polling, Oct. 23, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]