["About this rating", "In November 2020, a photograph supposedly showing a rainbow-colored harpy eagle circulated on social media:", "This is not a genuine photograph of a harpy eagle. This image was digitally edited to make this beautiful bird appear more colorful than it is in reality.", "This image was created by Arstation user Godserg_art circa 2018 as part of a series of rainbow-colored animals. The original posting was accompanied by tags such as \"Digital Painting,\" \"illustration,\" and \"speedpaint,\" as well as a note from Godserg_art indicating that the software Photoshop was used to create this image.", "Godserg_art also created a rainbow tiger, a rainbow bear, and a rainbow wolf, all of which are clearly artistic renderings and not genuine photographs:", "The harpy eagle is the largest raptor in the Americas and one of the largest in the world. Full-grown harpy eagles have a wingspan that extends nearly 7 feet across and have talons that rival bear claws. The American Bird Conservancy writes:", "These powerful eagles are at the top of the rainforest food chain and have no natural predators. They prey on tree-dwelling mammals including sloths, monkeys, and opossums; large birds such as macaws and curassows; and reptiles like iguanas and snakes.", "Truly impressive birds, Harpy Eagles' legs are as thick as a person's arm and their talons are three to four inches long — the same size as a grizzly bear's claws!", "Although these are impressively large raptors, they aren't particularly colorful. PBS writes:", "\"The harpy eagle has dark gray feathers with a white underside. A black band of plumage spans its neck and a fan of gray feathers crowns its head. Male and female plumage is identical.\"", "Here's a genuine photograph of a harpy eagle:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]