["About this rating", "Burger King Israel shared an image and a video of a Valentine's Day \"adult meal,\" including toys geared to grownups.", "The promotion appeared to be limited to a four-hour span on Valentine's Day at a single Burger King location in Tel Aviv.", "On 14 February 2017, multiple online outlets published headlines and images intimating that the Burger King fast food chain had introduced an \"adult meal\" that includes a sex toy:", ".@BurgerKing is offering an \"adult\" meal for Valentine’s Day and yes, it comes with a toy: https://t.co/vsBhuZspgk pic.twitter.com/7YlAXEsCf4", "— UPROXX (@UPROXX) February 13, 2017", "The claim was of the sort that is typically spotted and passed along by social media users without closer inspection. Shortened headlines and excerpts in social media posts fostered the belief that Burger King's newest menu item was burger meal that included French fries and a French tickler — and a widely-shared video didn't do much to clear up the confusion:", "Articles about the rumor were equally ambiguous (for the most part):", "Well, this Valentine’s Day, Burger King decided that they shouldn’t just limit the “toy with meal” concept to just kids. They’ve created the “adult meal” that includes some “adult toys.”", "The meal is exclusively offered to those 18-years-old and up, and is only available after 6:00pm. The possible “toys” include a blindfold, a feather duster, and a head massager.", "It definitely looks like the “adult toys” aren’t a much higher quality than the kids toys. The meal also includes two beers, so you’ll basically have everything you could ever need for a fancy date night with your boo ... Tragically, if you thought that this great Valentine’s Day package might be your last minute V-Day plan, the King is being super stingy about where it is offered. It seems like this deal is exclusive to Burger King locations in Israel.", "American Burger King social media accounts did not address the popular story's spread, and links to the promotion were not present on Burger King Israel's web site. However, a 12 February 2017 post on Burger King Israel's Facebook page as well as a cover photograph  (reverted before the promotion was scheduled to run) suggested that the rumored Valentine's Day promotion existed in that country:", "Although Burger King Israel's Facebook page frequently engaged with users commenting on posts about the purported \"Adult Meal,\" none of the replies provided specifics about the promotion or any other form of substantive response. Photographs depicted a kids' meal-style box alongside a head massager, sleep mask, and feather duster, but details (such as cost, duration, the nature of the included \"toys,\" which outlets would be participating) remained absent from Burger King Israel's official site and social media channels. (A Hebrew version of the video advertisement was shared on 12 February 2017.)", "Advertising industry publication AdWeek asserted that Burger King's \"Adult Meal\" came with two burgers, two orders of fries, two beers, and a \"romantic ADULT TOY inside (emphasis BK’s).\" Israeli news source Haaretz reported that the promotion would be available only at a single Burger King location, and only for about four hours:", "The box, only available to those older than 18 after 6 P.M. at the Rabin Square location in Tel Aviv, will contain two Whoppers, two orders of french fries, two beers and \"a romantic adult toy.\"", "Burger King, aware that building up suspense fuels passion, did not reveal which \"romantic adult toys\" would be included, but a promotional video showcases a blindfold, a feather tickler and a head massager.", "Although details about Burger King Israel's \"adult meal\" (or included adult toys) were difficult to locate, the promotion appears be be extremely limited — restricted to several hours on a single night (14 February 2017) at one Tel Aviv Burger King locations.", "We have been unable to find social media posts or pictures shared by individuals who had taken advantage of the deal, and we have not received a response from Burger King Israel.", "Conway, Clint.    \"Today Burger King Is Offering an ‘Adult Meal’ With ‘Adult Toys’ for Some Saucy ‘Adult Fun.'\"\r\n    Thought Catalog.    14 February 2017.", "Nudd, Tim.    \"Burger King Offers an Adults-Only Valentine’s Day Meal, with a Different Kind of Toy Inside.\"\r\n    AdWeek.    13 February 2017.", "Haaretz.    \"Valentine's Day: Israeli Burger King Offers 'Adults Meal' for One Night Only.\"\r\n    14 February 2017.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]