["About this rating", "On 1 June 2017, the web site Geller Report published an image of black smoke rising above Vatican City under the headline \"Breaking: Vatican City Bombing\":", "Geller Report also implied that the bombing was carried out by Muslims:", "Not to worry, the Pope says Quran is a book of peace and Islam is not a violent religion.", "Ramadan?", "Despite the sensational title and subsequent tweet plugging the article, this image does not show a bombing in Vatican City -- because a bombing did not occur. Geller appeared to admit as much in the body of her article:", "Plumes of black smoke have filled the sky above the Vatican amid reports of an explosion.", "Eyewitnesses spoke of seeing thick smoke coming from a building right next to the headquarters of the Roman Catholic Church after a ‘loud boom’.", "One news outlet in Rome claimed a large fire had erupted at an auto garage.", "The local news outlet Rai News reported that the smoke was coming from an auto junkyard to the west of the capital, where \"a fire of vast proportions\" had broken out, causing several explosions.", "The Twitter account for the local fire station also posted a video of the junkyard fire:", "(1gju-18.30) #Roma, incendio autodemolitore via Battistini: evacuata a scopo precauzionale una palazzina nelle vicinanze. 4squadre impegnate pic.twitter.com/wI2Qski9Ay", "— Vigili del Fuoco (@emergenzavvf) June 1, 2017", "The exact cause of the fire is still unknown as of this writing. However, the fire did not occur at the Vatican and there have been no credible reports about a bombing in the area. Vatican officials told Catholic.org that the Pope, as well as tourists at the Vatican, were safe and confirmed that the smoke had come from the junkyard fire a few miles away from the holy site:", "A garage fire near the Vatican sparked fears that a terrorist attack has struck the holy site. Additional reports of an explosion caused a frenzy of reports that a bomb may have exploded.", "However, officials in Rome say the Vatican is safe, and the cause of the incident is a garage fire next to the Vatican walls. The Pope as well as the tourists and all others at Vatican City are safe. The fire is presently being extinguished.", "Connolly, Marshall.   \"Garage Fire Near Vatican Sparks Fears for Pope, Tourists.\"\r\n    Catholic Online.   1 June 2017.", "Di Giovan, Tiziana.   \"Roma, Incendio in Uno Sfasciacarrozze: Timori Nube Tossica a Primavalle.\"\r\n    Rai News.   1 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]