["By Robert Farley", "Posted on October 9, 2020", "Hours after announcing that he would not participate in an Oct. 15 debate because the Commission on Presidential Debates said it would be virtual, President Donald Trump revived an old complaint that the commission deliberately “oscillated” his microphone during a 2016 debate with Hillary Clinton.", "Trump has had a longstanding beef with the commission over a faulty microphone during the first presidential debate between Trump and Clinton on Sept. 26, 2016. But there’s less to it than Trump claims. The commission acknowledged there was a technical glitch with Trump’s microphone that affected his volume in the debate room, but it did not affect the audio for the 84 million people who watched the debate on television.", "In an interview with Sean Hannity on Fox News on Oct. 8, Trump inaccurately described the commission as “Clinton people” and he wrongly claimed the commission “apologized” to him in a letter about the microphone.", "Trump’s complaint about the commission resurfaced this week after the commission announced on the morning of Oct. 8 that the second presidential debate scheduled for Oct. 15 would be held virtually.", "“In order to protect the health and safety of all involved … the second presidential debate will take the form of a town meeting, in which the candidates would participate from separate remote locations,” the commission stated in a press release.", "In an interview on Fox Business shortly after the commission’s announcement, Trump said given the decision to hold the debate virtually, he wouldn’t participate.", "“I’m not going to waste my time on a virtual debate,” Trump said. “That’s not what debating’s all about. You sit behind a computer and do a debate. It’s ridiculous. And then they cut you off whenever they want.” (The first presidential debate was marred by repeated interruptions, most of them from Trump.)", "In an interview with Hannity later that evening, Trump said he didn’t want the commission to host the debate even before its announcement of a virtual debate. The CPD, a nonprofit entity has sponsored all of the presidential debates since 1988.", "“Last time, I had a big problem,” Trump said. “They oscillated my mics when I had the one debate… On the first debate, they oscillated the mic and they oscillated it very, very seriously, and they actually apologized to me.”", "Trump characterized the 2016 commission as “Clinton people” and said his campaign discussed doing debates independent of the commission.", "“The commission’s a joke,” Trump continued later in the interview. “Take a look at the letter they wrote me four years ago when they apologized. They were oscillating my mic. They were turning it up and down when I was speaking to Hillary, crooked Hillary who turns out to be very crooked.”", "As we wrote when Trump raised the same claims last December, the bipartisan commission did not apologize for any willful tampering, but acknowledged in a terse statement that “there were issues regarding Donald Trump’s audio that affected the sound level in the debate hall.”", "(We should note that Trump has a history of claiming people apologized to him when they have not.)", "According to the New York Times, Trump said after the first debate with Clinton that “the changing volume had distracted him and alleged again that someone had created the problem deliberately.”", "“They had somebody modulating the microphone, so when I was speaking, the mike would go up and down,” Trump told the Times. ”I spent 50% of my thought process working the mike.”", "The Times noted that there was “no evidence of sabotage.”", "As for Trump’s characterization of the 2016 commission as “Clinton people,” when Trump made a similar claim back in October 2016 we noted that the commission at that time had two co-chairmen. One of them was Michael D. McCurry, a former press secretary for Bill Clinton. But the other co-chair was Frank J. Fahrenkopf Jr., who was chairman of the Republican National Committee from 1983 to 1989.", "CPD was founded in 1987 by Fahrenkopf and Paul Kirk Jr., then chairman of the Democratic National Committee. McCurry succeeded Kirk as co-chairman of CPD in 2009.", "In an interview on Fox and Friends on Aug. 5, Trump called the current CPD “a very left-leaning commission” and “a Clinton-Obama type commission.”", "The CPD currently has three co-chairs: Fahrenkopf, Dorothy Ridings, formerly a newspaper journalist, president of the League of Women Voters and president and chief executive officer of the charitable Council on Foundations and Kenneth Wollack, a former president of the National Democratic Institute who once served on the national staff of Democrat George McGovern’s presidential campaign in 1972.", "It’s unclear if the Oct. 15 debate can be salvaged or rescheduled.", "On the night of Oct. 8, Trump’s campaign manager, Bill Stepien released a statement saying, “President Trump’s physician, Dr. Sean Conley, says the President will be medically cleared for ‘safe return to public engagements’ by Saturday, five full days before the originally scheduled debate in Miami on October 15. There is therefore no medical reason why the Commission on Presidential Debates should shift the debate to a virtual setting, postpone it, or otherwise alter it in any way.”", "About a half hour that statement was posted, the debate commission said its decision to hold the debate virtually was made in consultation with medical experts at the Cleveland Clinic recommendation. Fahrenkopf told the Associated Press that it had no plans to concede to Trump’s demand for an in-person debate.", "Editor’s Note: Please consider a donation to FactCheck.org. We do not accept advertising. We rely on grants and individual donations from people like you. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]