["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The Clintons and George Soros are likely bedfellows when it comes to conservative conspiracy theories, and now that union is allegedly official.", "\"Did you know?\" begins a July 22 Facebook post with what looks like a doctored image of Chelsea Clinton and George Soros. \"Chelsea Clinton is married to Mark Mezvinski (sic). Mark Mezvinski is George Soro’s (sic) nephew!!\"", "This post, which includes the words @illuminati killers, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim isn’t a new one, and it was amplified by the actress Roseanne Barr last year when she accused Clinton of being married to Soros’ nephew and tweeted: \"Chelsea Soros Clinton.\"", "Clinton retweeted Barr — Barr’s tweet has since been deleted — and said: \"Good morning Roseanne - my given middle name is Victoria. I imagine George Soros’s nephews are lovely people. I’m just not married to one. I am grateful for the important work @OpenSociety does in the world. Have a great day!\"", "Open Society Foundations is a philanthropic organization founded by Soros.", "Clinton married her husband, Marc Mezvinsky, whose name was misspelled in the Facebook post, in July 2010. Reuters reported that the only high profile guests seen in the town where they married other than former President Bill Clinton and former Secretary of State Hillary Clinton were Madeleine Albright, who served as secretary of state under Bill Clinton, actors Ted Danson and Mary Steenburgen, and fashion designer Vera Wang.", "Mezvinsky is an investment banker and the son of Marjorie Margolies-Mezvinsky and Edward Mezvinsky, both former Democratic members of the U.S. House of Representatives.", "Searching the Nexis database for anything involving the couple, George Soros, and the word \"nephew,\" we found 35 news stories. They were all about Roseanne Barr’s allegation that Clinton is married to Soros’s nephew. And they didn’t corroborate her claim.", "We couldn’t find any evidence to lend credence to this Facebook post. We rate it Pants on Fire!", "Facebook post, July 22, 2019", "Vox, \"Roseanne goes full conspiracy theorist on Chelsea Clinton,\" May 29, 2018", "Chelsea Clinton tweet, May 29, 2018", "The New York Times, \"George Soros smears find new life in Roseanne’s Twitter tantrum,\" May 29, 2018", "Reuters, \"Chelsea Clinton marries in ‘royal wedding,’\" Aug. 2, 2019", "The New York Times, \"Town elbows its way into Clinton wedding,\" July 31, 2010", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]