["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A viral post about living past 90 might leave some readers wondering if they should stock up on wine and stop exercising.", "\"New research says drinking wine is more important than exercise for living past 90,\" said the Jan. 21 headline of a post on higherperspectives.com.", "Spoiler: Drink in moderation; don’t cancel the gym membership.", "The higherperspectives.com post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The claim in the headline isn’t supported in the story — nowhere in it does it say that drinking wine is more important than exercising in order to live a long life. It even includes lines about the importance of working out.", "\"We strongly advise you to have a glass or two of your favorite wine during the day, but make sure you also go for a run or walk first,\" the post said.", "The higherperspectives.com story references a study on aging and dementia, centered on people 90 years and older. The study began in 2003 and is known as The 90+ Study, led by researchers at the University of California-Irvine.", "Some of the findings of The 90+ Study found that people who drank moderate amounts of alcohol or coffee lived longer than those who abstained from it, and that people who were overweight in their 70s lived longer than did normal or underweight people.", "One of the The 90+ Study investigators, Dr. Claudia Kawas, told PolitiFact that they published a paper on alcohol and longevity in 2007 and have not done work in the area since then. It should not be inferred from their studies that alcohol is more important than exercise, she said.", "Kawas at a February 2018 American Association for the Advancement of Science conference also said there was a connection between exercise and longevity.", "\"Exercise, as little as 15 minutes a day was associated with greater longevity,\" Kawas said. \"Thirty minutes was better, 45 minutes was even better than that. And mercifully for couch potatoes like me, three hours (or more) was no better than 45 minutes.\"", "Kawas’ findings don’t say people should prioritize drinking over working out.", "\"Keep in mind that I start studying people when they’re 90,\" Kawas said at the conference. \"I think it’s very likely that individuals who have very excessive alcohol intake at younger ages don’t even make it to their 90s.\"", "The \"About Us\" page on higherperspectives.com said \"everything contained on our website is an opinion formed by a well-informed group — but it’s still just an opinion — not fact or news of the who, what, when, etc.\"", "In this case, the story’s headline is wrong. We rate it False.", "Higherperspectives.com, New research says drinking wine is more important than exercise for living past 90, Jan. 21, 2019", "Email interview, Dr. Claudia Kawas, University of California-Irvine, Jan. 30, 2019", "Eurkealert.org, Why Some Older Adults Keep Memory and Brain Functions Intact, Feb. 17, 2018", "Pubmed.gov, Type of alcohol consumed, changes in intake over time and mortality: the Leisure World Cohort Study, 2007", "Mind.uci.edu, The 90+ Study", "Mcisymposium.org, Risk Factors for Dementia and MCI in the Oldest Old The 90+ Study Claudia H. Kawas, M.D., January 18, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]