["About this rating", "On 27 February 2018, the dubious web site YourNewsWire.com reported that Pope Francis had granted forgiveness and \"covered up\" the acts of 4,444 Australian priests accused of pedophilia:", "The Austrailian commission reported that not only were the priests forgiven by the Vatican for their crimes, allegations were “swept under the carpet” and never reported to law enforcement.", "“Between 1950 and 2010, overall seven percent of priests were alleged perpetrators,”", "“The accounts were depressingly similar. Children were ignored or worse, punished. Allegations were not investigated. Priests and religious (figures) were moved.”", "The item quoted an early 2017 article in the German newspaper Deutsche Welle as its source, which in no way substantiated the claim Pope Francis had forgiven or covered up the acts of 4,444 priests in Australia:", "On Monday, an Australian commission reported that 4,444 alleged incidents of abuse by Catholic priests over a 60-year period had not been investigated. Roughly seven percent of all priests in Australia were accused at least once.", "Canberra set up the Royal Commission into Institutional Responses to Child Sexual Abuse in 2012 following years of mounting pressure to look into the claims of pedophilia.", "\"Between 1950 and 2010, overall seven percent of priests were alleged perpetrators,\" said Gail Furness, the lawyer in charge of questioning at the Sydney inquiry. \"The accounts were depressingly similar. Children were ignored or worse, punished. Allegations were not investigated. Priests and religious (figures) were moved.\"", "Furness added that \"the parishes or communities to which they were moved knew nothing of their past. Documents were not kept or they were destroyed. Secrecy prevailed as did cover ups.\"", "Notably, the Deutsche Welle article never mentioned Pope Francis, only Vatican finance chief George Pell, who the paper reported was implicated in the inquiry. The piece went on to say that the inquiry had found over 1,880 perpetrators, 90 percent of whom were men (about 1,700).", "The commission was set up to look into incidents between 1950 and 2010, three years before Pope Francis's March 2013 election. Predictably, no other outlet (credible or otherwise) made any claims Pope Francis forgave or concealed the actions of 4,444 Australian child predators.", "The Pope has come under fire recently for appointing Juan Barros bishop of Osorno, Chile, after victims accused Barros of covering up sexual abuse by a priest in Santiago.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]