["On April 24 2020, the Ministry of AYUSH promoted a herbal formulation called AYUSH Kwath for ‘immunity boosting’ of the masses for the COVID-19 pandemic. The ministry requested the State/UT governments to “direct the AYUSH Licensing Authorities to consider granting license/approval for manufacturing of AYUSH Kwath formulation to the interested licensed Ayurveda/Siddha/Unani drug manufacturers.”", "The Ministry of AYUSH presents ‘AYUSH KWATH’ formulation as an immunity-enhancing measure for the public.", "Ayush Kwath is a combination of four medicinal herbs commonly used in the Indian kitchen. The formulation has been standardized for commercial manufacturing and pic.twitter.com/46KgH4saUV", "— Ministry of AYUSH (@moayush) April 25, 2020", "The recommended formulation of the AYUSH Kwath (also known as kadha) comprises of:", "Subsequently, on July 4, 2020, Shripad Naik, Minister of AYUSH, Government of India, launched two immunity boosters against the novel coronavirus infection, namely AYUSH Kwath and Giloi Tea manufactured by Vibha Natural Products Ltd, a Mumbai-based company.", "As many people started concocting their own versions of this kadha, the herbal market produced and sold various generic products of AYUSH Kwath. A drug manufacturer Nutriley labelled its AYUSH Kwath upfront with ‘COVID-19’ on its bottle.", "Baidyanath’s advertisement claimed that the individual components of AYUSH Kwath like tulsi and cinnamon increase immunity. Kudos Ayurveda’s advertisement for AYUSH Kwath claimed ‘no side effects of prolonged use’ and ‘no infections’. The advertisement by Naturoveda Organics asks people to “start AYUSH Kwath at the first sign of sore throat or cold-cough”.", "Acharya Manish, an Ayurvedic practitioner also claimed that “AYUSH Kwath works against all symptoms of COVID-19.” The product page of AYUSH Kwath on Shuddhi Ayurveda clinic recommended by the Ministry of AYUSH claims that “AYUSH Kwath is the only approved and possible remedy for COVID-19.”", "This slideshow requires JavaScript.", "False", "Our immune system has two broad components, innate and adaptive immunity, which were explained in our previous Alt News Science article.", "What does it mean to ‘boost’ our immune system against infections?", "‘Immunity booster’ is not a medical term. It is often used in common parlance for foods that have antioxidant properties. But these are a part of a balanced diet which maintain our immune system and general health and do not enhance it beyond what our body innately has to justify the term ‘immunity booster.’ A healthy immune system can only be achieved with adequate sleep, a balanced diet, exercise and adequate sunlight or vitamin D, unless the patient is suffering from an immune system disease such as AIDS, bone marrow cancer or is undergoing other immune-modulatory treatments like chemotherapy or steroids", "Allergies and autoimmune diseases are caused by a hyperactive immune system", "The blanket call for ‘boosting’ the immune system stems from a myopic view of the immune system as a defence system that always protects us from infections. But an otherwise well functioning immune system capable of fighting off infections can also cause a variety of disorders grouped under the term ‘hypersensitivity’. In hypersensitivity disorders, our immune system is over-activated which harms our own body. Examples of these disorders are allergic reactions which are immediate hypersensitivity reactions against substances that are not supposed to cause reactions in healthy patients like nuts, pollens, dust particles and a variety of autoimmune disorders like psoriasis, multiple sclerosis, systemic lupus erythematosus, etc.", "Suppression of the immune system, not ‘boosting’ is required for certain severe COVID-19 cases", "In some patients with severe COVID-19 infection, there is a ‘cytokine storm’ which has been the cause of death in many young and healthy people with no comorbidities like high blood pressure and diabetes.", "Cytokines are protein signalling molecules that mediate and regulate immunity and inflammation. But in various infectious and non-infectious diseases, there is a ‘storm’ of excessive cytokines released in the blood circulation. In COVID-19, this cytokine storm is followed by the immune system attacking the body, which causes ARDS (acute respiratory distress syndrome) and multiple organ failure. In such severe cases, the treatment is geared towards suppressing this overactive immune system to save the patient. Thus, the use of steroids like Dexamethasone to suppress the immune system is recommended at the right time to save the patient from death due to COVID-19.", "Most COVID-19 patients recover on their own and no amount of immunity-boosting can prevent the death of those who succumb", "While most of the COVID-19 patients recover on their own and would not benefit from formulations claiming to be ‘immunity boosters,’ many severe cases of COVID-19 need suppression (instead of a boost) of the immune system through established drugs like dexamethasone.", "While there is no clinical proof of efficacy of Kadha/AYUSH Kwath, it is not desirable to boost the immune system of severe COVID-19 patients, many of whom die of an overactive immune system.", "Only the adaptive immune system can be specific towards a pathogen. Therefore, the immune system can be theoretically enhanced against COVID-19 only from an active method like a vaccine against COVID-19 or a passive method like plasma with antibodies of seropositive patients, i.e. blood component of previously infected and recovered from COVID-19 who have demonstrated COVID-19 antibodies in their blood.", "Thus natural foods/herbs, or even synthetic antiviral drugs, do not equip our immune system with the ability to prevent COVID-19 disease.", "A preprint computer simulation study (i.e, a study that is not tested in humans or animals and the results are not peer-reviewed by other scientists) by Khanal, P. et al. (2020) aims to validate the kadha recommended by the Ministry of AYUSH as an ‘immunity booster’ against severe COVID-19 infection. They identified phytoconstituents from six herbs, including the four herbs that are used in AYUSH Kwath that regulate different pathways of the immune system. It is a study conducted through computer simulation and not one done on any living organism or cells. Thus, this study does not give proof of efficacy for AYUSH Kwath or kadha against COVID-19.", "There are no research studies on the AYUSH Kwath formulation. Therefore, there is no empirical proof, i.e. based on a scientifically validated observation, and not mere theory, of its efficacy against COVID-19.", "Let us look at any available evidence from previous clinical trials related to these herbs for their efficacy in immunomodulation (boosting or suppression) against viral infections. Immunomodulation refers to any process in which an immune response is altered to the desired level, and this may involve suppression of an overactive immune response or vice versa.", "Holy basil", "A double-blinded randomized controlled trial by Mondal S et al. (2011) on 22 healthy volunteers found that there was a statistically significant increase in the levels of various IFN-, IL-4 (which are cytokines) and T-helper cells and NK-cells (which are types of white blood cells) after four weeks in the group that received Tulsi extract in contrast to the placebo group. Given the easier availability of healthy volunteers, a sample size of 22 is too small and further studies would be needed to see if the findings are replicable. And as we have seen, it would actually be harmful if the Tulsi extracts could increase the cytokine levels in severe COVID-19 patients.", "There have been two clinical studies of holy basil against viral infections and both have very poor methodological quality. The first study by Rajalakshmi et al. (1986) studied the effect of Tulsi on 20 viral hepatitis patients. It shows clinical improvement after taking Tulsi but this sample size is very small and there was no control group to compare with. The second study by Das et al. (1983) has a similar drawback of a very small sample size of 14 cases of viral encephalitis. We have explained the impact of small sample size and lack of control groups in clinical studies in our previous Alt News Science article.", "Cinnamon", "We have noted in a previous article at Alt News Science that despite some studies suggesting antibacterial activity of cinnamon against bacteria like Streptococcus mutans and Lactobacillus plantarum and inhibition of fungal infections such as candidiasis, the evidence needed more validation since it is based on flakey preliminary data (Ulbricht, C. et al. 2011). However, there are no clinical studies of cinnamon extracts that show the immunomodulatory effect on healthy individuals or any effects in viral infections.", "Black pepper", "There are no clinical trials that evaluate the efficacy of black pepper against any infection or any immunomodulatory effect. Also, WHO has debunked the claim of using pepper to prevent COVID-19 infection. (see infographic)", "Dry ginger", "There are no clinical trials demonstrating the efficacy of dry ginger in viral infections.", "A pilot study by Stefano, D. et al. (2019) on 10 healthy individuals showed immunomodulatory effects of the combination of Echinacea angustifolia and Zingiber officinale in softgel capsules. They measured the expression of genes in white blood cells (cells responsible for immune function in the blood) of the volunteers and found that after they consumed these softgel capsules, 500 genes were differentially expressed (the process through which the genes makes proteins) in these leukocytes. All these together shifted the leukocyte activity towards suppression of inflammation (which is a response of the immune system). So, contrary to the claims of boosting, the immunomodulation in this study can be similar to the one directed by hydrocortisone administration, a steroid drug used to suppress the immune system.", "Thus, there is no observational validity to deduce that any of these drug components even given as an independent dose will help the COVID-19 patients in any form. Moreover, the dosage of these herbs or the active ingredient concentration that achieves this modulation of immune proteins has not been studied thoroughly.", "Since there is no clinical study done for AYUSH Kwath formulation, the interactions possible among its various active ingredients are unknown. Let us look at a few examples of side effects associated with the individual herbs.", "Cinnamon", "Cinnamon supplements can cause acute hepatitis; cinnamon oil and cinnamon flavoured gum can cause allergic contact dermatitis and other allergic reactions (Hajimonfarednejad, M. et al. 2019).", "Dry ginger", "Preparations made from dry ginger can cause liver damage in certain patients (Suzuki, Y. et al. 2015) and therapeutic use of ginger for nausea and vomiting of pregnancy was associated with a shorter gestational age (duration of pregnancy) and in a smaller circumference of the newborn’s skull (Trabace, L. et al. 2015).", "Black pepper", "Piperine, the main constituent of black pepper, increases the blood levels of various rifampicin, sulphadiazine, tetracycline and phenytoin which may harm certain patients by increasing the side effects of these medications (Velpandian, T. et al. 2001). It also increases the gastric acid secretion, potassium loss, gastric cell exfoliation (erosion) (Srinivasan, K. 2007).", "Holy basil", "Animal studies show that holy basil can increase the bleeding time (the time taken for the blood to clot) (Singh, S. et al. 2001) and decrease blood sugar (Gholap, S. .et al. 2004).", "Therefore, these herbs can cause side effects and interact with synthetic/modern medicines, especially since the ministry recommends them for long-term use with no need for consultation with a doctor.", "While a healthy diet and lifestyle help in maintaining the immunity that we innately possess, there is no way to pop a pill or drink kadha and ‘boost’ the immune system. The term ‘immunity booster’ has no basis in medical science, and yet it remains widely used by the Ministry of AYUSH and the media alike. The market is flooded with ‘immunity boosters’ with everything from khakhra and bread to shirts and beddings claiming to boost our immunity against COVID-19. They divert attention from the harder but proven preventive measures such as social distancing and consistently using masks and washing hands.", "AYUSH ministry has encouraged mass production of formulations like AYUSH Kwath without testing it for efficacy or safety in humans. It seems to be unaware of the potential dangers of ‘boosting’ the immune system in diseases like COVID-19, where an overactive immune system kills patients. The long-term use of AYUAH Kwath could cause various side-effects in healthy individuals as well.", "Thus, there is a lack of clarity in immune-boosting or suppression achievable through the intake of these herbs. The research on individual drugs has not shown any proof that it will affect COVID-19 patients or protect healthy people from getting infected. Moreover, since ‘immune-boosting’ should not be achieved theoretically in patients of COVID-19, the claims of immune-boosting via AYUSH Kwath or kadha may harm infected patients. Since, there is no proof that the concoction will help the patients, kwath or kadha may serve as a ‘feel-good’ warm drink during a sore throat, which is better categorised as a placebo relief.", "References", "Ulbricht, C., Seamon, E., Windsor, R. C., Armbruester, N., Bryan, J. K., Costa, D., … & Grimes Serrano, J. M. (2011). An evidence-based systematic review of cinnamon (Cinnamomum spp.) by the Natural Standard Research Collaboration. Journal of dietary supplements, 8(4), 378-454.", "Trabace, L., Tucci, P., Ciuffreda, L., Matteo, M., Fortunato, F., Campolongo, P., … & Cuomo, V. (2015). “Natural” relief of pregnancy-related symptoms and neonatal outcomes: above all do no harm. Journal of ethnopharmacology, 174, 396-402.", "Suzuki, Y., Yamazaki, Y., Hashizume, H., Oyama, T., Horiguchi, N., Sato, K., … & Yamada, M. (2015). Drug-induced liver injury caused by a dietary supplement (Kin-toki Shoga (®)) made from ginger. Nihon Shokakibyo Gakkai zasshi= The Japanese journal of gastro-enterology, 112(1), 108-114.", "Velpandian, T., Jasuja, R., Bhardwaj, R. K., Jaiswal, J., & Gupta, S. K. (2001). Piperine in food: interference in the pharmacokinetics of phenytoin. European journal of drug metabolism and pharmacokinetics, 26(4), 241–247.", "Singh, S., Rehan, H. M. S., & Majumdar, D. K. (2001). Effect of Ocimum sanctum fixed oil on blood pressure, blood clotting time and pentobarbitone-induced sleeping time. Journal of ethnopharmacology, 78(2-3), 139-143.", "Gholap, S., & Kar, A. (2004). Hypoglycaemic effects of some plant extracts are possibly mediated through inhibition in corticosteroid concentration. Die Pharmazie, 59(11), 876–878.", "Hajimonfarednejad, M., Ostovar, M., Raee, M. J., Hashempur, M. H., Mayer, J. G., & Heydari, M. (2019). Cinnamon: a systematic review of adverse events. Clinical Nutrition, 38(2), 594-602.", "Mondal, S., Varma, S., Bamola, V. D., Naik, S. N., Mirdha, B. R., Padhi, M. M., … & Mahapatra, S. C. (2011). Double-blinded randomized controlled trial for immunomodulatory effects of Tulsi (Ocimum sanctum Linn.) leaf extract on healthy volunteers. Journal of ethnopharmacology, 136(3), 452-456.", "Srinivasan, K. (2007). Black pepper and its pungent principle-piperine: a review of diverse physiological effects. Critical reviews in food science and nutrition, 47(8), 735-748", "Stefano, D. A., Grabnar, I., Verardo, R., Enio, K., Marchionni, L. L., Eddie, L. I., … & Voinovich, D. (2019). Combined extracts of Echinacea angustifolia DC. and Zingiber officinale Roscoe softgel capsules: Pharmacokinetics and immunomodulatory effects assessed by gene expression profiling.", "Khanal, P., Duyu, T., Dey, Y. N., Patil, B. M., Pasha, I., & Wanjari, M. (2020). Network pharmacology of AYUSH recommended immune-boosting medicinal plants against COVID-19.", "Rajalakshmi, S., Sivanandam, G., & Veluchamy, G. (1986). Role of Tulsi (Ocimum sanctum Linn.) in the management of Manjal Kamalai (viral hepatitis). Journal of Research in Ayurveda and Siddha, 9(3-4), 118-123.", "Das, S., Chandra, A., Agarwal, S., & Singh, N. (1983). Ocimum sanctum (tulsi) in the treatment of viral encephalitis (A preliminary clinical trial). Antiseptic, 80, 323-327.", "[Update: The article has been updated with a new featured image, i.e. the image that shows up on social media posts along with the article. The earlier featured image has been replaced after an objection was raised. However, we clarify that the earlier image was representative and had no connection with any organisation or company.]", "Donate Now", "A video of a ladder moving on its own, purportedly from Jharkhand, is viral on…", "In a 2-minute video, a man recommends a “technique” to prevent infection from Omicron, the…", "A video of a set of iron nails that appear to melt after being placed…", "Several social media users have shared an image that shows two columns — ‘Cepa/variante’ (Spanish…", "A 90-second video of a man dissecting a banana has been shared on the internet…."]