["About this rating", "A photograph of a busty woman with a set of tea cups resting on her chest is frequently shared online along with the claim that her name was \"Tea Cup Sallie,\" and that she was a notorious prostitute who reportedly lived sometime in the late 1800s:", "This image is frequently coupled with a second photograph purportedly showing Tea Cup Sallie's \"license for prostitution\": We've found no evidence to support the claim that this woman was a prostitute named \"Tea Cup Sallie,\" and this \"license\" certificate is a modern recreation, not a genuine artifact.", "The \"Tea Cup Sallie\" claim appears to have originated circa 2015 with a post to the WTF section of Reddit. Nearly five years before that posting, however, this photograph was being shared online with a much more mundane claim: The picture simply showed a \"tea lady.\"", "The photograph reached a much wider audience when it was included in a 2014 article on Whizzpast (subsequently aggregated by Bored Panda) concerning silly photographs of people during the Victorian era. From there, it was shared with a variety of captions (some more crude than others) before it was attached to this prostitution license.", "The \"license for prostitution\" has a number of questionable features. For one, the price sticker on the upper-right corner indicates this item was likely available in some sort of gift shop, meaning that this is almost certainly a reproduction and not a genuine artifact from 1898.", "Furthermore, we've found several other copies of \"Tea Cup Sallie's license for prostitution\" that were supposedly issued in several other cities, by several different people (including Wyatt Earp), over the span of more than 40 years from 1876 to 1920:", "The above-displayed images supposedly showed how \"Tea Cup Sallie\" received a prostitution license in Dodge City, Kansas, in 1876; Prescott, Arizona, in 1896; Jerome, Arizona, in 1897 and 1898; and Williams, Arizona, in 1920. Given that the life expectancy during this time period hovered around the age of 50, we're a bit skeptical that this woman had a 44-year prostitution career.", "The certificate appears to be a novelty item loosely based on historical events. In the 1860s, for instance, Nashville's Provost Marshal George Spalding was ordered to round up all of the prostitutes in the city and banish them. The task proved impossible, however, and soon Spalding came up with a new plan: He'd issue licenses and require prostitutes to undergo medical exams:", "Spalding’s proposal was simple: Each prostitute would register herself, obtaining for $5 a license entitling her to work as she pleased. A doctor approved by the Army would be charged with examining prostitutes each week, a service for which each woman would pay a 50 cent fee. Women found to have venereal diseases would be sent to a hospital established (in the home of the former Catholic bishop) for the treatment of such ailments, paid for in part by the weekly fees. Engaging in prostitution without a license, or failing to appear for scheduled examinations, would result in arrest and a jail term of 30 days.", "The prospect of participating in the sex trade without fear of arrest or prosecution was instantly attractive to most of Nashville’s prostitutes, and by early 1864 some 352 women were on record as being licensed, and another hundred had been successfully treated for syphilis and other conditions hazardous to their industry. In the summer of 1864, one doctor at the hospital remarked on a “marked improvement” in the licensed prostitutes’ physical and mental health, noting that at the beginning of the initiative the women had been characterized by use of crude language and little care for personal hygiene, but were soon virtual models of “cleanliness and propriety.”", "While licenses for prostitution weren't totally unheard of, the viral item showing a \"license for prostitution\" is a novelty item that doesn't use a real name, date, location, signatory, or photograph.", "It seems that this certificate is merely a template. The seller can add in a reasonable sounding date and location, a vintage scandalous photograph, and a signature from a well-known figure from the Wild West, and then sell the \"license\" as a novelty item. We found a few other examples of this prostitution license that contain some historical inaccuracies.", "The image on the left uses a piece of currency that was not in circulation at the time the \"license\" was supposedly issued. The image on the right features a woman in Paris, not Kansas:", "The particular example (on the left) is dated as 1898, yet it shows a 1901 bank note that wasn’t actually printed until the 1910s. Someone obviously missed the attention to details. I think the licenses are usually signed by famous wild west lawmen like Wyatt Earp. So long story short, if you see these just understand that they are completely fraudulent and have no collector value.", "In short, the image at the top of this article shows an anonymous woman from the Victorian era who was taking a silly photograph with two tea cups resting on her chest. The claim that this woman's name is \"Tea Cup Sallie\" is not based on any factual information, and the accompanying \"license for prostitution\" is an apocryphal novelty item.", "Serratore, Angela.   \"The Curious Case of Nashville’s Frail Sisterhood.\"\r\n    Smithsonian.   8 July 2013.", "Harris, Kathleen.   \"Picture Power: Proof That Victorians Weren’t as Serious as You Thought.\"\r\n    Whizzpast   22 August 2014.", "Antique Money.   \"License for Prostitution.\"\r\n    Retrieved 16 July 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]