["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The ubiquitous coffee retailer Starbucks buys about 3 percent of the world's coffee beans. (Associated Press)", "Starbucks has a reputation for serving a strong cup of joe, but the ubiquitous coffee retailer’s director of public policy offered a claim on Capitol Hill that turns out to be a thin brew.", "The Senate Foreign Relations Committee invited Starbucks’ Kelly Goodejohn to talk about how doing well can mean doing good. A 20-year veteran of the coffee trade, Goodejohn had some key points for the senators.", "\"Coffee is grown in challenging regions, often with war-torn pasts, but we have seen coffee as a stabilizing force that provides prosperity and economic stability,\" she said.", "Coffee, Goodejohn said, is a big economic deal.", "\"Coffee is the second-most traded commodity after oil, and 25 million farmers around the world rely on income generated from growing coffee,\" she said.", "Holy latte! We’ve all seen coffee take off in America, but are those beans really the other black gold? We decided to check Goodejohn’s ranking of oil and coffee.", "The hard numbers show her statement has been provably incorrect for about as long as Goodejohn has been in the business.", "Comparing the goods Part 1: Market size", "Since oil comes in barrels and coffee beans in 60 kilogram sacks, you can’t just stack them side by side. So the most obvious comparison is the dollar value of the world market for each.", "The United Nations trade statistics branch estimated the oil export market at $788 billion in 2015. The estimate for aluminum was $106 billion, for copper $104 billion, and iron ore and concentrates $67 billion.", "Calculating the world market for coffee is a little trickier because the United Nations trade data lumps coffee in with other products that contain even just a trace of coffee, such as powdered mixes.", "With help from John Baffes, senior economist at the World Bank’s Development Prospects Group, we estimated the size of the coffee export market at about $19 billion. (We got the amount of coffee sold from the International Coffee Organization and the average price per kilogram from the World Bank. Baffes confirmed our math.)", "The Starbucks press office pointed to a report by the International Institute for Sustainable Development that estimated the total market at $23 billion.", "The keen observer will note that the coffee market is about one-fourth as large as the markets for aluminum and copper, and also less than the market in iron ore.", "But what about other agricultural products? Based on sales data from the U.S. Agriculture Department and the World Bank’s price data, the world market for wheat was $29 billion and for soybeans, $57 billion. Both beat out coffee.", "Baffes, who co-authored a report on global commodity markets in 2000, said the claim about coffee being second only to oil is old news.", "\"This used to be the case back in 1970,\" Baffes said. \"However, later grains and metals overtook coffee.\"", "In that 2000 report, coffee ranked 15th, bested by, among others, hardwood logs, bananas and gold.", "Over the years, there have been several efforts to correct the record.", "Science writer Mark Pendergrast included the errant claim in his 1999 book Uncommon Grounds: The History of Coffee and How It Transformed Our World. Ten years later, he wrote a correction (and fixed the error in the second edition).", "\"I was wrong, and so is everyone else who keeps repeating this myth,\" he wrote in 2009.", "Voices in the coffee industry itself have also tried to rebut the claim.", "At one time, coffee represented the second-most valuable commodity exported by developing countries, but there’s no evidence that’s still the case.", "Comparing the goods Part 2: Futures trading", "When we asked the Starbucks organization for the source behind Goodejohn’s claim, the press office suggested we look at a webpage on commodities trading. The site is a consumer guide to investing in commodities, and it said, \"Coffee is the most traded commodity after oil.\"", "This seemed to suggest that Starbucks had another yardstick in mind -- the number or value of coffee contracts bought and sold by investors. In other words, we shouldn’t measure the amount of actual coffee or costs, but the bets on coffee prices.", "We found several similar websites that repeat the claim, such as Investorguide.com, Economics.help and a Kenyan-based training group called Institute of Trade Development. None of these sites say how they reached this conclusion.", "In contrast, the Futures Industry Association, a reliable source of commodity trading data, posts annual data. In its 2016 survey of the number of contracts traded, soybeans and rapeseed meal (or canola meal) top the list of the 20 highest volume-traded agricultural contracts. Coffee contracts don’t show up in the top 20.", "Coffee Co-mission, a group of small coffee roasters based in Winston-Salem, N.C., went through this comparison in 2015 and found that among commodities \"whether the measure is by quantity or value, coffee does not even make the top 100.\"", "Pendergrast said, \"I don't think that this urban coffee myth has ever been true, regardless of how you look at it.\"", "Our ruling", "A Starbucks executive said coffee is the second-most traded commodity after oil. We examined it two ways, and the statement failed on both.", "The markets for several commodities including soybeans, wheat, aluminum, copper and iron ore are larger than the coffee market -- in some cases, four times larger.", "The statistic also falls short in terms of the commodity contracts traded by investors. Both the number of coffee contracts traded and the value of contracts are much lower than for many other commodities.", "This claim has been challenged since 2000 by economists, journalists and voices in the coffee industry. But it still found its way into a congressional hearing despite being very, very wrong. We rate it Pants on Fire!", "Senate Foreign Relations Committee, Hearing on International Development: Value Added Through Private Sector Engagement , May 4, 2017", "Global Coffee Report, Coffee trade: a basic lesson on the economics of the price of coffee, March 2011", "Coffee Co-mission, MYTH: Coffee is Among the Most Traded Commodities on Earth, March 24, 2015", "Tea and Coffee Trade Journal, Coffee second only to oil?, April 1, 2009", "U.S. Agriculture Department Foreign Agricultural Service, Export data, accessed May 5, 2017", "U.S. Agriculture Department Foreign Agricultural Service, World production, markets and trade reports, accessed May 5, 2017", "United Nations, Trade statistics - commodities, 2015", "International Coffee Organization, Trade statistics, accessed May 5, 2017", "John M. Talbot, Grounds for Agreement: The Political Economy of the Coffee Commodity Chain, 2004", "World Bank, Global commodity markets, April 2000", "Futures Industry Association, 2016 Annual volume survey, March 2017", "Economics.help, Most traded commodities, Nov. 28, 2014", "Tradecommodities.co.uk, The most common commodities to trade, June, 2010", "Institute of Trade Development, Coffee, accessed May 6, 2017", "Global Exchange, Coffee FAQ, accessed May 6, 2017", "Investorguide.com, What are the Most Commonly Traded Commodities?, accessed May 6, 2017", "Email interview, John Baffes, senior economist, World Bank Development Prospects Group, May 5, 2017", "Email interview, Mark Pendergrast, author, Uncommon Grounds: The History of Coffee and How It Transformed Our World, May 7, 2017", "Email interview, press office, Starbucks, May 5, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]