["About this rating", "As Canada officially legalized the recreational use of marijuana, experts speculated about how the new law would impact the country. Would it generate billions of dollars in sales and tax revenues? Would it reduce crime? Would it increase drug use? Or would it give the entire country an unquenchable case of the munchies?", "On 18 October 2018, the World News Daily Report (WNDR) website addressed the last question by publishing an article reporting that the legalization of marijuana in Canada had produced an unintended consequence -- a donut shortage:", "The legalization of marijuana in Canada had unintended consequences on several Tim Horton’s [sic] stores which were forced to close because of shortages in donuts and pastries.", "17 Tim Horton’s in seven different provinces were forced to close earlier than usual for lack of staff and the shortage of donuts and pastries, reported one spokesman for the company.", "Tim Horton spokesman James Dyke said that he had no explanation for the unexpected hike in demand for goods offered by the popular coffee shop franchise but that some had suggested it could be linked to the recent legalization of cannabis.", "Of course, this report was not a genuine news story. World News Daily Report is an entertainment web site with a long history of publishing junk news. The site carries a disclaimer stating that that all of its content is \"fictional.\"", "Canada did not face a donut shortage due to increased cases of the munchies, but this bit of fiction was vaguely reminiscent of a news story reported by CNN in which a 9-year-old girl set up shop outside of a dispensary to sell Girl Scout cookies to cannabis-loving Canadians and sold out of her supply within the hour:", "Canada legalized recreational pot this week and its dispensaries weren't the only ones with a business plan. A Girl Scouts Brownie -- and budding entrepreneur -- knew exactly where her best sales would come from.", "Elina Childs, 9, stood outside an Edmonton dispensary Wednesday and sold all her cookies to those enduring 4-hour lines during the country's first day of legal marijuana sales.", "In the past, Elina has sold her cookies door-to-door and that took weeks, her dad said ...", "\"While driving, we saw how long the lines were at the dispensary, and we just stopped to sell the cookies there.\"", "Elina sold out her stock in just 45 minutes, making a total of $120 (US $91).", "\"She didn't quite understand what the big deal was,\" Childs said. \"She was just selling cookies in her mind, but everyone was so happy to see her, and kept congratulating her.\"", "World News Daily Report wasn't the only entertainment web site to publish a bit of cannabis comedy after Canada legalized marijuana. The entertainment web site The Daily Bonnet (satirically) reported that the country was able to pay off the national debt within 24 hours of legalizing the sale of pot.", "Haridy, Rich.   \"Legal Marijuana: The World Watches as Canada’s Massive Social Experiment Begins.\"\r\n    New Atlas.   20 October 2018.", "World News Daily Report.   \"Canadians Face Major Donut Shortage After First Day of Cannabis Legalization.\"\r\n    18 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]