["By Vanessa Schipani", "Posted on September 20, 2016", "Senate Minority Leader Harry Reid claimed that Zika “affects everyone” — not just pregnant women and their babies — because recent research found that it “causes people to go blind.” That’s false. Temporary vision impairment is a symptom of Zika, but no adults have gone blind because of the virus.", "In fact, one author of a study cited by Reid’s office told us his study “did not claim” that Zika causes blindness. The study found that the virus “infects specific target cells in different regions of the eye.” Some infected mice in the study experienced inflammation, but none went blind.", "However, studies have shown that severe vision impairment is a Zika-related birth defect.", "The Zika epidemic first began in Brazil in May 2015. The World Health Organization declared the outbreak a global public health emergency in February 2016. The first locally acquired infections in the U.S. were reported in Puerto Rico on Dec. 31, 2015, and in Florida on July 29, 2016.", "On Aug. 12, the U.S. Department of Health and Human Services declared a public health emergency in Puerto Rico. On Aug. 1, the Centers for Disease Control and Prevention also advised pregnant women to avoid an area of Miami where health officials had identified local Zika transmission. The CDC defines a “local” case as one transmitted through a mosquito bite on U.S. soil.", "Zika spreads “primarily through the bite of an infected Aedes species mosquito,” says the CDC. The virus can also be transmitted from mother to child during pregnancy and through sex and blood transfusions. However, the CDC is investigating whether Zika also spreads via bodily fluids, such as saliva, vomit or urine.", "On Feb. 22, President Obama submitted a request to Congress for $1.9 billion in emergency funding to combat Zika, but Republicans and Democrats in Congress have yet to agree on legislation. In the partisan battle, Republicans and Democrats, including Reid, have blamed each other for stalling the legislation, although a compromise could come as early as today.", "Reid made some additional comments concerning Zika that aren’t exactly accurate. We will address those, too, but first we will focus on his claim about blindness.", "Reid exaggerated what scientists know about the health effects of Zika on vision on at least three occasions — on the Senate floor, while answering questions posed by the press and during a news conference.", "Reid, Sept. 7, on the Senate floor: One of America’s pronounced scientists today said that now Zika affects everybody. Zika is now infecting eyes – the virus goes in people’s eyes and leads to vision impairment and blindness. So it’s not just women of child-bearing age. It is going to affect a lot of people.", "Reid, Sept. 7, answering press questions: One of the op-eds today was from a physician, well known, reputable professor. He said he’s very concerned because they keep finding new things that this virus affects. For example, eyes. Now, in certain cases, they’ve proven that the virus goes into people’s eyes and certainly impairs your vision and causes people to go blind. … It doesn’t affect only women of child-bearing age. It affects everyone.", "Reid, Sept. 8, during a news conference: Yesterday we learned that scientists have found that the Zika virus goes into people’s eyes causing blindness and a lot of visual impairment.", "To be clear, many people who contract Zika have little or no symptoms. When individuals do have symptoms, they last around a week and can entail fever, rash, joint pain and conjunctivitis, or pinkeye.", "But “Zika infection during pregnancy can cause serious birth defects and is associated with other pregnancy problems,” explains the CDC. Zika can cause underdeveloped heads and brains (microcephaly) in newborns. The virus is also “linked to other problems in infants,” such as eye defects, hearing loss and impaired growth.", "When we contacted Reid’s office, Dan Yoken, Reid’s deputy communications director, referred us to a Wall Street Journal op-ed by Ian Lipkin, a professor of epidemiology at Columbia University.", "Lipkin’s piece mentions nothing about Zika-related blindness or vision impairment in adults or newborns, though he does discuss the potential wider societal costs of a generation of children born with Zika-related defects.", "Yoken also referred us to two research papers, one published in Cell Reports on Sept. 6, and another published in The New England Journal of Medicine on July 28. Neither of them directly supported Reid’s claims about Zika and blindness.", "In fact, we contacted the authors of the first paper, and Michael S. Diamond, an expert in infectious diseases and virology at Washington University in St. Louis, told us his study “did not claim” that “the Zika virus goes into people’s eyes causing blindness and a lot of visual impairment,” as Reid said.", "What did the researchers find?", "After infecting mice under the skin with Zika, the group found that the virus “infects specific target cells in different regions of the eye.” The scientists also uncovered Zika’s genetic material in the tears of mice, which suggests the virus could be transmitted through this bodily fluid. Like humans, some infected mice in their study experienced inflammation in different regions of the eye, including conditions such as panuveitis and conjunctivitis, or pinkeye. None of the mice went blind.", "It’s worth noting that a study published in the Journal for the American Medical Association Ophthalmology on Sept. 15 confirmed Zika genetic material on the eyes of human adults.", "The July study cited by Reid’s office outlined the case of a man in his early 40s whose vision in one eye dropped from 20/40 to 20/60 acuity after contracting Zika, a condition called uveitis. After treatment, the man’s vision returned to 20/40. In other words, he didn’t go blind, and his vision was only impaired temporarily. If untreated, this condition can lead to permanent vision loss.", "Likewise, the September Cell Reports paper also explains, “The most common form of ZIKV-induced ocular disease is conjunctivitis, which occurs in 10% to 15% of [human] patients, but whether conjunctivitis is a direct consequence of ZIKV infection of the eye is not known. In contrast, ZIKV-induced uveitis is less common, although it has been described in humans.”", "When we contacted Reid’s office again to point out that the cited research didn’t support Reid’s claims, Yoken responded by stating, “We don’t yet know all the effects of the Zika virus. Senator Reid was citing published research into the virus that has raised questions about Zika and how it affects vision and the eye. Sen. Reid could have been more exact in describing the results of the [Cell Reports] study.”", "We agree on all accounts.", "It’s worth mentioning that at least three studies have shown that mothers infected with Zika during pregnancy can give birth to babies with severe vision impairment. However, the generalizability of these studies is limited, given that one study evaluated vision impairment in one child, a second study examined three children, and a third study evaluated 29 babies. The last study found vision abnormalities in roughly a third of the babies considered.", "An author on the third study, Rubens Belfort Jr., told CNN, “These are severe retina lesions that will impede the ability of the children [in his study] to see well.” An expert in ophthalmology at the Federal University of Sao Paulo in Brazil, he added, “Many of these children could be blind.”", "In fact, on Sept. 6, Reid did correctly summarize Zika-related birth defects when he said on the Senate floor that newborns with Zika also suffer from “vision impairment.”", "To be clear, we do not aim to minimize the gravity of the Zika epidemic. And we agree with Reid when he said that “we need more study” in order to understand the effects of the virus on both newborns and adults. But at present, there isn’t conclusive research to support Reid’s statements on Sept. 7 and 8.", "On Sept. 6 on the Senate floor, Reid said, “2,000 Puerto Ricans are infected each week” with Zika. The number of new Zika cases peaked at roughly 1,900 infections in the second week of August, according to the territory’s health department.", "As of Sept. 15, Puerto Rican health officials have confirmed 19,967 cases of Zika infection total. The U.S. territory also has seen one fetus born with Zika-related birth defects.", "When we asked about Reid’s claim, Yoken cited a Sept. 2 article from NBC’s Dallas-Fort Worth station, which states: “Some 2,000 people a week are getting infected and, if current trends hold, a quarter of the island’s 3.5 million people could get Zika by the end of this year, according to the Centers for Disease Control and Prevention.”", "But as of Sept. 14, the CDC also stated: “The Puerto Rico Department of Health is retroactively reporting cases, resulting in larger than normal increases in cases in recent weeks.” The territory has seen roughly 570 new infections on average each week since the first case was confirmed on Dec. 31, 2015.", "To be clear, the number of actual infections may be higher than the number of reported cases. For example, CDC Director Tom Frieden told STAT, a health and science news website, in June that as many as 2 percent of adults in the territory could be infected monthly.", "While Reid’s statement may turn out to be correct once all the data come in, at this point 2,000 cases per week is not quite right.", "Reid also claimed, “The Centers for Disease Control predict by the end of the year 25 percent of Puerto Rico’s population will be infected by Zika.” But that’s a worst-case scenario prediction, the CDC told us.", "Yoken of Reid’s office pointed us to a Wall Street Journal article from June 8 that did state, “The Centers for Disease Control and Prevention estimates 25% of Puerto Rico’s 3.5 million population will be infected with Zika by the end of 2016,” quoting Tyler Sharp, a CDC epidemiologist based in San Juan.", "But Benjamin Haynes, a spokesman for the CDC, told us by email, “The projection of 25% was based on ‘worst case’ projections based on weekly incidence and looking at the spread of chikungunya in previous outbreaks. Obviously interventions can affect that number and it’s too soon to tell. The projection was more of a ‘could be’ if the rates of transmission continued to accelerate at the same pace. That also assumes there are no interventions or preventive measures in place to slow the spread of the virus.”", "Lastly, Reid exaggerated the extent to which Zika has spread in the continental U.S. when he said, “Local transmission of Zika was confirmed in Florida and elsewhere.”", "According to the CDC, local transmission of the virus has taken place only in Florida. As of Sept. 15, the state’s health department has reported 77 locally acquired Zika infections. Ten non-Florida residents have also contracted the virus while visiting the state.", "Yoken told us by email that “Senator Reid misspoke” when he said “and elsewhere,” pertaining to Zika’s spread in the continental U.S. “This was corrected in our released remarks,” Yoken added.", "Editor’s Note: SciCheck is made possible by a grant from the Stanton Foundation.", "https://www.sharethefacts.co/share/b592ca8f-988f-42b8-a780-6c1ec5d7d303", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]