["Property taxes are one of the usual go-to sources to gripe about the high cost of living in New Jersey. But there's dozens of other taxes and fees ripe for the picking.\n\nBuying new tires? Working on your tan? Looking to blow something up -- legally?\n\nAll that will cost a little something extra.\n\nAnd a decade of Democratic control in state government is to blame, according to Republican state Sen. Tom Kean Jr.\n\n\"Over the past 10 years, Democrats have been in control of the Legislature and have done a disservice to New Jersey workers and their families by raising taxes over 115 times, making New Jersey increasingly unaffordable and chasing jobs to neighboring states,\" Kean said in an Oct. 7 news release.\n\nPolitiFact New Jersey has heard the claim that Democrats increased taxes 115 times before -- and we’ll probably hear it again. But is it true?\n\nA list of the 115 tax increases that John Gorman, a Senate Republican spokesman, sent us included a mix of tax increases, fee hikes and tax policy changes between fiscal years 2003 and 2010. And though the vast majority of the bills were sponsored by only Democrats, a few had Republican support.\n\nAlso, some of the increases -- whether they were taxes or fees -- were temporary and have expired. But since they went up, if only for a short period, we think it’s still fair to call that an increase.\n\nThe state increased the sales tax from 6 percent to 7 percent in 2006. The legislation that hiked that tax also extended its reach, applying the tax to investigation and security services, tanning and limousine services, among other items and services.  \n\nThe gross income tax was increased in 2004 for taxpayers with income exceeding $500,000  and in 2009 for taxpayers with income exceeding $400,000.\n\nAnd smokers couldn’t have missed the multiple increases on cigarette taxes between 2002 and 2009.\n\nBut among the 115 \"tax increases\" were a number of fee hikes -- measures that cost some residents more money but are arguably not a tax increase.\n\nOf those were a bill passed in 2008 that increased the maximum fees for permits to manufacture, store, sell or use explosives and a 2004 law that imposed a $1.50 fee on the sale of a new motor vehicle tires.\n\nOverall, Gorman provided a list that showed under Democratic majorities, there were dozens of increases in taxes or fees or other tax policy changes that could result in individuals or businesses paying higher taxes. Kean would be more accurate if he said taxes and fees were increased 115 times, but his number isn’t wildly off.\n\nNow let’s assess Kean’s larger point that tax increases drove jobs from New Jersey to neighboring states.\n\nGorman sent a handful of surveys and studies that show New Jersey’s poor standing in the nation for its business and tax climate. A 2009 report by the Pew Center on the States said, \"While its proximity to New York City and its educated workforce are appealing to many employers, New Jersey has been ranked the least friendly state for business four years running, largely because of its heavy tax burden.\"\n\nThat’s a valid point, but there are a number of factors involved in the creation and destruction of jobs.\n\nNancy Mantell, director of the Rutgers Economic Advisory Service, said \"so many different things\" are involved that you can’t just point to one factor as the reason for New Jersey’s job losses.\n\nAlso, we previously researched a similar claim by another Republican state senator that blamed Democratic tax hikes for private-sector jobs losses in the last decade. Considering the impact of the recession on employment, we determined that tax hikes aren’t the only factors involved.\n\nOur ruling\n\nKean said Democrats raised taxes over 115 times in the past 10 years, \"making New Jersey increasingly unaffordable and chasing jobs to neighboring states.\"\n\nUnder Democratic control of the state Legislature and governor’s office, the state saw nearly 115 increases in taxes and fees or other tax policy changes. But Kean can’t attribute a loss of jobs in New Jersey solely to those changes.\n\nWe rate his statement Half True.", "To comment on this ruling, go to NJ.com.", "New Jersey Senate Republicans, Kean: All 16 GOP Senators Named \"Taxpayer Champions,\" Oct. 7, 2011\n\nEmail interview with John Gorman, spokesman for the New Jersey Senate Republicans, Oct. 11-14, 2011\n\nNew Jersey State Legislature, Bill Search, accessed Oct. 13, 2011\n\nInterview with Nancy Mantell, director of the Rutgers Economic Advisory Service, Oct. 14, 2011\n\nPolitiFact New Jersey, Sen. Steve Oroho claims Democratic tax hikes are to blame for private-sector job losses in New Jersey over the last decade, July 12, 2011\n\nU.S. Bureau of Labor Statistics, Employment, Hours, and Earnings - State and Metro Area, accessed Oct. 13 & 14, 2011\n\nPolitiFact New Jersey, breakdown of Republican list of tax increases, Oct. 14, 2011\n\nNew Jersey Department of Treasury, Tax Legislation, accessed Oct. 14, 2011\n\nThe Pew Center on the States, Beyond California: States in Fiscal Peril, Nov. 11, 2009\n\nBeacon Hill Institute, Tenth Annual State Competitiveness Report, 2010\n\nForbes.com, The Best States for Business, Sept. 23, 2009\n\nSmall Business & Entrepreneurship Council, Business Tax Index 2011: Best to Worst Tax Systems for Entrepreneurship and Small Business, accessed Oct. 14, 2011\n\nCFO Magazine, Stingers: The 2004 State Tax Survey, Jan.1, 2004\n\nChiefExecutive.net, Best/Worst States for Business, May 3, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]