["About this rating", "In September 2018, NRATV (the National Rifle Association's television channel) caused controversy when they digitally added Ku Klux Klan hoods to trains from the long-running children's television program Thomas and Friends during a segment about gender and racial diversity.", "The segment in question was aired on 7 September 2018, during NRA spokesperson Dana Loesch's show \"Relentless.\" The episode is no longer available, though clips are included in the following video:", "Loesch was addressing a recent development on Thomas and Friends which saw two female characters (one of them from Africa) added to the show to bolster its international appeal and give more prominence to female characters:\nAnnouncing a new direction for the Thomas and Friends TV show, Mattel said that several changes to the 30-year-old show would help to update the brand’s image and popularity, particularly in Africa and Asia, where the characters and stories were hugely popular.\nChanges include some new female characters, including Nia, a train engine from Kenya, and Rebecca, a strong-willed, outspoken electric locomotive. Other female characters include an aeroplane from Australia and an Indian train yard controller. The changes are all an effort to modernise the Thomas brand and give it a distinctive international flavour.\n“We have added new female characters before, but I think, with a show like Thomas, they tend to fall into the background after initial introduction,” said Thomas and Friends producer Ian McCue. “What we wanted to do here was really bring these two female characters to the forefront.”\nAnother of the show’s producers, Micaela Winter, said gender equality was important to the creators in the new series and going forward.\nHere are the relevant excerpts from Loesch's monologue on the subject, along with the imagery shown on screen along the way:\n\nAnyway, [the producers of Thomas and Friends] have decided that the next stop is \"virtue town.\" Thomas the Tank is now bringing gender balance to the show by adding girl trains. Seriously. One of those trains, Nia, will be from Kenya to add ethnic diversity to the show. By the way, that's where it gets really strange to me because I've looked at Thomas and Friends, at their pictures, and they seem grey and blue. Am I to understand this entire time that Thomas and his trains were white? Because they all had grey faces. How do you bring ethnic diversity?\n\nI mean they had to paint what I guess they thought was some kind of African pattern on the side of Nia's engine? I mean, how do you bring ethnic diversity to a show that literally has no ethnicities, because they're trains! They don't even have skin pigmentation! Was there some concern that the show had racist undertones? Because, I mean, Sir Topham Hatt clearly is white, but the trains? I'm looking at this picture, and I'm really really struggling to understand how in the world there isn't any diversity in any of this ...\n\n[Reacting to Ku Klux Klan hoods on screen] Oh. Was it because? I see it. It was the white hoods and the burning train tracks. Ok fine, fair point, I get it. Thomas the Tank Engine has been a blight on race relations for far too long. Clearly, this is overdue, right?\nSo the segment was structured as a joke: Loesch expressed outrage and bafflement about the introduction of female characters, including one from Kenya, then questioned whether the producers of Thomas and Friends were compensating for some previous racism on the show. The fake \"Ku Klux Klan\" image provided a punchline of sorts, with Loesch then theatrically \"accepting\" that there was, in fact, a need for greater diversity on the show.\nLoesch made some notable omissions and errors in her monologue. First, although she claimed that the show's producers were \"bringing gender balance to the show by adding girl trains,\" Thomas and Friends (and its spin-offs) have featured female characters (including trains) for many years.\nSome of those characters, including Gina and Frieda, were introduced in the 2016 film The Great Race, but others have been a part of the Thomas universe for much longer. Emily first appeared on the show in 2003, and Annie and Clarabelle (a pair of passenger coaches) were in the original 1946 book Thomas the Tank Engine and the subsequent television series.\nSecond, Loesch failed to mention that the new initiative was part of a collaboration between the United Nations and Mattel, the toy company that own sthe Thomas the Tank Engine brand, to promote five of the U.N.'s 17 \"Sustainable Development Goals\":\n﻿ \nIn a press release, Mattel said that newest season of the show would see the characters travel beyond the fictional world of Sodor, to locations in China, India and Australia, and would see the introduction of several new (mostly female) characters from diverse racial and ethnic backgrounds and nationalities:\nThe series will feature characters from around the world, including the new African steam engine from Kenya called Nia, Ashima from India, Yong Bao from China, and Shane from Australia, as well as host of new female characters ... including Isla, an Aussie flying doctor plane, Noor Jehan, a royal express engine from India, and Hong-Mei, a Number 1 Blue Tank Engine from China.\nIn response to NRATV's \"Ku Klux Klan\" segment, Mattel issued a statement saying that \"We are not associated with images that promote hate and denounce any images of our brands that are being used to convey a message not in line with the values of the company.\"", "Loesch was addressing a recent development on Thomas and Friends which saw two female characters (one of them from Africa) added to the show to bolster its international appeal and give more prominence to female characters:", "Announcing a new direction for the Thomas and Friends TV show, Mattel said that several changes to the 30-year-old show would help to update the brand’s image and popularity, particularly in Africa and Asia, where the characters and stories were hugely popular.", "Changes include some new female characters, including Nia, a train engine from Kenya, and Rebecca, a strong-willed, outspoken electric locomotive. Other female characters include an aeroplane from Australia and an Indian train yard controller. The changes are all an effort to modernise the Thomas brand and give it a distinctive international flavour.", "“We have added new female characters before, but I think, with a show like Thomas, they tend to fall into the background after initial introduction,” said Thomas and Friends producer Ian McCue. “What we wanted to do here was really bring these two female characters to the forefront.”", "Another of the show’s producers, Micaela Winter, said gender equality was important to the creators in the new series and going forward.", "Here are the relevant excerpts from Loesch's monologue on the subject, along with the imagery shown on screen along the way:", "Anyway, [the producers of Thomas and Friends] have decided that the next stop is \"virtue town.\" Thomas the Tank is now bringing gender balance to the show by adding girl trains. Seriously. One of those trains, Nia, will be from Kenya to add ethnic diversity to the show. By the way, that's where it gets really strange to me because I've looked at Thomas and Friends, at their pictures, and they seem grey and blue. Am I to understand this entire time that Thomas and his trains were white? Because they all had grey faces. How do you bring ethnic diversity?", "I mean they had to paint what I guess they thought was some kind of African pattern on the side of Nia's engine? I mean, how do you bring ethnic diversity to a show that literally has no ethnicities, because they're trains! They don't even have skin pigmentation! Was there some concern that the show had racist undertones? Because, I mean, Sir Topham Hatt clearly is white, but the trains? I'm looking at this picture, and I'm really really struggling to understand how in the world there isn't any diversity in any of this ...", "[Reacting to Ku Klux Klan hoods on screen] Oh. Was it because? I see it. It was the white hoods and the burning train tracks. Ok fine, fair point, I get it. Thomas the Tank Engine has been a blight on race relations for far too long. Clearly, this is overdue, right?", "So the segment was structured as a joke: Loesch expressed outrage and bafflement about the introduction of female characters, including one from Kenya, then questioned whether the producers of Thomas and Friends were compensating for some previous racism on the show. The fake \"Ku Klux Klan\" image provided a punchline of sorts, with Loesch then theatrically \"accepting\" that there was, in fact, a need for greater diversity on the show.", "Loesch made some notable omissions and errors in her monologue. First, although she claimed that the show's producers were \"bringing gender balance to the show by adding girl trains,\" Thomas and Friends (and its spin-offs) have featured female characters (including trains) for many years.", "Some of those characters, including Gina and Frieda, were introduced in the 2016 film The Great Race, but others have been a part of the Thomas universe for much longer. Emily first appeared on the show in 2003, and Annie and Clarabelle (a pair of passenger coaches) were in the original 1946 book Thomas the Tank Engine and the subsequent television series.", "Second, Loesch failed to mention that the new initiative was part of a collaboration between the United Nations and Mattel, the toy company that own sthe Thomas the Tank Engine brand, to promote five of the U.N.'s 17 \"Sustainable Development Goals\":", "﻿", "In a press release, Mattel said that newest season of the show would see the characters travel beyond the fictional world of Sodor, to locations in China, India and Australia, and would see the introduction of several new (mostly female) characters from diverse racial and ethnic backgrounds and nationalities:", "The series will feature characters from around the world, including the new African steam engine from Kenya called Nia, Ashima from India, Yong Bao from China, and Shane from Australia, as well as host of new female characters ... including Isla, an Aussie flying doctor plane, Noor Jehan, a royal express engine from India, and Hong-Mei, a Number 1 Blue Tank Engine from China.", "In response to NRATV's \"Ku Klux Klan\" segment, Mattel issued a statement saying that \"We are not associated with images that promote hate and denounce any images of our brands that are being used to convey a message not in line with the values of the company.\"", "Melas, Chloe.   \"NRA TV Depicts 'Thomas & Friends' Characters in KKK Hoods.\"\r\n    CNN.   14 September 2018.", "Burke, Michael.   \"NRA Depicts Children's Show Characters in KKK Hoods to Criticize Cast Diversity.\"\r\n    The Hill.   12 September 2018.", "Chokshi, Niraj.   \"N.R.A. Show Puts Thomas the Tank Engine in White Hood to Criticize Diversity Move.\"\r\n    The New York Times.   12 September 2018.", "The United Nations.   \"United Nations, Thomas and Friends Launch SDG Collaboration.\"\r\n    The United Nations.   7 September 2018.", "Mattel.   \"Thomas & Friends Launches Collaboration with the United Nations to Inspire the Next Generation of Global Citizens.\"\r\n    7 September 2018.", "Sept. 5, 2019: Added a note that the NRA TV episode is no longer available, but clips are included in the video in this story.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]