["About this rating", "Actor Jussie Smollett was embroiled in a controversy in February 2019 after he told police he had been assaulted on the streets of Chicago in a possible hate crime. While law enforcement was looking into these claims, rumors circulated that the Empire actor had orchestrated the attack.", "On 18 February 2019, the Babylon Bee website added their own fictional twist to this story when they published an article reporting that Smollett had been offered a job at the CNN.", "The network, according to the Babylon Bee, was reportedly impressed with Smollett's ability to fabricate a story out of thin air:", "While Empire actor Jussie Smollett has been having a tough week so far, there appears to be a silver lining: cable news channel CNN has offered Smollett a job as an investigative reporter and on-air anchor after witnessing his skills at fabricating a story entirely out of thin air.", "CNN producers were reportedly impressed throughout the ongoing saga of Smollett's apparent hoax attack on himself. They realized early on the facts didn't add up but were fascinated with how well the actor kept the narrative going. An HR rep quickly reached out to Smollett to see if he'd be interested in taking on a position at the news organization after news broke that the entire thing was probably fabricated.", "This was not a genuine news story, although some readers mistook it for such. The Babylon Bee is a satirical website whose disclaimer notes that \"The Babylon Bee is Your Trusted Source For Christian News Satire.\"", "Babylon Bee.   \"Jussie Smollett Offered Job at CNN After Fabricating News Story Out of Thin Air.\"\r\n    18 February 2019.", "Deb, Sopan.   \"Jussie Smollett Timeline: Mystery Deepens as Police Review Case.\"\r\n    The New York Times   17 February 2019.", "Sakuma, Amanda and German Lopez.   \"Hate Crime or Hoax? The Drama Behind the Jussie Smollett Case, Explained.\"\r\n    Vox   19 February 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]