["The images were published in a Facebook post here on August 6, 2020.", "The post, which has been shared more than 960 times, reads: “If this is created on the outside of your head underneath the mask, guess what’s going on inside of your body, your mouth, your throat, your lungs!!!", "“Think about all the people that have to wear a mask all day for work, what the hell are we putting them through!!!”", "The images appeared alongside a similar claim in Facebook posts here, here, here and here.", "The claim, however, is misleading; only two of the images relate to wearing face masks.", "Chickenpox image", "The photo in the bottom left-hand corner of the post was originally published as a stock image here on Getty Images.", "The image’s caption states it shows a child with chickenpox, or varicella, a highly-contagious viral disease caused by the initial infection with varicella zoster virus (VZV).", "According to the World Health Organization (WHO), “VZV is highly transmissible via respiratory droplets or direct contact with characteristic skin lesions of the infected person.”", "Eczema herpeticum image", "The photo in the top right-hand corner of the post was uploaded here on Wikipedia on April 11, 2018 -- more than 18 months before the first major outbreak of the novel coronavirus in the Chinese city of Wuhan in December 2019.", "According to the caption, the photo shows a child suffering from eczema herpeticum. The condition is caused by a virus which can lead to severe reactions in people already suffering from eczema.", "The same photo appears to show eczema herpeticum on this page of the Royal Children’s Hospital in Melbourne, Australia.", "Medical worker image", "The image in the middle on the right-hand side of the post shows Italian nurse Valeria Zedde, who posted the same photo here on Instagram on March 13, 2020. It shows the marks caused by personal protection equipment she wore for her shift.", "The post’s Italian caption translates to English as: “We leave six hour shifts with these faces. We are tired, overwhelmed, with mixed emotions and a fear that we cannot hide. When we get to work we harness ourselves and we know that for six hours we cannot eat, drink and pee. We wear protective gear that hurt and make us sweat. But that's not what scares us. The passion for our work gives us the right energy, the people who love us give us the necessary strength.”", "The photo was shared as other images circulated of other medical workers who experienced similar facial marks after wearing PPE during the pandemic, including here, here and here.", "The WHO has issued guidelines on April 6, 2020, for the use of PPE during COVID-19, stressing that these differ from the recommended protective measures for the general public, which can include wearing surgical or cotton-made masks.", "Rosacea image", "The photo in the bottom right-hand corner of the post was published here on the website Medical News Today. It illustrates a skin condition called a malar rash, which the article says can be caused by rosacea.", "The same woman can be seen in other photos on stock photo websites, including here on Alamy. The image’s caption reads: “Unhappy elderly woman with skin condition rosacea characterized by facial redness, small and superficial dilated blood vessels.”", "According to the United Kingdom’s National Health Service (NHS), rosacea is “a long-term skin condition that mainly affects the face”. It is not known what causes rosacea. But the NHS lists “alcohol, spicy foods, cheese, caffeine, hot drinks, aerobic exercise like running” as possible triggers.", "Allergy image", "The image in the top left-hand corner of the post has circulated in reports about a French teenager who claims she suffered an allergic reaction after wearing a mask for a prolonged time.", "An August 10, 2020, report by French newspaper Le Monde quotes the teenager’s mother as saying: “It was the first time she wore that mask given by her school for such a long time. We were on holiday for a week camping and it was mandatory to wear a mask in closed spaces, so she wore it everyday”.", "According to the American Academy of Dermatology, wearing a mask can lead to skin problems including acne and dryness. It recommends washing cloth face masks with fragrance-free, hypoallergenic detergent to remove germs, oils and particles that can build up and irritate the skin.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]