["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "No one named Rittenhouse works for Kenosha County or city.", "A Facebook post suggests that the father of the young man arrested for killing two protesters and wounding a third in Kenosha, Wisc., is himself a law enforcement officer.", "\"Wondering about Kyle Rittenhouse’s father?\" the post says. \"Call the Kenosha Sheriff’s department and ask for Deputy Rittenhouse.\"", "This is made up.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The county’s employee database has no Rittenhouse. The sheriff’s department lists 10 staffers. The Rittenhouse name doesn’t appear. We called the department and they don’t know of any employee by that name. We checked with the City of Kenosha and the human resources department told us no Rittenhouse has worked for the city in any capacity.", "Kyle Rittenhouse has been strongly drawn to police work. He supported the Blue Lives Matter movement on social media. He participated in a youth training program for aspiring law enforcement officers.", "Aside from the post having zero basis in reality, Rittenhouse lives with his single mother, a nurse’s assistant, in Antioch, Ill,, not Wisconsin.", "Court records from 2014 show that Kyle Rittenhouse's, Michael Rittenhouse, was living in Zion, Ill., when he was ordered to pay $85 a week in child support. At the time, he worked for QPS Employment, a firm that provides temporary office workers and other staffing services.", "We rate the post Pants on Fire.", "Facebook, post, Aug 27, 2020", "Kenosha County, staff directory, accessed Aug. 28, 2020", "Email exchange, City of Kenosha, Human relations department, Aug. 28, 2020", "Interview, Kenosha County Sheriff’s Department, Aug. 28, 2020", "New York Times, Suspect in Kenosha Killings Lionized the Police, Aug. 27, 2020", "Daily Beast, 17-Year-Old ‘Blue Lives Matter’ Fanatic Charged With Murder at Kenosha Protest, Aug. 27, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]