["About this rating", "The Hawkeyes have started a tradition of waving to children in the hospital after the first quarter of home games.", "The hospital was not built by the Hawkeyes football team as such, but by the University of Iowa.", "On 18 September 2017, Facebook user Nik Mathias posted a photograph of a child looking out a window on Kinnick Stadium, home of the Iowa Hawkeyes (the University of Iowa's football team) along with the following claims:", "The Iowa Hawkeyes have built a hospital for children that faces the stadium. Only children in the hospital and their families are allowed in that area of the hospital during game day. After the first quarter of the game they ask the entire stadium to turn around and wave to the children.", "The UI Stead Family Children's Hospital was not built by the Hawkeyes football team, but it is owned and run by the University of Iowa in Iowa City. Although \"Hawkeyes\" can sometimes be used to refer to students, faculty or alumni of the University of Iowa, it most commonly refers to the football team. This — combined with the text and photographs in Nik Mathias' Facebook post — led many readers to believe the football team, not the university, had built the hospital.", "It was opened in February 2017. Further, the Hawkeyes have indeed started a new ritual of waving and applauding for children after the first quarter of home games, as this brief ESPN report explains:", "This video (from Iowa radio station KHAK) shows raw footage of the very first wave, which took place at the Hawkeyes' first home game of the season on 2 September 2017:", "The photograph that accompanies Nik Mathias' Facebook post is authentic and was originally posted to Facebook by Hillary Hemphill. Contrary to Mathias' post, the child in the photograph is not a girl, but rather Hemphill's four-year-old son Wyatt, who suffers from a rare immune condition called Hyper IgM syndrome, according to Iowa news channel KCRG.", "Saunders, Forrest.  \"What It's Like on the Other Side of 'The Wave.'\"\r\n  KCRG.  17 September 2017.", "26 September 2017, 10:05 A.M.: Added clarification about Hawkeyes descriptor.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]