["By Angelo Fichera", "Posted on October 19, 2018", "Q: Is Sen. Robert Menendez on trial — and was his co-defendant convicted on prostitution charges — as an online meme says?", "A: No. Menendez was tried on corruption charges last year, but was not convicted. His co-defendant was found guilty of defrauding Medicare in an unrelated case.", "Bob Menendez. Is he on trial?", "Weeks before the midterm elections, an outdated meme circulating on Facebook has resurrected charges against New Jersey Democratic Sen. Robert Menendez.", "The popular meme tells users that Menendez is “on trial for corruption” alongside a defendant who was “convicted and is getting life in prison in a case that involves selling underage minority immigrant girls into prostitution.”", "“Where is the outrage?” the meme, posted Oct. 10, asks.", "But the meme distorts the facts in several respects.", "For starters, Menendez was tried last year on charges that he had accepted bribes and used his influence to help a friend’s personal and business interests. In return, the federal indictment alleged, Menendez received gifts, vacations and hundreds of thousands in political donations.", "The trial ended in November 2017 when a jury deadlocked, leading to a mistrial. A federal judge subsequently acquitted the senator on some of the charges and the government ultimately dropped the case. The Senate Ethics Committee, in a letter earlier this year, “severely admonished” Menendez for his actions.", "So, Menendez is no longer “on trial” — as the circulating meme declares — or facing charges.", "And what about the claim that Menendez’s co-defendant and friend, Salomon Melgen, got “life in prison” in a case involving underage sex workers? That’s also inaccurate.", "In a separate case, Melgen, an ophthalmologist, was accused of defrauding Medicare, including by submitting false claims and falsifying entries in patient charts. He was sentenced in February to 17 years in prison after being convicted on 67 counts.", "Neither of the two federal cases involved any charges relating to prostitution.", "Early in the corruption case, investigators did indeed probe claims from an anonymous tipster that Menendez and Melgen had solicited underage prostitutes in the Dominican Republic. Those allegations were investigated, court records indicate, and never led to charges being filed.", "Nevertheless, the unproven claims have been used as the basis for an attack ad against the senator as he seeks reelection, as the Washington Post‘s Fact Checker has reported. Menendez faces Republican Bob Hugin on Nov. 6.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "“Public Letter of Admonition.” U.S. Senate Select Committee on Ethics. 26 Apr 2018.", "“South Florida Doctor Sentenced in Medicare Fraud Scheme.” Press Release, U.S. Attorney’s Office for the Southern District of Florida. 22 Feb 2018.", "United States of America v. Robert Menendez and Salomon Melgen. 2:15-cr-00155-WHW. U.S. District Court, District of New Jersey. “Indictment.” 1 Apr 2015.", "United States of America v. Robert Menendez and Salomon Melgen. 2:15-cr-00155-WHW. U.S. District Court, District of New Jersey. “Order.” 24 Jan 2018.", "United States of America v. Robert Menendez and Salomon Melgen. 2:15-cr-00155-WHW. U.S. District Court, District of New Jersey. “Order.” 31 Jan 2018.", "United States of America v. Salomon Melgen. 9:15-cr-80049-KAM. U.S. District Court, Southern District of Florida. “Indictment.” 14 Apr 2015.", "“United States v Salomon Melgen.” Press Release, U.S. Attorney’s Office for the Southern District of Florida. 9 Jan 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]