["About this rating", "Minneapolis police did initially advise residents in writing not to fight back in the event they are the victim of a robbery, although police later amended the advice, taking out the language about fighting back.", "This advice was not given as the result of the city defunding the police department, as the police force is still operating. Also, the City Council voted to amend the city charter to replace the current police department. But the question must first be put to voters before it could go into effect.", "Rumors are surging in the wake of George Floyd's death and resulting protests against police violence and racial injustice in the United States. Stay informed. Read our special coverage, contribute to support our mission, and submit any tips or claims you see here.", "In early August 2020, Snopes readers asked about social media memes and articles stating that Minneapolis officials had advised citizens to cooperate with criminals, the result of lawlessness emanating from defunding the police department. See the example above of one such meme.", "The articles and memes being shared misleadingly stated that the city had already defunded its police department, giving the false impression that Minneapolis had no police patrolling the city. That is not the case.", "The Minneapolis Police Department remains in operation. On June 26, 2020, the City Council voted to amend the city charter in a way that would enable the replacement of the police department with another public safety agency — a decision that is ultimately up to voters.", "In the spring of 2020, protests — and, initially, riots — tore through Minneapolis and spread nationwide in the wake of the death of George Floyd, a Black man who was pinned for nearly nine minutes under the knee of former Minneapolis police Officer Derek Chauvin, who is white. Video of Floyd's agonizing death went viral, galvanizing a widespread racial-justice movement. Minneapolis city officials responded with the unanimous vote amending the city's charter, vowing that the current police department would be dismantled and replaced.", "Since then, the city has been the subject of sensational internet stories based on the false assertion that Minneapolis is now without a police force.", "The framing of the citizen-robber rumor depended on the news outlet telling it. TV news station KSTP, for example, reported that Minneapolis police had simply offered precautions against crime, citing an increase in robberies and carjackings in downtown and South Minneapolis.", "Right-leaning websites linked the police advisory to the Minneapolis City Council's decision to change the city charter, claiming that the advisory indicated police had surrendered the city to criminals. For example, Russian state-owned propaganda network RT in an Aug. 2, 2020, post ominously warned:", "In an era of rising crime and a push by many on the left to defund police and “reimagine” law enforcement in Democrat-controlled cities, the self-help tips in Minneapolis may be a sign of things to come.", "The Minneapolis City Council voted unanimously in June to replace the city's police department with a “department of community safety and violence prevention, which will have responsibility for public safety services prioritizing a holistic, public health-oriented approach.”", "Among the tips offered by police were advice that if robbed, pedestrians should, \"Be prepared to give up your cell phone and purse/wallet,\" and, \"Despite all our efforts, robberies may still occur! Do not argue or fight with the criminal. Do as they say. Your safety is most important!\"", "On Aug. 3, 2020, the police department backtracked, stating the advisory that contained those tips didn't go through the proper channels for clearance before it was released to the public, and that Minneapolis police Chief Medaria Arrodondo was not consulted beforehand. The statement read:", "There is not a prescribed way to respond to being a victim of a crime. People have different capabilities and each incident is different.", "Things that people can do to help protect them from being victims of crime includes walking with others, staying in well-lit and populated areas and be aware of your surroundings. If you are the victim of a crime, please call 911 as soon as possible. Share as much information as possible with the dispatcher such as suspect description, location of crime, verbiage used along with direction and method of escape.", "We will continue to keep reallocated resources in the areas hit by this uptick in crime and we are working with community groups to help hold those committing these crimes accountable.", "Although Minneapolis police revised their notice to the public, advising citizens not to fight armed robbers isn't unique or new. Numerous examples exist of similar advice being offered by officials elsewhere, and well before activists raised the demand of defunding police departments.", "For example, in 2015, the Charlotte Observer newspaper reported that police in Charlotte, North Carolina, had put out similar advice, stating that robbery victims \"shouldn't fight back.\" If one is the victim of a robbery, police recommended \"doing exactly as you are told,\" the Observer reported. \"One statement, bolded and all caps for emphasis: DO NOT RESIST!\"", "\"Don’t be a hero,\" Charlotte-Mecklenburg police advised in 2015. \"It's better to lose your money than your life.\"", "The Star Tribune reported that Minneapolis Police Department had been grappling with a staffing shortage amid the spike in armed robberies and carjackings in the city's Third Precinct, which police said were the work of one crew. The staffing shortages were the result of resignations, firings, and 75 officers taking \"medical leave for post-traumatic stress disorder they say was caused by the riots that followed Floyd's death.\"", "RT. \"‘Do As They Say’: Minneapolis Police Warn People to Obey Criminals for Their Own Safety as Violent Crime Surges Amid BLM Protests.\"\r\n  2 August 2020.", "Associated Press and MPR News Staff. \"Council Advances Plan to Dismantle Minneapolis Police Dept.\"\r\n  26 June 2020.", "Jokich, Alex. \"'You Do Whatever You Can to Survive': 99-Year-Old Woman Fought Off an Intruder in South Minneapolis Home.\"\r\n  KSTP-TV. 28 July 2020.", "Jany, Libor. \"Minneapolis Police Face Staffing Challenges as Violence Rises.\"\r\n  Star Tribune. 1 August 2020.", "Wootson, Cleve R., Jr. \"If Confronted By a Robber, Don’t Be a Hero, Police Say.\"\r\n  Charlotte Observer. 12 August 2015.", "Navratil, Liz. \"Minneapolis Charter Commission Votes to Keep First of Two Police Reform Measures Off Ballot.\"\r\n  Star Tribune. 30 July 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]