["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In May 2020, a photograph started to circulate on social media supposedly showing a petri dish that was coughed on by a person not wearing a mask and a petri dish coughed on by the same person wearing a mask:", "As the Twitter user noted, this image reportedly was taken by lab technician Katie Corley and shared to her public Facebook page. Corley's original post was shared on May 6 along with a message to the \"conspiracy theorists\" who were refusing to wear masks during the COVID-19 pandemic:", "Visual experiment for you conspiracy theorists:", "I coughed on two petri dishes, one while wearing a mask and one not. Shocking! The one on the left with no growth is the one I used a mask for! The one on the right where I didn't wear a mask is full of bacteria. So yeah, maybe cloth masks don't give you much protection, but they protect the people around you. Maybe wear one if you insist it's your constitutional right to eat at Chili's.", "We note that many social media users who encountered this photograph made some incorrect assumptions about what it showed. For example, many people seemed to think that the petri dish on the right showed SARS-CoV-2, the strain of coronavirus at the center of the current pandemic, and that this photograph demonstrated just how effective masks were at stopping the spread of COVID-19.  This photograph, however, simply shows \"normal oral flora.\"", "In an edit to her post, Corley explained that the petri dish on the right contained \"normal oral flora,\" such as staph species, neisseria species, and corynebacterium. Corley also noted that viruses are much smaller than the bacterium shown in the petri dish, but noted that this small experiment demonstrated how masks can lessen droplet spread that can carry viruses.", "Corley added:", "There's been a lot of questions regarding this experiment, so here's some answers:\n1. I used a cloth mask I made myself with disposable lab coat material.\n2. I used blood agar.\n3. The plate on the right looks \"old\" or \"stale\" because of the growth. Some of the organisms on this plate are alpha hemolytic, meaning they partially hemolyze blood. The agar itself is made with 5% sheep's blood, so when it's partially hemolyzed, it turns a dark green color.\n4. As for the growth, it's mostly viridans strep, staph species (not staph aureus), neisseria species, and corynebacterium. Pretty normal oral flora.\n5. I realize that viruses are 1,000 times smaller than bacteria. The point of the masks is to prevent droplet spread, which carry bacteria as well as viruses.", "Corley, of course, was not the first person to notice how face masks lessened droplet transmission. Similar images showing bacteria from a person's cough growing in a petri dish can also be seen in this article from the Microbiology Society. Rich Davis, the Clinical Microbiology Lab Directory at Providence Sacred Heart, posted a series of images of a similar demonstration:", "Davis, like Corley, emphasized that this was not an experiment showing the efficacy of masks against the spread of COVID-19. Rather, it was a simple demonstration to show how masks lessened the spread of respiratory droplets, which can carry the disease.", "The British children's television show \"Operation Ouch!\" also took a look at how much bacteria gets disseminated when a person coughs. While that episode did not include masks, it did compare a petri dish that was coughed on by a man with no mouth covering and a petri dish that was coughed on by a man who covered his mouth with an elbow.", "Here's how the petri dish looked after it was coughed on by the man who covered his mouth (left) and the petri dish coughed on by the man who didn't (right). As you can see, the results from \"Operation Ouch!\" are very similar to the results seen in Corley's post:", "Here's the clip from \"Operation Ouch!\" (The cough experiment starts around the 50-second mark):", "A 2005 study published in the Journal of Clinical Microbiology noted that more than 700 bacterial species have been detected in the oral cavity. Covering your mouth when you cough (either with an elbow or a mask) can reduce droplet transmission and lessen the spread of potentially harmful germs.", "Professor Lindsay Grayson, director of infectious diseases at Melbourne's Austin Hospital, said as much during a presentation at the Interscience Conference on Antimicrobial Agents and Chemotherapy in San Francisco in 2009 concerning research on the effectiveness of masks in slowing the spread of influenza.", "The New York Times reported:", "“If you’re wearing a mask to prevent yourself from catching it, they’re not so effective,” said Dr. M. Lindsay Grayson, professor of medicine at the University of Melbourne and one of the study’s co-authors. “But if you’re sick with the flu and coughing and sputtering, those masks do prevent you from spraying those bugs everywhere.”", "The researchers asked nine study subjects with documented cases of influenza type A or B to test two different types of masks — the standard, disposable surgical masks and a more costly, respirator-style mask. The flu patients coughed into a petri dish while wearing both types of mask as well as without the mask. The dish was then tested for the presence of flu virus. When either type of mask was worn, no virus was detected on the petri dish.", "But how effective are masks in preventing the spread of COVID-19?", "While the exact efficacy of masks on the spread of COVID-19 is still undetermined, health officials do recommend that people wear masks in public because these face coverings can prevent droplet transmission.", "The Centers for Disease Control and Prevention (CDC) told us:", "“As we study the virus, CDC has learned that a good proportion of individuals who have COVID-19 spread virus before they become symptomatic and a few people never have symptoms at all but are still infected and infectious. That means, that people who are not coughing or sneezing can be a source of infection for others. Something simple like speaking is enough to generate aerosols that can spread the infection to other people.", "A simple cloth mask is a way to contain respiratory secretions right at the source and not put other people at risk. The mask traps the droplets before they spread into the environment. Therefore, “my mask protects you, and your mask protects me!” It’s a way of strengthening the social distancing that we are already doing.", "It's important to note, however, that wearing a mask is only one of several preventative measures that people should be taking during this pandemic, such as frequently washing their hands and maintaining a safe social distance (6 feet apart) while in public. Or, as Tedros Adhanom, the director-general of the World Health Organization, said: \"Masks alone cannot stop the pandemic.\"", "Adhanom said:", "“Masks alone cannot stop the pandemic. Countries must continue to find, test, isolate and treat every case and trace every contact. Mask or no mask, there are proven things all of us can do to protect ourselves and others – keep your distance, clean your hands, cough or sneeze into your elbow, and avoid touching your face.”", "Drum, Kevin.   \"How Effective Are Masks?\"\r\n    Mother Jones.   19 April 2020.", "Aas, joorn; Paster, Bruce; Stokes, Lauren; Olsen, Ingar; Dewhirst, Floyd.   \"Defining the Normal Bacterial Flora of the Oral Cavity.\"\r\n    Journal of Clinical Microbiology.   2005.", "Pappas, Stephanie.   \"Do Face Masks Really Reduce Coronavirus Spread? Experts Have Mixed Answers.\"\r\n    Live Science.   12 April 2020.", "Parker-Pope, Tara.   \"Who Should Wear a Mask During Flu Season?\"\r\n    The New York Times.   14 September 2009.", "Golder, Andy.   \"If Anyone Doubts Whether Masks Work, Just Look At These Photos.\"\r\n    Buzzfeed.   29 June 2020.", "Carter, Helen.   \"Even Cheap Masks Stop Flu Spreading.\"\r\n    ABC.Net.AU.   31 March 2008.", "Updated [1 July 2020]: Changed status from Unproven to True after reviewing a similar experiment from the clinical microbiology lab director at Providence Sacred Heart Medical Center in Spokane, Washington.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]