["A one-minute and 45-seconds news clip was published on Facebook here on October 29, 2020.", "The post’s caption says: “Modi Modi slogans in Pakistan’s parliament.”", "The clip shared in the Facebook post is a segment from India TV that reports on and shows footage from a debate in Pakistan’s National Assembly that was held on October 26, 2020.", "The segment was published on India TV’s Twitter account here on October 28, 2020. “Exclusive: Why some MPs in Pakistan parliament shouted  ‘Modi, Modi’,” the tweet reads.", "In the broadcast, India TV’s chyron reads “Again MPs raised the slogans of Modi” and “‘Modi-Modi’ slogans chanted in front of Pakistan foreign minister.”", "The claim that the Pakistani lawmakers were chanting “Modi, Modi” in favour of the Indian prime minister was amplified by politicians from Modi’s Bharatiya Janata Party on social media here, here, here, here, here, here and here.", "Footage of the parliamentary debate was also shared alongside the claim by Indian media outlets here, here, here, here, here, here and here and by Facebook users here, here, here and here.", "However, the claim is false.", "A close analysis of the parliamentary proceedings show that the lawmakers are in fact chanting in Urdu “voting, voting” — not “Modi, Modi”.", "The chanting was coming from opposition politicians that were demanding a vote on a resolution that would call on Muslim countries to boycott French goods in response to remarks made by French President Emmanuel Macron regarding cartoons of the Prophet Mohammad.", "The “voting, voting” chants occurred while Pakistani Foreign Minister Shah Mehmood Qureshi was speaking during the debate, which can be seen in full on Pakistan’s Public TV YouTube channel here.", "The chanting can be heard at the video’s 13:28 mark.", "Dawn, a major English newspaper in Pakistan, reported on the “voting, voting” chants here on October 27, 2020.", "Prime Minister Modi was invoked later in the parliamentary proceeding but in a negative sense.", "At 18:25 mark of the Public TV video, Qureshi taunts an opposition lawmaker, saying “it appears that the spirit of Indian Prime Minister Narendra Modi's has been transferred into him\".", "The quip was followed by chants of “whoever is a friend of Modi is a traitor.”", "The negative comments about Modi were reported on by several news outlets, including Pakistan’s Express Tribune here, Indian news agency IANS here and in the Dawn report here.", "The false claim that Pakistani lawmakers chanted “Modi, Modi” was also debunked by the UK’s BBC here and by Indian fact-checking organizations Boomlive here and Alt News here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]