["About this rating", "This email started circulating back in 2008:", "Facts:", "Speaker of the House Nancy Pelosi's home district includes San Francisco.", "Star-Kist Tuna's headquarters are in San Francisco, Pelosi's home district.", "Star-Kist is owned by Del Monte Foods and is a major contributor to Pelosi.", "Star-Kist is the major employer in American Samoa employing 75% of the Samoan workforce.", "Paul Pelosi, Nancy's husband, owns $17 million dollars of Star-Kist stock.", "In January, 2007 when the minimum wage was increased from $5.15 to $7.25, Pelosi had American Samoa exempted from the increase so Del Monte would not have to pay the higher wage. This would make Del Monte products less expensive than their competition's.", "Last week when the huge bailout bill was passed, Pelosi added an earmark to the final bill adding $33 million dollars for an 'economic development credit in American Samoa'.", "Pelosi has called the Bush Administration 'corrupt'.", "She should know.", "Another version which began circulating in e-mail in March 2010 asserts \"Snopes validates the facts below,\" which is not the case.", "Prior to 2007, the U.S. territories of Northern Marianas and American Samoa were exempt from federal minimum wage standards; instead, the minimum wage standards in those territories were established by a committee appointed by the U.S. Department of Labor. The Fair Minimum Wage Act of 2007 (H.R. 2), introduced to Congress in January of that year, sought to revise U.S. federal minimum wage standards, including the gradual raising of the federal minimum wage from $5.15 to $7.25 per hour.  When it came to light that the bill extended federal minimum wage standards to the Northern Marianas but exempted American Samoa, Republican critics charged that this circumstance was the doing of House Speaker Nancy Pelosi, a favor she was granting because the island's primary employer was headquartered in her district:", "Under the minimum-wage increase approved by the House this week, employers on the Northern Marianas would for the first time have to pay their workers the minimum wage, which would rise from $5.15 to $7.25 an hour. For years, Republicans — with the help of convicted lobbyist Jack A. Abramoff — have fended off efforts to bring the islands under federal labor laws.", "The bill would leave American Samoa as the only territory not covered by the $7.25 rate, and because Samoa is represented by a Democrat, Del. Eni F.H. Faleomavaega, Republicans cried foul.", "Faleomavaega's campaign coffers have been well stocked by the tuna industry that dominates his island economy, but Republicans picked up on another issue: StarKist owns one of the largest canneries on the island, and Del Monte Foods, StarKist's parent company, is based in San Francisco, which Pelosi represents.", "Speaker Pelosi was the Congressional leader of the party that sponsored H.R. 2 (214 of the bill's 222 cosponsors were Democrats), and it is true that Del Monte Foods' San Francisco headquarters are located within the boundaries of the California district she represents in Congress.   However, we haven't found any evidence of a direct link between Speaker Pelosi and the decision to exclude American Samoa from the minimum wage legislation: Democrats maintained that Speaker Pelosi did not work on the details of the bill, and that the exemption for American Samoa was created at the behest of the island's Congressional delegate:", "A spokesman for Pelosi said the bill excluded American Samoa at the request of nonvoting Delegate Eni Faleomavaega, a Democrat who represents the Pacific island territories in the House.", "The minimum-wage bill was drafted by [House Education and Labor Committee Chairman George] Miller's committee, and Pelosi had little input on the nitty-gritty details of the legislation, House sources said.", "Faleomavaega did indeed strongly advocate that American Samoa be allowed to retain its exemption from federal minimum wage standards:", "One person who is concerned about enforcing the federal minimum wage in American Samoa is non-voting Rep. Eni Faleomavaega, who echoed the arguments of many conservatives against raising the minimum wage in poorer regions of the U.S. mainland.", "A \"decrease in production or departure of one or both of the two canneries in American Samoa could devastate the local economy, resulting in massive layoffs and insurmountable financial difficulties,\" he said in a statement provided to The [Washington] Times.", "\"The truth is the global tuna industry is so competitive that it is no longer possible for the federal government to demand mainland minimum wage rates for American Samoa without causing the collapse of our economy and making us welfare wards of the federal government.\"", "As a result of the controversy, Democrats asserted that American Samoa would indeed be covered in the final version of the bill:", "Fending off charges of favoritism, congressional Democrats say a just-passed minimum wage bill will be changed to cover all U.S. territories — including American Samoa — before it reaches President George W. Bush's desk.", "The House of Representatives' leader, Nancy Pelosi, told reporters she has instructed the House Education and Labor Committee to help get the bill changed to \"make sure that all of the territories have to comply with the U.S. law on minimum wage.\"", "(The revised minimum wage regulations for American Samoa are detailed here.)", "Whatever the motivation might have been for the initial exclusion of American Samoa from the minimum wage bill, news accounts do not support the claim that the exemption came about because Del Monte Food was \"a major contributor to Pelosi.\"  The New York Post noted that \"Pelosi's spokeswoman denied receiving any campaign contributions from Del Monte, which federal campaign records confirm,\" and even the conservative Washington Times observed that:", "Democrats involved in the legislation say that neither Del Monte nor StarKist has lobbied Mrs. Pelosi or the committee on the matter. And records show that while Del Monte political action committees have given $5,300 in the past five years to Republicans, neither they nor Del Monte executives have given to any Democrats.", "We also could find no confirmation for the claim that Speaker Pelosi's husband owns \"$17 million dollars of StarKist stock.\"  StarKist is a subsidiary of Del Monte Foods,* and the H.J. Heinz Company in turn owns nearly 75% of Del Monte's stock.  Various pieces of Internet flotsam alternately claim that Mr. Pelosi owns $17 million dollars worth of \"StarKist stock,\" \"Del Monte stock,\" or \"H.J. Heinz stock,\" but  although the Pelosis hold investments in stocks and real estate worth many millions of dollars, we could not find any hard information confirming that they own millions of dollars of stock in either Del Monte Foods or H.J. Heinz (Since the financial disclosure rules that apply to members of Congress contain a number of loopholes that can obscure members' investment holdings, it's also difficult to definitively rule out that the Pelosis might hold such an investment.)", "The $700 billion \"bailout bill\" (H.R. 1424) that Congress began working on in September 2008 in response to an economic crisis in the U.S. contained hundreds of various tax provisions typically (but not necessarily accurately) described as \"earmarks,\" most famously an \"exemption from excise tax for certain wooden arrows designed for use by children.\"  One of those provisions modified the Tax Relief and Health Care Act of 2006, which had created an economic development credit for American Samoa, to extend that development credit from applying to the \"to the first two taxable years of a corporation\" to applying to \"the first 4 taxable years.\"  We have so far not been able to determine, from available public information, which member(s) of Congress initiated the addition of that provision.", "(* In late 2008 the Korea-based Dongwon Group acquired the StarKist seafood division of Del Monte Foods.)", "Lathem, Niles.   \"Pelosi Bill Blasted As Pork for Tuna.\"\n     New York Post.   13 January 2007.", "Weisman, Jonathan.   \"Minimum-Wage Hike May Reach to Samoa.\"\n     The Washington Post.   13 January 2007   (p. A2).", "Wildermuth, John.   \"Pelosi's Husband Prefers a Low Profile.\"\n     San Francisco Chronicle.   1 January 2007.", "Associated Press.   \"Democrats Pledge to Extend Federal Minimum Wage to All U.S. Territories.\"\n     International Herald Tribune.   13 January 2007.", "The Washington Times.   \"Pelosi Moves to Close Samoa Wage Loophole.\"\n      13 January 2007.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]