["About this rating", "An image supposedly showing an ancient sculpture resembling the pop culture superhero character of Batman is frequently circulated on social media with misleading claims about its origins:", "Interest in this image was renewed in May 2019 after it was included in articles about the ancient Mayan god Camazotz published by outlets such as the Yucatan Times and Curiousmos. Although these sources provided correct information about where and when this image was created, some readers were left with the impression that this sculpture was thousands of years old:A bat god named Camazotz can be found in Mayan mythology, but this image does not depict an ancient sculpture made by the Mayans circa 500 AD. This is actually a modern artwork created in 2014 by the artist Kimball for an exhibit at the Mexican Museum of Design, one that explored the character of Batman through the lens of Mexican creativity:", "Warner Bros Entertainment con el apoyo del Museo Mexicano del Diseño convocaron a 30 artistas a participar en la exhibición “BATMAN A TRAVÉS DE LA CREATIVIDAD MEXICANA” para el desarrollo e intervención de esculturas de fibra de vidrio del personaje con motivo de su 75 aniversario.", "El dios murciélago de la cultura maya CAMAZOTZ es asociado con la noche y el inframundo fue el punto de partida para la pieza realizada, los colores y las formas de la decoración están inspiradas en los braceros de cerámica encontrados en el templo de la cruz foliada en las ruinas arqueológicas de Palenque, generando una pieza que rinde tributo a nuestro pasado prehispánico.", "Warner Bros Entertainment with the support of the Mexican Museum of Design invited 30 artists to participate in the exhibition \"BATMAN THROUGH MEXICAN CREATIVITY\" for the development and intervention of fiberglass sculptures of the character on the occasion of its 75th anniversary.", "The bat god of the Mayan culture CAMAZOTZ is associated with the night and the underworld was the starting point for the piece made, the colors and shapes of the decoration are inspired by the ceramic braceros found in the temple of the foliated cross in the archaeological ruins of Palenque, generating a piece that pays tribute to our pre-Hispanic past.", "Several other images documenting the making of this sculpture can be viewed on Kimball's Behance page.", "While bat gods were depicted in some ancient art, these sculptures had far less in common with the modern Batman character than Kimball's interpretation did. Here's an image of a \"pre-Columbian Maya bat god sculpture\" that was reportedly taken at the Museo Popol Vuh in Guatemala City:", "The viral image does not show an ancient Mayan Batman sculpture, but rather a modern piece of art created in 2014 and depicting an artist's interpretation of what a Batman sculpture could have looked like had it been created by Mayans.", "Yucatan Times.   \"Camazotz: The Maya Batman.\"\r\n      22 May 2019.", "Addams, Eli.   \"Camazotz: The Mayan Bat God.\"\r\n    HistoricalMX.   Retrieved 24 May 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]