["About this rating", "In September 2020, a photograph supposedly showing a Patagonia clothing tag reading \"Vote the Assholes Out\" started to circulate on social media:", "This is a genuine picture of a Patagonia clothing tag. However, the tag is not found on every Patagonia clothing item.", "A spokesperson for Patagonia confirmed to us in an email that \"the tags are real,\" and that they can be found on the company's Regenerative Organic Stand-Up Shorts:", "The tags are real. They were added to our 2020 Men’s and Women’s Regenerative Organic Stand-Up Shorts because we have been standing up to climate deniers for almost as long as we’ve been making those shorts.", "[Patagonia Founder] Yvon Chouinard has been saying “vote the assholes out” for several years and it refers to politicians from any party who deny or disregard the climate crisis and ignore science, not because they aren’t aware of it, but because their pockets are lined with money from oil and gas interests.", "Fumi Yokoyama, a reporter for GQ Japan, also confirmed that this clothing tag could be found on Patagonia's Road to Regenerative Standup Shorts.", "GQ Japan wrote [translated via Google]:", "So I really found it and bought it right away. It was a reality!", "One of the products that uses cotton made by farmers who adopt the \"regenerative organic farming method\" promoted by Patagonia in recent years. Whereas traditional giant farming accounts for up to 25% of carbon emissions that are deepening the climate crisis, this farming method aims to build healthy soil that helps return carbon to the ground. It is said.", "This is not the first time Patagonia has used the slogan \"Vote the Assholes Out.\" In 2018, social media users reported seeing this slogan and various pieces of swag — such as stickers and cups — that the company was handing out during that year's Outdoor Retailer Summer Show in Colorado.", "In April 2020, Patagonia's founder Yvon Chouinard wrote an open letter to customers about Earth Day, the COVID-19 pandemic, and climate change, that ended with the following message:", "Remember, vote the assholes out—all of those politicians who don't believe we should do anything about climate change. Vote for the planet and against those who would do nothing. We have the power and now is the time to use it.", "Yokoyama, Fumi.   \"Editors' Pick ~ Patagonia Shorts That Gently Raise \"VOTE THE ASSHOLES OUT (Vote and Beat the Fucking Guy)\".\"\r\n&nbsp   GQ Japan.   14 September 2020.", "Byars, Tessa.   \"A Letter From Our Founder, Yvon Chouinard.\"\r\n&nbsp   Patagonia Works.   22 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]