["In this era of high unemployment, it's always about jobs.", "The issue came up again Jan. 31 when Jonathan Boucher, executive director of the Rhode Island Democratic Party, published a commentary in The Providence Journal attacking the argument by Republican Ian Prior that the state needs Republicans in its congressional delegation, now all Democratic.", "Boucher argued that the idea of \"replacing our delegation with a bunch of Republican freshmen,\" which wasn't exactly Prior's argument, \"is completely absurd.\"", "\"The House Republicans’ failure and inability to govern caused the first government shutdown in 16 years. The Republican leadership in the House has refused to address the issues that matter the most to Rhode Island, such as passing a jobs bill, extending unemployment benefits, raising the minimum wage, and passing comprehensive immigration reform.\"", "In that list of alleged GOP failures, one stood out to a reader, who emailed us a list of jobs bills that, he said, the Republican-controlled House has, in fact, passed.", "We were intrigued and decided to see whether Boucher's jobs claim was correct.", "The list has lots of bills with the word \"jobs\" in the title, but that doesn't mean the proposals would actually create jobs.", "In addition, Republicans and Democrats tend to have different views on what constitutes a \"jobs bill.\" For Democrats, that can mean legislation expanding or creating a government training program. For Republicans, that can mean bills shrinking government or eliminating regulations to help businesses.", "We decided to use a technique employed by PolitiFact National when it looked at a claim made on Facebook in 2011 that congressional Republicans have introduced dozens of bills on social issues and other topics, but \"zero on job creation,\" a claim that earned a Pants on Fire.", "We went to Congress.gov, run by the Library of Congress. It lists the topics that a bill covers. We looked for topics related to employment and job creation. It's not a perfect gauge, but it's a nonpartisan guide. We also reviewed summaries of the bills and committee reports looking for references to jobs and employment.", "For example, the SKILLS Act (H.R. 803), intended to streamline work-force development programs, touches on 52 topics from \"tobacco use\" to \"sex offenses.\" But it also has provisions that deal with \"labor and employment,\" \"unemployment,\" \"temporary and part-time employment,\" \"vocational education\" and \"youth employment and child labor.\" It passed the House on March 15, 2013.", "The \"Veterans Economic Opportunity Act of 2013\" (H.R. 2481) deals with veterans education, employment and rehabilitation. It passed the House on a voice vote on Oct. 28, 2013.", "And the \"Global Investment in American Jobs Act of 2013\" (H.R. 2052) is intended to get the feds to come up with a plan for increasing \"U.S. global competitiveness without weakening labor, consumer, financial, or environmental protections.\" It passed the House in a bipartisan vote on Sept. 9, 2013.", "Some jobs bills were designed to create jobs by encouraging more energy production and distribution, such as proposals to expand offshore oil drilling or push the controversial Keystone XL pipeline, which gives some environmentalists heartburn.", "Others on the list from our GOP reader seemed to have little to do with directly promoting employment, and Congress.gov doesn't list them in any employment-related categories.", "When we emailed the list of \"jobs\" legislation to Boucher, he took issue with some of the bills, saying they weren’t really about jobs.", "Boucher also argued that his statement is true because none of the Republican jobs-related legislation had been enacted.", "\"When I wrote 'passing a jobs bill,' I was clearly referring to a bill that has passed into law,\" he said in an email statement. \"A bill can’t create a single job if it’s not actually passed into law.\"", "But that's not what he said in his commentary.", "He said, \"The Republican leadership in the House has refused to address the issues that matter the most to Rhode Island, such as passing a jobs bill.\"", "The House, regardless of which party is in control, cannot unilaterally enact laws. Approval by the Senate and (in most cases) the president are also required.", "The bottom line: The House, under the current Republican leadership, has passed bills with the goal of encouraging employment.", "Whether one thinks that the bills will do more harm than good is a matter for debate, and beyond the scope of this fact check.", "Boucher's statement is wrong, enough for a ruling of False. But because he's making a ridiculous defense to justify it, we rate it Pants on Fire!", "(If you have a claim you’d like PolitiFact Rhode Island to check, email us at [email protected]. And follow us on Twitter: @politifactri.)", "ProvidenceJournal.com, \"Jonathan Boucher: R.I. would lose clout by sending Republicans to D.C.\" Jan. 31, 2014 and \"Ian Prior: R.I.’s weakening influence in Washington,\" Jan. 14, 2014", "Emails, Jonathan Boucher, executive director, Rhode Island Democratic Party, Jan. 31-Feb. 6, 2014", "Congress.gov, \"H.R.803 - SKILLS Act,\" \"H.R.2481 - Veterans Economic Opportunity Act of 2013,\" \"H.R.2052 - Global Investment in American Jobs Act of 2013,\" \"H.R.678 - Bureau of Reclamation Small Conduit Hydropower Development and Rural Jobs Act,\" \"H.R.1105 - Small Business Capital Access and Job Preservation Act,\" \"H.R.1963 - Bureau of Reclamation Conduit Hydropower Development Equity and Jobs Act,\" \"H.R.1965 - Federal Lands Jobs and Energy Security Act of 2013,\" \"H.R.2231 - Offshore Energy and Jobs Act,\" and \"H.R.2640 Central Oregon Jobs and Water Security Act,\" accessed Feb. 4, 2014", "Gop.gov, \"Summary of Jobs Bills Stalled in the Senate,\" Oct. 27, 2011, accessed Feb. 4, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]