["A video currently doing the rounds on social media shows West Bengal CM Mamata Banerjee being greeted with chants of ‘Jai Shri Ram’. It has been claimed that the incident took place at the Raj Bhavan in Kolkata. BJP MP from Karnataka, Shobha Karandlaje is among those who have shared this video clip on Twitter.", "What a Sight!!#MamataBanerjee being welcomed with #JaiShreeRam chants outside the Kolkata Rajbhavan.", "She must be getting #JaiShreeRam welcomes very often these days. pic.twitter.com/ymoRzY1KY4", "— Shobha Karandlaje (@ShobhaBJP) May 29, 2019", "Mahesh Vikram Hegde, founder of the fake news website Postcard News has also posted this video on his Twitter account, saying that the West Bengal CM is being trolled openly at the Raj Bhavan.", "Now She Trolled Openly in Bengal Raj Bhavan", "What a beautiful reaction, I love the kind of faces she make 😂😂 pic.twitter.com/DQxpm5qdtJ", "— Mahesh Vikram Hegde (@mvmeet) May 28, 2019", "The video has also been circulated on Facebook. Posted by Vivek Shetty (also founder of Postcard News) on May 28, the video clip has been viewed over 215,000 times and shared over 6700 times so far.", "Now She Trolled Openly in Bengal Raj Bhavan 😝", "Posted by Vivek Shetty on Tuesday, May 28, 2019", "Alt News found that the original video, uploaded by a India Today correspondent, has different audio from the clip which has been circulated widely. The video clip had been uploaded by Indrajit Kundu on Twitter on February 1, 2019 and shows Mamata Banerjee greeting BJP Bengal chief Dilip Ghosh at the state assembly and NOT the Raj Bhavan.", "#Bengal chief minister @MamataOfficial and #Bengal BJP chief @DilipGhoshBJP came face to face at the state assembly today. Watch what happend! #JabWeMet pic.twitter.com/02qHzDNRLT", "— Citizen Indrojit | নাগরিক ইন্দ্রজিৎ (@iindrojit) February 1, 2019", "In the above video clip which is 11 seconds long, Mamata Banerjee asks Dilip Ghosh, “Dilip Babu, are you fine?”, to which Ghosh replies, “I am absolutely fine madam”.", "The backdrop to this issue about Mamata Banerjee and the ‘Jai Shri Ram’ slogan is an incident which had occurred in early May 2019 when the TMC chief was campaigning for the Arambagh Lok Sabha seat. Mamata Banerjee was greeted with slogans of Jai Shri Ram as her convoy had passed by. Responding to the sloganeering, Banerjee had stepped out of the car to confront the sloganeers. A video report of the same by NDTV is posted below.", "It may be noted over here that in the video which is currently being shared, at 0:03 minutes, a giggle can be heard. The same is faintly audible in the video posted above, at 0:44 minutes. Alt News compared the audio in the two video clips and confirmed that audio from the incident which took place at Arambagh in early May was laid over the audio of the video clip of Mamata Banerjee at the state assembly.", "In conclusion, the video clip showing Mamata Banerjee greeted with Jai Shri Ram slogans at the state assembly in Kolkata, has been edited with the original audio removed. The story was earlier fact-checked by Boom Live.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]