["The photo was published here on Facebook on November 17, 2019.", "The photo shows an injured man lying on a hospital bed with severe burns to his face, arm and chest.", "The post’s traditional Chinese-language caption translates to English as: “The police officer from the armoured car that just caught fire. Everyone please pray for this officer and hope him could recover soon.”", "Below is a screenshot of the misleading Facebook post:", "The photo was published on the same day pro-democracy protesters threw petrol bombs at a police vehicle during a stand-off at Hong Kong Polytechnic University (PolyU), Kowloon on November 17, 2019.", "This is a Reuters video of the incident published by Singapore-based broadcaster Channel NewsAsia on November 17.", "Police said the police vehicle reversed and escaped, as reported here by AFP.", "The same photo was published on Facebook here, here, here and here; on Weibo here; and here on a Hong Kong forum with a similar claim that it shows a Hong Kong police officer.", "It was also included in multiple posts here on Facebook, here on Twitter and here on Weibo, along with with three other photos which show people at the Hong Kong Polytechnic University on the evening of November 17, 2019. The posts have been shared more than 1,000 times.", "The claim is false; the photo has circulated online since at least 2018 in Malaysian media reports about a man who was attacked in Malaysia.", "A reverse image search on Google found this news article published by Malaysia-based Chinese language newspaper Kwong Wah Yit Poh on September 10, 2018.", "Below is a screenshot of the article:", "The article’s simplified Chinese-language headline translates to English as: “Stranger breaks into car, man attacked on the face and burned with fire”.", "The photo caption states: “The injured was attacked by a male stranger, and then set on fire on the face, and is now in the hospital for treatment.”", "The article states in part: “A Malay man running online business was attacked on the face by a stranger who suddenly sat in his car, then splashed liquid and ignited with a lighter, causing burns to the man’s face, chest and left arm. The injured is being treated at Tuanku Fauziah Hospital.”", "The article also states the attack happened at 1am on September 9, 2018 at a night market in Jejawi, Perlis, and the suspect was still at large.", "The same incident was also covered by Malaysian newspaper Berita Harian here, including the same photo of the injured man.", "Below is a screenshot of the article:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]