["By Sydney Nixon and Alan Jaffe", "Posted on September 3, 2020", "Facebook posts falsely suggest that envelopes used for mail-in ballots in general elections reveal party affiliation, saying postal workers may “toss” votes. Voting experts say they don’t know of any such labels in general elections — only on envelopes during primary elections.", "Some states have made it easier to vote by mail, particularly in recent months because of health risks from the COVID-19 pandemic, as we’ve written.", "But, as we’ve reported, President Donald Trump has attacked mail-in voting as “fraudulent” and “corrupt,” though voting experts have said his claims are exaggerated or false.", "A video post shared on Facebook amplifies false claims about the security of mail-in voting by showing ballot envelopes with bar codes that include the letters “D” and “R” — designating Democrat or Republican. The narrator on the video says that a postal worker can “toss” the ballot after seeing the party affiliation, and she warns: “Do not vote by mail.”", "Another post shows a screengrab from the video, with a finger pointing to the bar code, and the headline: “THE POST OFFICE KNOWS WHICH BALLOTS ARE DEM VS REP.”", "But the Facebook posts don’t explain that the envelopes shown in the video are from Florida’s Aug. 18 closed primary, during which voters could vote only for members of their own party.", "In a general election, ballot envelopes in Florida do not reveal party affiliation, an election official told us. Voting experts told us they aren’t aware of any jurisdiction using such labels in general elections, nor would there be a reason to do so.", "The office of the supervisor of elections for Palm Beach County, Florida — where the envelopes in the Facebook posts were sent — confirmed that in a statement to FactCheck.org. In a closed primary, “voters are sent ballots according to their precinct and their party affiliation. The ballots in that video are primary ballots.” The alphanumeric codes on the envelopes shown in the video are used to direct the ballots for counting.", "“The alternative would be to open the envelope and look at the ballot itself to ensure that the voter voted the proper party and precinct style. We want to maintain ballot confidentiality, so those numbers are on the outside,” the statement said. “It would be a federal crime for any post office employee to tamper with this process and we have received no such reports of anything like this happening.”", "The statement from the supervisor’s office, portions of which were shared on Twitter, noted, “All ballots for the general election in November will look exactly the same, as voters can vote for whoever they would like. There would be no way to tell the party affiliation of a voter based on their vote-by-mail envelope for the general election.”", "We contacted county election officials in other states to see if the same was true elsewhere. Officials in Los Angeles and Philadelphia told us that party designations do not appear on mail-in ballot envelopes for general elections in those counties.", "Matthew Weil, director of the Elections Project at the Bipartisan Policy Center, said that state laws determine what appears on ballot envelopes, though counties have some control over the design of the ballot materials. But party affiliation should not appear on envelopes in any general elections, he told us in a phone interview.", "Justin Levitt, an election law professor at Loyola Marymount University, told us in an email that the Facebook video is “misleading to the extent it implies anything about the general election.”", "“I don’t know of any election official in the country who indicates the voter’s party affiliation in the bar code (or on the envelope) for the general election. For a primary, it serves an administrative double-checking purpose (you can confirm with a quick scan that Democratic primary ballots are going to Democratic primary voters, etc.). But it doesn’t serve any similar purpose in the general election,” Levitt said.", "“In a general election, there’s no reason at all to have party affiliation listed on the exterior of a mail ballot, and I don’t know of anywhere where that happens,” he said.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Farley, Robert. “Trump’s Latest Voter Fraud Misinformation.” FactCheck.org. 10 Apr 2020.", "Kiely, Eugene, et al. “The President’s Trumped-Up Claims of Voter Fraud.” FactCheck.org. 30 Jul 2020.", "Levitt, Justin. Professor of law, Loyola Marymount University. Email exchange. 1 Sep 2020.", "Rieder, Rem. “Voting by Mail in the Swing States.” FactCheck.org. 7 Aug 2020.", "Supervisor of elections, Palm Beach County, Florida. Email exchange. 21 Aug 2020.", "U.S. Election Assistance Commission. “EAVS Deep Dive: Early, Absentee and Mail Voting.” 17 Oct 2017.", "West, Darrell. “How does vote-by-mail work and does it increase election fraud?” Brookings Institution. 22 Jun 2020.", "Weil, Matthew. Director of the Elections Project, Bipartisan Policy Center. Telephone interview with FactCheck.org. 1 Sep 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]