["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Power lines in Houston. More than 4 million people in Texas still had no power a full day after a historic storm caused widespread blackouts. (AP Photo/David J. Phillip)", "As millions of Texans regained power after a severe winter storm brought snow, ice and freezing temperatures, some conspiracy theorists tried to pin the widespread outage on the Biden administration.", "On Feb. 20, InfoWars, a conspiracy website run by Alex Jones, published an article with the headline: \"Joe Biden’s Dept. of Energy Blocked Texas from Increasing Power Ahead of Killer Storm.\"", "\"An Emergency Order from the Biden administration’s Department of Energy shows Texas energy grid operator ERCOT was instructed to stay within green energy standards by purchasing energy from outside the state at a higher cost, throttling power output throughout the state ahead of a catastrophic polar vortex,\" the story says.", "The article, interspersed with ads for InfoWars-brand sleep aid supplements, was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Facebook has banned InfoWars and associated accounts from its platform since 2019, citing concerns about hate speech and content promoting violence. Still, this article had been shared thousands of times on Facebook, so we wanted to take a closer look.", "(Screenshot from InfoWars)", "The story is wrong — the Energy Department did not \"block\" Texas from increasing power production before the winter storm hit. The \"major smoking gun\" cited by InfoWars is actually an emergency order that temporarily suspended federal emissions caps in the state so that some power plants could operate at maximum capacity.", "We reached out to InfoWars for a comment, but we haven’t heard back.", "ERCOT stands for the Electric Reliability Council of Texas. It was created in 1970 to oversee the state’s power grid beyond the reach of federal regulators.", "As freezing temperatures descended on large areas of the central and southern Plains, ERCOT asked its customers to conserve energy amid \"record-breaking electric demand.\" On Feb. 15, ERCOT reported that about 34 gigawatts of power were offline, mainly due to frozen instruments at natural gas and coal plants.", "Before that outage, ERCOT sent a letter to acting Energy Secretary David Huizenga requesting emergency assistance. Specifically, the corporation asked the government to allow Texas power plants to exceed federal emissions requirements until Feb. 19 so that they could operate at maximum capacity.", "\"In ERCOT’s judgment, the loss of power to homes and local businesses in the areas affected by curtailments presents a far greater risk to public health and safety than the temporary exceedances of those permit limits that would be allowed under the requested order,\" ERCOT President and CEO Bill Magness wrote. \"This request is narrowly tailored to allow only the exceedances that are necessary to ensure reliability over the next few days.\"", "The emissions ERCOT mentioned in its letter were sulfur dioxide, nitrogen oxide, mercury, and carbon monoxide. The corporation also anticipated an influx of wastewater as a result of the increased demand for electricity.", "On Feb. 14, the same day ERCOT sent its letter, the Energy Department issued an emergency order granting ERCOT’s request.", "\"Given the emergency nature of the expected load stress … I have determined that additional dispatch of the Specified Resources is necessary to best meet the emergency and serve the public interest,\" Huizenga wrote. \"Because the additional generation may result in a conflict with environmental standards and requirements, I am authorizing only the necessary additional generation, with reporting requirements as described below.\"", "RELATED: How Fox News, far-right TV blamed green energy for Texas’ power outages", "The emergency order applied predominantly to coal and natural gas plants. The Energy Department stipulated that ERCOT should \"exhaust all reasonably and practically available resources\" to \"minimize an increase in emissions.\"", "Many Facebook posts center on stipulations of the emergency order that permitted ERCOT to exceed emissions standards only under specific emergency levels. Those stipulations did not prevent Texas from ramping up its power production.", "In an emailed statement, the Energy Department told PolitiFact that its order \"allowed specified power plants to generate up to their maximum capacity in order to manage the expected increase in electricity demand.\"", "We reached out to the White House and ERCOT for comments, but we haven’t heard back.", "InfoWars wrote that the Energy Department \"Blocked Texas from Increasing Power Ahead of Killer Storm.\"", "That’s wrong — the Energy Department did the opposite. On the same day that ERCOT asked the government to allow power plants to exceed federal emissions caps, the Energy Department granted the request. The emergency order helped Texas increase its power production during what became a devastating winter storm.", "InfoWars’ article is inaccurate and ridiculous. We rate it Pants on Fire!", "Bloomberg, \"Texas Power Plants Get Emergency Clearance to Crank Up Output,\" Feb. 15, 2021", "CBS News, \"Texans face drinking water shortage as power grid returns to normal,\" Feb. 21, 2021", "CNBC, \"Alex Jones was banned from Facebook, but an hour later he was back on Facebook livestreaming,\" May 2, 2019", "CrowdTangle, accessed Feb. 22, 2021", "Email from the U.S. Department of Energy, Feb. 22, 2021", "ERCOT, DOE Order 202-21-1 Resource List", "ERCOT, \"Grid operator has restored power to 500,000 households,\" Feb. 15, 2021", "ERCOT, \"Grid operator requests energy conservation for system reliability,\" Feb. 14, 2021", "Facebook post, Feb. 20, 2021", "Facebook post, Feb. 20, 2021", "Facebook post, Feb. 21, 2021", "First Draft, Daily Briefing: Feb. 22, 2021", "InfoWars, \"Joe Biden’s Dept. of Energy Blocked Texas from Increasing Power Ahead of Killer Storm,\" Feb. 20, 2021", "KHOU, \"VERIFY: Energy Department gave Texas an emergency OK to exceed pollution limits,\" Feb. 19, 2021", "PolitiFact, \"Natural gas, not wind turbines, main driver of Texas power shortage,\" Feb. 16, 2021", "PolitiFact, \"Yes, aversion to federal regulation drove Texas to isolate its power grid,\" Feb. 18, 2021", "U.S. Department of Energy, ERCOT 202(c) Emergency Order Request", "U.S. Department of Energy, Order No. 202-21-1", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]