["An alleged picture of Congress workers feeding cake to former adult film actress Mia Khalifa’s poster is widespread on social media. Khalifa has been making headlines in India after she tweeted in support of the farmers’ protest. The solidarity expressed by international artists has led pro-government media and supporters of the ruling Bharatiya Janata Party to allude a global conspiracy against Prime Minister Modi. None of these claims is either supported by reason or evidence.", "Below is a tweet by BJP member Surendra Poonia mocking the Congress party – “Rahul Gandhi ji’s Congress. And then they say EVMs are hacked.” (राहुल जी के कांग्रेसी ! फिर कहते हैं EVM हैक हो गई.)", "राहुल जी के कांग्रेसी ! फिर कहते हैं EVM हैक हो गई …. pic.twitter.com/hCMw80PThJ", "— Major Surendra Poonia (@MajorPoonia) February 6, 2021", "Another BJP member Raj Anand Singh also shared the photograph in a rather distasteful tweet. “Why do these bootlickers like international dancers and those who show skin? No one asks for local Swara Bhaskar and what can we say about Arfa Khanum,” he wrote.", "@miakhalifa खालिस्तान आंदोलन के समर्थन मे किए ट्वीट के बाद कॉंग्रसी चमचे खुशी मनाते हुए वो भी देश के सबसे शिक्षित राज्य केरल मे.", "इन चमचों को विदेशी नाचने और अंग प्रदर्शन करने वालीं ही क्यू पसंद आता है 🙊देशी @ReallySwara को कोई पूछ ही नहीं रहा इस बार और @khanumarfa खैर छोड़ों 🤣 pic.twitter.com/14HqoKM4hx", "— Raj Aanand singh🇮🇳 (@rajanand_) February 6, 2021", "It was also tweeted by Rishi Bagree, who has often been found spreading misinformation. He later took it down.", "Another Twitter user पिंकू शुक्ला @shuklapinku’s post drew over 900 likes as of this writing. The image is massively viral on Facebook as well.", "A simple Google reverse image search reveals that the image is morphed. The original Congress poster features Rahul Gandhi. The photograph is available on Getty Images and was taken on June 19, 2007 on Gandhi’s birthday. Youth Congress supporters cut a huge cake and fed it to Gandhi’s poster on his 37th birthday. The image carries the credit ‘RAVEENDRAN/AFP via Getty Images’.", "In an earlier fact-check, Alt News had shown American pop artist Rihanna’s photograph was morphed to falsely portray that she held the flag of Pakistan. Rihanna’s tweet asking why the world isn’t talking about farmers’ protest in India is what drew international attention to the cause and sparked false news in India in support of the farm laws.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]