["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A May 2014 video ad opens with the narrator saying: \"One thousand people a day are moving to Texas, which means there will be 15 million more people over the next 25 years. And since people can’t bring their roads with them, that means we’ll have a lot of extra cars without additional driving space.\"", "If only to mull the narrator’s drawl, we recommend you watch the ad from Texas Future, an entity that has surfaced in advance of November 2014 balloting on a proposed constitutional amendment authorizing lawmakers to tap the state’s rainy day fund for road projects.", "We wondered about the 1,000-a-day statement and the declared link to 15 million more residents within a quarter century.", "1,000 additional Texans a day", "We’re ready to deem \"1,000 people a day move to Texas\" a golden oldie of flawed factoids, because it doesn’t acknowledge people routinely quit the state, too.", "The state demographer, Lloyd Potter, who we asked about the group’s claim, counseled by phone that more than 1,000 people a day may have moved to Texas from other states and countries from July 2012 through June 2013, but plenty of people also left, according to U.S. Census Bureau estimates. Potter noted by email that net migration over the 12 months -- people moving in less people moving out -- totaled 177,715. \"Dividing that by 365, we estimate that there were on average 487 net migrants to Texas each day,\" Potter emailed.", "That’s not as high (or catchy) as what Texas Future said.", "But there’s a way to get to a factually stout rendition of the 1,000 factoid. Overall, Potter and Robert Bernstein, a bureau spokesman, previously cited the bureau’s Texas estimates to say the state gained an average of 1,061 residents a day over the 12 months -- taking into account net migration as well as births here outpacing deaths.", "We gathered a slightly longer view of the 1,000-a-day figure from Steve Murdock, a Rice University sociologist and former state demographer and past director of the census bureau. Murdock said by email that per bureau population estimates covering April 2010 through June 2013, Texas added nearly 1,100 people a day with more than half the increase due to births outnumbering deaths. Net migration into Texas from abroad and from other states, he said, accounted for a gain of 515 people a day; births exceeding deaths was responsible for 577 more people a day.", "Fifteen million additional Texans in 25 years", "Enough about the first part of this claim; do all the expected additional residents mean there will be 15 million additional residents 25 years from now, as the group says?", "After our first-pass interviews with Potter and Murdock, a Texas Future spokesman, David Polyansky, said by email the projection of 15 million additional Texans has appeared in state reports including a March 2011 report on transportation by an advisory panel to the Texas Department of Transportation. It refers to 15 million Texans \"projected to arrive over the next 25 years.\"", "We nudged Potter about that. He confirmed such a projection, but cautioned it’s not expected to occur simply due to 1,000 new residents a day.", "Potter said the state’s projections based on population growth from 2000 to 2010 indicate a potential addition of 15 million residents in about 25 years by assuming that as more people settle in, an escalating number of babies will be born. \"Thus the growth in our population projections is more geometric (or compounding) in nature,\" Potter wrote.", "In contrast, Potter said, simply adding 1,000 residents a day to the population (as the group’s statement says) reflects \"arithmetic growth, which is substantially slower,\" meaning it would take nearly 39 years to gain 15 million additional residents by this factor alone, he said.", "Polyansky later agreed the average of 1,000 new Texans a day combines natural population growth as well as in-migration. The ad, he said, \"should be phrased differently,\" though it remains the case more people potentially puts more pressure on the highways.", "Our ruling", "Texas Future said: \"One thousand people a day are moving to Texas, which means there will be 15 million more people over the next 25 years.\"", "More than 1,000 people a day move to Texas, but at the same time hundreds leave. Still, the population grows by more than 1,000 a day, though that's mostly due to births outpacing deaths rather than Californians and other out-of-staters parking their Teslas.", "Another wrinkle: The state demographer agrees the population could grow by 15 million within about 25 years. But contrary to the group’s message, reasons for the potential growth extend beyond the number of people that could flock here from elsewhere.", "On balance, we rate this claim as Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "CLARIFICATION, 4:40 p.m., June 23, 2014: We revised our quotation of Lloyd Potter, the state demographer, to make it clear what he told us about the effects of net migration and there being more births than deaths in the state. This didn't affect our rating of the claim.", "Truth-O-Meter article, \"Texas trails for fastest-growing state, but more than 1,000 people a day have still been moving there,\" PolitiFact Texas, Jan. 16, 2014", "Emails and telephone interview, Lloyd Potter, Texas state demographer, San Antonio, June 11 and 12, 2014", "Email, Steve Murdock, Allyn R. and Gladys M. Cline Professor of Sociology, Rice University, June 11, 2014", "Emails (excerpted), David Polyansky, president, New Strategies Group, June 13, 2014", "Report, \"It’s About Time: Investing in Transportation to Keep Texas Economically Competitive,\" Texas 2030 Committee, March 2, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]