["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "(AP)", "Over the past few weeks, misinformation and personal attacks targeting Rep. Ilhan Omar, D-Minn., have made headlines.", "Most notably, President Donald Trump said that Omar, a U.S. citizen who immigrated as a Somali refugee, said that al-Qaida was \"wonderful.\" PolitiFact rated Trump’s statement False — he twisted her words.", "On Facebook, some users are pushing back against the notion that Omar has downplayed attacks by terrorist groups. A photo published on Facebook July 21 claims that Omar \"voted yes to provide further funding for the 9/11 First Responders Victims Fund,\" while Republican Sen. Rand Paul of Kentucky \"voted no.\"", "\"Who hates America again?\" reads the photo, which includes headshots of both politicians and was shared hundreds of times.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed, so we wanted to check it out. (Read more about our partnership with Facebook.)", "(Screenshot from Facebook)", "PolitiFact reached out to the Facebook user who shared the photo asking for their source. We’ll update this story if we hear back.", "Congress created the September 11th Victim Compensation Fund in 2001 to pay the people and relatives harmed or killed during the 9/11 terrorist attacks. The original program operated until 2004.", "The fund was revived between 2011 and 2016 with the passage of the James Zadroga 9/11 Health and Compensation Act of 2010. In December 2015, President Barack Obama signed a bill that extended the fund until 2020.", "For the past several months, lawmakers have been deciding whether to extend the fund through 2090 — and Paul has come under attack for his action on the bill.", "A quick Google search for the Victim Compensation Fund surfaced several recent articles about how Paul blocked the Senate from extending the fund July 17. The House passed the bill July 12.", "We checked footage from the session. Sen. Kirsten Gillibrand, D-N.Y., asked the Senate to pass the bill without debate, and Paul objected.", "\"It has long been my feeling that we need to address our massive debt in this country,\" he said. \"Therefore any spending that we are approaching, any new program that's going to have the longevity of 70, 80 years, should be offset by cutting spending that’s less valuable. We need to, at the very least, have this debate.\"", "The senator’s objection delayed a vote on the bill to July 23. Rand’s move didn’t technically constitute a vote — he was objecting to Gillibrand’s motion to pass the bill without debate and put it on the unanimous consent docket. It would be more accurate to say he stalled the bill’s passage, even if that did effectively kill the legislation for the time being.", "The Facebook post was shared before the Senate took its full vote. On July 23, Rand and Sen. Mike Lee, R-Utah, were the two senators who voted against the bill. Both proposed amendments; Rand’s would have required offsets for money spent on the fund, and Lee’s would have restricted the extension to 10 years. Both were defeated in roll call votes.", "As for Omar, we checked the voting record and found that the congresswoman voted in favor of the bill July 12.", "A Facebook photo claims Omar \"voted yes\" to pass a bill extending the September 11th Victim Compensation Fund while Sen. Rand Paul \"voted no.\"", "The congressional voting record shows that Omar did vote for the measure in the House. At the time the photo was published, Paul objected to a motion to pass the bill in the Senate without debate. The move did not technically constitute a nay vote, but it did effectively halt the legislation. Later, he did officially vote against the bill — he was one of two Republican votes against it.", "We rate the Facebook post True.", "Bowling Green Daily News, \"Paul defends stance on 9/11 bill,\" July 22, 2019", "Clerk of the United States House of Representatives, Roll call vote 474, July 12, 2019", "C-SPAN, \"Senate Session, Part 2,\" July 23, 2019", "Donald Trump, remarks at the White House, July 15, 2019", "Facebook post, July 21, 2019", "The Hill, \"Rand Paul blocks Senate from approving 9/11 victim compensation fund,\" July 17, 2019", "Kirsten Gillibrand, remarks in the Senate, July 17, 2019", "New York Daily News, \"9/11 Victim Compensation Fund renewal set for a Senate vote, $10.2B compensation package expected to pass,\" July 23, 2019", "PolitiFact, \"Donald Trump twists Ilhan Omar’s comments about al-Qaida,\" July 16, 2019", "Rand Paul, remarks in the Senate, July 17, 2019", "The September 11th Victim Compensation Fund, \"About the Victim Compensation Fund,\" accessed July 23, 2019", "Tweet from Donald Trump, July 14, 2019", "U.S. Congress, \"H.R.1327 - Never Forget the Heroes: James Zadroga, Ray Pfeifer, and Luis Alvarez Permanent Authorization of the September 11th Victim Compensation Fund Act,\" accessed July 23, 2019", "U.S. Congress, \"S.546 - Never Forget the Heroes: Permanent Authorization of the September 11th Victim Compensation Fund Act,\" accessed July 23, 2019", "Vox, \"The battle over extending the September 11th Victim Compensation Fund, explained,\" July 17, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]