["About this rating", "In late March 2021, Marwa Elselehdar, Egypt's first female sea captain, took to social media to debunk false claims that she was in command of a ship trapped in the Suez Canal.", "As of this writing, a massive cargo ship, the MV Ever Given, was lodged sideways in the Suez Canal, and caused a maritime traffic jam in the vital passageway in Egypt that provides a direct route between Europe and Asia.", "Readers emailed Snopes, reporting that viral social media posts alleged Elselehdar was the Ever Given's captain. The posts appeared to be an altered version of a real story published by the English-language news site Arab News. The real story, posted on March 20, 2021, was a profile about Elselehdar's accomplishments, breaking barriers.", "An altered screenshot shows a fake headline, spreading the false claim that Elselehdar was involved in the Suez Canal incident:", "Although the headline in the above image cuts off, it read, \"Cargo ship crashes into Suez Canal. First female Arab Lloyd captain involved in incident.\"", "Global shipping news site Tradewinds explained in detail the ways in which the headline is false:", "\"There was never any such story on Arab News; the ship on which Elselehdar is now chief mate had no connection with the incident; she does not work for Hapag-Lloyd's Arab Lloyd; and Arab Lloyd — the former United Arab Shipping Corp — is not a partner but a competitor of Evergreen.\"", "Elselehdar's ship is the Aida VI, which she navigated through the then-newly expanded Suez Canal in 2015 during its opening ceremony, a milestone detailed in the Arab News article.", "Elselehdar told Egyptian newspaper Youm7 that the hoax targeting her appeared to be part of a disinformation campaign that included fake social media accounts using her name.", "The Ever Given is owned by the Japanese company Shoei Kisen Kaisha. An Associated Press article identifies the crew of the vessel as having all come from India. It also had \"two pilots from Egypt’s canal authority aboard the vessel to guide it when the grounding happened around 7:45 a.m. Tuesday,\" according to the AP.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]