["About this rating", "As the Glastonbury music and performing arts festival got underway in June 2017, a purported screenshot of a news article about Radiohead fans wildly applauding a tuning session they mistook for a real song appeared on social media:", "The image mimics the format of a BBC news article, but the headline is nowhere to be found on the BBC's Radiohead artist page -- or anywhere else on the BBC web site. We found no record of this story in any other genuine news publication. The BBC's actual article about the band's performance at Glastonbury did not mention any awkward applause:", "Absorbing, challenging and achingly beautiful - Radiohead delivered a typically Radiohead sort of set for Glastonbury's opening night.", "The Oxford quintet emerged, bathed in white light, to the haunting piano refrain of Daydreaming, from last year's A Moon Shaped Pool album.", "Two hours and 25 songs later, they closed with Karma Police, singing: \"For a minute there, I lost myself.\"", "It felt like a perfect metaphor for the band's power to transport an audience.", "The earliest iteration of the viral fake news article that we could find came from a pretty unusual source -- a London flower shop's Twitter account:", "BREAKING NEWS: #Glastonbury2017 pic.twitter.com/mkihP4KsHi", "— Arena Flowers (@ArenaFlowers) June 23, 2017", "Although flower shops aren't known for throwing shade at Radiohead fans, Arena Flowers's Twitter account is full of similar jokes. For instance, they posted another fake news item about the Glastonbury Festival which claimed that Ed Sheeran played simultaneously on every stage:", "BREAKING NEWS: #Glastonbury2017 pic.twitter.com/BIReqQPXqX", "— Arena Flowers (@ArenaFlowers) June 25, 2017", "The news article about Radiohead fans mistaking a tuning session for a genuine song at Glastonbury is fake. However, this article is reminiscent of another embarrassing musical moment when Ravi Shankar fans actually did applaud a tuning session:", "Savage, Mark.   \"Radiohead Mesmerise Fans at Glastonbury with a Wayward, but Compelling, Set.\"\r\n    BBC.   24 June 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]