["By D'Angelo Gore", "Posted on March 10, 2017", "Rep. Maxine Waters suggested without evidence that unsubstantiated allegations of “sex actions” made in a dossier against President Donald Trump are “absolutely true.”", "The allegations that Waters referred to were made in a dossier compiled by a former British intelligence officer on alleged ties between Trump and Russia. BuzzFeed News published the full document online on Jan. 10, but explained that it was “unverified.”", "In an interview with MSNBC on March 9, host Ali Velshi told Waters that her Democratic colleague, Rep. Adam Schiff, wanted Chris Steele, the author of the dossier, to testify before the House committee investigating possible links between Trump and Russia.", "Velshi then asked Waters if she believed any of the dossier’s claims. In response, she said that “we already know the part about the coverage that they have on him with sex actions is supposed to be true.”", "Waters then added: “They have said that that’s absolutely true.”", "Velshi, March 9: Your colleague, Rep. Adam Schiff, a Democrat on the House panel investigating Donald Trump’s ties to Russia says he’s seeking testimony of a former British spy, who wrote an unsubstantiated dossier of alleged collusion between Donald Trump and Russia. Do you believe anything about that dossier?", "Waters: Oh, I think it should be taken a look at. I think they should really read it, understand it, analyze it, and determine what’s fact, what may not be fact. We already know that the part about the coverage that they have on him with sex actions is supposed to be true. They have said that that’s absolutely true. Some other things they kind of allude to. Yes, I think he should go into that dossier and see what’s there.", "Velshi: You say you know, you think them to be true. How are we all going to find out what is true and what isn’t true? I mean, does it help that you think so? Because unless you have information that we don’t have, that’s an allegation.", "Waters: Yeah, but you understand that I am saying the investigations must be done. The drilling down must be done. We must get to the facts of what it has been about. I don’t think you can do the impeachment just because I think or others think. But I think that if we do the investigations, that we will find the connections and I do think that impeachment will be necessary.", "It wasn’t clear who Waters meant by “they,” but it isn’t true that the sex allegations against Trump have been substantiated.", "The first page of the dossier says that Russia has “compromised Trump through his activities in Moscow sufficiently to be able to blackmail him,” and refers to “perverted sexual acts,” including an incident involving prostitutes that purportedly occurred at a Russian hotel in 2013.", "“The Moscow Ritz Carlton episode involving Trump reported above was confirmed by Source E,” the dossier says, although information about the source is redacted.", "In an email to FactCheck.org, Waters’ congressional office confirmed that she was “referring to this section of the dossier and saying that she would support an investigation into the redacted source and the information they provided as part of the broader House Intelligence investigation into potential ties between Trump associates and Russian operatives during the 2016 presidential election.”", "“She wasn’t talking about anything that’s not already in the public domain,” the email said.", "But Waters went beyond “saying that she would support an investigation into the redacted source and the information they provided.” She suggested that the dossier’s claims about Trump’s “sex actions” were “absolutely true,” when, in fact, the claims are unsubstantiated. She offered no evidence, either.", "Trump dismissed the dossier’s assertions on Twitter and during a Jan. 11 press conference. “Does anyone really believe that story?” Trump asked reporters. “I’m also very much of a germaphobe, by the way, believe me,” he said, alluding to the more obscene charges.", "The dossier reportedly had been circulating for months, but mainstream news organizations could not independently confirm the allegations and opted not to write about them until they “were summarized and included alongside a highly classified report assembled by the nation’s intelligence services,” as the Washington Post wrote.", "CNN, which broke the story that the four top U.S. intelligence officials had briefed Trump and former President Barack Obama about the dossier, said that it was “not reporting on details of the memos, as it has not independently corroborated the specific allegations.”", "Even BuzzFeed News, which made the controversial decision to publish the memos online in full, made clear at the time that the dossier’s charges hadn’t been verified.", "BuzzFeed News, Jan. 10: A dossier making explosive — but unverified — allegations that the Russian government has been “cultivating, supporting and assisting” President-elect Donald Trump for years and gained compromising information about him has been circulating among elected officials, intelligence agents, and journalists for weeks.", "The dossier, which is a collection of memos written over a period of months, includes specific, unverified, and potentially unverifiable allegations of contact between Trump aides and Russian operatives, and graphic claims of sexual acts documented by the Russians. BuzzFeed News reporters in the US and Europe have been investigating various alleged facts in the dossier but have not verified or falsified them.", "And when CNN reported in February that U.S. investigators had “corroborated some of the communications” mentioned in the dossier, its story said that only “relates to conversations between foreign nationals.”", "The CNN story said that “none of the newly learned information relates to the salacious allegations in the dossier.”", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]