["The photo was posted on Facebook here on June 18, 2020. It has been shared more than 6,000 times.", "The post’s Tagalog-language caption states: \"Those who don't SHARE this and Type Amen are Heartless These are Conjoined Twins in Surigao Born Just Earlier at 4 am SHARE this to help them\".", "Surigao is located in Mindanao, a major island in the southern Philippines.", "The photo was also shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "A reverse image search on Google followed by a keyword search found the same photo was featured in multiple reports about conjoined twins who were born in the Mexican city of Juarez.", "It was published in this Spanish-language report by the website noticiasya.com on January 9, 2017. The photo’s caption in the article reads: \"A baby from Juarez is born with two heads\".", "The report states in part: \"In Ciudad Juarez, the birth of a baby with two heads was reported. Doctors who specialised in the field think this is the first case in the city and in Mexico, which is why they call this an extraordinary case … For the moment, doctors cannot determine if the baby has small body with two heads, or if these are Siamese twins united in one body.\"", "Below is a screenshot comparison of the photo in the misleading posts (L) and the photo in the noticiasya.com report (R):", "The same photo was also published in reports about the January 2017 birth in Mexico by US television network Fox News here and UK tabloid newspaper The Mirror here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]