["About this rating", "On 5 March 2017, PoliticalGarbageChute.com published an article reporting that U.S. Secretary of Education Betsy DeVos had announced that history textbooks will be revised to exclude all information not found in the Bible:", "DeVos To Strike More Than 4.5 Billion Years Of Earth’s History From School Curriculum", "WASHINGTON, D.C. — Education Secretary Betsy DeVos announced today that the 2017-2018 school year will feature drastically revised history texts for all school grades. At a luncheon being held at a D.C. area school for corporate backers of charter schools, DeVos announced that all history books will contain only the information that can also be found in the Christian Bible.", "\"If it’s not important enough to be mentioned in the Bible,\" Secretary DeVos stated, \"I don’t see why it’s important enough to be in our texbooks [sic].\"", "DeVos was further quoted as saying, \"Nothing that has happened in the last two thousand years is really all that important, not enough to teach our kids about, anyway.\"", "However, both of these shocking quotes, along with the rest of article in which they are found, are completely fictitious. As the name of the web site implies, Political Garbage Chute traffics in political satire. This and other posts on the site are clearly labeled \"Humor/Satire,\" and a disclaimer on the site says:", "This website is satirical in scope and intent. It provides fake news and social criticism in a satirical setting.", "The article riffs on DeVos' reputation as a churchgoer and advocate of private (including home and faith-based) schools who once said that her goal is to \"confront the culture in which we all live today in ways which will continue to advance God’s kingdom.\"", "We have found no instances of her making public statements to the effect that history textbooks ought to be based on the Bible, however. Like a previous Political Garbage Chute spoof holding that President Trump signed an executive order declaring himself the winner of the popular vote in the 2016 election, it's a prime example of fake news.", "Miller, Emily McFarlin.   \"Betsy DeVos: 5 Faith Facts to Know About the Education Secretary.\"\r\n   USA Today.   7 February 2017.", "Schlarmann, James.   \"DeVos To Strike More Than 4.5 Billion Years Of Earth’s History From School Curriculum.\"\r\n  Political Garbage Chute.   5 March 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]