["A video showing two men in khaki uniform involved in a scuffle, has gone viral on social media in the context of the recent Motor Vehicles (Amendment) Act, 2019 which stipulates heavy penalties for traffic violations. The video clip has been posted with the message, “चालान काटने में हुई भारी कमाई से बटवारा सही से ना होने पर हो रहा झगड़ा” (Fight over sharing the spoils of heavy fines collected- translation).", "चालान काटने में हुई भारी कमाई से बटवारा सही से ना होने पर हो रहा झगड़ा😢😢. @Samiullah_inc @INCMdKhan @Dildars40799329 @indianmuslim123 @Ah201509 @pakhandi_bhagao @BuletRaja8329 pic.twitter.com/BlJKx1gFje", "— Deepak jain (@Deepak_jain_PHA) September 6, 2019", "The video and message have been shared widely by social media users on Twitter and Facebook.", "Using the key words पुलिस झगड़ा (police fight) on Google, Alt News found an article on NDTV India dated August 26, 2019.", "The article was titled, ‘Quarrel between PRD jawan and homeguard at Baraut police station; several blows landed’ (translation). The article stated the incident had occurred at the Baraut police station in Baghpat district of Uttar Pradesh. The fight was between a Prantiya Rakshak Dal (PRD) jawan and a home guard over money, and was related to collection of fine over halting of a vehicle for RTO inspection. We found a tweet by ANI regarding the same incident, posted on August 25. The same was reported by Zee News.", "#WATCH Baghpat: A fight broke out between a Prantiya Raksha Dal (PRD) jawan and a home guard in Mandi Chowki under Baraut police station, yesterday. pic.twitter.com/CrA1R4qb3G", "— ANI UP (@ANINewsUP) August 25, 2019", "ANI has quoted circle officer Baraut, RK Kushwaha saying, “RTO has seized a car which was released yesterday. The car was under home guard’s observation and a PRD jawan stopped the car at the mandi gate, because of which a fight broke out between them.” Baghpat police too tweeted about the incident, stating, “The two men scuffling in the video are not police officials. One is a home guard and another is a PRD jawan. Both departments have been intimated regarding the matter, and action against them has been initiated.” (translation).", "प्रकरण में मारपीट करने वाले दोनो कर्मचारी पुलिस कर्मी नहीं है।एक होमगार्ड व दूसरा PRD का जवान है क्षेत्राधिकारी बडौत द्वारा जाँच किए जाने के उपरांत दोनों के विरुद्ध कार्यवाही हेतु संबंधित विभागों को संस्तुति की गई है।", "— Baghpat Police (@baghpatpolice) August 25, 2019", "It may be noted that the men seen scuffling are not policemen, and the video is not related to the imposition of heavy traffic penalties, as implied. It is from Baghpat, UP and depicts a quarrel between a home guard and a PRD jawan.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]