["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "State Sen. Donna Campbell, R-New Braunfels, speaks at a Senate hearing at the Texas Capitol in 2017. JAY JANNER / AMERICAN-STATESMAN", "Texas lawmakers are considering a proposal that would prohibit city and county governments from doing business with Planned Parenthood and other abortion providers, eight years after passing legislation prohibiting the state from doing the same.", "During debate on the proposal in the Senate, Democratic lawmakers proposed amendments that would exempt spending on non-abortion related health care like sexually transmitted diseases or health crises like a Zika outbreak.", "Sen. Donna Campbell, the bill’s author, urged her colleagues to reject the changes and said no taxpayer dollars should go to an entity that performs abortions.", "\"When we’re talking about health, there’s nothing healthy about abortion,\" said Campbell, a Republican from New Braunfels. \"For an industry that in Texas alone aborts almost 60,000 innocent babies a year, when we’re trying to put things in perspective and you’re talking about healthier practices, having more opportunities for people with STDs, STIs — where is the outcry for the crisis of the almost 60,000 for abortion?\"", "We were curious about Campbell’s abortion statistics. The number of abortions performed annually in Texas has been declining, as the state has tightened restrictions on the procedure. What do the latest numbers tell us?", "Campbell’s estimate is close", "Alice Claiborne, Campbell’s spokeswoman, said this number came from reports published by the state’s Health and Human Services Commission about abortion providers in Texas.", "These reports are compiled using data reported to the state from abortion facilities, hospitals, ambulatory surgery centers and doctor’s offices.", "In 2016, there were 54,507 abortions performed in Texas, including 1,026 for patients from out of state, according to the most recent state figures.", "At least 200 of those procedures occurred in hospitals or doctor’s offices that would be exempt from Campbell’s legislation.", "Her bill applies to all abortion clinics and any ambulatory surgical centers or doctor’s offices that perform more than 50 abortion procedures in a given year.", "There are 26 facilities in Texas, including clinics and surgical centers, that perform abortions, according to a list curated by NARAL Pro-Choice Texas and Lilith Fund, which helps low-income patients pay for abortions.", "Texas law prohibits abortions past 20 weeks post-fertilization (with some exceptions) and requires any abortions performed more than 16 weeks post-fertilization to happen in a hospital or at an ambulatory surgical center, according to the American Civil Liberties Union of Texas.", "Campbell’s bill would end an Austin contract with Planned Parenthood in which the organization rents a city-owned building for a health center for $1 a year.", "State data shows decline in abortions", "The number of abortions performed in Texas has declined dramatically since 2001, the year with the earliest data published by the Health and Human Services Commission.", "The number fluctuated between 77,000 and 75,000 between 2001 and 2005, before rising as high as 82,000 in 2006. Since 2008, the number of abortions performed in the state has declined almost every year.", "Nationally, the number of abortions performed annually tends to surge after key court rulings that strike down abortion restrictions and then start decreasing, according to an earlier PolitiFact Texas report on the number of procedures.", "Texas lawmakers frequently pass legislation aimed at restricting access to abortion. In 2013, lawmakers passed a law to require all abortion facilities to meet the standards of ambulatory surgical centers and for physicians performing abortions there to have admitting privileges at a hospital within 30 miles.", "Key provisions of the law were ultimately struck down by the Supreme Court in 2016, but not before nearly two dozen abortion clinics had shut down, leaving just 18 open, according to research from the Texas Policy Evaluation Project at UT.", "By 2019, the number of facilities offering abortions had grown again to 26.", "To Campbell’s larger point about whether abortion correlates with health care, studies published by Texas Policy Evaluation Project showed that clinic closures affect the number of procedures performed but also limit access to general gynecological and reproductive care, said Kari White, an investigator at the policy group.", "\"Our work has shown that these various measures have had adverse effects on women’s health,\" White said, noting that closures mean \"women haven’t been able to get the reproductive care they need.\"", "Our rating", "Campbell said the abortion industry performs 60,000 procedures annually in Texas.", "In 2016, there were more than 54,000 abortions performed in Texas. Not all of those procedures were performed by providers who would fall under Campbell’s proposal.", "We rate this claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information.", "Email Interview with Alice Claiborne, spokeswoman for Sen. Donna Campbell, April 1, 2019", "Texas Legislature Online, Senate Bill 22, accessed April 1, 2019", "Austin American-Statesman, Texas Senate backs ban on city, county contracts with abortion providers, April 1, 2019", "PolitiFact Texas, Donna Howard says abortions are decreasing, Feb. 12, 2013", "PolitiFact Texas, Jonathan Stickland says Texas has more than 80,000 abortions each year, July 10, 2013", "Texas Health and Human Services Commission, Induced Terminations of Pregnancy, accessed April 1, 2019", "Know Your Rights!, Where to Get an Abortion in Texas, accessed April 2, 2019", "Texas Department of State Health Services, Directories of Ambulatory Surgical Centers, accessed April 2, 2019", "American Civil Liberties Union, Abortion in Texas, accessed April 2, 2019", "Texas Policy Evaluation Project, Abortion Wait Times in Texas, Oct. 5, 2015", "Phone Interview with Kari White, investigator at the Texas Policy Evaluation Project at the University of Texas at Austin, April 2, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]