["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Miami-Dade County Mayor Carlos Gimenez, right, speaks during a news conference with Florida Gov. Ron DeSantis, rear, at the Miami-Dade Emergency Operations Center, Monday, June 8, 2020, in Doral, Fla. (AP)", "When Carlos Gimenez took office as Miami-Dade mayor in 2011, he slashed the mayor’s salary from $230,000 to $150,000. Seven years later, the county commission agreed to raise his pay to $250,000 at his request.", "While Gimenez was a county commissioner about a decade ago, he had a car allowance for a Mercedes-Benz. When he became mayor he took over the lease personally.", "An attack by U.S. Rep. Debbie Mucarsel-Powell portrays Miami-Dade Mayor Carlos Gimenez as living the high life at county hall at taxpayers’ expense.", "\"Corrupt Carlos Gimenez approved a 67% pay raise for himself and increased his own pension,\" states Mucarsel-Powell’s website. \"He makes $250,000 a year, more than almost every big-city Mayor in the country. He also kept his taxpayer-funded Mercedes-Benz after slashing $400 million in government jobs and spending.\"", "Mucarsel-Powell, a first-term incumbent, faces a challenge from Gimenez, a Republican who has served as mayor of Florida’s most populous county since 2011. It’s one of 18 pivotal House and Senate races up for election on Nov. 3 that PolitiFact is tracking, and the most competitive congressional contest in Florida.", "Evidence cited by Murcarsel-Powell’s campaign website — including news articles and county documents — show that Gimenez did raise his pay and accept a car perk, but these claims leave out significant context. The car allowance was from about a decade ago before he was mayor, and the pay raise followed years of a pay cut.", "RELATED: Fact-checking Fla. Rep. Mucarsel-Powell’s attack on Gimenez over bridge collapse", "Gimenez did call for his own pay raise, but Mucarsel-Powell omits that Gimenez also substantially slashed his own salary several years earlier, delivering on a campaign promise.", "Gimenez’s predecessor earned a base salary of about $230,000 plus additional compensation. When Gimenez took office as mayor in 2011, he cut the salary to $150,000.", "The Miami Herald reported that seven years after Gimenez took office as mayor, county commissioners authorized Gimenez’s proposal to raise his salary from $150,000 to $250,000, a 67% increase.", "In 2018, Gimenez defended taking the salary increase.", "\"I made a decision to reduce my salary and benefits by half when I was first elected mayor in 2011 during a tough economic time in which all employees had to face salary reductions,\" Gimenez said. \"Today, after forgoing my full salary for seven years, our county's economy is strong, and our efforts to tighten the belt have paid off.\"", "The salary increase Gimenez secured meant that his pension would increase, too. It’s worth noting that if Gimenez wins the congressional race, his Washington salary will drop to the $174,000 paid to members of Congress.", "In short, yes.", "County records showed Gimenez was paid about $251,000 in 2019. Mucarsel-Powell cited a 2018 Business Journals article about the salaries of 57 big city mayors. The article showed that two mayors earned in the ballpark of Gimenez’s salary — in Los Angeles, the mayor’s salary was about $248,000, while in New York City, it was about $259,000. The highest paid mayor at the time was San Francisco’s, with a salary of about $300,000.", "We were unable to find a comparison of county mayor salary data.", "Comparing salaries among elected government officials is tricky due to varying forms of government in different jurisdictions. Miami-Dade County, with a population of about 2.8 million, is the seventh most populous county in the United States and has a strong mayor form of government. The elected mayor is the chief executive — the county doesn’t have a county manager or administrator.", "Gimenez did drive a Mercedes-Benz at taxpayer expense, but it wasn’t as mayor. This happened when he was a county commissioner with a car allowance from 2004 to 2011. In his final year on the commission, his annual salary of $6,000 came with benefits that included a $9,600-a-year car allowance.", "In 2009, the County Commission including Gimenez approved about $400 million in jobs and spending cuts amid the recession. Meanwhile, the county continued to pick up the tab for commissioners’ luxury cars, including the 2009 Mercedes Benz ML 350 SUV that Gimenez drove.", "Once he became mayor, Gimenez assumed the lease personally, according to Jennifer Moon, the county budget director. When the lease expired, he purchased the car for the residual value. As mayor for the last nine years, Gimenez has not had a car allowance.", "Mucarsel-Powell said Gimenez \"approved a 67% pay raise for himself and increased his own pension. He makes $250,000 a year, more than almost every big-city Mayor in the country. He also kept his taxpayer-funded Mercedes-Benz after slashing $400 million in government jobs and spending.\"", "The statement is partially accurate but leaves out important details. Gimenez did get a 67% pay raise in the fall of 2018, which will increase his pension. But the evidence shows he slashed the mayor’s salary when he took office in 2011.", "Mucarsel-Powell’s campaign website points to a 2018 news article which shows that the $250,000 salary is higher than most big city mayors.", "In 2009, the County Commission along with Gimenez voted for the budget cuts while keeping their car perks. But when Gimenez became mayor, he took over the lease for his car and no longer had a car allowance.", "We rate this statement Half True.", "U.S. Rep. Debbie Mucarsel-Powell, Campaign website and back up, Sept. 17, 2020", "Miami Herald, Miami-Dade's mayor secures a pay boost as the county's new budget takes effect, Oct. 2, 2018", "Miami Herald, How the mayor of Miami-Dade might end up earning more than the mayor of New York, Dec. 13, 2017", "Miami Herald, Budget crisis or not, Miami-Dade leaders keep luxury cars, May 23, 2010", "Tampa Bay Times, After the primary, Florida Rep. Debbie Mucarsel-Powell moves up in vulnerability rankings, Sept. 8, 2020", "PolitiFact, In Miami mayor's race, third-party group tries to tie Carlos Gimenez to Carlos Alvarez over car deal, June 20, 2011", "Email interview, Nikki Rapanos, Carlos Gimenez campaign spokeswoman, Sept. 23, 2020", "Interview, Joshua Karp, Debbie Mucarsel-Powell campaign spokesman, Sept. 23, 2020", "Email interview, Jennifer Moon, Miami-Dade County deputy mayor and Director of the Office of Management and Budget, Sept. 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]