["About this rating", "A federal judge issued an order enjoining Brandon High School from including religious material and events in school-sponsored activities after the school district had violated a previous agreement to stop doing so.", "A judge did not specifically order Brandon's marching band not to perform the hymn at a halftime show, and spectators at a Brandon High football game did not sing the  \"forbidden song\" despite its alleged ban from the event.", "On 21 August 2015, Fox News columnist Todd Starnes published an article titled \"School Band Told to Stop Performing 'How Great Thou Art.'\" Starnes' opinion piece drew national attention to a debate initially localized to Brandon, Mississippi, over the mixing of prayer and other religious elements with school events:", "There was no halftime show under the Friday night lights at Mississippi’s Brandon High School — the marching band had been benched.", "The band was ordered off the field because the Christian hymn \"How Great Thou Art\" was a part of their halftime show — in violation of a federal court order.", "Word about the band getting benched spread across the town quicker than kudzu. I must have received emails and Facebook messages from nearly the entire state — from Desoto County to Yazoo City.", "Something must be done to right this wrong, people said. A message had to be sent to the likes of Judge Reeves. Locals gathered in coffee shops and garages to devise their plan.", "And what they did — would become known as the musical shot heard around the world.", "During halftime of Friday night's game — a lone voice began to sing the forbidden song.", "Starnes' take on the events at Brandon High School was largely accurate, although typically one-sided and exaggerated. The portion about a \"lone voice\" singing a \"forbidden song,\" for example, was misleading since spectators were not in any way prohibited by court order from singing hymns or engaging in other religious speech (nor had a judge specifically enjoined the band from performing \"How Great Thou Art\").", "Soon after Starnes' column appeared, social media rumors circulated claiming that a federal judge (appointed by President Obama) forbade the Brandon High School marching band from including the hymn \"How Great Thou Art\" from their halftime show. But that condensed version of events didn't correctly sum up precisely what was going on in Brandon.", "First, it's true that U.S. District Court Judge Carlton Reeves was appointed by President Obama in April 2010. It's also true that Reeves issued a ruling in July 2015 in which he found the school district to be in violation of an earlier agreement pertaining to prayer in schools.", "As the Clarion Ledger reported on 22 August 2015, the school board (and not Reeves) made the decision to eliminate \"How Great Thou Art\" from the halftime show, and that decision was made by the district in order to comply with previous court rulings that pertained to a 2013 lawsuit brought by a Northwest Rankin High School student:", "School Board president Ann Sturdivant said because of the court order, the board \"had no choice\" but to make the decision it did.", "In 2013, a Northwest Rankin High School student sued the district and then-Principal Charles Frazier over a series of Christian assemblies held at the school. The district agreed it had violated the student's First Amendment rights and settled the lawsuit by entering into an agreement and paying the plaintiff's attorney fees.", "However, in July of [2015], U.S. District Court Judge Carlton Reeves ruled that the district was in violation of the agreement when it held an awards ceremony where a Christian reverend delivered a prayer, and again when it assisted Gideons in distributing Bibles at an elementary school. Both events took place in 2014.", "As the article excerpted above clearly indicated, the district (not Judge Reeves) opted to pull a Christian hymn (\"How Great Thou Art\") from a school-related event due to previous incidents during which they were found to be in violation of extant court orders. A statement from the school issued on 21 August 2015 quoted the court order in question:", "A Federal Court Order was recently issued to the Rankin County School District.", "The order states: 'Defendants are permanently enjoined from including prayer, religious sermons or activities in any school sponsored event including but not limited to assemblies, graduations, award ceremonies, athletic events and any other school event. That means administrators, teachers and staff of the Rankin County School District may not participate in any religious activity, or solicit or encourage religious activities at school or while performing duties as a RCSD employee.'", "Notably, \"administrators, teachers and staff of the Rankin County School District\" were specifically mentioned in the Federal court order. (Parents, students, and spectators were not bound by it, and thus did not engage in singing a \"forbidden song\" during the halftime show, a pervasive misconception that conflates the right to impose prayer with a right to voluntary prayer.) That inaccurate interpretation appeared to be widespread among persons affiliated with the school:", "Because of the flap over \"How Great Thou Art,\" band members were informed Friday afternoon they would not be able to perform their halftime show — just hours before the season-opening game between Brandon and Ocean Springs.", "\"It's really unfair to just tell them at the last minute you can't perform your halftime show and that the show has been cancelled,\" Mary Fairchilds told WJTV in Jackson. Fairchilds has two children in the Brandon band.", "The decision to keep the band from taking the field has angered parents and students.", "\"We have the right to express music, everyone and music cannot be regulated. They didn't sing the words 'How Great Thou Art,' they are playing the music,\" Brandon High School parent Ken Chapman told WKRN. \"I'm saying it's time for Christians and other people to stand up and say were not going to take this anymore, we're going to make a difference. We're going to be heard.\"", "Although Judge Reeves issued a ruling permanently enjoining school district staff from endorsing the practices of any specific religion in the course of school activities, the school district decided to remove \"How Great Thou Art\" from their halftime lineup on their own after having been found in violation of a previous agreement to cease including religious material in school-sponsored events.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]