["The photos were published on Facebook here on September 8, 2020. The post has been shared more than 1,500 times.", "The post’s Thai-language caption reads in English: “Mae Sot checkpoint is about to burst… Burmese crossing over to escape from Covid. High infection rate please wear masks. It is a new strong strain of covid, can cause death quickly. By now Mae Sai will have been infected. Myanmar silences the news. From what we know now Tachileik already has 5,000 cases.”", "Mae Sot is a town in western Thailand that shares a border with Myanmar to the west. Mae Sai District is the northernmost district of Chiang Rai Province in northern Thailand. Tachileik is a border town in Shan State in eastern Myanmar.", "The photos were also published alongside a similar claim on Facebook here, here, and here.", "The claim is false.", "First and second photo", "The first photo in the set is actually an AFP photo showing Indian migrant workers queuing at the Anand Vihar bus terminal as they try to leave the capital Delhi during a government-imposed nationwide lockdown on March 28, 2020. Here is the photograph on the AFP Image Forum.", "The second image shows the same scene as this AFP photo taken the same date and time in Delhi, which also shows migrant workers at the Anand Vihar bus terminal.", "Below is a comparison of the first image in the misleading post (top) and the AFP image:", "A version of the misleading photograph was also posted on Facebook on March 29, 2020 here by a maths teacher in Delhi, one day after the AFP photo was taken.", "Very similar images of the queue of Indian migrants were posted here by a New Delhi based journalist on Twitter, and in the Times of India here.", "The photos from Delhi circulated just days after Indian Prime Minister Narendra Modi ordered a 21-day lockdown to curb the spread of the coronavirus, as AFP reports here.", "Third and fourth photo", "The third photo was published in this article by Khaosod, a Thai news website, on May 27, 2020.", "The article’s headline reads in English: “Prachuap Governor orders the deployment of barbed wires along the Thai-Myanmar border to obstruct contraband and illegal migrant workers.”", "The fourth photo was published on this Facebook post by Wassana Nanuam, a Thai journalist, on July 13, 2020.", "The Thai captions translate to English in part as: “Intercept migrant workers! Deploying barbed wires to the border.", "“Strict border patrol on Myanmar-Cambodia to intercept unregistered migrant workers sneaking into Thailand without screening, fearful of COVID carriers.”", "Fifth photo", "The fifth photo was featured in this report by Thairath, a Thai media organisation, published on March 22, 2020.", "The report’s headline reads in English as: “Myanmar migrant workers choose not to remain in Thailand, tens of thousands wait to cross the border in Mae Sot, on the last day before borders close.\"", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]