["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Middle class. According to a recent study, more than half of Americans say that’s what they are.", "More than a third of Americans with incomes below $20,000 describe themselves as middle class. So do a third of people with incomes above $150,000.", "The government doesn't officially define the \"middle class.\" But this much is certain: Since most people consider themselves middle class, politicians want their vote.", "In a recent campaign ad focusing on economic issues, Sen. Barack Obama directly appealed to this important constituency.", "\"Instead of extending the Bush tax cuts for the wealthiest — I’ll focus on you,\" Obama said. \"My plan offers three times as much tax relief to the middle class as Senator McCain’s.\"", "The claim refers to a report from the Tax Policy Center, which analyzed the tax plans of Sens. Obama and John McCain after interviews with their top economic advisers.", "The analysts concluded that under Obama’s plan, people with incomes in the middle 20 percent would see their federal income tax burden go down by $1,118 in 2009. Under McCain’s plan, those same people would see their federal taxes cut by $325.", "That’s more than \"three times as much tax relief.\"", "But a couple qualifiers are in order. First, those figures are for just one year of Obama's tax plan, 2009. If you look down the road, say at 2012, those in the middle quintile would see tax cuts of $2,197 under Obama’s plan; $1,441 under McCain’s. Not \"three times as much.\"", "Also consider that the middle 20 percent of incomes translates to people making between $37,595 and $66,354.", "Suppose you consider yourself middle class, but you make between $66,354 and $111,645 (in the 60 to 80 percent quintile). Then Obama’s plan would translate to a tax cut of $1,264 in 2007, as opposed to a cut of $994 under McCain’s plan. Not \"three times as much.\"", "\"Like all of these things, everyone is cherry-picking the facts,\" said Bob Williams of the Tax Policy Center.", "Obama’s claim that his tax plan would result in three times as much tax relief for the middle class \"is for one year (2009), not the whole lifespan of the tax plan,\" Williams said. \"There’s so many things happening at different times in the plan.\"", "The nonpartisan, business-backed Tax Foundation points out another caveat. The tables cited by the Obama campaign in the Tax Policy Center analysis don’t include the candidates’ health care plans.", "The McCain camp has argued that some of his biggest proposed tax cuts for the middle class come through his idea to replace the income tax exclusion of employer-paid health insurance with a refundable income tax credit of $2,500 for individual coverage or $5,000 for family coverage.", "Obama has a direct pay plan that would provide subsidies to help low- and middle-income families purchase insurance, as well as a mandate for health insurance coverage for children.", "As both health plans are not part of the tax code, it’s probably not fair to include them in a head-to-head comparison of McCain’s and Obama’s tax plans.", "But the Tax Policy Center did provide a preliminary report that concluded that under McCain’s health care plan, people with incomes in the middle 20 percent would see after-tax income increase by $1,559 in 2009. Under Obama’s health plan, those folks would see their income rise $269.", "While it’s not fair to simply add the difference between those figures to the earlier analysis, \"it’s probably safe to say that if you include McCain’s health care tax cuts, you do not get this three times greater figure\" that Obama cited, said Gerald Prante, a senior economist with the Tax Foundation.", "And then there’s the issue of defining the middle class. Is it the middle 20 percent? The middle 60 percent?", "It’s certainly fair for Obama to pick the middle 20 percent. But picking, say, the middle 60 percent would yield much different results.", "This much we can say for sure: A higher fraction of Obama’s tax cuts would go to the middle class than McCain’s. Perhaps the most stark contrast in tax distribution comes for those in the top quintile, people making more than $111,645. Under Obama’s plan, those folks, on average, would be paying $3,017 a year more in federal taxes in 2007, according to the Tax Policy Center analysis. Under McCains plan, they would be paying $6,498 less.", "As for Obama’s claim that his plan offers \"three times as much tax relief to the middle class as Senator McCain’s,\" it’s true for one year, and under one sensible definition of middle class. But since it’s not true when you look at the fourth year of the plan — and we are talking about electing a president for four years — we rate Obama’s claim Half True.", "YouTube,\n\nObama Campaign \"Same Path\" Ad\n\n, Sept. 30, 2008", "Tax Policy Center,\n\nAn Updated Analysis of the 2008 Presidential Candidates’ Tax Plans\n\n, by Len Burman, Surachai Khitatrakun, Greg Leiserson, Jeff Rohaly, Eric Toder and Bob Williams, Updated Sept. 12, 2008", "Obama Campaign Web site,\n\nObama’s Comprehensive Tax Policy Plan for America", "McCain Campaign Web site,\n\nMcCain Economic Plan for Low Taxes and Government Spending", "Pew Research Center,\n\nInside the Middle Class: Bad Times Hit the Good Life\n\n, April 9, 2008", "Interview with Bob Williams of the Tax Policy Center, Sept. 30, 2008", "Interview with Gerald Prante, a senior economist with the Tax Foundation, Sept. 30, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]