["The official Twitter handle of the Bharatiya Janata Party tweeted two purported images of the Western Peripheral Expressway. The image on the left intended to depict a barren land, while the photograph on the right attempted to showcase how it was converted into a fully operational expressway. BJP tweeted the images with the hashtag #5YearChallege and captioned it as – “Western Peripheral Expressway providing world-class infrastructure became operational in a time-bound deadline.”", "A Twitter user Kapil (@kapsology) tweeted that the images did not depict the Western Peripheral Expressway as claimed by BJP. He wrote, “the image on the left was that of the Lucknow-Agra expressway (2015) which was completed by Akhilesh Yadav in 22 months. The image on the right is 10 KM stretch of Delhi Meerut Expressway, which Modi inaugurated with 100 TV cameras.”", "The image on the left is of 302KM Lucknow-Agra expressway (2015) which was completed by @yadavakhilesh in a record time of 22 months.", "The image on the right is 10 KM stretch of Delhi Meerut Expressway, which Modi inaugurated with 100 TV cameras.", "The project is still pending 🤣 https://t.co/6rjjMg57Bv", "— Kapil (@kapsology) January 18, 2019", "Soon after Kapil’s tweet, BJP deleted theirs.", "Alt News found that information provided in Kapil’s tweet was indeed true. Upon reverse-searching both the images, we found that the left one depicted the Agra-Lucknow Expressway. American stock photo agency Shutterstock had uploaded a similar image of the under-construction expressway describing it as – “Lucknow; Uttar Pradesh; INDIA March 17, 2015, Aerial view of the under-construction new Agra -Lucknow Expressway, process with heavy equipment at on the construction site.“", "The image on the right portrayed the Delhi-Meerut Expressway, which was tweeted last year by BJP MP Vijay Goel himself.", "The Agra-Lucknow Expressway was inaugurated on November 21, 2016, by the former UP chief minister and Samajwadi Party president Akhilesh Yadav ahead of UP assembly polls. It was widely reported in the media. Financial Express had reported that the expressway was constructed in 23 months.", "The Delhi-Meerut Expressway is an under-construction project divided into three phases. Prime Minister Modi had inaugurated the first phase of the expressway in May last year. “The first phase has been completed entirely. The second phase is 15% complete. While the second and third phases are at 60% and 3% level of completion,” said R.P Singh, project director at the National Highways Authority of India (NHAI), according to The Wire.", "The Western Peripheral Expressway was inaugurated by PM Modi on November 19, 2018, nine years after its original deadline. The project was initiated under UPA-1.", "Despite the fallacy, multiple handles of the BJP tweeted the misleading images with the false narrative.", "While the main BJP handle has deleted the tweet, Alt News found that more than 20 other handles of the BJP tweeted the same #5YearChallenge images claiming that they were before and after photographs of the Western Peripheral Expressway – BJP Jharkhand, BJP Nagaland, BJP Odisha, BJYM Chandigarh, BJP Delhi, BJP Uttarakhand, BJP Tripura, BJP Sikkim, BJP Puducherry, BJP Chattisgarh, BJP Himachal, BJP Daman & Diu, BJP Chandigarh, BJP Bengal, BJP Andhra Pradesh, BJP Andaman Nicobar, BJP Arambagh, BJP Siliguri, BJP Live, BJP IT Cell Andamans, भाजपा किसान मोर्चा, BJP Odisha Live, BJP Lakshadweep.", "In conclusion, the BJP used images of Agra-Lucknow Expressway and Delhi-Meerut Expressway to claim that they depicted Western Peripheral Expressway. In the past as well, BJP has been found using incorrect images to accredit itself with infrastructural developments. BJP Chhattisgarh had used images from Gujarat and abroad to showcase improved highways and Ahmedabad mayor had tweeted a picture from Seoul as Sabarmati riverfront. There are many more such instances. But isn’t just the BJP that had spread misinformation in this manner. AAP had attempted to pass off a bridge in the Netherlands as Signature bridge in Delhi.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]