["In arguing that taxi drivers should be considered essential workers when Covid-19 vaccines are rolled out, the taxi industry claimed it transports 70% of South Africa’s commuters, or more than 15 million people daily. We crunched the numbers.", "The first doses of a vaccine against Covid-19 arrived in South Africa on 1 February 2021. These are intended for the country’s healthcare workers. The second phase of the country’s vaccine rollout plan will include other essential workers.", "South African minister of health, Zweli Mkhize, has said that minibus-taxi drivers will be prioritised in phase two, along with teachers, hotel and restaurant workers. This comes after calls from some in the country’s taxi industry for drivers to be recognised as essential workers.", "The National Taxi Alliance, or NTA, has said: “The taxi industry transports 70% of the commuting public, which translates to more than 15 million commuters daily.”", "Is this correct? The organisation was not able to provide a source for the statistics when contacted by Africa Check, so we went looking.", "The taxi industry transports 70% of the commuting public", "South Africa’s national land transport act defines a “minibus taxi-type service” as “an unscheduled public transport service operated on a specific route or routes, or where applicable, within a particular area, by means of a motor car, minibus or midibus”.", "A minibus can carry up to 16 people, including the driver. A larger vehicle, called a midibus, can carry up to 35 people.", "There are a number of definitions for the term “commuter”.", "The national transport act defines it as a person who travels “daily between home and work by means of a public transport service”.", "Herrie Schalekamp, a research officer at the Centre for Transport Studies at the University of Cape Town, told Africa Check that others use “commuter” to refer to any person using public transport for any trip purpose.", "Statistics South Africa (Stats SA), the country’s national statistics agency,  collects data on how people travel in the country.", "The most recent national household travel survey was conducted in 2013. It defined a commuter as “any person who regularly travels to and from work whether on foot or by motorised transport”.", "The survey estimated that 39.1% of workers used public transport as their main mode of travel to work, while 38.4% used private transport. Just over 21% of workers reported walking all the way to and from work.", "The survey found that 26.5% of all workers used taxis as their main mode of transport, an estimated 3.7 million people. This is roughly the same proportion of households (26.3%) who said taxis were their “usual” mode of transport to work in the 2019 general household survey.", "Stats SA notes that “in South Africa, common usage associates the word commuter with those who travel to work by public transport”, and this is how “commuting” is defined by the national land transport act.", "In 2013, the data agency found that 67.6% of workers who used public transport to travel to work used taxis. Buses, used by 19.5% of workers, were the second most common mode of public transport. Trains came in third, at 12.9%.", "The survey also asked households what their main mode of travel had been in the month before the survey. It found that 69.0% of households that used public transport used taxis. Stats SA told us this represents an estimated 9.9 million households.", "The National Taxi Alliance’s claim is close to the estimates from Stats SA – therefore we rate the claim mostly correct.", "One group for whom taxis were not the dominant form of transport was schoolchildren. The main mode of travel to an educational institution in 2013 was walking all the way. This was the mode of transport for 63.4% of students. Taxis were the second most common mode of transport to school, at 14.8%.", "The 2019 general household survey found that the four most common methods of travel to school in 2019 were walking (62.1%), a vehicle hired by a group of parents (13.3%), a private vehicle (9.6%) and then a taxi (7.5%).", "The University of Cape Town’s Schalekamp told us that the public transport sector would have changed since the 2013 survey was released. In particular, he said that the financial collapse of the Passenger Rail Agency of South Africa (Prasa) “unfolded almost entirely in the period since the last survey”.", "“We know in Cape Town that many of those former Prasa passengers who used the most well-travelled Metrorail line in South Africa, the central line between the Cape Flats and central Cape Town, had no option but to move to minibus taxis,” Schalekamp said. A similar move from rail services and towards taxis was expected in other large cities, he said.", "“We don’t have the resources to conduct a survey to know the scale of this shift.”", "Stats SA had to cancel a 2018 follow-up to the transport survey due to a lack of funding. The results of a 2020 survey are expected on 16 February 2021.", "The taxi industry transports “more than 15 million commuters daily”", "The National Taxi Alliance did not provide a source for the statistic. Stats SA said it did not have an estimate of the total number of people who used taxis in a single day for any reason. The statistics from their 2013 travel survey related only to workers using taxis as their main form of transport.", "The figure of 15 million has, however, been shared elsewhere.", "SA Taxi, a taxi finance business, claims on its website that “taxi operators transport over 15 million commuters every day”. It attributes this figure to the national household travel survey, which does not appear to include the number.", "An SA Taxi spokesperson told Africa Check that the number came from a 2014 Reuters article which said the country’s taxi industry “moves 15 million people a day”.", "The author of the article told Africa Check that he couldn’t remember the exact source of the figure, but he thought it had been provided by an employee of the South African National Taxi Council. The council has not responded to requests for comment.", "A figure of “15 million taxi trips a day”, again attributed to SA Taxi, was included in a report for South Africa’s national treasury conducted by transport analyst Philip van Ryneveld.", "The report said the national household travel survey found that “in 2013 South Africa’s minibus taxis transported 6.26 million people in the morning”. Africa Check has tried to contact Van Ryneveld for clarity on how this figure was calculated.", "We have rated the claim that the taxi industry transports “more than 15 million commuters daily” as unproven. The figure does not appear to be supported by the available data. The figure will also vary depending on the definition of “commuter” used and if the number of people or individual taxi trips are counted.", "Please complete this form to receive the HTML sharing code.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]