["About this rating", "On 21 December 2018, President Donald Trump posted an inaccurate statement on Twitter comparing his attempts to secure billions of dollars in funding for border wall construction to the efforts of former President Ronald Reagan:", "Even President Ronald Reagan tried for 8 years to build a Border Wall, or Fence, and was unable to do so. Others also have tried. We will get it done, one way or the other!", "— Donald J. Trump (@realDonaldTrump) December 21, 2018", "That same day, the federal government began a partial shutdown because President Trump and Democratic legislators in Congress could not reach agreement on an a budget. Trump wanted $5.7 billion appropriated to construct more wall structures on the U.S.-Mexico border, while Democrats refused to authorize it. The impasse resulted in a protracted closure of the federal government, with pressure mounting as government workers went without paychecks.", "Despite what President Trump said, former president Ronald Reagan didn't try for eight years to build a border wall along the frontier with Mexico. However, other administrations and agencies have indeed succeeded in building walls in sections, and walls and fencing already separate the U.S. from Mexico for hundreds of miles along the 2,000-mile border.", "Speaking to the Washington Post, Doris Meissner, who served in the Reagan administration as executive associate commissioner of the Immigration and Naturalization Service (INS), said, \"There was not any discussion at the senior policy levels during the Reagan administration about fencing or a wall that I can recall.\" (INS was the federal immigration agency that was replaced by Immigration and Customs Enforcement, commonly known as ICE.)", "Reagan addressed the topic during a 23 April 1980 debate with George H.W. Bush, a Republican primary candidate who would become Reagan's vice president. When asked by an audience member if \"the children of illegal aliens should be allowed to attend Texas public schools free,\" Reagan said the issue could be resolved by providing immigrants a path to work and live in the U.S. legally.", "Recognizing high unemployment rates in Mexico and the threat of the Cuban influence during the Cold War, Reagan said he believed in free movement between the U.S. and Mexico for those who wanted to come to the U.S. to work:", "Rather than making them ... we're talking about putting up a fence. Why don't we work out some recognition of our mutual problems, make it possible for them to come here legally with a work permit, and then while they're working and earning here, they pay taxes here? And when they want to go back, they can go back and they can cross. And open the border both ways by understanding their problems. This is the only safety valve they have with that unemployment that probably keeps the lid from blowing off down there. And I think we could have a fine relationship and it would solve the problem you mentioned also.", "Mettler, Katie.  \"What Ronald Reagan Actually Said About Border Security — According to History, Not President Trump.\"\r\n    The Washington Post.   24 December 2018.", "Garfield, Leanna.   \"29 Photos That Show the US-Mexico Border's Evolution Over 100 Years.\"\r\n    Business Insider.   24 June 2018.", "Stone, Daniel.   \"We Visited the Border Wall. Here's What It Looks Like.\"\r\n    National Geographic.   12 December 2018.", "Rosenberg, Eli and Katie Mettler.   \"Trump Claimed Ex-Presidents Told Him They Wanted to Build a Wall. Four of Them Say It’s Not True.\"\r\n    The Washington Post.   8 January 2019.", "NPR.   \"A Reagan Legacy: Amnesty for Illegal Immigrants.\"\r\n    4 July 2010.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]