["The misleading infographic was published in this Facebook post on September 8, 2019, and has been shared more than 18.000 times since.", "The infographic states: ”HONDURAS POP: 8.2 MILLION, BANS CITIZENS FROM OWNING GUNS, HIGHEST HOMICIDE RATE IN THE ENTIRE WORLD.”", "“SWITZERLAND POP 8.2 MILLION, REQUIRES CITIZENS TO OWN GUNS, LOWEST HOMICIDE RATE IN THE ENTIRE WORLD.", "“JUST SHOW THEM FACTS! THEY REALLY HATE FACTS!!!”", "Below is a screenshot of the misleading post:", "The infographic was also shared here on Facebook, and here and here on Twitter.", "It has also been shared here on Reddit and here on a Christian blog.", "The infographic is misleading; Honduras does not ban its citizens from owning guns, nor does it have the highest homicide rate in the world; Switzerland does not require its citizens to own guns and nor does it have the lowest homicide rate in the world. The population figures in the infographic are also not accurate.", "Honduras", "Honduras recently tightened its gun laws. In May 2019, the government introduced a new law which permits citizens over 21 years old who do not have a drug or alcohol addiction to own up to three firearms. This press release published by the National Congress of Honduras on June 18, 2019, gives details of the gun law changes.", "Previously, Hondurans could own up to five firearms if they obtained a permit which lasts for four years, according to page 10 of this report titled “Firearms Trafficking in Honduras” published by non-profit group InSight Crime and Honduras’ Asociación para una Sociedad más Justa in 2017.", "Based on the most recent data from the United Nations Office on Drugs and Crime published here, El Salvador topped the 2017 chart of homicide rate, followed by Jamaica and Honduras, while at the bottom of the list are Japan, Singapore and Hong Kong.", "Below is a screenshot of the chart of homicide rate by countries sorted from the highest to the lowest (L), and vice versa (R):", "Honduras was not the country with the highest homicide rate, neither was Switzerland the one with the lowest. Below is a screenshot of UNODC data on where they stand:", "Government data published by Honduras’ National Institute of Statistics here states Honduras has a population of more than 9.2 millions as of October 2019.", "Switzerland", "In Switzerland, citizens are not required to own guns. Applications to carry a weapon are granted if an individual can prove that he or she needs a weapon, for example while working as a private security officer.", "Individuals must also pass an exam on how to use a firearm. This web page published by Switzerland’s Federal Office of Police gives details on the gun regulations.", "Each of Switzerland’s 26 cantons (states) are responsible for issuing weapons permits.", "This Swiss government web page states military service is compulsory for men and voluntary for women in Switzerland, which includes mandatory firing practice. But if citizens feel unable to carry out military service due to a conflict of conscience, they can carry out their service in a civilian role instead, which would not involve gun use.", "The Small Arms Survey, a Swiss-based research centre, estimated in 2017 that there were around 2.3 million firearms in circulation in Switzerland.", "Switzerland has a population of more than 8.6 millions in 2019, according its Federal Statistical Office.", "AFP South Africa previously debunked similar claims about Switzerland’s gun laws here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]