["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Irish Foreign Minister Simon Coveney cleared the way for Santa Claus to come to town when he declared the North Pole resident an essential worker, granting the jolly old man an exemption from self-quarantine so that he may deliver presents in 2020.", "In a floor speech on Nov. 26 that was posted to Twitter, Coveney said that his team had been “working on the Santa Claus issue for a number of weeks” and that Santa’s travels were considered “essential,\" allowing the world traveler to enter Ireland's air space as needed.", "\"It's important to say to all children in the country that we regard Santa Claus' travels as essential travel for essential purposes, and therefore he is exempt from the need to self-quarantine for 14 days and should able to come in and out of Irish airspace, and indeed in and out of Irish homes, without having to restrict his movements,” continued Coveney.", "In early December 2020, the U.S. Embassy in Ireland noted travel restrictions were in place in Ireland as part of the government of Ireland's five-tiered “Living with COVID-19” plan issued on Sept. 15. Under the policy, five levels of restrictions were outlined that could be put in effect across different counties depending on the severity of novel coronavirus infection. Ireland was placed on a third-level classification effective Dec. 1 through 15, which restricted domestic travel with exceptions made for work, school, medical appointments, and other limited circumstances — including Santa’s very necessary holiday work.", "Ireland isn’t alone in its decision to issue special privileges to Santa. Belgium’s Health Minister, Frank Vandebroucke, wrote a letter published in the French language newspaper Le Soir, assuring Santa that he was exempt from quarantine rules that would otherwise interfere with his travel plans.", "Australian health officials also promised Santa that they would not impede his or his helpers' travel into parts of the country on Dec. 24 and 25.", "“Mr. Claus, I understand you have significant magical powers which allow you to travel the world safely without transmitting COVID-19,” wrote New South Wales (NSW) Minister for Health Brad Hazzard in a letter.", "“I am aware you have safely delivered presents to children in Australia during previous pandemics and as a result, I am confident you will take the necessary precautions to keep our community safe.”", "Hazzard outlined several precautions for Santa to follow upon his planned stops, including delivering presents only after bedtime to minimize contact and a requirement that Santa and his elves wash hands regularly, carry hand sanitizer, and wear a mask whenever he and his helpers are unable to maintain physical distance. A spokesperson for Santa reportedly confirmed receipt of the special exemption, noting that her employer is happy to comply.", "\"After a challenging year, Mr. Claus wants this Christmas to be the best yet,” she said. “Santa’s advice to the NSW community is to stay safe and look after each other as you reflect on how blessed NSW has been in keeping COVID-19 at bay.”", "And if you’re worried about Santa bringing more than just presents this year, U.S. National Institutes of Health Director Dr. Anthony Fauci told USA Today that the gift-bearer is immune from SARS-CoV-2, the coronavirus that causes severe respiratory disease.", "\"Santa is exempt from this because Santa, of all the good qualities, has a lot of good innate immunity,\" Fauci told the publication in November.", "But a word to the wise: Santa isn’t just any human. The Centers for Disease Control and Prevention still recommends that the rest of us adhere to COVID-19 recommendations and guidelines, particularly as health experts predict a large uptick in virus cases and deaths in the months through February 2021.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]