["By Lori Robertson, Eugene Kiely, Rem Rieder, Jessica McDonald, Robert Farley and D'Angelo Gore", "Posted on August 10, 2020", "President Donald Trump made several false, misleading and exaggerated claims in press briefings he held Aug. 7 and 8 at Trump National Golf Club in Bedminster, New Jersey, spinning the facts on COVID-19 and the economy, among other topics:", "The HEROES Act, or the Health and Economic Recovery Omnibus Emergency Solutions Act, passed the Democratic-controlled House in May by a vote of 208-199. (One Republican voted in favor; 14 Democrats voted against.) But negotiations broke down on Aug. 7 between the White House and congressional Democratic leaders to find a coronavirus relief bill both sides could support.", "Trump spoke about the Democratic bill, his executive orders on relief efforts, the coronavirus pandemic and more in the Aug. 7 and 8 press briefings.", "On Aug. 8, Trump signed an executive order that directs his administration to identify federal funds “to provide temporary financial assistance to renters and homeowners” and “to promote the ability of renters and homeowners to avoid eviction or foreclosure” due to the coronavirus.", "In signing the order, Trump falsely claimed that “the Democrats don’t want to do anything having to do with protecting people from eviction,” even though the House Democrats had already passed a bill to do exactly that.", "Trump, Aug. 8: So I’m protecting people from eviction. Yet you’ve been hearing a lot about eviction, and the Democrats don’t want to do anything having to do with protecting people from eviction. I said, “Let’s do that separately. That can be a totally separate thing from passing along money so people can live.” And they didn’t even want to protect people from eviction.", "In fact, the House — without a single Republican vote — passed the Emergency Housing Protections and Relief Act, which would provide $100 billion for emergency rental assistance and create a $75 billion homeowners assistance fund. It also would extend the eviction and foreclosure moratorium for certain renters and homeowners that was put in place by the Coronavirus Aid, Relief, and Economic Security Act, or CARES Act.", "The CARES Act protected “most residents of federally subsidized apartments, including those supported by HUD, USDA or Treasury (Low Income Housing Tax Credit developments) as well a moratorium on filings for evictions for renters in homes covered by federally-backed (FHA, Fannie Mae, and Freddie Mac) mortgages” for 120 days, according to the National Low Income Housing Coalition. The moratorium expired July 24, but the House Democratic bill would extend the protections until March 2021.", "The Senate Republicans did not include an extension of the eviction protections in their package of coronavirus relief bills.", "Trump made the curious claim that he would pursue an executive order to require “health insurance companies to cover all preexisting conditions for all customers,” claiming this had “never been done before.” The Affordable Care Act already enacted such preexisting conditions protections.", "The ACA, signed by then-President Barack Obama in 2010, prohibits insurance companies from denying coverage to those with preexisting conditions, charging them higher premiums or excluding coverage of certain conditions based on health status.", "The Department of Health and Human Services’ website says these protections went into effect in 2014: “These rules went into effect for plan years beginning on or after January 1, 2014.”", "Trump, Aug. 7: Over the next two weeks, I’ll be pursuing a major executive order requiring health insurance companies to cover all pre-existing conditions for all customers. That’s a big thing. I’ve always been very strongly in favor — we have to cover pre-existing conditions. So we will be pursuing a major executive order, requiring health insurance companies to cover all pre-existing conditions for all of its customers.", "This has never been done before, but it’s time the people of our country are properly represented and properly taken care of.", "Trump acknowledged to reporters on Aug. 10 that this executive order would simply reinforce what the ACA had already done. “Just a double safety net and just to let people know that the Republicans are totally and strongly in favor of preexisting conditions, taking care of people with preexisting conditions,” he said. Trump justified his “never been done before” comment by saying “as an executive order, it hasn’t been done before.”", "Of course, an executive order restating existing law wouldn’t change anything.", "The Trump administration has actually worked to reduce the preexisting condition protections under the ACA in several ways. It has backed a lawsuit to nullify the law, even arguing at one point that preexisting condition provisions would have to go if the suit were succesful. The administration later backed the full invalidation of the health care law. (The Supreme Court should hear arguments for that case — California v. Texas — in the fall, with a decision not expected until next year.)", "Trump also supported Republican health care legislation in 2017 that would have included some, but not all, of the ACA’s protections. And the president pushed the expansion of cheaper short-term health plans that wouldn’t have to abide by the ACA’s protections, including prohibitions against denying or pricing coverage based on health status.", "In claiming that the U.S. is “doing very well” with the coronavirus, Trump boasted in the Aug. 7 briefing of the large number of U.S. counties with fewer than 20 cases of COVID-19.", "“More than half of America’s counties report fewer than 20 cases last week,” he said.", "Data from USAFacts, a not-for-profit that supplies data to the Centers for Disease Control and Prevention, shows that the president is correct, if using cases reported between Aug. 1 and Aug. 7. In that time span, 1,635 counties or county equivalents had fewer than 20 COVID-19 cases, versus 1,507 with 20 or more.", "But what Trump does not share is the number of people who live in those areas — less than 31 million, or 9.4% of the U.S. population. That means more than 90% of the American population lives in a county with 20 or more COVID-19 cases.", "The numbers flip if looking for new cases reported between July 31 and Aug. 7, which covers the full past week. In that timeframe, 1,608 counties or county equivalents — accounting for 91.5% of the population — had 20 or more cases, versus 1,534 below that threshold.", "Trump then proceeded to overstate the progress seen in the nation’s surveillance system.", "“Nationally, the percentage of emergency room visits with the coronavirus symptoms is down to almost half what it was in July,” Trump said.", "But data from the CDC does not show that much of a drop. On Aug. 7, the CDC released its figures for the week ending Aug. 1, which found 2.9% of emergency room visits were for a COVID-19-like illness. That’s an improvement from three weeks prior, when the July peak was at 4.1%. But it’s only a 29% decline, not one of almost 50%.", "Later, Trump returned to one of his favorite topics: COVID-19 testing.", "Trump, Aug. 7: The United States is only 5% of the world’s population, but we have conducted over 25% of the world’s testing. Think of that: 5% and we’ve given 25% of the world’s testing. Any proper global analysis of confirmed cases must really take this into account, because we’re constantly showing cases — cases, cases, cases are up. Well, the reason cases are up, because we’re doing — one of the reasons — we’re doing a lot of testing. We’re doing much more testing than anyone else. Close to 65 million tests where other countries have done very little testing.", "Trump is right that the number of confirmed cases needs to take testing into account. But as we have explained before, the large number of COVID-19 cases in the U.S. isn’t just due to testing; it also stems from increased transmission of the virus. And many other countries are still doing more testing per coronavirus case — meaning they are doing more testing for the size of their outbreaks.", "Figures from Our World in Data show that as of Aug. 10, or around that date, the U.S. has done only 12.4 tests per COVID-19 case, which is below the majority of the rest of the world. New Zealand has done a whopping 407; Australia, 235; and South Korea, 110.", "It’s difficult to know what percentage of the world’s tests the U.S. has done because data is missing for numerous countries and countries report test data differently. The White House did not explain how the president arrived at his 25% claim. But according to the information available on Worldometer, the U.S. accounts for about 17.8% of all tests to date. That includes 90 million tests in China, which if correct, would be more than the U.S.’s 66 million tests. If leaving out all tests from China — an extreme underestimation — the U.S.’s percentage swells to 23.6%.", "The U.S. is actually 4.3% of the world population, per the Census Bureau, not quite 5%. More critically, Trump highlighted testing percentage, which is uncertain, but did not also share that the U.S. has 25% of the world’s coronavirus cases and 22% of the world’s coronavirus deaths, according to the Johns Hopkins COVID-19 tracker. Caveats about reporting aside, it’s clear that the U.S. has a disproportionate number of both cases and deaths, given its population.", "Trump also falsely said that if the Democrats controlled Washington, they would pass “legislation gutting every single police department in America.”", "Trump, Aug. 7: If the Democrats controlled in Washington — the Democrats’ control of Washington — they’d pass — with all of the things they do — legislation gutting every single police department in America. They truly do; many of these people want to defund the police department. At a minimum, they’re to stop money from going to the police department, but in many cases they actually wanted to defund, completely, the police department. No city, no town, and no suburb would be safe. Your suburbs would be a disaster. Your cities, your towns would be a disaster.", "First of all, even if the Democrats in Washington wanted to, they would not be able to do much “gutting” of police spending. According to a backgrounder by the Urban Institute, 86% of police funding in 2017 was from local governments, with additional money ponied up by state governments. “Nearly all spending on both police and corrections was funded by state and local governments because federal grants account for a very small share of both expenditures,” the report said.", "But there is no reason to think they want to. As we have written, presumptive Democratic presidential candidate Joe Biden has said several times that he is opposed to defunding the police. “While I do not believe federal dollars should go to police departments violating people’s rights or turning to violence as the first resort, I do not support defunding police,” the former vice president said in a June 10 op-ed.", "A campaign spokesman also told us Biden supports more funding for police for initiatives to strengthen community relationships and for body-worn cameras.", "That hasn’t stopped Trump from making the false claim about Biden, as he did in a highly publicized interview with Chris Wallace on “Fox News Sunday,” which aired on July 19. Wallace quickly pointed out that Biden didn’t support defunding the police. And it hasn’t stopped the Trump campaign from running a series of ads suggesting criminals would run amok in a Biden administration. The ads, which feature images of rioting and mayhem and ringing but unanswered police telephones, convey the message that people “won’t be safe in Joe Biden’s America.”", "Trump also falsely claimed in the Wallace interview that “defunding the police” was called for in a collection of recommendations put together by supporters of Biden and his vanquished rival in the Democratic primaries, Sen. Bernie Sanders. That also is false. There is no mention of it in the recommendations of the Biden-Sanders Unity Task Force.", "There is no agreed upon definition for the term “defund the police.” Some critics of the police, who believe there is systemic racism in law enforcement, really do want to abolish police forces and replace them with other forms of community safety entities. Others advocate shifting some money and functions away from police departments to social service agencies.", "But Trump’s comments and campaign ads depict defunding the police as meaning taking away significant amounts of money, crippling law enforcement.", "In one interview, Biden did say he was open to the idea in some cases of shifting some funds from the police to social service agencies. But Biden said in the same interview, “that’s not the same as getting rid of or defunding all the police.”", "Nothing Biden has said backs up the idea that he would seek legislation “gutting” law enforcement and making Americans unsafe.", "Trump falsely said that “everybody” — Republicans and Democrats alike — was in favor of the payroll tax cut he has long sought.", "Reporter, Aug. 8: Sir, the payroll tax cut was opposed by both parties on Capitol Hill. Can you give your rationale as to why you think that’s important, particularly since it doesn’t help Americans who (inaudible)?", "Trump: Yeah. Okay. It helps people greatly. It helps our country get back. And anybody that would say anything different, I think, is very foolish. Everybody wanted it. By the way, the Democrats want it. The Republicans want it. They just couldn’t get it — they just couldn’t come to an agreement, but everybody wants it. And the very important thing is the people want it, and the people need it, actually.", "But that is not the case. Democrats have resisted cutting or suspending the payroll tax. And Republicans, who have loyally supported the president on many issues, have expressed little enthusiasm for the idea. Even before the talks on the latest coronavirus assistance legislation broke down, the White House gave up on the payroll tax cut in the face of GOP opposition.", "For example, Senate Majority Whip John Thune of South Dakota, the chamber’s second-ranking Republican, told reporters on July 21, “I’m not a fan of that. I’ve been very clear about that. We’ll see what it looks like, but if it’s a choice between doing [stimulus] checks and a payroll-tax cut, I think it’s pretty clear that the checks have a more direct benefit to the economy.”", "Sen. Charles Grassley, a Kansas Republican and chairman of the Senate Finance Committee, also expressed reservations. “Go to the fact that Social Security people think we’re raiding the Social Security fund,” Grassley said on July 20. “And we are raiding it, but we have always put in general fund revenue in it so it is made whole. But that creates — it might create political problems — but it creates a public relations problem.”", "In a television interview on July 24, Senate Majority Leader Mitch McConnell, generally a staunch ally of the president, explained why the payroll tax provision would be left out of the legislation. He said there was “bipartisan opposition” to the idea, adding, “I think we’re a lot better off just to send another direct cash payment to those who’ve been left out of all of this. It’s the quickest and easiest way to get relief. A payroll tax [cut], of course, would only help those who have a job.”", "From the outset, Democrats on Capitol Hill were against the idea. Senate Minority Leader Charles Schumer said on July 21 that a payroll tax cut “not only will harm those who rely on Social Security, but will do nothing for the tens of millions of Americans who have lost their jobs during this crisis.”", "Trump claimed in the Aug. 8 briefing that “the Democrat bill includes stimulus checks for illegal aliens.” That’s true only for some individuals living in the U.S. illegally who also file federal income taxes.", "The HEROES Act includes another $1,200 refundable tax credit — paid in advance — for eligible individuals and households based on their 2018 or 2019 federal income tax returns. The credit is $1,200 for single taxpayers and $2,400 for joint filers. An additional $1,200 would be available for each dependent up to a maximum of three dependents. For individuals, the tax credit phases out starting at $75,000 of modified adjusted gross income. For heads of households and joint filers, the income cutoffs are $112,500 and $150,000, respectively.", "Unlike the Coronavirus Aid, Relief, and Economic Security Act, which was signed into law in late March, the HEROES Act would make the “economic impact payments” available to those who filed federal income taxes using an Individual Taxpayer Identification Number, or ITIN.", "ITINs are used by individuals — including people living in the U.S. illegally — who file their taxes and do not have, or are not eligible to receive, a Social Security number. “In 2015, 4.4 million ITIN filers paid over $5.5 billion in payroll and Medicare taxes and $23.6 billion in total taxes,” according to a 2015 report from the Taxpayer Advocate Service.", "House Speaker Nancy Pelosi has argued that those people should’ve never been left out of the CARES Act, which denied stimulus payments of similar amounts to individuals without — or joint filers married to someone without — a Social Security number.", "The HEROES Act would make some taxpayers who filed with ITINs — and meet other requirements — retroactively eligible for payments under the CARES Act as well.", "Trump boasted of job growth since May, but neglected to mention the historic job losses that preceeded it.", "In his Aug. 7 remarks, Trump correctly said the U.S. had “added 1.8 million new jobs in July” and exaggerated slightly in saying the job growth totaled “over 9.3 million jobs since May.” It was just under that: 9,279,000, according to the Bureau of Labor Statistics.", "“And I will say that the job growth that we’ve seen over the last three months — 9.3 million — is the single greatest three-month period of job creation in American history,” he continued.", "BLS data on employment, dating back to 1939, shows no other three-month period coming close to the magnitude of that job growth; however, no other two-month period comes close to the job loss in March and April. Those losses totaled 22.2 million.", "The unemployment rate hit 14.7% in April and was 10.2% in July. In February, the U.S. rate was 3.5%.", "Trump touted a drop in the unemployment rate for Latinos, saying, “Hispanic American unemployment has decreased by nearly 32%.” That’s the drop in the unemployment rate, from 18.9% in April to 12.9% in July, a decline of 6 percentage points. The rate was 4.4% in February.", "He also cited a record for African Americans: “Jobs held by African Americans, which were hit especially hard by the shutdowns — incredibly hard — increased by nearly 1 million over the past three months, and that’s also a record. That’s a job record: African American, 1 million. It’s job record.”", "Similar to the job losses and gains for the U.S. as a whole, African American employment has rebounded somewhat, with the gain of 921,000 jobs from May through July. But that comes after 3.5 million jobs lost in March and April.", "Trump exaggerated in claiming the Democratic relief bill would “require the mass release of illegal aliens from detention” and “compel the mass release of inmates, including serious felons.”", "Trump, Aug. 8: They require the mass release of illegal aliens from detention. They also compel the mass release of inmates, including serious felons. How do you like that one? And this is in the bill that we’re talking about? What does this have to do with stimulus, the economy? What does this have to do with the coronavirus?", "The $3 trillion House bill, known as the HEROES Act, includes provisions that are designed to reduce populations in crowded federal facilities, such as immigration detention centers and prisons, to prevent coronavirus outbreaks.", "In a section known as the “Pandemic Justice Response Act,” the bill would require the release of inmates who are within 12 months of being released from prison, or those who are juveniles or over 50 years old, or have a “covered health condition,” such as diabetes, heart disease and chronic lung disease. Such inmates would be subject to community supervision for the remainder of their prison sentences.", "The director of the Federal Bureau of Prisons “may not place in community supervision any individual determined, by clear and convincing evidence, to be likely to pose a specific and substantial risk of causing bodily injury to or using violent force against the person of another,” the bill states.", "It is worth noting the bill would apply only to federal prisons — which hold a small percentage of those incarcerated in the U.S. Of the nearly 2.2 million people incarcerated in the U.S. in 2016, only 188,000 — or 8.7% — were held in federal prisons, according to the Bureau of Justice Statistics (table 3). There are currently only about 157,000 federal inmates, according to the Federal Bureau of Prisons.", "In the case of immigrant detainees, the Democratic bill would require the Department of Homeland Security to review immigration files of all detainees and release those “who are not subject to mandatory detention laws” and not a “threat to public safety or national security.”", "Those subject to mandatory detention (and therefore not eligible for release under the Democratic bill) have been convicted of crimes “involving moral turpitude,” such as drug offenses, human trafficking and money laundering, or specific offenses, such as aggravated felony and firearm offenses, according to a 2019 report by the nonpartisan Congressional Research Service.", "The Democratic bill is consistent with existing law. The Immigration and Nationality Act “permits aliens who are not subject to mandatory detention to be released on bond or on their own recognizance,” according to the CRS report.", "The bill is also consistent with current ICE enforcement policy. In mid-March, ICE announced that because of the pandemic it would temporarily adjust its enforcement priorities to “focus enforcement on public safety risks and individuals subject to mandatory detention based on criminal grounds” — the two groups that would still be detained under the Democratic bill.", "Since announcing its new enforcement policy, the detainee population has declined from 37,888 on March 7 to 21,546 on Aug. 1, and the percentage of detainees with criminal convictions has increased from 38% to 53%.", "So, the Democratic bill is consistent with existing immigration law and current ICE enforcement policy.", "Trump again wrongly claimed that Biden “wants to rip down the wall” the Trump administration has constructed along the Mexican border. But as we have written, Biden has said only that he would not build any more wall, not that he would dismantle existing fencing.", "“I think from what I’ve heard, Joe Biden, sleepy Joe wants to rip the wall down,” Trump said. “He wants people to pour into our country. They want to have open borders.”", "The Trump administration has constructed about 200 miles of border fencing, though most of it is replacement for dilapidated fencing or fencing with outdated designs. Less than four miles of fencing has been built where there was no fencing before.", "Biden has not said he would tear down the fencing that has been constructed by the Trump administration, nor has he advocated for open borders. To the contrary, in an Aug. 5 interview, NPR reporter Lulu Garcia-Navarro asked Biden directly, “Trump campaigned on ‘Build that wall.’ Are you willing to tear that wall down?”", "“No,” Biden responded, “there will not be another foot of wall constructed in my administration. … I’m going to make sure that we have border protection, but it’s going to be based on making sure that we use high-tech capacity to deal with it. And at the ports of entry — that’s where all the bad stuff is happening.”", "For nearly two years, Trump has been spreading a bogus tale that he was responsible for enacting legislation to create the Veterans Choice program, when, in fact, that legislation was signed by Obama in 2014.", "The president again made the claim in his Aug. 8 press briefing, saying, “And they’ve been trying to get that passed for decades and decades and decades, and no president’s ever been able to do it, and we got it done so veterans have choice.”", "That echoes Trump’s prior claims that it’s something people had been “trying to get” for “almost 50 years,” or “44 years.” He has even claimed the program — which allows veterans to receive care from non-VA health care providers if they were unable to get timely appointments or face long travel to VA facilities — was his idea, calling it “the greatest idea I think I’ve ever had.”", "The Veterans Choice legislation passed easily in August 2014, with overwhelming bipartisan majorities. Only eight lawmakers in Congress opposed the final bill. Trump has continued the program.", "This time when Trump made the claim, a reporter called him out on the falsehood, and the president ended the press conference.", "Reporter, Aug. 8: Why do you keep saying that you passed Veterans … Veterans Choice? It was passed in 2014. … But it’s a false statement, sir.", "Trump: Okay, thank you very much everybody. Thank you very much.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]