["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Louise Slaughter, D-Fairport, claimed ending an Obama era immigration policy could cost New York more than $2.5 billion. (Courtesy: Slaughter's Website)", "Rep. Louise Slaughter, D-Fairport, says ending an Obama immigration policy that protects children of undocumented immigrants from deportation would damage the economy.", "The Deferred Action for Childhood Arrivals program will expire in two years after President Trump rescinded the policy earlier this month. Almost 800,000 people benefit from the program.", "More than 41,000 of those recipients are in New York state, the fourth most of any state. Slaughter claimed in a tweet that ending DACA would be bad for business.", "\"#POTUS’ decision will harm our economy and endanger the future of thousands of Americans,\" Slaughter tweeted.", "DACA allows undocumented immigrants who came to the U.S. before their 16th birthday to legally remain in the country for at least two years. They can apply to renew their status after those two years.", "DACA recipients have many of the same obligations as permanent U.S. residents, like paying income tax.", "But will ending DACA be bad for the economy?", "Origin of the data", "Slaughter's claim comes from a recent report by the Center of American Progress, a left-leaning policy research organization.", "It estimated the U.S. would lose $460.3 billion over a decade if working DACA recipients were deported. New York state would lose $2.6 billion each year.", "\"We're saying this is what would be taken away if these DACA recipients were taken out of the workforce,\" said Philip Wolgin, managing director for immigration policy at the Center for American Progress.", "The organization based its figure on a 2016 report from two economics professors at Queens College. The professors predicted the U.S. would lose $4.7 trillion in gross domestic product by 2026 if all 11 million undocumented immigrants in the country were deported.", "Analysts from the Center for American Progress narrowed that finding to immigrants in the labor force protected under DACA.", "\"We looked at how many unauthorized workers there were and what the impact was of losing them,\" said Silva Mathema, a senior policy analyst at the Center for American Progress. \"We take that and we apply it to looking at the DACA workers.\"", "The analysts applied the same logic to each state, with a few caveats. The analysts assumed the labor characteristics of the DACA workforce were the same as other undocumented workers.", "The data applies only to DACA recipients who are employed, which the analysts estimated to be about 87 percent in each state.", "Other research", "Researchers on the other side of the political spectrum agree ending DACA would harm the country’s economy, but they dispute the amount.", "The Cato Institute, a libertarian public policy group, estimated the national economy would lose $283 billion over the next decade if all DACA recipients were deported. New York alone would lose more than $49.4 billion in that time - more than $5 billion a year.", "\"The actual number may vary but all of the estimates find that DACA will shrink GDP,\" said Alex Nowrasteh, an immigration policy analyst at the Cato Institute. \"The magnitude of GDP loss is in doubt but there is no doubt that GDP will shrink once DACA starts to expire.\"", "Where's that money coming from?", "A small part of the lost economic contribution is tax receipts. Undocumented immigrants eligible for DACA contribute more than $2 billion in state and local taxes each year, according to research from the Institute on Taxation and Economic Policy. More than $140 million comes from DACA eligible immigrants in New York state.", "The bigger part is that DACA allows immigrants to enter the labor force without restrictions, creating a domino effect that’s good for business.", "\"When you have people working it helps the larger economic activity of the area,\" Wolgin said. \"When there’s a bigger supply of immigrants, businesses ramp up their business and their hiring.\"", "At the same time, these immigrants are not eligible for most public benefits, like Medicaid or food stamps.", "Our ruling", "Slaughter said ending DACA would harm the economy.", "Researchers dispute the amount but confirm Slaughter’s claim that deporting DACA recipients would do more harm than good for the economy.", "We rate her claim True.", "Tweet from Rep. Louise Slaughter, Sep. 5, 2017", "Phone and email conversation with press staff from Slaughter’s office", "U.S. Citizen and Immigration Services latest DACA recipient count, March 2017", "A New Threat to DACA Could Cost States Billions of Dollars, Center for American Progress, July 21, 2017", "Phone interview with Philip Wolgin, managing director for immigration policy at the Center for American Progress, and Silva Mathema, a senior policy analyst at the Center for American Progress", "\"The Economic Impacts of Removing Unauthorized Immigrant Workers\", Center for American Progress report by Queens College Economics Professors Ryan Edwards and Francesc Ortega, Sep. 2016", "Email conversation with Ryan Edwards, former economics professor at Queens College, current professor at UCLA Berkeley", "\"The Economic and Fiscal Impact of Repealing DACA\", Jan. 2017, The Cato Institute", "\"The Economic and Budgetary Cost of Repealing DACA at the State Level\", Aug. 2017, The Cato Institute", "Email conversation with Alex Nowrasteh, immigration policy analyst at the Cato Institute", "\"State & Local Tax Contributions of Young Undocumented Immigrants\" April 2017, Institute on Taxation & Economic Policy", "\"DACA and DAPA Access to Federal Health and Economic Support Programs\", 2015, National Immigration Law Center", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]