["News agency IANS tweeted on July 4 that a Twitter account of late actor Sushant Singh Rajput’s father has surfaced through which he is demanding an inquiry of the Central Bureau of Investigation (CBI) into the suicide of his son. Rajput had died by suicide on June 14.", "Several leading media outlets picked up the story — The New Indian Express, Outlook, Mathrubhumi, National Herald, The Times of India and The Pioneer.", "Aaj Tak aired alleged tweets of Rajput’s father K K Singh and claimed that he is demanding a CBI probe into his son’s death. The tweet read, “अब मैं बहुत जल्द सुशांत की मौत की सीबीआई जांच करवाने की याचिका सुप्रिम कोर्ट में दर्ज करवा रहा हूँ। कल को अगर मुझे कुछ हो जाये तो कितने लोग मेरे साथ हैं। (Very soon I will file a petition in the Supreme Cout for CBI inquiry into Sushant’s death. If something happens to me tomorrow, how many people are with me?) The relevant section can be watched 2:20 minutes onward where Aaj Tak also said that the account could not be verified.", "#SushantSinghRajput के मौत की CBI जाँच की हो रही मांग और पटना में लोगों में फूटा आक्रोश। #ATVideo pic.twitter.com/nmlOE2b8oO", "— AajTak (@aajtak) July 5, 2020", "A few other outlets that published the story were Times Now, The Tribune and Dainik Jagran. While the first two took down their reports, Dainik Jagran updated its article and added a clarification at the end. Its initial report can be accessed here while the updated one can be viewed here. Times Now is yet to take down its Facebook post of the story.", "It is important to note that media outlets Aaj Tak and Dainik Jagran run dedicated fact-checking desks. Furthermore, Jagran’s Vishwas News and India Today Fact Check are signatories to the International Fact-Checking Network (IFCN).", "The story was also picked up by right-wing propaganda website The Frustrated Indian.", "The tweets were made by an account with the username @K_KSingh_. This is an imposter account with an earlier username @Real_Aishwarya_.", "The account was also impersonating singer Sonu Nigam.", "Alt News had earlier published a report which revealed that this account was impersonating Sonu Nigam to target actor Shahrukh Khan. Our detailed fact-check can be read here.", "The account has made four tweets since July 2 which talk about CBI inquiry into Rajput’s death.", "Tweets by an imposter account posing as late actor Sushant Singh Rajput’s father K K Singh were therefore picked by mainstream media outlets led by IANS. “He (Singh) has outrightly denied the existence of any such account and urged those behind such things to not create confusion in public,” a family source told PTI.", "The above case wasn’t the only instance when IANS published news based on fake accounts or satirical posts and other news organisations amplifyed the misinformation.", "1. IANS falls for parody account of Raghuram Rajan, several media outlets follow suit", "Last year in September, a story on former RBI governor Raghuram Rajan’s alleged response to Railway Minister Piyush Goyal’s gaffe where he attributed the discovery of gravity to Albert Einstein splashed across media outlets. “It’s a sign that you’re hiding real data: Rajan on Goyal faux pas,” was the republished IANS story.", "Turns out, the report was based on a parody account of Raghuram Rajan.", "2. Led by IANS, media outlets fall for a parody account of Tripura CM Biplab Deb", "“There is no truth in the (media) reports of Modiji summoning me to Delhi. The (Delhi) trip was long planned. In fact, Modiji loves me like a son.” In 2018, news agency IANS reported that this tweet was made by Tripura Chief Minister, Biplab Deb. The story was taken down after IANS realised that the tweet was by a parody account of Deb.", "3. IANS falls for satire on Pakistani PM Imran Khan reading COVID-19 chart upside down", "Earlier in May, the news agency had published a report titled, “Imran Khan reads chart upside down, claims Covid curve flattening.”", "This was based on a satirical post by website The Dependent.", "4. Crazy sex run by Irish sheep after consuming Viagra? Indian media falls for satire", "If an IANS ‘news’ feed republished by multiple media outlets last year was to be believed, hundreds of sheep in Ireland went on a “week-long uncontrollable sex drive” after they drank water from Ringaskiddy harbour where drug manufacturer Pfizer had “accidentally spilled tonnes of Viagra.”", "This too was based on an article by satirical website worldnewsdailyreport.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A claim that Nobel laureate Amartya Sen has passed away went viral on social media…", "Within hours of Prime Minister of Canada Justin Trudeau alleging that “agents of the government…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…", "On the front page of its national edition dated August 22, Hindi daily Dainik Jagran…", "In his reply to the no-confidence motion brought by the Opposition in the Lok Sabha,…"]