["The video was published on Facebook here on August 28, 2020.", "The post’s caption reads: “This is not Karachi, Kashmir or Kerala. No, this chant of ‘Islam Zindabad’ is being raised in Kolkata, capital city of #MamataBanerjee-ruled #WestBengal !”", "The slogan “Islam Zindabad” translates to English as “long live Islam.”", "The post’s hashtags refer to Mamata Banerjee, the chief minister of the Indian state of West Bengal. Kolkata is the capital city of the state.", "The video was also shared alongside similar claims on Facebook here and here, and on Twitter here.", "However, the claim is false.", "A reverse image on Google found a similar video was published on YouTube here on September 13, 2017. The video’s title reads: “Islami Andolon Bangladesh enclose Myanmar embassy.”", "Islami Andolon Bangladesh is an Islamist political organization in Bangladesh.", "Below is a screenshot comparison of the video in the misleading post (L) and the YouTube video (R):", "On multiple days in September 2017, tens of the thousands of people marched in the Bangladeshi capital of Dhaka to protest violence against Rohingya Muslims in Myanmar, as AFP reported here.", "Local media outlets also published reports about the protests here and here.", "Kolkata police also took to Twitter on August 28, 2020, to refute the claim, saying it is “false” and “fake news”.", "#FakeNewsAlert\n\t\tA video clip from Bangladesh is being falsely claimed to be from Kolkata. Legal action initiated. pic.twitter.com/v5MYLICKiI", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]