["“Scandal in Senegal,” says a female voice commenting on the footage in French. “There’s a guy who came to a house to vaccinate seven children against COVID-19. They dropped dead instantly”.", "In the video, a crowd of people is seen gathering outside a building where a police car is parked.", "The footage has been shared thousands of times across more than a dozen Facebook accounts, with captions in English and French echoing the claim that seven children died after being vaccinated for the virus which has killed more than 94,000 people around the world as of April 10.", "Contacted by AFP, a spokeswoman for Senegal’s health ministry rejected the claims as “fake news”.", "“There is no vaccine,” she said. “We have medical experts at the Institut Pasteur (a medical research institute, editor’s note) in Dakar working to create and certify a vaccine according to procedure. They will be completely transparent about their findings.”", "According to the World Health Organization (WHO), clinical trials are underway to test possible vaccines and specific drug treatments for COVID-19. At the moment, patients receive care to relieve symptoms as there is no specific antiviral medicine for the disease.", "Two leading French doctors sparked accusations of racism last week for discussing the idea of testing a vaccine for coronavirus in Africa on television. They later apologised and said they had been misunderstood.", "Senegal’s health ministry spokeswoman told AFP that “Senegal is a sovereign country and even if there was a vaccine, nobody could oblige us to vaccine our citizens”.", "AFP searched comments on the videos circulating on Facebook, with one suggesting the drama unfolded “when a Canadian and a Senegalese tried to vaccinate people”.", "A Google search for “Senegal vaccine Canadian” revealed news reports (in French) from March 26 on the arrest of two people, including a Canadian, in Senegal’s capital Dakar for falsely claiming they were health ministry staff there to vaccinate children.", "A report from Senegalese news site Senego, which also recounts this incident, features the same footage that has been circulating online alongside the false claims, but without the woman’s voice-over.", "The health ministry and police told AFP that a Senegalese man was briefly arrested following a misunderstanding on March 26 in Dalifort, an area of Dakar. However, they said that no Canadian was detained.", "“He never wanted to vaccinate people,” the health ministry’s spokeswoman said. “He was passing by a house, and the resident’s aunt started causing panic when she heard the word ‘coronavirus’. A crowd of people gathered outside, thinking this man wanted to vaccinate people by force”.", "Police officers were called and found no medical equipment on the man, she said.", "Contacted by AFP, a spokesman for the armed forces ministry confirmed that a Senegalese man was arrested and quickly released. He said that no Canadian was involved.", "“There was just one man who was a Senegalese national selling cosmetics door to door,” he said. “During the discussion, a member of the family asked him if he had any vaccines. He jokingly replied that he did. The aunt rounded up the whole neighbourhood. Officers attended and found only cosmetic products in the man’s bag. The drama was caused by the fact he was wearing a health ministry t-shirt”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]