["The 25-second clip was published here on Facebook on January 11, 2021. It has been viewed more than 54,000 times.", "The post's Indonesian-language caption translates to English as: “Moments of\n\tSriwijaya Air Passengers\n\tPanicking\n\tFrom Jakarta en Route to Pontianak\n\tSaturday, January 9, 2021”.", "The text superimposed on the clip reads: “Situation inside the plane, last moments of panicking passengers. We can only pray.”", "Indonesia’s Sriwijaya Air Flight SJ 182, carrying 62 people on board, crashed into the Java Sea shortly after it took off from Jakarta on January 9, 2021, AFP reported here.", "The clip with a similar claim has been viewed more than 1.2 million times in other posts on Facebook here, here and here; on YouTube here and here; as well as on TikTok here.", "The claim is false.", "A reverse image search on Yandex followed by subsequent keyword search found this two-minute, 17-second video posted on YouTube in July 12, 2020, titled: “Mid-Scare Turbulence hit on Indigo flight, INDIA | Turbulence in IndiGo flight ✈ | #Indigo 11July20”.", "The same scene can be seen at the 30-second mark in the YouTube video, but the audio of the clip in the misleading post has been edited.", "Below is a screenshot comparison of the clip in the misleading post (L) and the genuine YouTube video (R):", "IndiGo is an Indian budget airline carrier.", "The Kashmir Monitor, a Srinagar-based news site, also tweeted the same video on July 12, 2020, here.", "It also published a report about the flight here on July 11, 2020. It is headlined: “MID AIR SCARE: Passengers shriek as Kashmir bound Indigo flight from Riyadh hits air turbulence”.", "The report reads in part: “Panic gripped the passengers on board Indigo flight from Saudi Arabia when it encountered major mid-air turbulence minutes before its landing at the Srinagar International Airport.", "“Tears of joy swelled the eyes as the flight landed on the Srinagar airport. People raised their hands and recited thanksgiving prayers for reaching home safely.”", "The incident was also reported by British tabloid The Daily Mirror.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]