["About this rating", "An elaborate series of mock websites published on 13 December 2017 announced what they called a name change for the pro football team in Washington D.C.:", "According to a statement by the fictional Washington Redhawks:", "On December 13th, The Washington football team franchise announced an updated team name and logo, coming Fall 2018.", "The WASHINGTON REDHAWKS is a team EVERYONE can cheer for. The Franchise is proud to be a leader in bringing people together in the DMV and in our country during a time of growing divisions.", "The updated \"Washington Redhawks\" was inspired by team owner Dan Snyder's deep admiration for Native Americans. \"It is a symbol of everything we stand for: strength, courage, pride, and respect—the same values we know guide Native Americans and which are embedded throughout their rich history as the original Americans.\"", "Their website also featured a purported new logo:", "However, it also linked to a series of mock news stories promoting the move — web sites made up to look like stories from Sports Illustrated, ESPN, and the Washington Post.", "Within hours after publishing the announcement, the Native American advocacy group the Rising Hearts Coalition admitted that it was behind the faux name change in a separate statement. One of the group's members, Cherokee Nation activist Rebecca Nagle, said:", "We created this action to show the NFL and the Washington Football franchise how easy, popular and powerful changing the name could be. What we're asking for changes only four letters. Just four letters! Certainly the harm that the mascot does to Native Americans outweighs the very, very minor changes the franchise would need to make.", "After announcing their intention, the coalition added a disclaimer to the original post regarding the name change:", "This website is a parody and is not endorsed by the Washington football team, the NFL, Dan Snyder, or any of their affiliates because, in 2017, these people think it's still OK to use a racial slur for their mascot. This website was created by Native advocates to help us all imagine how easy and powerful changing the mascot could be.", "When we contacted the actual football team, they pointed us to their own statement:", "This morning, the Redskins organization was made aware of fraudulent websites about our team name. The name of the team is the Washington Redskins and will remain that for the future.", "The Redhawks campaign is the latest in a long series of protests calling on the team to change its name. Nagle told us her group employed the faux announcement after \"every possible tactic\" — including litigation, petitions, and protests — to exert pressure on the team.", "She also confirmed that some supporters of the campaign shared the post knowing it was fake in an effort to \"make it go viral.\"", "She said:", "It was an obvious hoax so it wasn't meant to trick people but [instead] meant to help people reimagine and to experience what a name change could look like. I also think that in our current political climate, a satirical action is an important tactic for us to be able to use.", "But some members of Native American communities were critical of the campaign for pushing the fake story; activist and athlete Phillip Espinoza, a member of the Mesa Grande band of Mission Indians, told us:", "The only people who this really affected are the people who care about this issue, which are Natives, and it affected them in a negative way by fooling us. Nobody else was paying as much attention and so their target audience, America at large, was never really affected as they hypothesized they would be. That audience will only read the headlines that say it was fake news. Although well intentioned, the only real effects that can be proven to have arisen out of this stunt were negative. Snyder was not suddenly convinced of how easy it would be to change the mascot and no Redskins fans were won over. At best, it was naive to think this tactic, especially in the era of fake news, would be at all effective in achieving anything other than misinformation and broken hearts.", "The campaign sent us an email responding to Espinoza's critique, saying that their effort forced the team to respond to the attention it drew. They added:", "For anyone that felt disappointment upon finding out the Washington team wasn't changing its name, who read the team's statement digging in its heels about the racism it intended to continue, we understand how that heartbreak feels. We feel it every day, too. We hope that what remains in you is the spark of joy and excitement, the feeling of power, that started in a moment when it felt possible and attainable. A successful, and accessible, movement for justice employs many tactics, and the one we chose today with our parody sites was one of humor, satire, and most of all, dreaming big.", "Nagle also noted that during his administration, former President Barack Obama and 50 Senate members all criticized the team over the use of its name, which activist groups have called an anti-Native American slur.", "However, at least two polls — one conducted in 2004 by the Annenberg Public Policy Center at the University of Pennsylvania and a 2016 Washington Post survey — both found that at least 90 percent of Native American respondents did not oppose the team's name.", "Washington Redhawks. \"Go Washington Redhawks!\"\r\n13 December 2017.", "Washington Redskins. \"Statement From The Washington Redskins.\"\r\n13 December 2017.", "Jackson, David. \"Obama Again Urges Redskins Name Change.\"\r\nUSA Today. 6 November 2015.", "Rhodan, Maya. \"50 Senators Demand Washington Redskins Change Their Name.\"\r\nTime. 22 May 2014.", "Barry, Dan. \"A Heated Linguistic Debate: What Makes 'Redskins' a Slur?\"\r\nNew York Times. 21 May 2016.", "Annenberg Public Policy Center of the University of Pennsylvania. \"Most Indians Say Name of Washington 'Redskins' Is Acceptable While 9 Percent Call It Offensive.\"\r\n24 September 2004.", "Woodrow Cox, John et al. \"New Poll Finds 9 in 10 Native Americans Aren't Offended by Redskins Name.\"\r\nWashington Post. 19 May 2016.", "Update [13 December 2017]: Added new comment from both the Redhawks campaign and a Native American community member criticizing their efforts.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]