["About this rating", "No shortage exists on the tales of schemes hatched by students to fool teachers and professors into giving them higher scores on tests. This is the story of a student who had to answer two essay questions. He was unsure of the answer for the first question, so he filled in \"the last sentence of two\" of the first answer to make it appear as if the preceding pages in a separate blue book had been lost.", "ThoughtCo defines a blue book as \"literally a book with about 20 lined pages that college, graduate, and sometimes high school students use to answer test questions.\"", "Author Jan Harold Brunvand documented several different versions of the urban legend in the 1986 book: \"The Mexican Pet: More 'New' Urban Legends and Some Old Favorites.\" This first one was quoted by Lew Girdler in \"The Legend of the Second Blue Book\" in Western Folklore in 1970, \"as he heard it in 1937 from a Berkeley graduate student.\"", "\"This student went into his final examination with an A- average. There were two essay questions. He knew nothing about the first one, but he was primed on the second. He filled his first blue book with just anything he thought of. Then he labeled his second blue book II and began it with what appeared to be the last sentence or two of the answer to the first essay question. Then on the second page of the second blue book he put down '2' for the second essay question, and he wrote a beautiful answer. He turned in only the second blue book. A few days later he got a postcard from the instructor saying he got an A in the course and apologizing for having lost the first blue book.\"", "Additional versions of the legend are available for reading on Google Books from Brunvand's 1986 book. One of them was played out in a television advertisement for Instant Kiwi, part of the lottery games in New Zealand:", "This tale (which dates to at least the 1930s) is one of several collegiate legends featuring students who cheat on exams through the mechanism of substituted or switched test booklets, such as the The Tale of the Lost Exam Page and The Tale of the Mailed Blue Book. This one plays on an instructor's reluctance to penalize a student for something that was seemingly his own fault, and (as usual with this type of legend) the dishonest student receives an undeserved A.", "Brunvand, Jan Harold. \"The Mexican Pet.\"\r\n  New York. W. W. Norton, 1986.", "Girdler, Lou. \"The Legend of the Second Blue Book.\"\r\n   Western Folklore: Issue 29, 1970.", "Croucher, John. \"Exam Scams.\"\r\n  St. Leonards, Australia. Allen & Unwin, 1996.", "Dale, Rodney. \"The Tumor in the Whale.\"\r\n  London. Duckworth, 1978.", "Fleming, Brunvand, & Boyd (Jr.). \"The Big Book of Urban Legends: Adapted from the Works of Jan Harold Brunvand.\"\r\n  Paradox Press, 1994.", "Aug. 28, 2019: This story has been updated from an older website format, and additional variants of the tale has been added.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]