["Republican Ohio Attorney General Mike DeWine said he has tested thousands of rape kits that his predecessor Richard Cordray had let languish.", "\"While Richard Cordray was Attorney General, 12,000 rape kits like Allyssa's were left untested. Cordray's failure left serial rapists free to strike again,\" said DeWine’s TV ad narrated by rape survivor Allyssa Allison. \"Then Mike DeWine became Attorney General. He tested all 12,000 rape kits. Now hundreds of rapists are behind bars.\"", "DeWine ousted Cordray in 2010. The two men are now facing off for governor.", "DeWine portrays Cordray as ignoring untested rape kits as they piled up. But the backlog of untested rape kits can’t be blamed mainly on the attorney general; local police departments had a role, too. The ad omits that Cordray started to address the backlog as it drew more attention in the summer of 2010, but he had little time left in office.", "\"Rape kits\" are shorthand for sexual assault forensic evidence kits, which are collected soon after a sexual assault or rape. A nurse or a doctor collects evidence including tissue and hair samples from the victim’s body and clothing, including saliva, blood and semen. The evidence helps law enforcement investigate assaults.", "The ad said that while Cordray was attorney general, 12,000 rape kits were left untested, but they were not sitting around his office. That number reflects those that were sent in by police departments across the state once DeWine took over.", "Untested rape kits languishing in police evidence rooms had been a longstanding problem in many states when Cordray became Ohio attorney general in 2009. Some departments didn’t test the kits, citing hassles or cost. The national backlog continues today.", "During Cordray’s tenure, news coverage by the Cleveland Plain Dealer led to more scrutiny.", "Here’s what was known about untested kits when Cordray was in office. In July 2010, the Cleveland Police said they had found in their possession more than 6,000 rape kits going back to 1993, some of which had already been tested. The department decided it would start submitting all kits for testing to the state. By mid 2011, Cleveland began submitting untested kits in small batches to the state, according to a timeline written by Case Western Reserve University.", "While Cordray was attorney general, Ohio -- like much of the country -- had no consistent testing policy. Each law enforcement agency decided whether and how to test rape kits, which could be done at local labs or sent to the state. Cleveland police decided whether to test kits on a case by case basis.", "The Plain Dealer reported that the state Bureau of Criminal Identification and Investigation would test every kit Cleveland planned to send, though its preference was for departments to limit their submissions to evidence that officials thought would be most likely to provide leads. (BCI is under the purview of the attorney general.)", "Cordray in 2010 called for lawmakers, law enforcement officials and victim advocates to study best practices for testing and develop a statewide protocol.", "In his final months in office, Cordray formed the Ohio Sexual Assault Kit Testing Commission and announced that the state would receive new DNA-testing robots to speed up testing.", "Cordray then lost to DeWine.", "In a recent conference call with reporters, Cordray questioned why DeWine took seven years -- until he was in the middle of a campaign -- to clear out the backlog.", "\"What he cannot explain is why it took him seven years to do a job he says I should have done in five months,\" he said.", "Cordray counterattacked with his own ad that featured Republican Shelby County Sheriff John Lenhart. The sheriff said that Cordray put the technology in place and \"fixed\" the backlog that had stretched for decades. That’s misleading -- while Cordray started to address the problem, he didn’t fix it.", "DeWine took office in January 2011. A few months later he restarted the rape kit test commission after the Cleveland Heights police department misplaced evidence tied to Anthony Sowell, a serial killer and rapist.", "The Cleveland Plain Dealer wrote in an editorial in May 2011 that \"building on an initiative of his predecessor, Richard Cordray, DeWine says he will stop sending DNA samples to private labs.\" Instead, the state would handle processing.", "In December 2011, DeWine announced that police should submit all kits for testing if a crime probably occurred. At the time, about half of sexual assault kits were submitted to the state crime labs.", "DeWine started a new unit with four forensic scientists to test the old kits and began the push to clear out the backlog in 2012. Six more scientists were added later.", "Though DeWine deserves credit for tackling the backlog, so does Cuyahoga County Prosecutor Timothy McGinty. His office worked with Cleveland police to inventory rape kits, which resulted in identifying thousands of untested rape kits that were submitted to the state Bureau of Criminal Investigation in 2014.", "The General Assembly played a role, too. In 2014, Gov. John Kasich signed Senate Bill 316 to require law enforcement agencies to forward untested rape kits to the state or other crime labs within one year.", "In February 2018, DeWine announced that the state had analyzed 13,931 rape kits and had loaded more than 8,600 DNA profiles to a federal database used by law enforcement. (The TV ad cited 12,000 rape kits because it subtracted any rapes that occurred after Cordray left office.) DeWine said that charges had been filed against hundreds of attackers.", "The Cuyahoga County Prosecutor said that they have convicted 376 defendants between 2013 and 2018 largely based on rapes that occurred between 1993 and 2010, before DeWine took office. The average prison sentence is 11 years.", "DeWine said in a TV ad, \"While Richard Cordray was Attorney General, 12,000 rape kits like Allyssa's were left untested. Cordray's failure left serial rapists free to strike again. Then Mike DeWine became Attorney General. He tested all 12,000 rape kits. Now hundreds of rapists are behind bars.\"", "The ad leaves out a lot of context when it blames Cordray. First, it omits that Cordray inherited a statewide problem. Cordray started to take steps to address the problem, but didn’t get far before he was ousted by DeWine in November 2010.", "The ad is on firmer ground when it gives credit to DeWine for his efforts to clear out the backlog. But it omits that it took him several years to do it. The statement is partially accurate but leaves out important context. We rate this statement Half True.", "Cleveland Plain Dealer, \"Latest Mike DeWine ad accuses Richard Cordray of enabling serial rapists,\" Aug. 22, 2018", "The Cuyahoga County Sexual Assault Kit (SAK) Task Force: Describing the Process of Testing, Investigating, and Prosecuting Unsubmitted SAKs, 2016", "Rich Cordray, Tweet, Aug. 26, 2018", "Columbus Dispatch, \"Lost hope; When DNA evidence goes missing, so does the chance for an exoneration,\" Jan. 27, 2008", "Cleveland Plain Dealer, \"Two more of slain women are identified Their families' fears realized; victims hadn't been seen for months,\" Nov. 6, 2009", "Cleveland Plain Dealer, \"Cleveland pressured to give count of untested rape kits,\" May 2, 2010", "Cleveland Plain Dealer, \"Cleveland police chief says all new rape kits will be tested; count of older, untested kits continues,\" July 23, 2010", "Cleveland Plain Dealer, \"Cordray seeks uniform policy in Ohio on testing rape kits Debate builds in U.S. on most effective way to do checks,\" Aug. 23, 2010", "Associated Press, \"Ohio devoting more resources to sex assault cases,\" Oct. 21, 2010", "The Jackson County Times-Journal (Ohio), \"Cordray responds to Blanton's remarks,\" Nov. 2, 2010", "Cleveland Plain Dealer editorial, \"Tighten chain of evidence,\" May 31, 2011", "Cleveland Plain Dealer, \"Task force restarts work on sexual assault evidence,\" June 15, 2011", "Cleveland Plain Dealer, \"Processing rape kits saves heartache and money, Cuyahoga prosecutors tell congressional task force,\" June 16, 2017", "Cleveland Plain Dealer, \"Cleveland sex crimes unit faces scrutiny as questions about priorities and staffing resurface,\" March 12, 2018", "Dayton Daily News, \"Ohio’s rape kit testing effort starts to yield results,\" June 29, 2013", "NPR, \"Tested At Last, Rape Kits Give Evidence To Victims' Stories,\" Jan. 26, 2014", "Washington Post, \"Funds to reduce rape-kit backlog expected to pass in Congress,\" June 17, 2014", "WOSU, \"Ohio Clears Backlog Of Untested Rape Kits,\" Feb. 23, 2018", "Ohio Attorney General Richard Cordray, Annual report, 2010", "Ohio Attorney General Mike DeWine, Press release, June 14, 2011", "Ohio Attorney General Mike DeWine, Press release, Dec. 5, 2011", "Ohio Attorney General Mike DeWine, Press release, Dec. 2, 2016", "U.S. Department of Justice, Forensic DNA Backlog Reduction Program: Fiscal Year 2009 Awards and Abstracts,", "Endthebacklog.org/ohio, Accessed Aug. 24, 2018", "Columbus Dispatch, \"Campaign ad watch,\" Aug. 25, 2018", "PolitiFact, \"GOP challenger Mike DeWine says BCI tests delayed 'up to 6 months' under Cordray,\" Aug. 9, 2010", "Interview, Dan Tierney, Attorney General Mike DeWine spokesman, Aug. 23, 2018", "Interview, Joshua Eck, Mike DeWine campaign spokesman, Aug. 24, 2018", "Interview, Mike Gwin, Richard Cordray spokesman, Aug. 24, 2018", "Interview, Ryan Miday, Cuyahoga County prosecutor spokesman Aug. 27, 2018", "Interview, Michael McGrath, Cleveland Director of Public Safety, Aug. 29, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]