["As corporations and governments rush to develop an effective treatment for COVID-19, medicines have become the targets of partisan praise and ire, helping misinformation about them spread online.", "“Hydroxychloroquine is cheap-91% effective. Remdesivir is $1000-under 50% effective. Why is Fauci pushing Remdesivir? It was invented by Fauci and Gates. It’s stock is now soaring. Always follow the $$$$$$$,” a Facebook post with over 13,000 shares reads.", "While clinical trials on the drugs remain ongoing, neither hydroxychloroquine nor remdesivir has been proven effective against COVID-19. Bill Gates and Dr. Anthony Fauci were also not involved with the development or patenting of resmdesivir, and neither stands to profit from the drug’s distribution.", "Remdesivir is an antiviral medication developed by the pharmaceutical company Gilead Sciences. The company has researched the drug since 2009, originally as a potential treatment for hepatitis C and respiratory syncytial virus and then later for the Ebola virus and now COVID-19.", "During 2013-14 Ebola epidemic, Gilead and the U.S. government invested research into remdesivir as a potential medication against the virus. Initial studies from joint research groups were promising, though the drug was never ultimately deployed against Ebola.", "A March 2016 study published in the journal Nature found that remdesivir was somewhat effective against coronaviruses like SARS and MERS, as well as filoviruses like Ebola. The data “suggests the potential for wider medical use,” the researchers wrote.", "Gilead first received a patent for the drug as a treatment for Ebola in 2017. In fall 2015, Gilead applied for two patents for remdesivir, one for combatting coronaviruses and another for filoviruses, which were both approved in spring 2019.", "More:Gilead Sciences reports positive drug results for remdesivir as coronavirus treatment", "When the new coronavirus, SARS-CoV-2, began to spread, remdesivir was one of only a handful of drugs known to combat coronaviruses.", "An April National Institutes of Health study has since found the drug to be marginally effective against COVID-19. The results showed that critically ill COVID-19 patients who received the drug recovered 31% faster than those who did not. Medical experts found the study significant as the first effective clinical drug trial for a COVID-19 treatment.", "Gilead’s stock rose 9% in premarket trading on the news. Gilead maintains a monopoly on remdesivir in the United States and is consequently the only company set to profit from its use as a COVID-19 treatment.", "Fact check: Drugmaker Gilead Sciences claimed rights to a possible COVID-19 treatment", "Fauci, the director of the National Institute of Allergy and Infectious Diseases, is not cited anywhere as an inventor or patent owner of the drug and has not authored any research studying remdesivir.", "While Fauci has also said that early trials of remdesivir on coronavirus patients are a positive sign, he has also cautioned against prematurely celebrating.", "“I was very serious when I said this was not the total answer by any means, but it’s a very important first step,” Fauci said April 30 about the NIH study on remdesivir.", "As remdesivir is wholly owned by Gilead Sciences, Fauci is not legally entitled to any profits from remdesivir.", "Fauci was the director of NIAID during the 2013-14 Ebola outbreak and spearheaded the department’s research and response to the virus. NIAID supported research into a range of potential Ebola treatments, including remdesivir, as recently as December. That said, Fauci did not directly conduct this research; neither he nor the NIH stand to profit from its results.", "The National Institutes of Health confirmed that Fauci has not authored any studies on remdesivir and does not own stock in any biomedical or pharmaceutical companies.", "Owning financial assets in pharmaceutical firms like Gilead would also be required to be publicly disclosed per the agency's ethics policy.", "The NIH now recommends remdesivir be used \"in hospitalized patients with severe disease,\" meaning any case where a the patient needs the use of a ventilator.", "Similarly, Gates was not involved in the development of remdesivir or research into the drug. In March, the Bill & Melinda Gates Foundation convened a group of companies, including Gilead Sciences, to accelerate research on the new coronavirus.", "“Companies are working to identify concrete actions that will accelerate treatments, vaccines, and diagnostics to the field,” a March press release from the foundation reads. The over a dozen participating companies aren’t required to share profits, intellectual property, or resources with the Gates Foundation or any of the other firms.", "\"The foundation was not involved in the development or patenting of remdesivir, and has not provided funding directed to remdesivir research or production,\" Jeff Chertack, a spokesperson for the Gates Foundation, told USA TODAY.", "Gates mentioned remdesivir in an April 23 essay about global responses to the coronavirus. “If it proves to have benefits, then the manufacturing will have to be scaled up dramatically,” he wrote.", "Gilead Sciences is the only organization legally allowed to profit from the sale of remdesivir. Bill Gates and Dr. Anthony Fauci were not involved in the development of the drug and are not set to profit from its sale. The two have both spoken positively about remdesivir but have also both cautioned that the drug is only to be used in critically ill patients and should be used in concert with other treatments. We rate this claim FALSE because it is not supported by our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]