["The photos were published in this Facebook post on October 14, 2019. It has been shared more than 200 times.", "The post contains seven photos that show a flooded housing complex and underground pass.", "Below is a screenshot of the misleading post:", "The post’s Indonesian-language caption translates to English as: “It is viral, The floodwaters in Japan are clear and there is no trash.", "\"INTERNATIONAL - Japanese people’s discipline about cleanliness now falls in the world’s spotlight. Because of their discipline with cleanliness, the floodwaters in Japan are different from floods in other countries.", "“Instead of being muddy and brown, the floodwaters in Japan are actually as clear as pool water. This fact was known after Tokyo, Japan, was hit by a typhoon Hagibis on Sunday (13/10/2019) in the morning.", "“In social media, the photos of Tokyo in the aftermath of the typhoon have been viral. In a photo shared by Park, a housing complex can be seen being inundated by water to the ankle level. But the flood waters are turquoise like river. Trash is also not seen in the water. (*/Tribunnews)”.", "The same photos were also published here, here and here with a similar claim.", "Some of the photos were also published by Indonesian news outlet Tribunnews on October 19, 2019, here with a similar claim.", "This October 16, 2016, post on Twitter also shared some of the photos with a similar claim in English; it has been retweeted more than 45,600 times since.", "Typhoon Hagibis struck Japan on October 12, 2019, leaving at least 74 people dead, AFP reported here.", "The claim is misleading; two of the photos were taken after Typhoon Hagibis hit Japan in October 2019 but the remaining five were taken in the aftermath of Typhoon Etau in September 2015.", "Google reverse image searches and subsequent keyword searches on Google found that five of the photos had appeared in multiple media reports in September 2015.", "This September 10, 2015, report by Chinese state media CRI Online contains three of the photos seen in the misleading post.", "Below is a screenshot of CRI Online’s report:", "A Chinese-speaking journalist in AFP’s Hong Kong bureau analysed the news report. The report's headline translates to English as: “Typhoon Etau lands in Japan, rainwater poured into the underpass and changed it into a swimming pool (Photos).”", "The photo's caption translates to English as: “According to Japanese media, this year’s No. 18 Typhoon Etau landed in Aichi prefecture in the morning of September 9. Due to the influence of typhoon’s frontal surface, heavy rain may occur in areas like east Japan and Kansai region. The meteorological department called on the public to be alert to debris flow and flooding. The underground passage in Hamamatsu City, Shizuoka prefecture, has become a clear swimming pool because of the water poured back after the typhoon.”", "Typhoon Etau hit Japan on September 9, 2015, bringing torrential rain and flooding, and forcing more than half a million people to evacuate, according to this AFP report.", "Below is a comparison between images in the misleading post (top) and the photos published by CRI Online (bottom):", "This September 11, 2015, report by Hong Kong Free Press (HKFP) also shows the same photos credited to Chinese social media Weibo.", "Below is a screenshot of the HKFP report:", "The fourth photo in the misleading post matches a photo in the HKFP report. Below is a comparison between the misleading photo (L) and the HKFP photo (R):", "The fifth photo combines a photo seen in the HKFP report and one seen in CRI Online’s report.", "Below is a photo comparing the fifth photo in the misleading post (top) and the HKFP photo (bottom left) and CRI Online photo (bottom right):", "The remaining two photos in the misleading photos were published here on Twitter several hours after Hagibis struck Japan in the early hours of October 12, 2019.", "pic.twitter.com/RaKAhsVqey", "The post’s Japanese-language caption translates to English as: “At 5:30, the flood is waist deep.”", "AFP traced the location of the last two images on Google Maps to Shizuoka city here.", "Below is a comparison between the last two photos (top) and the image as shown in Google Maps (bottom):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]