["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Assemblyman Marc Butler speaks at a press conference on repealing the SAFE Act on Mar. 1, 2017 (Courtesy: New York State Assembly)", "Republican lawmakers in Albany are pushing a new proposal to repeal New York state’s 2013 gun control law, the New York Secure Ammunition and Firearms Enforcement Act, or SAFE Act.", "They want to repeal the law only in counties outside New York City. It would remain on the books for the city’s five boroughs.", "Marc Butler, a Republican Assemblyman from the North Country, claims the law is not effective upstate.", "\"We did a random survey of some of the counties,\" Butler said. \"We have counties where there have been one arrest under the SAFE Act. It indicates there's not a whole lot of interest in enforcing this in our upstate counties.\"", "Is Butler right that some counties have only had one SAFE Act violation in four years? And is there \"not a whole lot of interest in enforcing this\" in upstate counties?", "The SAFE Act", "The SAFE Act passed the New York State Legislature in a whirlwind January 2013 vote, soon after 26 people -- 20 students and six adults -- were shot and killed on Dec. 14, 2012, at Sandy Hook Elementary School in Newtown, Conn.", "The SAFE Act places additional regulations on gun owners and dealers on what guns need to be registered, how guns can be bought and sold, and how those guns can be used.", "The law expanded the definition of what’s considered an assault weapon in New York state and required those guns to be registered.", "The law also required almost universal background checks on gun sales in New York state. The law requires anyone who wants to buy a gun to make the sale through a federally licensed dealer. Those dealers are required to perform background checks before approving the sale.", "Before the SAFE Act, residents were able to privately buy or sell guns without any background checks. Now, even if someone wants to give a gun to a family member or neighbor, it has to go through a federal dealer.", "Downstate arrests", "Since the law's passage, there have been 11,893 arrests for SAFE Act violations in New York state through Feb. 17, according to the New York State Division of Criminal Justice Services.", "A disproportionate number of the arrests happened in New York City. Some 9,593 arrests were made in New York City compared with 1,641 arrests upstate and 659 arrests on Long Island or in the suburban Westchester and Rockland counties.", "New York City has the most SAFE Act arrests per capita with one arrest for every 692 people in the city. Long Island and the city's suburbs recorded one arrest for every 4,838 adults.", "Upstate arrests", "In upstate New York, there has been one SAFE Act arrest for every 3,411 adults since 2013.", "Erie County’s 254 arrests were the most among upstate counties. That's one SAFE Act arrest for every 2,870 adults in the county.", "Onondaga County had a higher SAFE Act arrest rate: one arrest for every 1,579 adults. Albany County had one arrest for every 5,400 residents and Monroe County had one arrest for every 3,514 adults.", "The arrests in most of those counties were concentrated in their largest cities. Buffalo had 78 percent of Erie County's arrests. Rochester had 81 percent of Monroe County's arrests. And, Syracuse had 87 percent of the arrests in Onondaga County. Albany County was the exception with only 48 percent of the county's arrests happening in the city of Albany.", "Some 172 arrests were in Oneida County, the fourth most upstate, and it had a rate of one arrest for every 1,066 adults.", "Oneida County District Attorney Scott McNamara says he treats the SAFE Act like any other law.", "\"Whether I politically agree with a certain section of the law, or I don’t agree with it, I don’t let that affect what I do,\" McNamara said. \"What I do professionally and what I might think or talk about at breakfast with my wife are two different things. I leave my personal opinions to the side.\"", "Eight counties, all upstate, had fewer than five SAFE Act arrests since the law took effect: Allegany, Chemung, Columbia, Hamilton, Schuyler, Wyoming, Tioga, and Lewis counties. Tioga and Lewis counties reported no SAFE Act arrests at all. Wyoming County is the only county with just one SAFE Act arrest. In that case, the offender gave a gun to someone not legally allowed to own one.", "\"We aren't seeing the violations,\" Wyoming County Sheriff Gregory Rudolph said.", "But law enforcement officials say they are not ignoring the law. People are obeying the law.", "\"To say our numbers are low because of lacking enforcement, we’re turning a blind eye? Never,\" Hamilton County Sheriff Karl Abrams said. \"It’s definitely less violators than downstate. They do everything by the book. They don’t do illegal transfers. They don’t do anything like that.\"", "Our ruling", "Butler said \"we have counties where there have been one arrest under the SAFE Act. It indicates there's not a whole lot of interest in enforcing this in our upstate counties.\"", "One county does indeed have just one arrest under the SAFE Act, and a handful of others have few arrests. But some upstate counties have large numbers of arrests. And even where there have been few arrests, law enforcement officials believe those numbers have more to do with residents complying with the law than authorities' lack of enthusiasm for enforcing it.", "We rate his claim as Half True.", "Press conference to repeal the NY SAFE Act in upstate New York, March 1, 2017", "Phone conversation with Hamilton County Sheriff Karl Abrams", "Email conversation with Bernadette VanDeinse from the New York State Assembly", "Email and phone conversation with Janine Kava from the Division of Criminal Justice Services", "Data obtained from the New York Division of Criminal Justice Services", "Resource page on the New York SAFE Act", "Population estimates from the U.S. Census Bureau 2015 5-year estimates", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]