["After Dan Patrick popped a statistic to back his contention that Texas state government spends plenty on education, a reader asked us to check the Republican lieutenant governor’s accuracy.", "Patrick, in a June 2017 commentary, extolled the state budget then about to be signed into law by Gov. Greg Abbott, specifying: \"Texas spends $60 billion on schools in our two-year budget, including both federal and state funds. Of that, $41 billion is state funding. That is on top of the estimated $28 billion to $30 billion annually paid by local property taxpayers.", "\"When colleges and universities are added,\" Patrick said, \"education spending is the biggest item in the state budget — about 52 percent of all state dollars. Health care is second, accounting for most of the remaining dollars. It is disingenuous to suggest that we are, somehow, holding back funding that we could spend on schools.\"", "Our review of budget documents posted by the Legislative Budget Board led us to find Patrick’s figure solid though the percentage also proved historic in a low-end way not stated by Patrick.", "Patrick cites state budget summary", "Up front, Patrick spokesman Alejandro Garcia responded by email to our inquiry about the basis of Patrick’s \"52 percent\" by pointing out a chart in the 2018-19 state budget, which takes effect Sept. 1, 2017. The chart shows that the budget puts $55.9 billion in general revenue toward public and higher education out of $106.7 billion in all such revenue — which breaks out to 52.4 percent of such spending. Next highest: Nearly $34 billion budgeted for health and human services accounts for 31 percent of state spending in the budget.", "SOURCE: Document, \"Summary of Conference Committee Report for Senate Bill 1, Appropriations for the 2018-19 Biennium,\" Legislative Budget Board, May 2017 (accessed June 14, 2017)", "Some context: The chart shows that the nearly $41 billion in public school aid appropriated by the 2017 Legislature trailed $635.6 million, or 1.5 percent, behind what lawmakers budgeted for public schools the previous two years. On the other hand, the new budget increases state spending on higher education by $195.2 million, 1.1 percent, from the 2016-17 budget, according to the chart.", "We asked the Legislative Budget Board about Patrick’s percentage. By email, staff spokesman R.J. DeSilva responded by pointing out the same chart offered by Patrick.", "Separately to our emailed inquiries, Austin school-finance expert Joe Wisnoski, who works for a firm that represents school districts, and Tom Canby of the Texas Association of School Business Officials didn’t quibble with Patrick’s calculation.", "Wisnoski added, though, that the 52 percent conclusion \"may not be the whole story.\" He also pointed out that from all funding sources--including federal aid--lawmakers devoted $80 billion to education, which represented 37 percent of the full $217 billion state budget.", "Alternate calculation", "For our part, we noticed one other way of gauging the share of state revenue budgeted for education. Another chart in the budget shows that lawmakers budgeted nearly $58.8 billion for public schools and higher education in state general revenue plus the smaller pot of money consisting of state revenue dedicated to particular expenditures. The combined amount, we found, also breaks out to 52 percent of the full budget’s $113.1 billion in state revenue and dedicated state revenue:", "SOURCE: Document, \"Summary of Conference Committee Report for Senate Bill 1, Appropriations for the 2018-19 Biennium,\" Legislative Budget Board, May 2017 (accessed June 14, 2017)", "Other state funds?", "When we asked about Patrick's claim, Dominic Giarratani of the Texas Association of School Boards agreed it’s fair to focus on state general revenue to evaluate budgeted spending on education. By email, though, he also provided a calculation suggesting that public plus higher education accounts for 48 percent of non-federal spending in the budget.", "That’s correct, it looked to us, though it’s worth noting the additional spending captured by this alternate analysis folds in chunks of money not easily controlled by lawmakers--including $1.8 billion of earnings on the endowment that benefits institutions in the University of Texas and Texas A&M University systems; nearly $4.6 billion in local tax revenue  projected to be provided by property-rich school districts, including the Austin district, to support the state’s school finance system; and nearly $3.6 billion in payments driven by a 2006 state-mandated reduction in school property taxes.", "Historic low?", "Next, we wondered how the 52 percent cited by Patrick for 2018-19 compares to the share of state GR devoted to education in previous budgets. To get a fix on that, we checked spending on education from non-dedicated GR in the previous 10 budgets. Such funds comprise the bulk of each budget and are most directly controlled by legislative decisions.", "Our finding: In the budgets, which encompass 20 years, no Legislature devoted less than 53 percent of general revenue to education. On average, education’s share of state spending through the budgets was 58 percent.", "State Revenue Budgeted for Education, Texas, 1998-99 through 2018-19 (By Percentage)", "BUDGET YEARS", "SHARE OF REVENUE* BUDGETED FOR PUBLIC AND HIGHER EDUCATION", "1998-99", "61 %", "2000-01", "63", "2002-03", "59", "2004-05", "59", "2006-07", "56", "2008-09", "59", "2010-11", "61", "2012-13", "57", "2014-15", "53", "2016-17", "53", "2018-19", "52", "*State general revenue, excluding revenue constitutionally dedicated to particular purposes.", "SOURCE: PolitiFact Texas calculations drawing on state budgets adopted by Texas Legislature, 1997-2017 as posted by the Legislative Budget Board (accessed June 14-15, 2017)", "Our ruling", "Patrick, saying it’s disingenuous to suggest lawmakers held back on education aid, said 52 percent of state spending in the 2018-19 state budget was appropriated to public plus higher education.", "That’s an accurate percentage. Unclarified: Education also accounts for the smallest share of budgeted state spending in at least 20 years, which is as far back as we checked.", "We rate the statement Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Dan Patrick oped commentary, \"The truth about education spending,\" San Antonio Express-News, June 8, 2017", "Adopted state budgets, Legislative Budget Board, \"Text of Conference Committee Report House Bill No. 1 General Appropriations Act ... 1998 –1999 Biennium,\" July 1, 1997;  \"Text of Conference Committee Report House Bill No. 1 (General Appropriations Act), 2000  – 2001 Biennium,\" May 23, 1999;  \"Text of Conference Committee Report Senate Bill No. 1 (General Appropriations Act), 2002  – 2003 Biennium,\" May, 21, 2001; \"Text of Conference Committee Report, House Bill No. 1  (General Appropriations Act),\" May 29, 2003; \"Text of Conference Committee Report  Senate  Bill No. 1,  Regular Session (General Appropriations Act),\" Sept. 23, 2005; \"Text of Conference Committee Report House Bill No. 1, Regular Session (General Appropriations Act),\" May 25, 2007; \"Text of Conference Committee Report Senate Bill No. 1, Regular Session (General Appropriations Act),\" May 26, 2009; \"GENERAL APPROPRIATIONS ACT FOR THE 2012- 13 BIENNIUM, Text of Conference Committee Report on House Bill No.  1,\" May 26, 2011; \"GENERAL APPROPRIATIONS ACT FOR THE 2014 -15  BIENNIUM, 2013 Text of Conference Committee Report on  Senate Bill  No. 1,\" May 23, 2013; \"GENERAL APPROPRIATIONS ACT FOR THE 2016-17 BIENNIUM, 2015 Text of Conference Committee Report on House Bill  No. 1,\" May 26, 2015;  \"Summary of Conference Committee Report for Senate Bill 1, Appropriations for the 2018-19 Biennium,\" May 2017 (accessed June 14, 2017)", "Email, R.J. DeSilva, communications officer, Legislative Budget Board, June 14, 2017", "Email, Joe Wisnoski, associate, Moak, Casey & Associates, June 14, 2017", "Email, Tom Canby, associate executive director, Texas Association of School Business Officials, June 14, 2017", "Email, Dominic Giarratani, assistant director, Governmental Relations, Texas Association of School Boards, June 15, 2017", "Email, Wayne Pulver, manager, Publications and Production Team, Legislative Budget Board, June 21, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]