["The photo was published here on Facebook on November 1, 2020.", "It shows one person in full personal protective equipment crouched on the ground while another examines a masked individual on a plastic table in the middle of the road.", "The post’s Sinhala-language caption translates to English as: “I have seen a lot of pictures that send a message, but this picture really speaks a thousand words. Whoever took this picture is actually giving a very important message to the society at this point in time..don't joke about it..Those sacrifices of health sector, please take it seriously\"", "The post’s caption did not explicitly specify the photo was taken in Sri Lanka, but comments by some Facebook users on the post suggested they believed it showed health workers in Sri Lanka.", "One Sri-Lanka based user commented in Sinhala: “I feel so bad for our police and army, they are working tirelessly.\"", "Another Sri-Lanka based user wrote: “This picture doesn't just talk, it makes me cry considering the foolishness of our people”.", "The photo was also shared here and here on Facebook, alongside similar claims.", "However, the claim is false.", "Closer examination of the photo in the misleading posts revealed a logo reading Bino_Adam_73.", "A keyword search found the same photo published here on an Instagram account with the same name, owned by Bino babu, a photographer based in south India.", "The post was published on August 14, 2020 and is captioned: “It simply came to our notice then.", "\"We have two sides to see… The heart that fights against the great disease, and a mind that is eager to jump even when it is falling… The other side, those who are heartless, are betraying the whole world…”", "The caption also contains several hashtags -- such as “#kerala #keralasnaps #keralagallery #kerala_gram #keralat #keralam #keralatourism #keralatalents #malayalam #malayalamtypography” -- that suggest the photo was taken in Kerala, India.", "In response to the misleading posts, Bino Babu told AFP that the photo was staged to increase awareness of the struggles of frontline workers during the Covid-19 pandemic.", "“It is a themed photoshoot I did to show society’s responsibility in [battling] Covid-19,” he added via Instagram Direct Messenger on November 2, 2020.", "Below is a screenshot comparison of the photo in the misleading post (L) and the Instagram photo (R) :", "Meanwhile, Sri Lanka has seen a surge of confirmed novel coronavirus cases since October, following a cluster outbreak of more than 1,000 at a factory in the outskirts of Colombo, which was producing surgical masks for the US until August, according to this AFP report.", "As of November 4, 2020, the country has recorded 11,744 confirmed cases, according to the Health Promotion Bureau of Sri Lanka.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]