["About this rating", "In December 2017, USA Today published a searing column from its editorial board concluding that Donald Trump was not suited to be president of the United States, a piece that included the following passage:", "And as is the case with all of Trump's digital provocations, the president's words were deliberate. He pours the gasoline of sexist language and lights the match gleefully knowing how it will burst into flame in a country reeling from the #MeToo moment.", "A president who would all but call Sen. Kirsten Gillibrand a whore is not fit to clean the toilets in the Barack Obama Presidential Library or to shine the shoes of George W. Bush.", "This isn’t about the policy differences we have with all presidents or our disappointment in some of their decisions. Obama and Bush both failed in many ways. They broke promises and told untruths, but the basic decency of each man was never in doubt.", "Donald Trump, the man, on the other hand, is uniquely awful. His sickening behavior is corrosive to the enterprise of a shared governance based on common values and the consent of the governed.", "One day later, as doggedly committed to unoriginal junk news as ever, repeat offender Your News Wire repurposed the quote in order to fabricate the false claim that actress Julia Roberts had made a series of mean-spirited comments about former First Lady Michelle Obama:", "First Lady Melania Trump has been “looked down upon and disrespected by sneering liberals across the country” while “doing a brilliant job” according to Julia Roberts, who also declared that former First Lady Michelle Obama “isn’t fit to clean to clean her toilet” ...", "“Melania has her priorities straight and she is a great example for our young women,” Julia Roberts said. “Michelle? Talk about a wolf in sheepskin.“", "The view that Michelle Obama \"isn't fit to clean Melania Trump's toilet\" seems out of line with Julia Roberts's known political views. She appeared at a fundraiser for Hillary Clinton, Donald Trump's main political opponent, during the 2016 election, and she helped raise money for Barack Obama's re-election in 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]