["“The Nevada Democratic Party made a last min rule change to toss ballots that only name one choice,” according to a tweet from February 15, 2020. “Can someone explain to me how this *isn’t* voter suppression?”", "The tweet was posted by a supporter of presidential candidate Bernie Sanders. It was deleted but lives on, mainly via screenshots shared on Facebook, including by pages supporting the US senator from Vermont.", "Supporters of Sanders believe that the Democratic Party cheated him out of the nomination in 2016, stacking the deck in favor of his rival Hillary Clinton, and fear that such a scenario could be repeated in 2020.", "The western US state of Nevada will hold caucuses on February 22 as part of a nationwide process to select the Democratic nominee, who will take on US President Donald Trump in a November 2020 national election.", "The Nevada State Democratic Party (NSDP) published rules for early voting -- including the requirement that three candidates be listed -- in October 2019.", "“All early vote participants are required to make three presidential preference choices when voting early before submitting their preferences,” according to the rules.", "“They have to choose three candidates and that can be the same candidate three times, it just has to be three selections,“ Molly Forgey, a spokeswoman for the Nevada Democrats, told AFP.", "The NSDP, as well as Sanders and others sought to alert early Nevada voters to the requirement, but did not attribute it to a last-minute rule change.", "The three choices are required because of the nature of the Nevada caucuses, during which voters express their support for their preferred choice by physically standing with other backers of the candidate.", "Participants whose candidate receives less than 15 percent of the votes must disband and stand with supporters of another, viable candidate.", "If an early voter’s first choice is not viable, their second or third choice can be used as necessary, in the same way a physically present voter would have joined a different group of supporters.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]