["About this rating", "The U.S. has imposed martial law at least 68 times in its history.", "Flynn did not get the exact numbers right in remarks he made to Newsmax but was close. Also, martial law has not been used in order to rerun a U.S. election before, despite what Flynn's remarks may have implied.", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "As incumbent U.S. President Donald Trump disputed the results of the November 2020 presidential elections, loyalists argued that declaring martial law would allow him to overturn the election results.", "Recently pardoned former national security adviser to Trump, retired Lt. Gen. Michael Flynn, made such a claim in an interview with Newsmax in December 2020.", "Flynn said that using martial law to rerun elections was not “unprecedented” and martial law had been declared 64 times in the United States’ history. Readers inquired if that number was accurate.", "Flynn’s full remarks to Newsmax:", "He could immediately on his order seize every single one of these machines around the country on his order. He could also order, within the swing states, if he wanted to, he could take military capabilities and he could place them in those states and basically rerun an election in each of those states. It's not unprecedented.", "I mean, these people are out there talking about martial law like it's something that we've never done. Martial law has been instituted 64 times.", "In August 2020, the Brennan Center for Justice compiled a list of times martial law, the temporary military takeover of civil functions like law enforcement and courts, had been imposed in the United States by federal and state authorities. They found it had been done at least 68 times. Martial law had been imposed 29 times to address labor disputes, twice for war or invasion, seven times for domestic wars or insurrections, and 11 times for riots or civil unrest.", "Not one of these instances of martial law was used to rerun an election the way Flynn described it.", "On Dec. 18, 2020, soon after Flynn’s remarks, Army Secretary Ryan McCarthy and Army Chief of Staff Gen. James McConville released a joint statement saying, “There is no role for the U.S. military in determining the outcome of an American election.”", "We thus rate this claim as a \"Mixture.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]