["The one-minute and 33-second video was published here in a Facebook post on October 20, 2019, where it was viewed more than 129,000 times and shared more than 8,400 times before it was removed.", "Below is a screenshot of the misleading post:", "The post’s Hindi-language caption translates to English as: “Owaisi, who mourned the death of thieves and terrorists, danced after the sacrifice of #Kamlesh_Tiwari. It seems as if some of his mission was accomplished. His staying out in the open might result into many more murders like #KamleshTiwari’s.”", "Owaisi refers to Asaduddin Owaisi, an Indian lawmaker and president of the regional All India Majlis-e-Ittehadul Muslimeen (AIMIM) party.", "Kamlesh Tiwari was a leader of a Hindu group who was killed in the north Indian city of Lucknow on October 18, 2019, as reported by Indian television channel News18 India here on the same day.", "The video was also shared here and here on Facebook; here and here on Twitter with an identical claim.", "The misleading news clip has been taken from a longer report by Indian Hindi news channel Sudarshan news.", "Sudarshan News editor-in-chief Suresh Chavhanke published the same one minute 33-second clip here on his official Twitter account on October 20, 2019.", "Below is a screenshot comparison of the video in the misleading posts (L) and the video in the Sudarshan News video (R):", "Chavhanke can be seen presenting the story in the clip. His comments in Hindi translate to English as: “After the murder and sacrifice of Kamlesh Tiwari, this traitor is dancing. I am showing you this video. Look at this, after the sacrifice of Kamlesh Tiwari how is Owaisi dancing. After the anger of Hindus, Owaisi was dancing in a rally in Mumbai yesterday. You would have never seen his jubilation, we have seen insolent behavior in the past but none have seen him jumping with joy. Is Owaisi’s dance-filled with happiness after the demise of Tiwari. This is my question, as he said that Kamlesh Tiwari won’t be spared. So in this murder, Owaisi should also be arrested. Him being free is not safe for any other Kamlesh Tiwari or any Hindu worker. This is what I believe, what do you think?”", "The short video was taken from this 52-minute 19-second clip published on Sudarshan News’ YouTube channel, uploaded on October 19, 2019. The video in the misleading posts corresponds with the YouTube video from the seven-minute five-second mark.", "But the claim in the Sudarshan News report is false; the footage of Owaisi dancing at an election rally was actually filmed one day before Tiwari’s murder.", "Owaisi held an election rally in at Paithan Gate neighborhood in Aurangabad town of the western Indian state of Maharashtra on October 17, 2019.", "The rally was streamed live here on the YouTube channel for News Express Live on October 17, 2019. Owaisi starts speaking from 1 hour 20 minutes.", "The exact same footage of Owaisi dancing at the rally was tweeted by Indian news agency Asian News International (ANI) on October 18, 2019.", "Maharashtra: AIMIM Chief Asaduddin Owaisi performs a dance step after the end of his rally at Paithan Gate in Aurangabad. (17.10.2019) pic.twitter.com/AldOABp2yd", "The tweet’s caption states: “Maharashtra: AIMIM Chief Asaduddin Owaisi performs a dance step after the end of his rally at Paithan Gate in Aurangabad. (17.10.2019).”", "This video published on Facebook at 1:10 am on October 18, 2019, shows Owaisi performing the same dance at the October 17 rally but from a different angle.", "Below is a screenshot image comparison of three different clips including the dancing video from ANI, the different angle of the dance in the Facebook post, and the live stream of the October 17 rally on News Express' YouTube channel video. In all the footage, Owaisi can be seen wearing the exact same clothes and a blue scarf.", "Tiwari was murdered on October 18, police said, one day after Owaisi’s rally.", "Ashish Dwivedi, the spokesperson for Lucknow Police, told AFP by phone on Oct 29, 2019: \"He was killed on October 18, 2019, somewhere between 12 noon - 1 pm.\"", "Indian newspaper The Hindu reported Tiwari was killed on Friday, October 18 in this report published the same day.", "The report’s first paragraph states: “Kamlesh Tiwari, leader of the Hindu Samaj Party and a former leader of the Hindu Mahasabha, was shot dead in broad daylight in Lucknow on Friday.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]