["About this rating", "Ukraine President Volodymyr Zelensky did say in a crucial July 2019 phone call that he and Donald Trump did not have a \"quid pro quo\" discussion about Ukraine providing dirt on one of Trump's political enemies in exchange for military aid. Since that is one of the principle allegations against Trump in an impeachment inquiry against him, Zelenksy's remarks would tend to exculpate the U.S. president.", "However, the allegations against Trump extend far beyond a single phone call and include allegedly directing a broader, months-long policy of pressuring Ukraine into investigating Trump's 2020 electoral rival Joe Biden, and Biden's son, Hunter. Zelensky did not address those multiple additional allegations against Trump.", "In December 2019, U.S. President Donald Trump, beset by a mounting, Democrat-led impeachment process, tried to dismiss allegations of wrongdoing in relation to his July 2019 phone conversation with Ukrainian President Volodymyr Zelensky, and Trump's broader actions and policies toward Ukraine.", "That phone call has been the focus of intense scrutiny, amid allegations that Trump used U.S. aid to Ukraine (a U.S. ally) as leverage in attempting to force Zelensky to launch an investigation into former U.S. Vice President and leading 2020 Democratic presidential candidate Joe Biden and Biden's son, Hunter.", "On Dec. 2, Trump tweeted:", "\"Breaking News: The President of Ukraine has just again announced that President Trump has done nothing wrong with respect to Ukraine and our interactions or calls. If the Radical Left Democrats were sane, which they are not, it would be case over!\"", "We asked the White House to explain what the president was referring to and how those purported remarks amounted to an announcement by Zelensky that Trump had \"done nothing wrong.\" We did not receive a response of any kind.", "However, Trump appeared to be alluding to a major interview Zelensky gave to four international news outlets: TIME in the U.S., Le Monde in France, Der Spiegel in Germany and Gazeta Wyborcza in Poland. Those news organizations published their respective transcripts of the interview on or around Dec. 2, with the exception of Der Spiegel, which had not yet released its own transcript at the time this fact check was published.", "Zelensky answered one question that was directly and specifically relevant to his July 2019 phone call with Trump. The following is a breakdown of how three of the four outlets reported that section of the interview.", "TIME", "Q: When did you first sense that there was a connection between Trump’s decision to block military aid to Ukraine this summer and the two investigations that Trump and his allies were asking for? Can you clarify this issue of the quid pro quo?", "Zelensky: Look, I never talked to the President from the position of a quid pro quo. That’s not my thing...I don’t want us to look like beggars. But you have to understand. We’re at war. If you’re our strategic partner, then you can’t go blocking anything for us. I think that’s just about fairness. It’s not about a quid pro quo. It just goes without saying.", "Le Monde", "Q: Lors de cette conversation téléphonique, quand avez-vous senti le lien entre l’aide militaire américaine et la demande d’enquête formulée par M. Trump sur Hunter Biden, le fils de son rival démocrate Joe Biden pour l’élection de 2020 ?", "Zelensky: Nous n’avons pas parlé d’un échange du genre « Je te donne ci et tu me donnes ça ». Ce type de conversation, je l’ai eu avec le président russe lorsque nous avons échangé les prisonniers. Et je peux l’avoir avec l’Europe pour qu’ils nous disent : « Remplissez telle ou telle condition pour rejoindre l’Union européenne [UE]. » L’Ukraine se trouve en Europe et peut faire partie de l’UE. Et nous le voulons. Là je comprendrais qu’il puisse y avoir un donnant-donnant...", "(Translated)", "Q: During that phone conversation, at what point did you sense the connection between American military aid and Mr. Trump's request for an inquiry into Hunter Biden, the son of his Democrat rival in the 2020 election, Joe Biden?", "Zelensky: We didn't talk about an exchange in terms of \"You give my this and I give you that.\" I did have that type of conversation with the Russian president, when we conducted a prisoner exchange. And I could have [that type of conversation] with Europe if they say to us \"Satisfy this or that condition in order to join the European Union.\" Ukraine is in Europe and could become part of the EU. And we want that. In that case I could understand having a give-and-take...", "Gazeta Wyborcza", "Q: Jest wiele spekulacji na temat tego, kiedy pan zrozumiał, że jest związek między amerykańską wojenną pomocą i śledztwami, o które prosił Trump [w sprawie Huntera Bidena i firmy Burisma]?", "Zelensky: Ja nie rozmawiałem z Trumpem z pozycji \"coś za coś\". W taki sposób rozmawiałem z prezydentem Rosji – oddaj mi tych, a my oddamy tych [więźniów]. Czego potrzebujemy od USA? Nie chcemy wyglądać dzisiaj jak klient. Ale trzeba rozumieć, że u nas toczy się wojna. Jeśli jesteśmy strategicznymi partnerami, to nie można nam czegoś blokować.", "U nas były posiedzenia z UE. Powiedziałem im otwarcie: zobaczcie, tak być nie może, albo nas widzicie w UE, albo nie. My podkreślamy: Ukraina znajduje się w Europie i zakładamy, że możemy być częścią UE, podzielamy te same wartości. Tutaj wymiana coś za coś jest dla mnie zrozumiałą...", "(Translated)", "Q: There has been a lot of speculation about when you understood that there was a link between American aid and the investigations Trump was asking for [regarding Hunter Biden and Burisma].", "Zelensky: I didn't talk to Trump in terms of \"this for that.\" I did talk like that with Putin -- give them [prisoners] to me and I'll give them to you. What do we want from the U.S.? We don't want to look like a client. But you have to understand that we have a war zone going on here. If we're strategic partners, we can't block each other's business.", "We had meetings with the EU. I told them explicitly: this is unacceptable. Either you see Ukraine as part of the EU or you don't. We emphasize: Ukraine is in Europe and we believe we can become part of the EU, we have the same core values. In that situation, a quid pro quo makes sense.", "Clearly, Zelensky did not say, word-for-word, that Trump had \"done nothing wrong with respect to Ukraine and [the two men's] interactions or calls.\" However, Trump's tweet did not attribute that to Zelensky as a direct quotation, so it should not be evaluated as such.", "Rather, Trump was giving his own description or summary of what Zelensky had said. As we've seen, Zelensky did say that, in their July phone conversation, he and Trump did not discuss a quid pro quo agreement or arrangement in which Trump would release military aid to Ukraine in exchange for Ukrainian authorities opening an investigation into the alleged (and unproven) activities of the Bidens in and with regard to Ukraine.", "Without presenting supportive evidence, Trump and others have claimed that Joe Biden acted corruptly while he was vice president, because he pressured Ukrainian authorities to fire the country's top prosecutor in order to end an investigation into the owner of Burisma, a natural gas company whose board of directors included Biden's son, Hunter. However, former U.S. officials have rejected that theory, saying that Joe Biden pushed Ukraine to remove the prosecutor as part of a broader Obama administration drive against corruption in Ukraine.", "The allegation that Trump used military aid to Ukraine as a bargaining chip, in exchange for an investigation that would prove damaging to one of his likely main rivals in the 2020 election, has so far undeniably been one of the principle allegations against the president.", "Therefore, when Zelensky said he and Trump did not discuss matters in terms of a \"quid pro quo,\" he was undeniably exculpating Trump to a certain extent (whether or not Zelensky's description of the conversation actually measures up to what the White House call summary shows). As such, there is a measure of truth in Trump's claim that Zelensky said his American counterpart had done nothing wrong, but only as it relates specifically to that phone call.", "The allegations of wrongdoing against Trump extend beyond the contents of one particular phone call in July. For example, Gordon Sondland, U.S. ambassador to the EU, has testified before Congress that Trump directed a months-long campaign of lobbying and persuading Ukrainian authorities to investigate the Bidens, as well as discredited claims that Ukraine (rather than Russia) was responsible for online efforts to intervene in the 2016 presidential election.", "According to Sondland, that broader policy involved Trump's personal attorney Rudy Giuliani, acting at the president's direction, as well as other administration officials, and involved Trump directing his officials to freeze U.S. military aid to Ukraine.", "In his December 2019 interview, Zelensky did not address those wider allegations about Trump's Ukraine policy — he spoke only about one particular phone call. Therefore, Trump was only partly accurate in summarizing and describing what Zelensky said as \"President Trump has done nothing wrong with respect to Ukraine and our interactions or calls.\"", "Shuster, Simon.  \"'I Don't Trust Anyone at All.' Ukrainian President Volodymyr Zelensky Speaks Out on Trump, Putin and a Divided Europe.\"\r\n  TIME.  2 December 2019.", "Gatinois, Claire.  \"Volodymyr Zelensky: 'Nous Voulons un Véritable Cessez-le-Feu.'\"\r\n  Le Monde.  2 December 2019.", "Andrusieczko, Piotr.  \"Wołodymyr Zełenski: Nie pójdę na Donbas, zginęłyby setki tysięcy ludzi.\"\r\n  Gazeta Wyborcza.  2 December 2019.", "Riechmann, Deb.  \"Anatomy of the Phone Call Now Imperiling Trump's Presidency.\"\r\n  The Associated Press.  12 October 2019.", "Levine, Mike.  \"Testimony and Texts: How the Trump-Ukraine Allegations Fit Together in a Timeline.\"\r\n  ABC News.  20 November 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]