["About this rating", "In September 2020, following reports that U.S. President Donald Trump had called fallen soldiers \"losers\" and \"suckers,\" an image started to circulate on social media supposedly showing an old tweet in which Trump referred to Democratic U.S. Sen. Tammy Duckworth of Illinois — a combat veteran who lost both her legs after her helicopter was shot down in Iraq by a rocket-propelled grenade — as \"Lieutenant Nolegs,\" a misspelling of \"no legs\":", "This is not a genuine tweet from Trump.", "For starters, we could find no record of this tweet on Trump's timeline. Some social media users claimed that Trump deleted this message, but that doesn't appear to be the case. There are several organizations that archive Trump's deleted tweets, such as ProPublica, FactBa.se, and the Trump Twitter Archive, but none had any record of the \"Nolegs\" tweet.", "Furthermore, the president of the United States calling a sitting senator \"Lieutenant No Legs\" would have undoubtedly made some sort of splash in the press. However, we were unable to find any news articles mentioning this insult.", "Although we did not find evidence of Trump calling Duckworth \"Lieutenant No Legs\" in a tweet, Duckworth has referred to the commander-in-chief as \"Cadet Bone Spurs,\" alluding to the medical deferments Trump reportedly received that exempted him from military duty during the Vietnam War. In February 2018, after Trump seemed to imply that it was treasonous for Democrats to not applaud during his State of the Union address, Duckworth took to Twitter, stating that she would not \"mindlessly cater to the whims of Cadet Bone Spurs and clap when he demands I clap\":", "Cillizza, Chris.   \"Donald Trump Thinks Not Clapping For Him is 'Treasonous.'\"\r\n    CNN.   6 February 2018.", "Goldberg, Jeffrey.   \"Trump: Americans Who Died in War Are ‘Losers’ and ‘Suckers.’\"\r\n    The Atlantic.   3 September 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]