["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "When President Barack Obama went to Boston on Oct. 30, 2013, to give a speech supporting his health care law amid a troubled website rollout, he chose the location carefully: Massachusetts was the state that enacted a universal health care law that Obama’s own proposal was based on.", "So it was natural that elected officials and pundits would begin to compare the Massachusetts plan with Obamacare.", "For the Nov. 3 edition of NBC’s Meet the Press, host David Gregory invited Mitt Romney -- the former Republican governor who enacted the law and the 2012 presidential nominee -- to discuss the laws.", "Gregory noted that in 2007, when Romney was making his first presidential bid, he encouraged other states to consider the Massachusetts model, even though in the 2012 race, Romney became -- like most others in his party -- a fierce critic of Obama’s law, which was passed in 2010.", "Romney said the two laws are not identical, and he added that he still believes that states should be able to choose the approach that fits their circumstances. Some will like the Massachusetts approach, and some won’t, he said.", "The Massachusetts approach \"teaches some important lessons some states are not going to want to follow,\" Romney said. \"One lesson is health insurance is more expensive in Massachusetts than anywhere else in the country. Now, that’s something that Texas and Minnesota and Montana are not going to necessarily want to adopt.\"", "Is it true that health insurance is \"more expensive in Massachusetts than anywhere else in the country\"?", "There are a number of ways to measure the cost of what Romney termed \"health insurance.\" For answers, we turned to research by the nonpartisan Kaiser Family Foundation. Here are a few of the categories that would seem to fit Romney’s definition. (Note: None of the categories here include the District of Columbia.)", "Employer-based health insurance for individuals", "• Employee share: Massachusetts ranks 1st among all states.", "• Employer share: Massachusetts ranks 10th among all states.", "• Combined employee and employer share: Massachusetts ranks 2nd among all states. (Only Alaska is higher.)", "Employer-based health insurance for families", "• Employee share: Massachusetts ranks 11th among all states.", "• Employer share: Massachusetts ranks 5th among all states.", "• Combined employee and employer share: Massachusetts ranks 2nd among all states. (Only Alaska is higher.)", "Individual-market insurance per person", "• Monthly premiums: Massachusetts ranks first.", "So, overall, health insurance costs are indeed higher in Massachusetts than almost anywhere else.", "Still, it’s worth noting that while Massachusetts’ universal health care plan is likely a factor in producing high costs, it’s probably not the only factor.", "The state ranked second nationally in per capita personal income in 2012 (Connecticut was first), and it ranked eighth in the nation in highest cost of living. Whenever residents of a state make a lot of income and pay a lot for consumer goods generally, it’s likely to follow that health care will be relatively expensive as well.", "In addition, Massachusetts ranks first among states in health care expenditures per capita, and most of the rest of the top 10 consists of other relatively affluent, northeastern and mid-Atlantic states: Connecticut, Maine, Delaware, New York, Rhode Island, New Hampshire, and Pennsylvania. (The others are Alaska and North Dakota.)", "Our ruling", "Romney said, \"health insurance is more expensive in Massachusetts than anywhere else in the country.\" The numbers show he’s basically correct that Massachusetts does have higher premiums than almost every other state. On some measures, though, Alaska outranks Massachusetts. The statement is accurate but needs clarification or additional information, so we rate it Mostly True.", "Mitt Romney, comments on NBC’s Meet the Press, Nov. 3, 2013", "CNBC, \"The Most Expensive US States to Live in,\" July 15, 2013", "University of New Mexico Bureau of Business & Economic Research, \"Per Capita Personal Income by State, 1990 to 2012,\" accessed Nov. 3, 2013", "Kaiser Family Foundation, \"Average Single Premium per Enrolled Employee For Employer-Based Health Insurance,\" accessed Nov. 3, 2013", "Kaiser Family Foundation, \"Average Family Premium per Enrolled Employee For Employer-Based Health Insurance,\" accessed Nov. 3, 2013", "Kaiser Family Foundation, \"Average Per Person Monthly Premiums in the Individual Market,\" accessed Nov. 3, 2013", "Kaiser Family Foundation, \"Health Care Expenditures per Capita by State of Residence,\" accessed Nov. 3, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]