["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Texas Lt. Gov. Dan Patrick was sworn into office in 2015. Previously he served as a state senator. [JAMES GREGG/AMERICAN-STATESMAN]", "Texas’ top political leaders gathered in Houston Oct. 28 at a \"Back the Blue\" news conference to express support for police officers and lambaste cities that cut police budgets.", "Gov. Greg Abbott sat alongside Lt. Gov. Dan Patrick, Texas House Speaker Dennis Bonnen, R-Lake Jackson, and U.S. Sen. John Cornyn, R-Texas, to reiterate plans for a state takeover of police functions in Austin after the City Council voted in August to cut $21.5 million from the police budget and shift another $128 million from the Police Department to other city departments.", "Abbott and other Republican leaders have criticized the council’s move repeatedly, but Patrick turned up the volume in remarks he gave during the Houston event.", "\"The city of Austin is a disaster if you haven’t been there. A great city, now one of the most dangerous cities in America and definitely in Texas,\" Patrick said.", "\"If we don’t back the police, we’re not going to have any police and you’re going to be left on your own,\" he said. \"And if you think that’s hyperbole, it’s not.\"", "We were curious about Patrick’s claim that Austin is now one of the most dangerous cities in the U.S. and Texas. Let’s compare how Austin crime measures up against other major metropolitan areas.", "We don’t know exactly what Patrick means by the term \"dangerous\" — his office did not respond to multiple emails and phone calls for explanation. A city could be considered dangerous, for instance, by its vulnerability to floods, wildfires or other natural disasters that threaten a population’s security. But considering the context in which Patrick’s comments were made, a \"Back the Blue\" pledge event, it’s safe to assume that Patrick was referring to crime.", "We also don’t know what information Patrick based his claim on. However, criminologists took Patrick’s use of \"dangerous\" to specifically mean violent crime, or crimes that threaten a person’s physical safety. This category, defined by Austin police as crimes against persons, includes violations such as murder, kidnapping and assault.", "When ranking Austin’s violent crime rates to that of other large U.S. cities, Austin comes nowhere near the top of the list.", "Austin police reported 3,953 incidents of violent crime in 2019, a rate of about 400 incidents for every 100,000 residents, according to the FBI’s Uniform Crime Reporting program. Among the nation’s 30 largest cities that report crime numbers to the FBI database, Detroit topped the list with about 1,965 violent incidents per 100,000 residents, followed by Memphis, Tenn., Baltimore and Milwaukee.", "Austin’s violent crime rate of 400 incidents per 100,000 residents ranked 28th among the 30 largest U.S. cities, above El Paso and San Diego. Austin ranked near the bottom of that list in 2018 and 2017 as well.", "Patrick’s second claim, that Austin is \"definitely\" one of the most dangerous cities in Texas, is also not borne out by last year’s crime data.", "The FBI’s Uniform Crime Reporting program shows that, among 534 Texas cities reporting data, Austin ranks 128th. The cities with the highest violent crime rates are South Padre Island, New Boston, Snyder and Oyster Creek, each with a rate above 1,200 incidents per 100,000 residents.", "If you look at only the largest 25 cities in Texas — cities with populations the size of Round Rock, 132,747, or larger — Austin ranked 13th. Houston, Lubbock, Dallas, Corpus Christi and Amarillo, in that order, are the cities with the highest violent crime rates in Texas.", "The FBI has not released any crime numbers for 2020, but the Austin police chief’s latest monthly report shows that, while certain categories of violent crimes are up, violent crime on the whole is about even with where it was this time last year. Murder, kidnapping, aggravated assault, intimidation and incest are up so far, while rape, forcible sodomy, sexual assault, simple assault and others are down.", "Patrick’s claim is the latest attack from Republican leaders on the Austin City Council’s budget decision.", "In August, a week after the council approved the budget, Abbott held a news conference pledging to push legislation next year that would freeze property tax revenue for any city or county that cuts law enforcement spending. He also said Austin \"is the No. 1 city in America in the year-to-year percentage increase in murders, with a percentage increase of more than 64% for the first half of this year,\" citing the 23 homicides recorded in the first half of 2020 compared to the 14 recorded in the first half of 2019.", "A PolitiFact analysis rated his claim Half True, noting that percentage change figures can be misleading when dealing with low numbers. (Abbott made that statement in Fort Worth, which had a murder rate last year more than double Austin’s.)", "Then in October, Abbott said in a tweet that Austin’s property crime was rising and that \"this is the kind of thing that happens when cities defund and deemphasize police.\" Another PolitiFact analysis rated that Mostly False. At the time Abbott made the claim, property crime was down by 2% this year compared to last year, Austin police reports show.", "The Texas Freedom Caucus, a group of conservative state legislators, released a video on Oct. 5 signaling its intent to join the fight against police budget cuts during the next legislative session.", "\"Crime is up because police funding is down. That’s the wrong direction for public safety in Texas,\" state Rep. Briscoe Cain, R-Baytown, said in the video.", "Patrick’s claim that Austin is now one of the most dangerous cities in the U.S. is a notable escalation of the political rhetoric, experts say.", "\"It’s a totally ridiculous comment and it’s completely divorced from reality,\" said Carsten Andresen, an assistant professor of criminal justice at St. Edward's University. \"It is possible to have a lot of critiques of Austin, and it’s possible to make a lot of critiques from a conservative perspective about Austin. But this remark is just a lying pants-on-fire situation.\"", "\"It’s inaccurate to say that Austin has suddenly shot up and become this super dangerous place,\" said Texas State University criminologist Sean Roche.", "Roche also notes that prevalence of crime is not the only thing that influences how people perceive crime. Severity of crimes also influence our perception, especially crimes like murder.", "Austin recorded a rate of about 3.2 murders per 100,000 residents in 2019, making it the 15th highest murder rate among Texas’ 25 largest cities. This year, as of September, the rate was at about 3.5 murders per 100,000 residents.", "In describing Austin as a \"disaster,\" Patrick said that the city is \"now one of the most dangerous cities in America and definitely in Texas.\"", "Among the 30 largest cities in the U.S., Austin's violent crime rate ranks 28th. And among the 25 largest cities in Texas, Austin ranks 13th.", "We rate this claim Pants on Fire.", "CBS Austin, Lt. Gov. Dan Patrick calls Austin 'one of the most dangerous cities in America,' Oct. 28, 2020", "FBI: Uniform Crime Reporting (UCR) Program, 2019 Crime in the United States, accessed Nov. 2, 2020", "FBI: Uniform Crime Reporting (UCR) Program, 2019 Crime in the United States: Texas, accessed Nov. 2, 2020", "Austin Police Department, Chief’s Monthly Report, Sept. 2020", "PolitiFact Texas, Examining claim about Austin homicides, crimes, Aug. 31, 2020", "PolitiFact Texas, Examining Austin's property crime trends, Oct. 9, 2020", "Tweet from Texas Freedom Caucus, Oct. 5, 2020", "Phone interview with Texas State criminologist Sean Roche, Nov. 2", "Phone interview with St. Edward's University criminologist Carsten Andresen, Nov. 3", "Grits for Breakfast, With one unanswered question, Chris Wallace debunked weeks of Texas media coverage on Austin, Fort Worth, crime trends, and partisanship, Oct. 5, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]