["“Canadian election was rigged,” claims a November 11, 2020 Facebook post, sharing a picture of Trudeau shaking hands with Joe Biden, along with the caption “The ‘glitchy’ Dominion ballot counting machines used in swing states to elect Joe Biden were also used in Canada to re-elect Justin Trudeau - coincidence?”", "Other examples of the same image being shared can be found in English and in French. However, Elections Canada confirmed the claim is false.", "“All ballots for Canadian federal elections are marked and counted by hand, in front of candidate representatives (scrutineers). We have never used automated vote tabulating machines,” a spokeswoman for Elections Canada told AFP in an email.", "Elections Canada also tweeted on November 16, 2020 that the agency “does not use Dominion Voting Systems. We use paper ballots counted by hand in front of scrutineers and have never used voting machines or electronic tabulators to count votes in our 100-year history.”", "US President Donald Trump falsely amplified that tweet to mirror his allegations that the Toronto-based company’s machines were defective, and that they led to massive fraud in the 2020 US election, which Trump lost. AFP Fact Check has debunked these allegations.", "After many questions were asked on its Twitter account, Elections Canada replied that their original tweet was “intended to inform people who mistakenly believe we use those systems in federal elections and should not be construed as anything other than that.”", "Dominion Voting Systems also tweeted and published a statement on the front page of their website to deny allegations of vote switching in the United States.", "Headlined “Setting the record straight: facts & rumors,”  the company referred to a joint statement by US federal and state election officials who said they found “no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.”", "Contacted by AFP, the company had not responded by time of publication.", "Although the Dominion ballot counting machines have never been used in a Canadian federal election, they have been employed for local and provincial elections. And both the Liberal and Conservative parties have used Dominion to tabulate votes in their leadership races.", "Trudeau’s Liberals won 157 of the 338 House of Commons seats in the October 2019 election, forcing them to seek the support of smaller parties after losing their comfortable 184-seat majority won in the previous vote.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]