["By Saranac Hale Spencer", "Posted on November 5, 2020", "A bogus QAnon-related claim that many of the mail-in ballots for the Nov. 3 election were illegitimate has spread widely on social media. But the claim is based on the faulty assumption that ballots are produced by the federal government.", "On the second day without a clear outcome to the presidential election, a QAnon-related conspiracy theory has gained traction on social media.", "QAnon followers, who regard President Donald Trump as a crusader against a shadowy group of elite pedophiles who supposedly run the government, have been posting bogus claims that many of the mail-in ballots being counted aren’t legitimate.", "One widely shared version that started on Twitter and migrated to Facebook says: “Consider: Dept of Homeland Security controlled ‘official ballots’ production. Dems print extras, not knowing about non-radioactive isotope watermarks on ‘official ballots’. Military sting operation. After weeding out all counterfeit ballots, Trump landslide confirmed.”", "Another commonly copied post on Facebook says, in part: “The ‘watch the water’ intel refers to …..THE WATERMARK on the official election ballots!!!! …The DEMS fell right into the trap of this sting operation and TRUMP has it all!!! Fraud will be exposed for the world to see.”", "Both of those posts are pure bunk.", "First of all, the Department of Homeland Security doesn’t produce ballots. That task is handled by local governments which, typically, contract with printing companies to make the ballots. The Wall Street Journal reported in August on the increase in demand for mail-in ballots due to the COVID-19 pandemic.", "As for the claim, “The ‘watch the water’ intel refers to …..THE WATERMARK on the official election ballots!!!!” That’s an apparent reference to a February 2018 post from “Q,” the pseudonym used by the person or people who post cryptic messages on internet message boards that are the basis for the QAnon conspiracy theory.", "It’s unclear why QAnon followers are pointing to this two-year-old message as support for a claim about fictitious watermarks on ballots in the 2020 election, but many of the clues posted by “Q” are either vague (such as, “watch the water”) or wrong, such as the suggestion in 2017 that Hillary Clinton would soon be arrested.", "Despite the flimsiness of the claim, it prompted at least one person to examine the remnant of her ballot with a magnifying glass and post a video of her investigation on YouTube. The video appears to show some small specks on the strip of paper she examines.", "“Oh dear,” she says in the video. “I think there is [a watermark] … Are you guys seeing this? What do you guys think?”", "“THE DEMS ARE IN FOR A GOOD ONE BOIS, THE TRAP WAS SET AND THEY TOOK THE BAIT. thanks for the video, you’re a legend,” responded one user.", "“Trump, you are a Goddamn genius,” said another.", "The video had been viewed more than 100,000 times as of Nov. 5, but it offered no proof of a watermark on a ballot, only a few small specks on a strip of paper.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "“Election Administration at State and Local Levels.” National Conference of State Legislatures. 3 Feb 2020.", "“Our Government — Elections & Voting.” Whitehouse.gov. Accessed 5 Nov 2020.", "Hufford, Austen and Joshua Jamerson. “Voting by Mail? These Companies Are Rushing to Print Your Ballot.” Wall Street Journal. 21 Aug 2020.", "Philadelphia City Commissioners. “Philadelphia City Commissioners Live Stream.” YouTube. Started streaming 3 Nov 2020.", "Selk, Avi and Abby Ohlheiser. “How QAnon, the conspiracy theory spawned by a Trump quip, got so big and scary.” Washington Post. 1 Aug 2018.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]