["A post shared hundreds of times on social media in South Africa claims that inhaling steam from a tea made from guava leaves, eucalyptus and an artemisia variety known as mhlonyane will \"kill\" the virus that causes Covid-19. But this is false: the World Health Organization (WHO) does not recommend steam inhalation to treat or prevent Covid-19.", "The claim, published here on Facebook, has been shared more than 940 times since it was posted on February 9, 2021.", "“Tanzania: Afrika response to Covid -19 ..innovation .. build your sauna/steam challenge! Put gumtree and guava leaves in the boiling pots…mhlonyane tea and all ..smoke/steam the virus: Your health is in your hands (sic)!” reads the post’s caption.", "Below the caption is a video that shows a man emerging from what appears to be a homemade sauna.", "The narrator in the video asks the man in Swahili to describe his experience, to which he replies, “sema mvuke”, which loosely translates to “it’s very steamy”.", "Different versions of the claim that steam inhalation can help prevent or treat Covid-19 have been circulating since the start of the pandemic in December 2019. However, experts say there is no scientific evidence to support these claims.", "Inhaling steam is a traditional remedy used by some communities to treat colds, but there is little evidence that it is effective.", "\"This claim is not based on scientific evidence. WHO hasn’t received data from clinical trials which can support such a claim,\" WHO Africa spokesman Collins Boakye-Agyemang told AFP Fact Check.", "More broadly speaking, the UN health agency has refuted claims that heat can prevent or treat Covid-19. This includes hot baths, hand dryers, living in humid climates, and sunny weather.", "A list of recommended practices to minimise risks of contracting Covid-19 can be found on the WHO website here.", "A 2017 study in the Cochrane Database of Systematic Reviews found that there is no conclusive evidence that steam reduces cold symptoms or the viral dose of the rhinovirus that causes colds. When disinfecting a surface, applying heat can destroy coronavirus particles, but similar treatments are not effective once the virus is already inside the human body.", "Eucalyptus, also known as gumtree, is popular for its oil and leaves. Guava leaves are also used in folk medicine in several countries, mainly as an anti-diarrheal remedy. However, there is not sufficient scientific evidence that this is an effective treatment.", "The leaves of mhlonyane, a common plant in Southern Africa, have been used by traditional healers for centuries to manage respiratory diseases. Although the herb can be effective in treating bacteria, no evidence has been found to show that it kills viruses like COVID-19, according to Sandy van Vuuren, a professor at Wits University in South Africa.", "AFP Fact Check has previously debunked similar claims about steam inhalation here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]