["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Terry McAuliffe sees Cuba as a land of opportunity.", "Amid President Barack Obama’s historic trip to Cuba this past week, McAuliffe said in an interview that Virginia already has made impressive headway in tapping the island nation’s export market.", "\"Virginia now is the number one exporter of ag (agricultural) products to Cuba,\" McAuliffe said during a March 21 MSNBC interview. \"We have now jumped to number one.\"", "In January, the governor returned from a trip to Cuba aimed at bolstering the commonwealth’s commercial ties with the nation. The U.S. still has a decades-long embargo on most trade with Cuba. But a 2000 law allows limited exports of agricultural products and medical equipment. In 2014, Obama re-established formal diplomatic relations with Cuba.", "McAuliffe supports ending the trade embargo.", "Brian Coy, the governor’s spokesman, pointed us to a Feb. 12 news release where McAuliffe announced that last year Virginia exported $41.6 million in agricultural goods to Cuba, all of it soybeans and soybean meal. In past years, Virginia also has shipped apples, poultry and beef. McAuliffe said the 2015 export tally was the most that any state had sent to Cuba that year.", "We tracked down the same trade figures through an online database provided by the U.S. Department of Agriculture. It shows that in 2015, Virginia’s $41.6 million indeed was the most of any state, followed by Georgia, which had $30.9 million in agricultural exports to Cuba; and Florida, which had $29.9 million in exports.", "Rounding out the top five agricultural exporters to Cuba were Alabama and Louisiana. Altogether, the U.S. exported nearly $150 million in agricultural goods to Cuba last year.", "A 2015 article from the Federal Reserve Bank of Richmond noted Virginia’s farm exports accounted for 28 percent of all U.S. agricultural exports last year, compared with the 21 percent share for Georgia and 20 percent share for Florida.", "Virginia, Georgia, Florida, Alabama and Louisiana generally have dominated the share of U.S. exports to Cuba since 2011.", "McAuliffe is correct that the 2015 figures are a turnabout of sorts for Virginia. In 2012, the state had $65.6 million in agricultural exports to Cuba, and that fell to $24.9 million in 2014, ranking it fifth behind those other four Southern states.", "Last year was the first time Virginia reached the goal of becoming the top agricultural exporter to Cuba, said Todd Haymore, the state’s secretary of agriculture and forestry.", "Haymore told us Virginia and other Southern states’ proximity to Cuba provides an advantage in tapping the Cuban market.", "Other factors helped, he said. For example, Georgia has focused on expanding an agricultural export facility in Savannah, Haymore said. Florida, meanwhile, has extensive port operations, the secretary said.", "Haymore said a \"significant\" share of Virginia’s agricultural exports to Cuba were produced in the commonwealth, although he added that Virginia’s ports also ship products that originate from other states, including Maryland and North Carolina.", "This year, it looks like Virginia has some serious competition if it wants to retain its billing as the top agricultural exporter to Cuba. Figures from January, the only month for which export figures are available so far this year, show that Louisiana sent $17.9 million in agricultural exports to Cuba that month, and Alabama sent $2.1 million. Virginia’s $1.7 million ranked third.", "While Virginia has seen its exports to Cuba go up and down and then back up in recent years, it’s been a different story for U.S. trade to the island nation. The total value of all U.S. exports to Cuba actually has been waning, even amid White House overtures to open trade. U.S. exports to Cuba dropped from $464.5 million in 2012 to $180.3 million last year, according to figures from the U.S. Commerce Department.", "Our ruling", "McAuliffe said Virginia is the top exporter of agricultural products to Cuba.", "The numbers from the latest year available back his claim. We rate his statement True.", "Terry McAuliffe’s appearance on MSNBC, March 21, 2016.", "Emails from Brian Coy, spokesman for Gov. Terry McAuliffe, March 22-24, 2016.", "Governor Terry McAuliffe, \"Governor McAuliffe announces Virginia is top state for agricultural exports to Cuba,\" Feb. 12, 2016.", "Interview with Todd Haymore, Virginia secretary of agriculture and forestry, March 24, 2016.", "U.S. Department of Agriculture, Foreign Agricultural Service, accessed March 23-24, 2016.", "Email from Gwen Sparks, spokeswoman for the U.S. Department of Agriculture, March 23, 2016.", "Interview with Gwen Sparks, March 23, 2016.", "Interview with Tim Truman, spokesman for the U.S. International Trade Administration, March 22, 2016.", "U.S. International Trade Administration, TradeStats Express, accessed March 22, 2016.", "Email from Laura Fortunato, spokeswoman for the Federal Reserve Bank of Richmond, March 23, 2016.", "Federal Reserve Bank of Richmond, \"Trading with Cuba,\" third quarter 2015.", "Email from Naomi Evangelista, spokeswoman for the U.S. Census Bureau, March 23, 2016.", "The Miami Herald, \"Despite White House opening exports to Cuba continue to drop,\" Oct. 12, 2015.", "Politico, \"Cuba to U.S. we don’t want your food,\" Oct. 5, 2015.", "Kansas City Star, \"Lewis Diuguid: Obama’s historic trip to Cuba expected to result in pressure to increase trade with U.S.,\" Feb. 18, 2016.", "U.S. Department of Agriculture Economic Research Service, \"US-Cuba agricultural trade: Past, presdent and possible future,\"  Aug. 3, 2015.", "The Washington Post, \"Virginia becomes Cuba’s largest U.S.-based agricultural exporter,\" Feb. 18, 2016.", "Richmond Times-Dispatch, \"McAuliffe prepares for historic trip to Cuba,\" Jan. 2, 2016.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]