["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An Australian doctor says he cured Charlie Sheen and the island nation of Comoros of HIV with a curious treatment — specifically, arthritic goat’s milk.", "Samir Chachoua first made headlines in January, when he became the subject of a Dr. Oz intervention. Sheen told Oz that he stopped taking conventional HIV medication for about a month after Chachoua’s treatment made HIV \"undetectable\" in his blood.", "Oz pointed out that Chachoua was not licensed to practice medicine in the United States and his method of convincing Sheen — by injecting himself with Sheen’s blood — was not only unorthodox, but highly inappropriate. Sheen agreed to take his medicine again.", "It gets weirder.", "A few weeks later, Chachoua expressed his disappointment in Sheen and touted his treatment on Jan. 29’s Real Time with Bill Maher.", "\"I found a place in Mexico with all these IV drug users, prostitutes, all the high profile things that are necessary for AIDS but I didn’t find AIDS,\" he said. \"What I found was, their people were drinking milk from goats, which had arthritis. These goats have a virus called CAEV, and this virus destroys HIV and protects people who drink it for life.\"", "This treatment, says Chachoua, not only cured Sheen but helped eradicate HIV in Comoros, an island nation in the Indian Ocean, in 2006.", "Let’s state off the bat that Chachoua has been, as Maher noted, \"called a quack a million times.\" His claims that he eradicated HIV in Comoros in 2006 and cured Sheen are profoundly untrue.", "\"We have no cure for AIDS and it’s certainly not going to be anything related to goat’s milk,\" said Jeffrey Laurence, the senior scientific consultant for programs at amfAR, the Foundation for AIDS Research.", "The facts on CAEV", "As its name suggests, the caprine arthritis encephalitis virus or CAEV  — which is part of the same genus of viruses as HIV — causes arthritis and encephalitis in goats. Some research shows that infected goats may develop antibodies that will \"cross react\" with HIV.", "What does this mean? If you remember the lock-and-key model from your biology textbook, you’ll know that your body produces antibodies that are specific to an antigen. Some CAEV antibodies, in addition to flagging CAEV, can also identify HIV. Simply put, they recognize HIV as an antigen. That’s it.", "There is no evidence these antibodies \"destroy\" or protect against HIV, said Brian Murphy, a professor of pathology at the University of California Davis’ School of Veterinary Medicine, who’s studied CAEV.", "Scientists have actually known about this cross-reactivity for decades, but in the grand scheme of AIDS research, it’s meaningless, according to Laurence of amfAR.", "\"It wouldn’t make my list of 100 things to consider in the search for a cure,\" he said. \"There are so many more interesting things to look into without having to look into cross-reactions with goats.\"", "Nonetheless, the National Institute of Allergy and Infectious Diseases did support research into CAEV’s vaccine potential in the 2000s before determining that it wasn’t viable. Currently, there’s a team of scientists at Joseph Fourier University in Grenoble, France, working on a CAEV-based HIV vaccine.", "Yahia Chebloune, one of the immunologists on the team, explained the concept to us.", "The team’s vaccine prototype combines CAEV with HIV and SIV (simian immunodeficiency virus). Unlike HIV, CAEV doesn’t destroy T helper cells — the white blood cells essential to the immune system — nor does it replicate as aggressively and indefinitely or create an AIDS-like disease in goats.", "So when the vaccine was tested on mice, macaques and llamas, their T helper cells weren’t destroyed and the animals could produce antibodies, suggesting that the vaccine was effective in stopping the HIV strains from replicating.", "Got goat milk", "None of this suggests that Chachoua has successfully cured Sheen or the 780,000 inhabitants of Comoros against HIV.", "Simply \"drinking milk from goats with arthritis\" cannot protect anyone from the virus. CAEV is not transmittable to humans, so Charlie Sheen couldn’t have developed CAEV antibodies — even if they did \"destroy\" HIV (again, they don't).", "\"This is the craziest story I’ve ever heard,\" said Chebloune. \"The claims of Dr. Sam Chachoua are not scientifically serious.\"", "Is it possible that Chachoua inoculated Sheen with a homemade CAEV-based vaccine like Chebloune’s? Our multiple requests for comment went unanswered so we’ll never know for sure.", "But the one CAEV vaccine prototype we found triggered an immune response in animals and has yet to be tested on humans. What’s more, as Lawrence of amfAR noted, vaccinating someone against a disease is not the same thing as curing it.", "Then there’s the most damning evidence against Chachou: Sheen is still HIV-positive, while there were 7,900 HIV cases in Comoros in 2012.", "\"I’m not cured, no,\" Sheen said on Feb. 11’s Dr. Oz.", "Salvator Niyonzima, who directs the Joint United Nations Programme on HIV/AIDS in Comoros, told Oz that he and his colleagues \"have never heard of Dr. Samir Chachoua.\"", "Our ruling", "Chachoua said he cured Charlie Sheen and Comoros of HIV with \"milk from goats which had arthritis.\"", "Chachoua is taking a nugget of science and twisting into an absurd claim. There is no proof that CAEV — a relative of HIV that’s studied for its vaccine potential — neutralizes HIV.", "Sheen and people on the island of Comoros both have HIV.", "We rate Chachoua’s claim Pants on Fire.", "Youtube, Real Time with Bill Maher, Jan. 29, 2016", "Dr. Oz, \"Exclusive Charlie Sheen 1 on 1 Part 2,\" Jan. 12, 2016", "Interview with Jeffrey Laurence, senior scientific consultant for programs at amfAR, Feb. 18, 2016", "US Department of Agriculture, \"Caprine Arthritis Encephalitis Virus Info Sheet,\" May 2008", "Virology, \"Caprine arthritis-encephalitis virus-infected goats can generate human immunodeficiency virus-gp120 cross-reactive antibodies,\" Oct. 10, 2003", "Archives of Medical Research, \"Frequency of the Serological Reactivity Against the Caprine Arthritis Encephalitis Lentivirus gp135 in Children Who Consume Goat Milk,\" April 2009", "Archives of Medical Research, \"Cross-reactivity between caprine arthritis-encephalitis virus and type 1 human immunodeficiency virus,\" Oct. 2003", "PLOS ONE, \"Long-Term Central and Effector SHIV-Specific Memory T Cell Responses Elicited after a Single Immunization with a Novel Lentivector DNA Vaccine,\" Oct. 22, 2014", "Email interview with Brian Murphy, professor of pathology at the University of California Davis’ School of Veterinary Medicine, Feb. 10, 2016", "Email interview with the National Institute of Allergy and Infectious Diseases, Feb. 17, 2016", "Grantome, \"HIV Vaccine Strategies Based on A Goat Lentivirus - Caev,\" accessed Feb. 16, 2016", "Vaccine, \"A novel non-integrative single-cycle chimeric HIV lentivector DNA vaccine,\" March 15, 2015", "Email interview with Yahia Chebloune, immunologist at Joseph Fourier University, Feb. 10, 2016", "Aids Research and Human Retroviruses, \"Cowpox Helped Against Smallpox; Will the Goat Lentivirus (Caprine Arthritis Encephalitis Virus) Help Against HIV-1?.\" June 3, 2015", "CIA, World Factbook: Comoros, accessed Feb. 18, 2016", "Journal of Virology, \"Lack of functional receptors is the only barrier that prevents caprine arthritis-encephalitis virus from infecting human cells,\" Sept. 2000", "UNICEF, \"Comoros Statistics,\" Dec. 24, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]