["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republican Senate candidate George Allen says he gave a thumbs down to a project that became a symbol of federal waste.\n\n\"I was one of about a dozen (senators) who voted against the Bridge to Nowhere,\" Allen said in a Dec. 7 debate with Tim Kaine, his expected Democratic rival for the senate seat.\n\nAllen, who served in the senate from 2001-2007, was referring to a federal plan to build a $225 million bridge connecting the city of Ketchikan, Alaska, with the Island of Gravina, which has 50 residents. The plan became a lightning rod for critics who said congressional earmarking -- the set aside of federal money for pet projects -- had run amok.\n\nFunding for the bridge was included in a $286.5 billion highway and transportation bill in 2005. The Senate passed the legislation on July 29, 2005, by a vote of 91-4.\n\nJamie Radtke, who is challenging Allen for the GOP nomination for the Senate seat, has charged that Allen supported the bridge because he voted for the omnibus highway bill. We’re dismissive of the charge, because funding for the Alaska bridge came to less than one-tenth of one percent of the expenses in the bill.\n\nPolitiFact examined a similar charge that President Barack Obama supported the Bridge to Nowhere because, like Allen, he voted in favor of the overall highway bill that contained the bridge funding. The claim  -- made by Sen. John McCain, R-Ariz., the 2008 Republican presidential nominee, was rated Mostly False.\n\nBut how does Allen justify his assertion that he actually voted against the bridge?\n\nDan Allen, a senior advisor to the Allen campaign, cited the former senator’s vote on an amendment in a later transportation appropriations bill that called for stripping federal funding from the Bridge to Nowhere project.\n\nThat amendment, sponsored by Sen. Tom Coburn, R-Oklahoma, sought to redirect part of the funding for the Ketchikan-Gravina Island bridge funding to a project to rebuild the Twin Spans Bridge between New Orleans and Slidell, La., which had been damaged during Hurricane Katrina.\n\nThat amendment failed by a vote of 82-15. Allen was indeed one of the 15 senators who voted in favor of killing the funding for the Bridge to Nowhere.\n\nSteve Ellis, the vice president of the Taxpayers for Common Sense, said considering Allen’s vote on the amendment, Allen’s statement is accurate.\n\n\"It rings pretty true,\" Ellis said.\n\nAfter the amendment’s defeat, lawmakers hashing out differences between the House and Senate measure of the appropriations bill removed the earmark for the Bridge project and instead provided the money directly to the Alaska Department of Transportation to spend on whatever projects it saw fit. That funding still could have gone to Ketchikan-Gravina Island span, but ultimately the bridge was never built.\n\nOur Ruling\n\nAllen said he was one of  a dozen senators who voted against the Bridge to Nowhere.\n\nWhen faced with a specific amendment to defund the bridge, Allen was one of a minority of senators who opted to kill the project.\n\nWe rate his claim True.", "TimesDispatch.com, \"Senate Debate -- Allen vs. Kaine -- 1 of 2,  Dec. 7, 2011. (Statement is just more than 32 minutes into the video).\n\nE-mail from Dan Allen, senior advisor to the George Allen campaign, Dec. 15, 2011.\n\nInterview with Dan Allen, Dec. 15, 2011.\n\nInterview with Steve Ellis, vice president of Taxpayers for Common Sense, Dec. 21, 2011.", "Jamie Radtke for Senate, \"George Allen sells out Republican Primary Voters,\"  Sept. 21, 2011.\n\nPolitiFact, \"Bridge too far on Bridge to Nowhere,\"  Sept. 23, 2008.\n\nFactCheck.Org, \"Bridge to Nowhere,\" Sept. 22, 2008.\n\nThe New York Times, \"Two ‘Bridges to Nowhere’ tumble down in Congress,\"  Nov. 17. 2005.\n\nPolitiFact, \"Earmark attack on Patty Murray rings mostly true,\" Oct.. 20, 2010.\n\nChristian Science Monitor, \"Ethanol vote: first step towards extinctgion of federal tax subsidies?\" June 14, 2011.\n\nTaxpayers for Common Sense, \"TCS applauds the elimination of the Alaska Bridges to Nowhere,\"  Nov. 16, 2005.\n\nPolitiFact, \"George LeMieux says Bill Nelson voted for billions in earmarks such as the Bridge to Nowhere,\" May 12, 2011.\n\nSen. Tom Coburn, \"Dr. Coburn’s statement on ethanol vote,\" June 14, 2011.\n\nThe Heritage Foundation, \"The Bridge to Nowhere: a national embarrassment,\"  Oct. 20, 2005.\n\nPolitico, \"Coburn on Palin and the Bridge to Nowhere,\"  Sept. 10, 2008.\n\nUnited States Senate, vote tally on passage of H.R. 3058, Oct. 20, 2005.\n\nUnited States Senate, vote tally on Coburn amendment to H.R. 3058,Oct. 20, 2005.\n\nUnited States Senate, vote tally on H.R. 3, July 29, 2005.\n\nThomas (Library of Congress), H.R. 3058, accessed on December 22, 2011.\n\nCongressional Record, debate on Coburn amendment to H.R. 3058, Oct. 20, 2005.\n\nCitizens Against Government Waste, \"Bridging the gap on the ‘Bridge to Nowhere,’\"  Sept. 11, 2008.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]