["Gov. Rick Perry marked the 38th anniversary of what he called \"the tragedy\" of the U.S. Supreme Court's landmark Roe v. Wade decision by speaking to fellow abortion opponents at the Jan. 22 Texas Rally for Life outside the Capitol building.", "Perry said that since the 1973 decision, which established abortion as a constitutional right, \"50 million, 50 million children have lost their chances. That is a catastrophic number.\"", "PolitiFact Texas readers asked us to check Perry's statement.", "But before diving in, we noted two issues with Perry's use of \"children\" -- a flash point in the political, moral and scientific national debate over abortion. One, abortion rights supporters dispute calling unborn fetuses \"children.\" Second, an unknown share of the 50 million aborted pregnancies referenced by Perry would not have resulted in live children, due to the natural risk of miscarriages and stillbirths.", "For our inquiry, we focused on the number of U.S. abortions since Roe was decided.", "The Roe v. Wade ruling, issued Jan. 22, 1973, struck down a Texas law prohibiting nearly all abortions and held that the right to privacy \"is broad enough to encompass a woman's decision whether or not to terminate her pregnancy.\" It said states could not prohibit a woman from having an abortion before viability, the time at which a fetus can survive outside a woman's body. It noted that viability \"is usually placed at about seven months (28 weeks) but may occur earlier, even at 24 weeks.\"", "After fetal viability, the court said, states could limit abortions provided that their policies met certain requirements, including an exception to protect the life of the woman. Since then, other Supreme Court rulings have affirmed states' rights to approve further restrictions.", "During the early 1960s, every state except Pennsylvania allowed abortions when needed to protect a woman's life, according to a March 2003 article published by the universally respected Guttmacher Institute, which studies and advocates on issues related to reproductive health. At the time Roe was decided, 17 states allowed abortions in certain other situations such as when pregnancy was the result of rape or incest. In 1972, the year before the Roe ruling, about 587,000 legal abortions were reported to the federal Centers for Disease Control and Prevention, according to a 2005 CDC report.", "And since 1973? Perry spokeswoman Catherine Frazier pointed us to a January 2010 report from the National Right to Life Committee, a Washington-based group that opposes abortion, that says about 52 million abortions took place from 1973 through 2009. According to the report, the group arrived at the total using figures from the Guttmacher Institute for 1973 through 2005; estimating a number for the next four years; and finally adding 3 percent to account for under-reporting. The National Right to Life publication says 3 percent is the under-reporting rate estimated by Guttmacher.", "Using a similar methodology, National Right to Life has since updated its numbers. The new report says that more than 53 million abortions took place from 1973 through 2010.", "Rachel Jones, a senior research associate at Guttmacher, told us the institute doesn't adjust its numbers — which are estimates based on surveys of facilities where abortions are performed, including hospitals and clinics — for under-reporting. She said a 1994 Guttmacher study had found that some small facilities weren't included in the institute's survey, which indicated that the number of abortions in 1992 was actually 3 percent to 4 percent more than reported.", "Our attempts to reach officials at National Right to Life were unsuccessful.", "Next, we sought the most up-to-date abortion data from Guttmacher. Spokeswoman Rebecca Wind provided us with a 2011 report that includes annual data on abortions from 1973 through 2008. The total: 49.3 million.", "We also sought abortion numbers from other sources. Data from the CDC indicate that there were 37.8 million abortions from 1973 through 2006. However, according to the CDC's website, states are not required to report abortion information to the agency, so in some years, the numbers are incomplete. For example, the CDC's 2006 data do not include information on abortions in California, Louisiana or New Hampshire.", "Representatives of abortion rights organizations Planned Parenthood and NARAL Pro-Choice Texas told us that the Guttmacher Institute is the best source for this information.", "Summing up: Perry's statement indicating that there have been 50 million abortions in the United States since 1973 appears to be on target. The Guttmacher Institute estimates that there were 49.3 million abortions in the U.S. through 2008 — 700,000 shy of 50 million. Considering that Guttmacher says there were more than 1 million abortions in both 2007 and 2008, it's reasonable to conclude that the United States has reached the 50 million mark.", "We rate Perry's statement True.", "Gov. Rick Perry, \"Gov. Perry Adds Sonogram Requirement to Emergency Items for Legislative Session,\" speech, Jan. 22, 2011", "U.S. Supreme Court, Roe v. Wade opinion, decided Jan. 22, 1973, accessed via Cornell University Law School website, Jan. 26, 2011", "Congressional Research Service, \"Abortion Law Development: A Brief Overview,\" Jan. 2, 2001", "Guttmacher Institute, \"Facts on Induced Abortion in the United States,\" January 2011", "Guttmacher Institute, \"Lessons from Before Roe: Will Past be Prologue?\" March 2003", "Centers for Disease Control and Prevention, \"Abortion Surveillance — United States, 2005,\" Nov. 28, 2008", "E-mail from Catherine Frazier, deputy press secretary, Gov. Rick Perry's office, Jan. 25, 2011", "National Right to Life Committee, \"Abortion Statistics: United States Data and Trends,\" January 2010", "National Right to Life Committee, \"Abortion Statistics: United States Data and Trends,\" January 2011", "Interview with Rachel Jones, senior research associate, Guttmacher Institute, Jan. 28, 2011", "E-mail from Rebecca Wind, senior communications associate, Guttmacher Institute, Jan. 26, 2011", "Guttmacher Institute, \"Abortion Incidence and Access to Services in the United States, 2008,\" March 2011", "Centers for Disease Control and Prevention, \"Abortion Surveillance — United States, 2006,\" Nov. 27, 2009", "Centers for Disease Control and Prevention, \"CDC's Abortion Surveillance System FAQs,\" accessed Jan. 26, 2011", "E-mail interview with Tait Sye, spokesman, Planned Parenthood Federation of America, Jan. 26, 2011", "E-mail interview with Blake Rocap, spokesman, NARAL Pro-Choice Texas, Jan. 26, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]