["This is one example of a rumor picked up on by conservative websites. It's not true.", "In some corners, impeachment talk is running high these days. Sarah Palin, the former Republican nominee for vice president, wrote on her Facebook page on July 8, 2014, that \"it’s time\" to impeach President Barack Obama.", "But a claim that’s been making the rounds in the conservative blogosphere over the past few months is even more startling. It says that John Roberts, the chief justice of the United States, has ordered Obama’s arrest for treason.", "The claim appeared on numerous conservative websites in April and May, including here, here, here, here and here. In this item, we’ll check the version of the claim that appeared on May 1, 2014, in theuspatriot.com, a conservative website. (The website did not respond to a query from PolitiFact.)", "The headline of the post says, \"BREAKING: Report Circulating That Justice John Roberts Signed Off On Obama’s Arrest For Treason.\"", "The rest of the post is not exactly transparently sourced, citing \"serious speculation\" and an unlinked-to \"leaked document.\"", "\"There is some serious speculation that Chief Justice John Roberts has signed off on Interpol, which would mean that Obama is one step closer to being removed from office for multiple counts of treason,\" the post says. \"Charges include infringements of the Second Amendment, and declaring war without consent of Congress, and some other serious violations of Obama’s Oath.\"", "It goes on to cite a litany of alleged infractions by Obama, which we’ve archived here. The post on this site alone had received more than 237,000 Facebook likes at the time we looked into it.", "Is there anything to this post? No, say legal experts, it’s entirely bunk. (The Supreme Court did not comment for this story, as is its general policy.)", "For starters, the phrase \"Chief Justice John Roberts has signed off on Interpol\" is not even \"coherent English, let alone a statement that makes any constitutional sense,\" said Stephen Wermiel, a law professor at American University’s Washington College of Law.", "Moreover, the powers of the chief justice are far more limited than this blog post imagines, Wermiel and other legal experts said.", "The chief justice \"has no authority to sign off on a warrant of any kind,\" said Paul Finkelman, a law professor at Albany Law School.", "About the only type of arrest the chief justice could set into motion would be to \"direct the sergeant at arms to remove a disruptive member of the audience\" at an oral argument in the Supreme Court building, said Kurt T. Lash, director of the program on constitutional theory, history and law at the University of Illinois.", "\"It would be a serious violation of separation of powers for the court as a whole to involve itself\" in allegations of treason by the president, Lash said. \"In cases where the president might refuse to follow a lawful directive of the court -- say, a failure to turn over Oval Office tapes -- the court would simply report the matter to Congress for their consideration of impeachment. The court itself would take no action against the president.\"", "If the House did proceed to impeach the president, the Senate would hold a trial -- and at that point, the chief justice would enter the picture, as the presiding officer over the trial in the Senate chamber. But that’s quite different than the scenario the blog post lays out, since the chief justice would be entering the fray at the final stage of a president’s possible removal, not as the official initiating it.", "\"Given his longtime participation as an advocate before the Supreme Court before joining the bench, John Roberts would know this, as does pretty much everyone else,\" Lash said. The likelihood that this rumor is false, Lash said, \"is 100 percent.\"", "Our ruling", "Bloggers said Roberts \"signed off on Obama’s arrest for treason.\" But even if he wanted to, the Constitution wouldn’t allow it. We rate the claim Pants on Fire.", "theuspatriot.com, \"BREAKING: Report Circulating That Justice John Roberts Signed Off On Obama’s Arrest For Treason,\" May 1, 2014", "Breitbart.com, \"Exclusive--Sarah Palin: 'It's Time to Impeach' President Obama,\" July 8, 2014", "USA Today, \"Palin calls for Obama's impeachment,\" July 8, 2014", "Email interview with Kurt T. Lash, director of the program on constitutional theory, history and law at the University of Illinois, July 9, 2014", "Email interview with Stephen Wermiel, law professor at American University’s Washington College of Law, July 9, 2014", "Email interview with Paul Finkelman, law professor at Albany Law School, July 9, 2014", "Email interview with Carl Tobias, law professor at the University of Richmond, July 9, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]