["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A photo spreading on social media shows dozens of cars driving in a caravan on a highway, American flags snapping in the wind.", "\"Look at the people coming from California to Washington DC,\" the description of the image says.", "One Facebook account vowing never to concede the 2020 presidential election shared the picture on Jan. 3 and wrote: \"Here come the Patriots!!\"", "Some supporters of President Donald Trump plan to rally in Washington on Jan. 6, when Congress is poised to certify President-elect Joe Biden’s win.", "But this photo appears to be from October, when thousands participated in a Trump parade in Long Island, N.Y.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The rally on Oct. 18 in Long Island stretched 80 miles from Seaford, N.Y., along the Sunrise Highway to Montauk.", "The event’s organizer, Shawn Farash, tweeted the image in the Facebook post that day, writing: \"We had reports of 9000+ cars...And one airplane today at the #LongIslandLOUDMajority Trump Parade from Seaford to Montauk!\"", "\"@realDonaldTrump Long Island loves you!\" said someone else who tweeted the image on Oct. 18.", "We rate this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Jan. 3, 2021", "Politico, MAGA marchers plot final D.C. stand on Jan. 6, Jan. 4, 2020", "Patch, Trump parade across Long Island draws thousands, Oct. 18, 2020", "Newsday, Rolling rally for Trump cruises across South Shore, Oct. 18, 2020", "Shawn Farash tweet, Oct. 18, 2020", "Tweet, Oct. 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]