["About this rating", "In February 2019, a meme re-emerged on social media containing a pro-Donald Trump quotation attributed to the veteran Broadway and Hollywood actor and singer Diahann Carroll.", "The meme appeared to be an improvised montage of a photograph of Carroll along with excerpts from a blog post which read:", "Actress Diahann Carroll: 'We've Never Had a President Like Trump and We Will Never Have...'", "\"I just can't understand you people!\" (she pointed her finger to Democrats.)", "\"You DEMOCRATS scraping the bottom of the barrel to make our president Donald Trump look bad. If you just spend that time and effort to come up with a political solution our country would be a paradise.\"", "\"Just leave him, he's doing important changes to improve our country. We've never had a president like Trump and we will never have again in the future, so just respect his efforts for this nation.\"", "The text of the meme was taken from an article posted and re-posted on several disreputable blogs and websites in March 2018. The earliest instance we found was a 1 March 2018 post on the \"United States Political Zone\" website, which read as follows:", "\"Not long ago, [Carroll] appeared on a TV show that was associated with modern fashion, but even there the Trump effect took a place. When she was asked about Trump's activities as leader of our nation and everything that happened in our country so far, she came up with something amazing.", "'You DEMOCRATS scraping the bottom of the barrel to make our president Donald Trump look bad. If you just spend that time and effort to come up with a political solution our country would be a paradise.'", "'Just leave him, he's doing important changes to improve our country. We've never had a president like Trump and we will never have again in the future, so just respect his efforts for this nation.'\"", "So the original blog post, from which the purported quotation was taken, did at least provide something of a putative source: an appearance by Diahann Carroll on an unnamed \"TV show that was associated with modern fashion,\" sometime between the inauguration of Donald Trump in January 2017 and the publication of the article in March 2018.", "However, despite extensively searching news archives we could find no evidence of any such television appearance or interview by Carroll during that period, and no evidence of any kind that Carroll had publicly said Donald Trump was \"doing important changes to improve our country\" or that Democrats should stop \"scraping the bottom of the barrel\" in their criticism of him.", "In July 2017, the Washington Post conducted an interview with Carroll, who was then 82 years old, but the president's name was not mentioned in it.", "It is true that Carroll's former husband, the late singer Vic Damone, was friends with Donald Trump, and Trump phoned Damone in the days before his death in 2018. Carroll and Damone were divorced in 1996, but at least one photograph shows that Carroll accompanied Damone to Trump's Mar-a-Lago resort in 1995.", "Notwithstanding those relatively tenuous historical links between Carroll and the 45th president, the \"We've never had a president like Trump\" quotation attributed to her in March 2018 and shared widely in February 2019, appears to be nothing less than a complete fabrication.", "Indeed, given Carroll's high profile and status as a black entertainment icon, any public comments by her to that effect would undoubtedly have attracted widespread media attention and commentary beyond a cluster of hyperpartisan right-leaning blogs and social media accounts.", "No such news coverage exists because no corroborated, reliable evidence exists that Carroll ever made the remarks.", "TrumpPictures.blogspot.com.  \"Actress Diahann Carroll: 'We've Never Had a President Like Trump and We Will Never Have Again in the Future, So Just Respect His Efforts for This Nation! Or Leave the Country. Do You Support Her?\"\r\n   15 March 2018.", "BlingNews.com.   \"Actress Diahann Carroll: We've Never Had a President Like Trump and We Will Never Have Again in the Future, So Just Respect His Efforts for This Nation! Or Leave the Country. Do You Support Her?\"\r\n    4 March 2018.", "USATodaysDonaldTrumpNews.online.   \"Actress Diahann Carroll: We've Never Had a President Like Trump and We Will Never Have Again in the Future, So Just Respect His Efforts for This Nation! Or Leave the Country. Do You Support Her?\"\r\n    1 March 2018.", "RedNewsPaper.com.   \"Actress Diahann Carroll: We've Never Had a President Like Donald Trump.\"\r\n    March 2018.", "USPoliticalZone.com.   \"Actress Diahann Carroll: We've Never Had a President Like Donald Trump.\"\r\n    1 March 2018.", "Thompson, Krissah.   \"A Starlet of the Civil Rights Era, Diahann Carroll Looks Back on a Career of Firsts.\"\r\n    The Washington Post.   17 July 2017.", "Fox News.   \"Legendary Singer Vic Damone Dies at Age 89.\"\r\n    12 February 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]