["New Jersey shells out nearly the most in the country to educate its public school students.\n\nBut, in at least one area, the yield on that investment is lackluster: more residents leave New Jersey to attend college than in any other state, according to Assembly Majority Leader Lou Greenwald.\n\nWhen asked about a November bond referendum for construction at state colleges in an Aug. 9 interview with the liberal blog Blue Jersey, Greenwald, a South Jersey Democrat, said the focus should be on \"how do we keep our best and brightest students here in New Jersey.\"\n\n\"We spend more on public education, kindergarten to 12th grade, than any other state in the country yet we have the highest exodus of graduating high school seniors who are more than qualified to go to the schools that we have here in the state,\" Greenwald said. \"We just don't have the capacity. A lot of that has helped drive up costs. So the capital construction to expand access for New Jersey residents is critically important. If you think about 100,000 kids in this country leave their home state and go to another state to be educated. Out of that 100,000 young people, 30,000 of them are from New Jersey, by far the largest amount.\"\n\nDo New Jerseyans really represent nearly a third of all students across the country who go to an out-of-state school?\n\nStatistics from the National Center for Education Statistics, an arm of the U.S. Department of Education, highlight a major flaw in Greenwald’s statement: far more than 100,000 students nationwide pursue a postsecondary education at an out-of-state institution.\n\nIn fall 2010 -- the most recent data available -- more than 515,000 freshmen across the country started college at an out-of-state school. Nearly 393,000 of those students finished high school in the previous year.\n\nSo Greenwald scores no points for accuracy there.\n\nBrian McGinnis, Greenwald’s communications director, said we were \"missing the forest for the trees.\"\n\n\"There’s a serious brain drain that’s disproportionately happening in New Jersey,\" he said, adding that Greenwald’s overall point -- that New Jersey \"sends more homegrown students out of state than any other state\" -- was correct.\n\nNearly 35,000 New Jerseyans left home to attend college for the first time in fall 2010. Of those students, more than 31,000 finished high school the previous year.\n\nNo other state had a larger amount of students in either group attend out-of-state schools, but California and New York -- two states with significantly larger populations -- weren’t far behind.\n\nMore than 34,500 students -- nearly 28,300 of whom recently finished high school --  left California for college in fall 2010. In New York, more than 33,900 students left the state for school in fall 2010. Of those students, more than 28,600 were graduated from high school in the previous year.   \n\nGreenwald was comparing the amount of New Jerseyans who leave the state for college to a nationwide figure, but  it’s worth nothing that as a percentage -- a \"more accurate barometer\" for comparing states according to Joseph Stetar, a professor of education at Seton Hall University -- four other states send more students out-of-state for college.\n\nA larger percentage of all first-time freshman students in Alaska, Connecticut, New Hampshire and Vermont attended college outside of their home state than New Jersey in fall 2010.  \n\nOur ruling\n\nGreenwald said \"about 100,000 kids in this country leave their home state and go to another state to be educated. Out of that 100,000 young people, 30,000 of them are from New Jersey, by far the largest amount.\"\n\nRoughly 30,000 recent high school graduates left New Jersey to attend an out-of-state college, according to federal data. That part of Greenwald’s claim is true.\n\nBut far more than 100,000 students attend out-of-state schools and though New Jersey students represented the largest portion of that group, California and New York followed closely behind.\n\nSo we rate this statement Half True.\n\nTo comment on this ruling, go to NJ.com.", "Blue Jersey, Blue Jersey Focus: Assembly Majority Leader Lou Greenwald, Aug. 9, 2012\n\nInterview with Brian McGinnis, communications director for Assembly Majority Leader Lou Greenwald, Aug. 13, 2012\n\nPolitiFact New Jersey, State college president claims New Jersey experiences a net loss of 30,000 students a year, March 22, 2012\n\nNational Center for Education Statistics: Digest of Education Statistics, Residence and migration of all first-time degree/certificate-seeking undergraduates in degree-granting institutions, by state or jurisdiction: Fall 2010, accessed Aug. 10, 2012\n\nNational Center for Education Statistics: Digest of Education Statistics, Residence and migration of all first-time degree/certificate-seeking undergraduates in degree-granting institutions who graduated from high school in the previous 12 months, by state or jurisdiction: Fall 2010, accessed Aug. 10, 2012\n\nNational Center for Education Statistics: Digest of Education Statistics, Residence and migration of all first-time degree/certificate-seeking undergraduates in 4-year degree-granting institutions who graduated from high school in the previous 12 months, by state or jurisdiction: Fall 2010, accessed Aug. 10, 2012\n\nMigration Patterns on College Students in New Jersey: A Synthesis of the Data and Literature by Alyssa R. McCloud, 2009, accessed Aug. 13, 2012\n\nThe Star-Ledger, N.J. voters to decide whether to approve $750M in higher education borrowing, Aug. 8, 2012\n\nE-mail interview with Joseph Stetar, professor in the Department of Education Leadership, Management & Policy at Seton Hall University, Aug. 13, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]