["About this rating", "On 15 December 2016, the state of Massachusetts officially legalized recreational marijuana. Just after that, an article published by The American Tribune reported:", "Recreational marijuana has only been legal in Massachusetts for two hours, and we are now already seeing what looks like the first recorded marijuana overdose since legalization.", "The victim, a 24-year-old male, was rushed to Massachusetts General Hospital in Boston after injecting nearly 5 grams of concentrated cannabis oil. This is the equivalent of around 50 marijuana cigarettes, known as “joints”. He was showing signs of dehydration and had been reportedly hallucinating before losing consciousness at 12:54 AM EST.", "The victim's family prefers to remain anonymous at the moment as they process this difficult news.", "The article had no attribution and a timestamp of 2:14 a.m., but no other outlets subsequently reported what would have been an extremely newsworthy incident (given that there are no recorded overdoses attributed to the use of marijuana).", "An \"About\" page linked in The American Tribune's footer disclaimed:", "The American Tribune provides a satirical view of current events. Our articles should be taken with a grain of salt.", "Our articles are a parody of the terrible news coverage in 2016 and beyond.", "The Massachusetts marijuana overdose claim wasn't The American Tribune's first foray into fake news based on cannabis-flavored current events. In late November 2016, the site reported that Green Party candidate Jill Stein embezzled money raised for 2016 election recounts to fund a \"marijuana dinner party.\"", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]