["Walter Valenzuela, 37, a Honduran man who wants to seek asylum in the U.S. with his family, talks, at right, with Guillermo Navarrete, a Methodist pastor in Tijuana, Mexico, across the border from San Diego, on, Feb. 8, 2021. (AP/Spagat)", "Some asylum seekers released by immigration officials in San Diego have been quarantining in a hotel to comply with the state’s pandemic rules. Jewish Family Service of San Diego, a local nonprofit, has been helping them do so.", "The migrants have been cleared to stay in the country while they wait for their chance to present their cases in court, a Jewish Family Service representative told PolitiFact.", "In general, any immigrants who are physically present in the United States or who arrive in the U.S. can seek asylum, even if they were not legally admitted into the country.", "As former President Donald Trump was tried in the Senate for inciting an insurrection, Fox News host Laura Ingraham accused Democrats of plotting their own insurrection by \"enticing illegals to bust through our borders, exploit our resources and commit crimes.\"", "Ingraham said immigrants were exploiting American hospitality. \"You may not have stayed in a hotel in the past year, but illegals arriving since Biden’s inauguration, they get to stay free of charge,\" Ingraham said Feb. 8, citing a report in the New York Times.", "\"It sounds so pleasant. Can you believe that? At a time when our own people are suffering,\" Ingraham said, after reading a snippet from the report.", "As part of a story about an influx of migrants at the U.S. border with Mexico, the New York Times reported that some migrants arriving in San Diego were quarantining in a hotel in order to comply with California’s 10-day quarantine requirement for out-of-state travelers.", "\"To guard against the coronavirus, health authorities in San Diego have arranged housing for hundreds of arriving migrants in a downtown high-rise hotel, where they are being quarantined before being allowed to join family or friends in the interior of the United States,\" the newspaper found.", "A clip from Ingraham’s monologue was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) So PolitiFact decided to put her claim about \"illegals\" at hotels to the Truth-O-Meter.", "We spoke with immigration experts and Jewish Family Service of San Diego, the nonprofit social-services agency that’s helping families through their hotel quarantines in San Diego.", "It’s true that arriving migrants are quarantining in a hotel in at least that one location, they said.", "But they said Ingraham was wrong to characterize the public health measure as an amenity for \"illegals.\" It involves migrants who were let into the U.S. to seek asylum.", "\"The hotel stay is not a vacation,\" said Nicole Hallett, an associate clinical professor of law and the director of the Immigrants’ Rights Clinic at the University of Chicago. \"It is designed as a public health measure to protect the entire community.\"", "Eitan Peled, a border services advocate with Jewish Family Service, said the migrants quarantining at the hotel include some who came through ports of entry and some who were apprehended after entering the country unlawfully.", "\"Every one of these migrants is asserting their legal right to seek international protection in the United States,\" Peled said.", "The hotel-quarantine setup in San Diego was covered in the New York Times’ report, and also by KSWB-TV, a Fox affiliate in San Diego, and the San Diego Union-Tribune.", "KSWB-TV reported Feb. 9 that the migrants in question \"have been allowed to remain in the U.S. after asking for asylum\" and were turned over to Jewish Family Service.", "Immigrants who are physically present in the U.S. can seek asylum regardless of whether they are in the country legally or illegally, as PolitiFact has reported. They generally have to apply for asylum within one year of arriving in the U.S. For that reason, immigration experts took issue with Ingraham’s characterization of the migrants in San Diego’s hotel as \"illegals.\"", "\"A person can seek asylum at a port of entry to the United States or within the interior of the United States,\" said Erin Barbato, director of the Immigrant Justice Clinic at the University of Wisconsin Law School. \"If a person crossed the border without inspection, that person was not ‘admitted’ into the United States, but that does not make the person ‘illegal.’\"", "In San Diego, the immigrants quarantining in a hotel are those who have been released by immigration officials while they wait to present their case in an immigration court, Peled said.", "They have \"passed a credible fear interview conducted by the Department of Homeland Security, and are now awaiting their asylum cases in the U.S.,\" he said.", "When immigrants claim asylum, they are processed and either detained or released to friends or family who promise that they will appear at future court hearings, Hallett said. But getting people to their sponsors can be tricky in a pandemic, when travel is restricted.", "\"Thus, the government releases people to a local nonprofit that assists with the quarantine and then ensures that they arrive at their final destination,\" Hallett said. \"It appears that Jewish Family Service is playing this role in San Diego.\"", "Peled said JFS is helping families through their quarantines by providing case management as well as financial and travel assistance. He said the effort is part of San Diego County’s ability to access federal funding for reimbursement of \"non-congregate sheltering\" — that is, temporary living arrangements that avoid crowding to reduce the risk of spreading the coronavirus.", "A spokesperson for the Border Patrol in the San Diego sector told the San Diego Union-Tribune that COVID-19 restrictions have caused some facilities to reach \"maximum safe holding capacity,\" prompting the release of some migrants before their court hearings.", "The practice of releasing immigrants until they appear before a judge was less common under Trump, Barbato said. The Trump administration starting in 2019 forced migrants to wait in Mexico while their cases moved through the immigration system.", "It isn’t clear how many places are using hotels like San Diego. The Associated Press reported that a Texas charity was testing migrants released by the Border Patrol for COVID-19 and sending those with infections to isolate in a hotel.", "A Fox News spokesperson cited the transcript from Ingraham’s show, where she referred specifically to what was happening in San Diego after first mentioning the hotel quarantines.", "But Ingraham’s broader claim that \"illegals … get to stay free of charge\" could have given some viewers the impression that President Joe Biden’s policy was opening up free hotel rooms along the border to immigrants who were in the country unlawfully.", "White House press secretary Jen Psaki said Feb. 10 that the \"vast majority have been turned away.\"", "In the video clip, Ingraham said, \"You may not have stayed in a hotel in the past year, but illegals arriving since Biden’s inauguration, they get to stay free of charge.\"", "Ingraham’s sweeping comment exaggerated the facts.", "In San Diego, under an arrangement with local health authorities and a local nonprofit, migrants seeking asylum have been quarantining in a hotel before traveling elsewhere to await their court cases.", "These migrants have been cleared by federal authorities to be in the country while they pursue their asylum claims, even if some entered unlawfully. Their hotel stays are part of public health measures to help contain the spread of COVID-19.", "Ingraham’s claim contains an element of truth but gives a misleading impression by omitting important context about the circumstances of their hotel stays.", "We rate this claim Mostly False.", "Fox News, \"The Ingraham Angle,\" Feb. 8, 2021", "The San Diego Union-Tribune \"Some asylum seekers trickle across border, others turned away as Biden guidance unfolds,\" Feb. 12, 2021", "The Associated Press, \"Biden administration to allow 25,000 asylum-seekers into US,\" Feb. 12, 2021", "The White House on YouTube, \"02/10/21: Press Briefing by Press Secretary Jen Psaki,\" Feb. 10, 2021", "KSWB-TV, \"Border authorities begin releasing migrants in California; Charity helps put people in hotels,\" Feb. 9, 2021", "The New York Times, \"Migrant Families Force Biden to Confront New Border Crisis,\" Feb. 6, 2021", "U.S. Department of Homeland Security, \"Annual Report 2020,\" Jan. 19, 2021", "U.S. Department of Homeland Security, \"Immigration Enforcement Actions: 2019,\" September 2020", "The Associated Press, \"AP Exclusive: Migrant kids held in US hotels, then expelled,\" July 22, 2020", "The Associated Press, \"AP Explains: What happens when migrants arrive at US border,\" June 26, 2019", "The International Rescue Committee, \"Is it legal to cross the U.S. border to seek asylum?\" March 1, 2019", "U.S. Department of Homeland Security, \"Definition of Terms,\" March 16, 2018", "U.S. Citizenship and Immigration Services, \"Questions and Answers: Credible Fear Screening,\" July 15, 2015", "PolitiFact, \"Tom Cotton wrong that there’s \"no way\" to screen immigrants,\" Feb. 3, 2021", "PolitiFact, \"Fact-checking Joe Biden’s claim on asylum seekers in Mexico,\" Aug. 12, 2020", "PolitiFact, \"No, immigrants cannot apply for asylum at U.S. embassies or consulates abroad,\" July 10, 2018", "PolitiFact, \"As Donald Trump seeks changes to immigration courts, what rights do immigrants here illegally have?\" June 28, 2018", "Email correspondence with Immigration and Customs Enforcement, Feb. 11, 2021", "Email interview with Nicole Hallett, associate clinical professor of law and director of the immigrants’ rights clinic at the University of Chicago Law School, Feb. 10, 2021", "Email interview with Erin Barbato, director of the Immigrant Justice Clinic at the University of Wisconsin Law School, Feb. 11, 2021", "Email interview with Eitan Peled, border services advocate at Jewish Family Service of San Diego, Feb. 11, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]