["By D'Angelo Gore", "Posted on June 30, 2020", "Noting that the United States accounts for about one-quarter of global COVID-19 cases and deaths, House Speaker Nancy Pelosi said the U.S. has “the worst record of any country in the world.” While the U.S. has the most confirmed cases and deaths by a wide margin, it does not have the most in either category on a per-capita basis.", "Pelosi emphasized the U.S. share of coronavirus-related cases and deaths during a June 28 interview on ABC’s “This Week” in which she argued the Trump administration is not taking the growing outbreak in several U.S. states seriously.", "“We are 4% of the world’s population,” the Democratic leader told host George Stephanopoulos. “We are 25% of the cases and the deaths, 25%. We have the worst record of any country in the world. And the president says we’re making progress or whatever.”", "Pelosi got the percentages right, but where the U.S. ranks in dealing with the pandemic depends on how one looks at the numbers.", "Pelosi’s deputy chief of staff, Drew Hammill, confirmed to FactCheck.org in an email that the congresswoman labeled the U.S. the “worst” based on it “having the most coronavirus deaths and confirmed cases of any country.”", "According to the University of Oxford-based project Our World in Data, as of June 28, the day Pelosi made her claim, there were 9.95 million confirmed cases of COVID-19 worldwide, and 2.51 million, or 25%, of those cases were in the U.S — the most of any nation.", "The U.S. total was 1.2 million cases more than the second-highest country, Brazil, which had 1.31 million cases as of that day.", "But the U.S. did not have the most cases per capita — which takes into account a country’s population.", "As of June 28, the U.S. had 7,584 confirmed cases per 1 million people, which was fewer cases than nine other nations, including Chile (14,007.27), Kuwait (10,394.65) and Peru (8,370.44). Qatar, which has an estimated population of almost 3 million, had the most cases per capita — 32,509.91 per 1 million people.", "Based on the raw numbers, the U.S. also led all countries with 125,539, or 25%, of the 498,521 confirmed deaths from COVID-19, as of June 28 — according to Our World in Data figures. Brazil again was second to the U.S. with 57,070 confirmed deaths.", "Per capita, however, the U.S. — with 379.27 confirmed deaths per 1 million people — had fewer fatalities from COVID-19 than eight other nations.", "Among those countries with more confirmed deaths per capita: Belgium (839.72), the United Kingdom (640.99), Italy (574.18), Sweden (522.81) and France (456.20).", "In addition, the U.S. had a lower COVID-19 case fatality rate than several nations. The case fatality rate is the number of confirmed deaths divided by confirmed cases.", "As of June 28, the U.S. rate was 5% — lower than the rate in dozens of other countries.", "According to statistics compiled by Johns Hopkins University, out of the 20 countries most affected by COVID-19, the U.S., as of June 30, has the fifth highest observed case-fatality ratio for COVID-19 and the second highest per-capita death rate.", "Pelosi’s claim, that the U.S. has fared the worst based on its total confirmed cases and deaths, reminded us of President Donald Trump’s claims that the U.S. leads the world in testing for COVID-19 simply based on the number of tests performed.", "In Trump’s case, we also pointed out that because of the large U.S. population, a per-capita comparison would be a better gauge of countries’ testing efforts. By that measurement, we found the U.S. trailed at least a dozen countries in testing for the disease, as of May 9, and it’s still not leading the world.", "Pelosi no doubt has a point about the large number of confirmed cases and deaths in the U.S. — and it is in no way our intention to minimize the seriousness of the situation.", "But, similar to Trump’s boasts on testing, whether the U.S. has the “worst record” – as Pelosi said — also depends on the metric used.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]