["About this rating", "Voting in the 2020 U.S. Election may be over, but the misinformation keeps on ticking. Never stop fact-checking. Follow our post-election coverage here.", "In November 2020, as states continued to tally votes cast in the U.S. presidential election, an image graphic supposedly showing how voter turnout had exceeded voter registrations in several states — the most extreme example claimed that Nevada had 125% voter turnout — was circulated on social media, along with accusations alleging some sort of voter fraud.", "The data in the column for the number of registered voters was outdated.", "An archived version of WorldPopulationReview.com from Nov. 4 shows that the number of registered voters shown in the above-displayed graphic was truly displayed by this website. However, the data listed on this website at that time was outdated. On Nov. 5, the website had updated many of these numbers and added a disclaimer stating that \"a previous version of this page contained data from 2018.\"", "Here's the most recent data from these states. The number of registered voters comes from the election websites of the respective states and shows data from just before the start of the election (some states allow same-day registration, which is not reflected in the data below), and the number of votes cast comes from the most recent election data (as of noon CST on Nov. 5, 2020) reported by The New York Times:", "Nevada: 1,821,356 registered voters / 1,221,403 votes\nPennsylvania: 9,091,371 registered voters / 6,424,679 votes\nMinnesota: 3,588,563 registered voters /  3,257,507 votes\nNorth Carolina: 7,361,219 registered voters / 5,461,810 votes\nWisconsin: 3,684,726 registered voters / 3,297,420 votes\nMichigan: 8,127,040 registered voters / 5,515,817 votes\nArizona: 4,281,152 registered voters / 2,910,677 votes\nGeorgia: 7,233,584 registered voters / 4,919,922 votes", "None of these states have seen more votes than registered voters.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]