["About this rating", "In early September 2018, an image of a cloud forming a perfect spiral shape over water with a setting sun on the horizon captivated social media users:", "The picture was not entirely genuine, though.", "This image was created by travel photographer Ilkgul Menzil and originally shared to her Facebook page in October 2016, with the caption \"Stormy Sunset on Fethiye.\"", "When Menzil shared this image a few months later on her Instagram page in order to promote the Liberty Hotel, she noted that she was responsible for both the original photograph and the editing.", "Menzil provided another hint that the scene was digitally manipulated when she shared a \"live version\" of the image to her Instagram page. Menzil said that she created the version featuring a moving cloud spiral after she was inspired by all of the likes and comments on her original post:", "You loved my this photo so much i saw ❤ you made me so happy with your likes and comments and posts on your thousands pages ❤ i thank you millions of millions times to y'all ❤? i wish you like my this photo's live version ❤️ And this amazing tour with was @libertyhotelslykia so much thanks ❤ Photo by me @ilkgulmenzil", "A post shared by  ILKGUL MENZIL (@ilkgulmenzil) on Apr 1, 2017 at 6:26am PDT", "Furthermore, we found this same exact cloud formation in a second photograph. Here's a comparison of the viral image (right) and the alternative version (left). It's unclear if Menzil was responsible for both images:", "Ilkgul Menzil combines photography with digital editing in order to create some stunning images. While her work may inspire people to hop on a plane and venture off to some far off place, it doesn't present accurate representations of real-world sights.", "In May 2016 a similar image of clouds encircling a spire went viral, but that image was computer-generated. Additionally, a very similar image to the one seen here can be found on the Shutterstock.com stock image site.", "Similar looping clouds were recorded over Tunisia in 2014, but this time they were real:", "According to the now-defunct Gawker website, the spiral cloud formation was probably the result of a military jet flying through the sky, creating distrails which are similar in concept to contrails or condensation trails:", "We're most familiar with contrails, short for \"condensation trails,\" or the wispy trails of clouds that form behind high-flying aircraft as a result of warm, moist jet exhaust condensing when it meets the extremely cold upper-atmosphere. \"Distrail\" is short for a \"dissipation trail,\" and while they're similar to contrails, they form through a difference process. Altocumulus clouds often consist of supercooled water droplets—which are water droplets that are still liquid below freezing—but lack a nucleus (like a speck of dust) around which it can freeze into an ice crystal. These supercooled water droplets stay liquid until an impurity is introduced that allows the water to freeze -- in this case, the impurity was jet exhaust.", "The most likely explanation for the photo is that a military jet flew patterns through the altocumulus deck, expelling jet exhaust that gave the supercooled water droplets a nucleus around which to crystallize. Once these droplets froze into ice crystals, they began to precipitate and evaporate, causing a chain reaction much like we see with fallstreak holes. The result is a spectacular sight, with the clouds bisected (or looped, in this case) by a trail of ice crystals precipitating from the deck.", "Sky watchers were wowed in 2009 when a luminous spiral formed in the Norwegian sky, prompting some viewers to question whether it meant contact with extraterrestrials was imminent. The likely explanation, however, was a Russian ballistic missile test.", "Mersereau, Dennis.   \"What Are These Strange, Beautiful Clouds Over Tunisia?\"\r\n    Gawker.   17 December 2014.", "Murphy, Dan.   \"Norway Spiral: A Rocket Scientist Explains the Mystery.\"\r\n    Christian Science Monitor.   10 September 2009.", "Dan Evon is a former writer for Snopes.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]