["About this rating", "On 28 August 2016, the web site The Burning Platform published an image purportedly showing what the electoral map would look like if only taxpayers had been allowed to vote during the 2012 election:", "However, the map displayed here was stolen from Buzzfeed, then republished alongside extremely inaccurate and misleading misinformation.  According to the blog post, the data in this image comes from CNN's 2012 presidential race election poll (as noted in the bottom right-hand corner of this image).", "However, by going to polling page itself, it's clear that no one was asked if they were taxpayers — or if they were asked, that answer was not factored into the CNN map.", "So where did the data actually come from? On 9 November 2012, Buzzfeed published an article featuring several electoral maps representing what the 2012 election would have looked like without universal suffrage. The map, therefore, is a doctored version of Buzzfeed's map for 1920, which showed the results of the 2012 election if only white people (both men and women) had been allowed to vote:", "President Barack Obama has been elected twice by a coalition that reflects the diversity of America. Republicans have struggled to win with ever-higher percentages of the shrinking share of the population that is white men — “a Mad Men party in a Modern Family world,” in the words of one strategist.", "But at America’s founding, only white men could vote, and the franchise has only slowly expanded to include people of color, women, and — during the Vietnam War — people under 21. These maps show how American politics would have looked in that undemocratic past.", "[...]", "While women’s suffrage passed in 1920, there were still huge impediments to minorities to vote during that period, for instance in the form of poll taxes (only finally outlawed by the 24th Amendment in 1964). So here’s a version of the map that shows only white voters, men and women.", "Other maps published in the same article used different metrics for comparison's sake such as how the 2012 election would have looked like — for example — if only white men could vote, if only men (not just white men, but no women) could vote, if only people over age 24 could vote, and finally, how the 2012 election actually played out.", "Buzzfeed.   \"What The 2012 Election Would Have Looked Like Without Universal Suffrage.\"\r\n    9 November 2012.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]