["By Saranac Hale Spencer", "Posted on February 21, 2020", "A Virginia bill that would have banned the sale of “assault firearms” has been tabled for a year, but misinformation about it continues to circulate online — including a false claim that the state will confiscate guns.", "Thousands of demonstrators from around the country, some of them heavily armed, descended on Virginia’s Capitol last month to protest a bill there that would have banned the sale of guns defined as “assault firearms.” Concerns about the protest prompted the governor to declare a state of emergency, but the demonstration was ultimately peaceful and without serious incident.", "The bill grew into a lightning rod for the gun-control debate as national attention turned to Virginia following an election in November that gave Democrats control of both chambers in the state legislature for the first time since 1993.", "During a press conference the day after the election, Gov. Ralph Northam, a Democrat, committed to passing what he termed “common-sense gun legislation.” Referring to gun violence, he said, “I really think a large part of the results that we saw yesterday were Virginians saying that they’ve had enough.”", "Northam had proposed a package of gun control measures in July, about a month after a shooting killed 12 people at a municipal building in Virginia Beach. Among the proposed measures was a ban on assault weapons, high-capacity magazines, bump stocks and silencers.", "The bill introduced in Virginia’s House of Delegates on Jan. 7 came from that proposal. It passed Virginia’s House of Delegates on Feb. 11, but stalled a week later in the Senate, where the judiciary committee shelved it for a year and sent it to the state’s crime commission for review.", "While the bill was working its way through the legislature, it attracted national attention and generated coverage that got the details wrong as it spread widely on social media.", "For example, President Donald Trump last month weighed in on Twitter, saying, “Your 2nd Amendment is under very serious attack in the Great Commonwealth of Virginia. That’s what happens when you vote for Democrats, they will take your guns away. Republicans will win Virginia in 2020. Thank you Dems!”", "The bill did not include a provision that would “take” anyone’s gun away. But the idea that it did has circulated online, ranging from memes with the false claim that the state would confiscate guns to suggestive headlines, like, “Virginia Dems Officially Force Through ‘Assault Weapons’ And Magazine Confiscation Law.”", "One YouTube video, which has received more than 70,000 views, carries a headline that says, “Virginia To Confiscate All Guns…Is The Rest Of America Next?”", "First of all, the bill has not become law; it passed only one chamber of the legislature. Also, it had no gun “confiscation” provision.", "Here’s what it actually proposed: Making the sale and purchase of “assault firearms” illegal. It defined an “assault firearm,” largely, as a semi-automatic rifle, pistol, or shotgun.", "Those who already owned such a weapon wouldn’t have been affected, except for restrictions on the sale or transfer of such weapons. The bill would have banned sales and laid out several rules governing the transfer of an “assault firearm,” such as giving it as a gift to a family member, conveying it as part of an estate, or transferring it to avoid “imminent death or great bodily harm.”", "Exempted from the ban were police and military personnel who use the weapons in the course of their work.", "While the bill never included a ban on the possession of already owned “assault firearms,” it did include a ban on the possession of high-capacity magazines. Those were defined as holding more than 12 rounds of ammunition.", "Selling or purchasing such a magazine would have been a felony offense, while possessing one would have been a misdemeanor.", "The bill laid out various options for those who already own such a magazine: Owners could render it inoperable, transfer it to someone in another state where its possession is legal, take it out of the state, or turn it in to police.", "Those found in possession of a working high-capacity magazine, however, would have been subject to an already existing state law that says illegally held weapons “shall be forfeited to the Commonwealth.” That law currently applies to a type of shotgun commonly called a “streetsweeper,” plastic firearms, and weapons brought into prohibited areas, like schools, courthouses, and airport terminals.", "In addition to those two often cited provisions, the bill proposed to ban bump stocks, which increase the rate of fire from semi-automatic weapons and have already been banned on the federal level. The bill also banned the purchase and sale of silencers, although possession of a silencer would still have been legal.", "A short-lived bill introduced in the state Senate in November may have contributed to some of the misconceptions about the House bill. The proposed law in the Senate would have banned the possession of “assault firearms,” drawing ire from the National Rifle Association. But Northam made it clear in December that he would support legislation only if it included a grandfather clause. The sponsor withdrew his bill on Jan. 13.", "Virginia’s bill isn’t the first of its kind. There was a federal ban on such firearms in effect from 1994 to 2004 and similar laws have been on the books for decades in other states. California, for example, passed an “assault weapon control act” in 1989. Maryland, Massachusetts, New Jersey, New York, and Washington all have various bans on semi-automatic guns. Puerto Rico bans them, too, and Washington, D.C. effectively bans them since it doesn’t allow them to be registered. Hawaii has banned “assault pistols.”", "Some counties and municipalities have also instituted bans on what are often termed “assault weapons.” For example, both Chicago and Cook County, where the city is located, have bans, as does the Chicago suburb of Highland Park.", "Also, legislation related to “assault weapons” was introduced in 13 states in 2019, according to the National Conference of State Legislatures.", "The NCSL has counted the number of states with a ban on high-capacity magazines, too. There are nine — California, Colorado, Connecticut, Hawaii, Maryland, Massachusetts, New Jersey, New York, and Vermont — plus Washington, D.C. Those state laws typically define a high-capacity magazine as holding 10 or more rounds of ammunition, but they vary from as low as seven rounds to as high as 15 rounds.", "Delegate Mark Levine, who sponsored the Virginia bill, said in an interview with FactCheck.org, he looked primarily to the federal legislation when drafting it, but took into account other states’ laws. Asked if he expects to propose similar legislation next year, Levine said, “My plan is to come back. I haven’t changed my views on this.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Virginia House of Delegates. “HB 961 Assault firearms, certain firearm magazines, etc.; prohibiting sale, transport, etc., penalties.” (as passed by the House 11 Feb 2020).", "Trump, Donald (@realDonaldTrump). “Your 2nd Amendment is under very serious attack in the Great Commonwealth of Virginia. That’s what happens when you vote for Democrats, they will take your guns away. Republicans will win Virginia in 2020. Thank you Dems!” Twitter. 17 Jan 2020.", "U.S. House. “H.R.3355 – Violent Crime Control and Law Enforcement Act of 1994.” 13 Sep 1994.", "“Governor Northam Unveils Gun Violence Prevention Legislation Ahead of July 9 Special Session.” Press release. Ralph Northam. 3 Jul 2019.", "“The City of Virginia Beach: An Independent Review of the Tragic Events of May 31, 2019.” Hillard Heintze. 13 Nov 2019.", "Levine, Mark. Delegate, Virginia House of Delegates. Interview with FactCheck.org. 18 Feb 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]