["On March 27, over 900 people died due to novel coronavirus in Italy in a single day. The state’s death toll has now crossed 9,000. Meanwhile, in Iran, the virus has taken the lives of more than 2,000 people. In the midst of the disturbing news, a video is viral on Facebook and Twitter which shows people coming out of a building. It is being claimed that 50 people from Italy and Iran came to Patna’s Kurji last month and have since been hiding in a mosque. They were apprehended by Digha police, the claim furthers.", "At 12:15 PM on March 3, News 24 India tweeted (archive) the video with the text, “पटना के कुर्जी इलाके में ईरान और इटली से करीब 50 विदेशी नागरिक अचानक से इस कॉलोनी में आ गए. जिस वज़ह से पूरे कॉलोनी में अफरा-तफरी मच गया है. इलाके के एक में मस्जिद आकर रुके थे. पटना पुलिस जांच में जुटी. (In Patna’s Kurji, 50 foreign nationals of Iran and Italy suddenly came to this colony. There was panic in the colony due to this. They were staying inside a local mosque. Patna police is investigating.)”", "Punjab Kesari, Amar Ujala, Times Now Hindi and News18 informed that 12 foreign nationals, who were hiding in the mosque, were arrested by the police amid the fear of coronavirus.", "These media outlets, in contrast to News 24 India’s report of 50 foreign nationals, claimed that only 12 people were arrested. Meanwhile, News18 reported, “The number of people who were kept hidden is being said to be 12. Everyone is said to be from Turkestan. People living in the neighbourhood objected when they came to know about them and started creating a ruckus. Local police were informed about the ruckus, after which, the police took these 12 people into their custody. Police are conducting raids in the area (translated).”", "ANI’s Bihar bureau chief Mukesh Singh also tweeted the video and questioned Bihar CM Nitish Kumar, “At lane no. 74 of Patna’s Kurji area, 25-30 foreign nationals said to be from Iran and Italy, suddenly got down from 2-3 cars. The locals have informed the police and some of them were taken for interrogation. But why this disaster?”.", "#पटना के कुर्जी इलाके के 74 नंबर गली में अचानक से 2-3 गाड़ी में 25 से 30 की संख्या में विदेशी नागरिक जो जो की इटली और ईरान से कहा जा रहा है अचानक पहुंच गया है। स्थानीय लोगों ने पुलिस को सूचना दी है और पुलिस कुछ लोगो को जांच के लिए ले गई है।", "लेकिन ये अनर्थ क्यों ?@NitishKumar pic.twitter.com/aq7zmRDorQ", "— Mukesh Singh@ANI (@Mukesh_Journo) March 23, 2020", "Right-wing website OpIndia went a step further and speculated that these people could be ‘Chinese Ughyur Muslims’. “Seeing their physique, the possibility, of them being Chinese Uyghur, cannot be denied. For time being, the police are interrogating them. (translated)”", "As stated above, the video was published with two different claims. One that these people were hiding inside the mosque and the other that they are from Iran and Italy. Accordingly, we have divided the fact-check into two different sub-sections.", "1. Were these people infected with coronavirus and were they hiding inside the mosque in fear of being tested for the same?", "Twitter handle Zaid (@pindropvolence) informed Alt News that there were rumours circulating about foreign nationals found at Kurji mosque. Zaid had tweeted medical reports of some of these individuals which showed the results of coronavirus tests as negative.", "On the basis of the above details, we found a March 23 post by a Facebook page ‘Digha Samachar‘. The post says, “Please don’t spread any kind of rumour about the foreign nationals in Kurji mosque. All of them have tested for COVID-19 and found to be negative.”", "We reached out to the admin of this Facebook page. He said, “The issue is related to a mosque located near gate 74 of Patna’s Kurji. These people had come from Krygyzstan in the first week of January for ‘jamaat’. Some people saw them in the mosque and quickly informed the [authorities]. The police came and took them to AIIMS. The reports of these people have come negative.”", "Alt News was independently able to access the reports. Each of the men has tested negative. You can see the results in the images posted below. It may be noted that out of the 12 people, ten were foreign nationals and two were local guides. Below are the medical reports of two of the tourists.", "We also spoke with Patna AIIMS which confirmed that these were foreign nationals of Kyrgyzstan who were tested negative for coronavirus.", "Ascertaining their country of origin", "We requested Digha Samachar’s Imad to share copies of the individuals’ passports and visas. The travel documents carried details about their arrival in India. Alt News is not attaching every person’s document in this article to protect their privacy. However, to ascertain whether these men were foreign nationals of Krygyzstan, or Iran/ Italy as claimed by the multiple media outlets, we are posting the copies of the visa and passport of two people while blurring their names and passport numbers. One of them arrived in India on December 19, 2019, and other, on January 10, 2020. All of these individuals had arrived in India before the first case of COVID-19 was reported in the country on January 30, 2020.", "There were also two local guides with these foreign nationals. We spoke to one of them, Munawar Iqbal. “We had reached the Kurji mosque on the same day. ‘Jamaats’ have been coming to the mosque, but this [ruckus] has never happened before, why now? Because there is a fear of the disease that’s why? The whole neighbourhood had gathered at one spot. When the police came, they asked us what is the problem. We said we have no issues, a jamaat has come. Police were given this incorrect information that a jamaat has gathered here from last 2-4 days and one of our fellow travellers died due to coronavirus whom we would bury later. Later, the police asked every one of us to move out. At the time, when we were getting out of the mosque, some people who were standing outside made inappropriate remarks and filmed videos of the incident. It was later made viral by someone falsely claiming that people from Iran and Italy found at the mosque. We all were taken to Patna AIIMS. There we were tested for coronavirus and by the grace of God, the reports were negative.” Tablighi Jamaat is the outreach society to preach Islam.", "Iqbal also informed, “They have come to India on a tourist visa and not as a group for the Tablighi Jamaat. Everyone has their own individual visas. They have come in pairs of two and three people. All of them don’t come together. For instance, when a jamaat from here went to Malaysia, they did the same. Eight people went separately and not in a group. Three jamaats had come to Patna. One from Krygyzstan, one from Malaysia which is working in Buxar right now and one more from Indonesia. Verification of all these three jamaats has [also] been done.”", "We did a video call to confirm that we were speaking to a person who was seen in the viral video. He is highlighted in the image below.", "Alt News reached out to SHO Manoj Kumar Singh of Digha police station. He rubbished the claims and reiterated that the individuals are not from Iran or Italy but Krygyzstan. “This is fake news,” said the SHO and informed that they had jamaat going on in the area. “These men preach information about Islam and have come on tourist visas. They had come for a jamaat at the mosque,” said the policeman, adding the group was in Patna since March 6.", "A section of the media misreported that people from the Muslim community were hiding inside a mosque in Bihar during coronavirus pandemic. These outlets even reported that these men were foreign nationals from Iran, Italy and China. However, they were from Krygyzstan and had arrived in India before the first coronavirus case was reported in the country. In all likelihood, Iran, Italy and China were used to promote the misinformation owing to a large number of COVID-19 cases in these countries.", "A YouTube search with keywords, “Patna Mosque Foreigners” reveals that the same video has been uploaded by several channels with the identical false claim. Some went a step further and called the incident ‘Corona Jihad’.", "Note: The number of positive cases of the novel coronavirus in India exceeds 900. This has caused the government to impose a complete restriction on movement apart from essential services. Globally, more than 6 lakh confirmed cases and over 28,000 deaths have been reported. There is a growing sense of panic among citizens, causing them to fall for a variety of online misinformation – misleading images and videos rousing fear or medical misinformation promoting pseudoscience and invalid treatments. While your intentions may be pure, misinformation, spread especially during a global pandemic, can take lives. We request our readers to practice caution and not forward unverified messages on WhatsApp and other social media platforms.", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]