["About this rating", "Hand sanitizers generally expire after two to three years of use and lose their effectiveness.", "However, if the bottle is never opened and remains sealed, the alcohol inside would not have been exposed to air, which reduces effectiveness. Thus, the sanitizer may still be effective.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Hand sanitizers were flying off grocery store shelves in early 2020 amid the COVID-19 coronavirus disease pandemic, leading to shortages around the United States. While washing hands thoroughly and frequently with soap is the most highly recommended method of preventing the spread of the virus, many people were turning to hand sanitizers.", "We received questions about the effectiveness of sanitizers after their expiration date from people who were concerned about using old sanitizer they found in their storage. Some questioned whether hand sanitizers even needed an expiration date, and if the alcohol in them could really \"expire.\"", "The answer is somewhat complicated. According the U.S. Food and Drug Administration (FDA), over-the-counter drugs must list an expiration date unless data show they are stable for more than three years. However, the FDA \"does not have information on the stability or effectiveness of drug products past their expiration date.\"", "Hand sanitizer needs to have 60% to 95% alcohol to be effective at killing germs, according to the Centers for Disease Control and Prevention (CDC). Hand sanitizers without alcohol are not as effective for most germs, and in most cases, they reduce the number of germs but do not kill them.", "Hand sanitizers with alcohol generally take two to three years to expire, and because the FDA regulates them, they are required by law to have an expiration date on their packaging.", "According to Insider, the alcohol evaporates quickly when exposed to air. So, when someone pops open the bottle of sanitizer, the alcohol content will gradually decrease over time, since most closed containers are not airtight. As a result, the sanitizer becomes less effective over time. According to Healthline:", "The manufacturer estimates how long it’ll take for the percentage of the active ingredient to drop below 90% of the percentage stated on the label. That time estimate becomes the expiration date.", "However, sealed bottles of sanitizer will maintain relatively more alcohol content after their expiration date, especially if they have not yet been exposed to air. According to Insider:", "If a bottle hasn't been opened, less of the alcohol will have evaporated, so a freshly-opened bottle of hand-sanitizer that is past its expiration date will likely be more effective than a bottle that is expired and has already been opened.", "That said, if expired hand sanitizer is your only option, and you have no access to soap and water, use it. Alex Berezow, microbiologist and vice president of scientific communications at the American Council on Science and Health, said in an interview with Insider, \"Some alcohol is better than nothing.\"", "Hand sanitizers should not be prioritized over hand-washing with soap, according to the CDC, because they do not eliminate all types of germs:", "Soap and water are more effective than hand sanitizers at removing certain kinds of germs, like Cryptosporidium, norovirus, and Clostridium difficile. Although alcohol-based hand sanitizers can inactivate many types of microbes very effectively when used correctly, people may not use a large enough volume of the sanitizers, or may wipe it off before it has dried.", "Thus, based on guidance from the CDC and experts, hand sanitizers should be used as a secondary option to hand-washing, and are less effective at killing germs after they've been opened and their expiration date has passed. The alcohol content in sealed containers, however, possibly remains almost the same after the expiration date because it has not been exposed to air. We therefore rate the overall truth of this claim as \"Mixture.\"", "Burch, Kelly.  \"Hand Sanitizer Does Expire — Here's Whether It's Still Worth Using.\"\r\n   Insider.  15 April 2020.", "Centers for Disease Control and Prevention.   \"Show Me the Science – When & How to Use Hand Sanitizer in Community Settings.\"\r\n   3 March 2020.", "Frothingham, Scott.  \"Can I Safely Use Expired Hand Sanitizer?\"\r\n   Healthline.  16 April 2020.", "Kavilanz, Parija and Yurkevich, Vanessa.  \"A Plan to Ease the Hand Sanitizer Shortage Could Go Bust.\"\r\n    CNN.  1 May 2020.", "U.S. Food & Drug Administration.  \"Q&A for Consumers: Hand Sanitizers and COVID-19.\"\r\n   13 April 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]