["By Saranac Hale Spencer", "Posted on December 8, 2017", "Q: Did Kevin Bacon say that “we are blessed to have Donald Trump as our president”?", "A: No. Several quotes supporting Trump have been falsely attributed to the actor.", "A collection of quotes praising President Donald Trump has been wrongly attributed to the actor Kevin Bacon and spread widely online.", "Several dubious websites have published them in a false story with the headline: “Kevin Bacon: ‘We Are Blessed To Have Donald Trump As Our President, He Is The Only One Who Can…’” It has been shared more than 20,000 times on Facebook, and users of the social media site rightly flagged it as being potentially false.", "None of the quotes listed in the story was actually uttered by Bacon, who contributed to Hillary Clinton’s campaign when she ran against Trump in the 2016 presidential election.", "On Dec. 4, Bacon said in a tweet that he doesn’t agree with any of Trump’s policies and doesn’t admire anything in the president’s character.", "And just to be clear to those of you read or believed this original blog. There’s nothing about this presidents policy’s that I agree with. And nothing about his character that I admire. https://t.co/dq10K6ZMh9", "— Kevin Bacon (@kevinbacon) December 4, 2017", "The false story claims that Bacon lauded Trump on a recent episode of ABC’s “This Week with George Stephanopoulos.” But he hasn’t been a guest on that show since 2007.", "It also misattributes quotes to Bacon that are similar to those actually said by other public figures — most of them Trump supporters.", "On Nov. 26, South Carolina Sen. Tim Scott was on “This Week” and answered a question about whether Trump unfairly singles out minorities for criticism. He said: “He attacks anyone he perceives or believes is attacking him or the country, right or wrong.”", "The false story claims that Bacon had said something similar: “I think he attacks anyone he perceives or believes is attacking him or the country.”", "The actor also supposedly said: “He should be given the Medal of Freedom for talking his mind in such a bold, honest, and straightforward manner.”", "But, in reality, that’s almost exactly what Ted Nugent wrote in a 2015 column defending Trump against establishment Republicans shortly after Trump announced his run for the presidency. Nugent wrote: “Donald Trump should be given the Medal of Freedom for speaking his mind in such a bold, honest and straight-forward manner.”", "Then, the false story has a reworded version of something boxing champion Mike Tyson said in 2015. The story claims that Bacon said: “How about we have a go at something new. How about we run America like a business, where no colors matter. Whoever can carry out the activity, lands the position.”", "This is what Tyson actually said: “Let’s try something new. Let’s run America like a business, where no colors matter. Whoever can do the job, gets the job.”", "Lastly, the made-up story claims that Bacon said: “He has no speechwriters, no editing, no nothing. You just have to like the guy,” and, “Trump is not a politician. He does not need your money, and he will speak his mind, God damn it, whether you like it or not.”", "But it was Gene Simmons, the bassist for KISS, who said almost the exact same thing to Rolling Stone in 2016. Simmons also told the magazine that he wasn’t necessarily supportive of Trump’s candidacy.", "“He has no speechwriters, no editing, no nothing,” Simmons said. (Trump did have speech writers during his 2016 campaign, though.)", "Simmons also said, “Trump is not a politician. He does not need your money, and he will speak his mind, God damn it, whether you like it or not.”", "An identical story also has been published on a website called Tomi Lahren NEWS. It attributes all of the same quotes to actor Gary Busey, who did endorse Trump. That site uses the image of conservative commentator Tomi Lahren without actually being affiliated with her.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to help identify and label viral fake news stories flagged by readers on the social media network.", "“Kevin Bacon: ‘We Are Blessed To Have Donald Trump As Our President, He Is The Only One Who Can…’” TheConservativeOnline. 3 Dec 2017.", "Federal Election Commission. “Hillary for America.” Itemized receipts. 11 Jul 2016.", "Scott, Tim. “This Week.” Segment starts at about 10:50. 26 Nov 2017.", "Nugent, Ted. “Give Trump The Medal of Freedom.” WND. 8 Jul 2015.", "Gebreyes, Rahel. “Mike Tyson Just Endorsed Donald Trump.” Huffpost. 26 Oct 2015.", "Grow, Kory. “Gene Simmons on Donald Trump: ‘He’s Good for the Political System.’” Rolling Stone. 30 Mar 2016.", "Goldmacher, Shane. “Trump taps aide Stephen Miller to write inaugural address.” Politico. 26 Dec 2016.", "“Actor Gary Busey Says: ‘We Are Blessed To Have Donald Trump As Our President, Trump Is Smart And Powerful He Is The Only One Who Can…’ Do You Support Gary Busey?” Tomi Lahren NEWS. 4 Dec 2017.", "Axelrod, Joshua. “Gary Busey endorses Donald Trump for president.” Washington Examiner. 15 Sep 2015.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]