["“Breaking News: Trump Rejects New Arms Deal with Nigeria,” reads the headline on a post shared more than 1,000 times.", "Showing a picture of Trump and Nigerian President Muhammadu Buhari, it claims that the “United States GOVERNMENT has OFFICIALLY declared NIGERIA a Terrorist and unstable nation and vowed never to sell weapons to them for violation of human right against it citizens (sic)”.", "The post has also been shared here, here and here, while a different picture with the same claim was shared here.", "The United States has never declared Nigeria a terrorist nation, according to its list of state sponsors of terrorism, which is updated from time to time.  The list currently includes North Korea, Iran, Sudan and Syria.", "However, the US recently issued a travel advisory urging its citizens to avoid some regions in Nigeria “due to crime, terrorism, civil unrest, kidnapping, and maritime crime”.", "But this does not mean Nigeria has been declared a terrorist nation", "As reported by AFP, the US government under Obama refused to sell arms to Nigeria to fight Boko Haram terrorists, citing human rights abuses by the Nigerian army as a reason. This moratorium prompted complaints from former Nigerian president Goodluck Jonathan and his successor Muhammadu Buhari.", "Jonathan had said the US refusal to sell arms made fighting the war against Boko Haram “very difficult”, while Buhari remarked that the decision had aided the terrorist outfit.", "However, Trump changed all of that when he agreed in 2018 to sell arms and fighter jets to Nigeria to fight Boko Haram.", "“We’re getting them approved,” Trump told Buhari when they met that year. “Part of the problem is you weren't allowed to buy helicopters in our country and now you are; I worked that out.”", "Nigeria paid $496 million to the US for the purchase of fighter jets, which are expected to be delivered this year. At no time did Trump reject the deal, as Obama did.", "A reverse image search shows the picture used in the misleading posts is an Associated Press photo taken at the White House when Buhari visited Trump in Washington DC in April 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]