["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A Facebook post says a quote from Roman public speaker and statesman Cicero amounts to \"a two thousand Year Old warning about TRUMP.\"", "The quote reads:", "\"A nation can survive its fools, and even the ambitious. But it cannot survive treason from within. For the traitor appears not a traitor – He speaks in the accents familiar to his victims, and he appeals to the baseness that lies deep in the hearts of all men. He rots the soul of a nation – he works secretly and unknown in the night to undermine the pillars of a city – he infects the body politic so that it can no longer resist. A murderer is less to be feared.\"", "The words, with some slightly different iterations, have been widely attributed to Cicero across the internet for some time, but we could find no evidence that he actually said or wrote it. (Additionally, he died in 43 B.C., a year before the meme claims he said the quote.)", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We traced the quote down to a 1965 fictional novel by Taylor Caldwell called \"A Pillar of Iron.\" On page 661 of the book, it attributes the passage to a speech Cicero made in the Roman Senate in 58 B.C. as \"Recorded by Sallust.\"", "While the novel often includes recorded speeches and letters of Cicero, it is a work of fiction, and the passage could not be located in online archives or compiled works of Cicero’s writings and addresses.", "Catherine Steel, professor of classics at the University of Glasgow, told PolitiFact she has not come across this quote in any of Cicero’s work.", "\"I'm not aware that this is translation of any work of Cicero,\" Steel wrote in an email. \"The idea of an internal threat does surface in his speeches against Catiline from 63 B.C., particularly e.g. 2.11, but there aren't any close parallels in terms of language.\"", "Besides the quote appearing in a 1965 fictional novel, no official documentation of Cicero’s extensive writings or speeches includes anything close to the passage.", "We rate this False.", "Facebook post, April 29, 2019", "Britannica, Marcus Tullius Cicero, Accessed May 2, 2019", "History Today, Cicero and the Power of Rhetoric, March 3, 2016", "A Pillar of Iron, 1965 novel by Taylor Caldwell", "LibertyFund.org, works and writings of Marcus Tullius Cicero, Accessed May 2, 2019", "Cicero: Selected Works, translated by Michael Grant; Accessed May 2, 2019", "Cicero: Selected Political Speeches, translated by Michael Grant; Accessed May 2, 2019", "Cicero: The Life and Times of Rome's Greatest Politician by Anthony Everitt May 6, 2003", "Email interview, Catherine Steel professor of classics at the University of Glasgow, May 3, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]