["About this rating", "A video supposedly showing a fish with a human face has racked up millions of views as it circulated on social media:", "This is not a genuine video of a fish with a human face. First and foremost, take a good look at it. The alleged aquatic life form doesn't look like a fish, it doesn't move like a fish, and while the ocean is certainly filled with some bizarre-looking creatures, we've yet to come across any fish with faces resembling the children's character of Thomas the Tank Engine.", "Curious viewers may have also examined the source of this footage. While the video has been posted in a number of different languages and on several different platforms, we've yet to encounter a single posting that included specific details about the alleged discovery. If this video were real (meaning someone actually caught a fish with a human face), we'd see news reports about the discovery. Instead, the video simply shows the work of computer-generated imagery.", "The video appears to have first gone viral on the social media service WeChat circa April 2019. Early versions of this footage were simply captioned \"怪异的鱼?\" or \"Weird Fish.\" As this video continued on its way across the internet, subsequent details were added. Some shared it as if it showed an \"alien fish.\" Others claimed that it was the result of human / fish crossbreeding, nuclear fallout, or the reincarnation of an unknown person. The most common claim, however, was simply that this \"fish with a human face (was) caught in Japan.\"", "The fact that the story behind this footage has repeatedly been altered without any new information coming to light should raise a few more red flags.", "The Chinese-language website MyGoPen talked to an animator shortly after this video first went viral to find out if the footage was authentic. The animator (who was not named) noted that the light and texture of the face make it clear that it is a 3D animation, not a real human-faced fish:", "The light reflection from the object and the texture material on the surface of the face are 3D computer animation, not the real situation.", "Although we have been unable to locate the source of this footage, we're certain this video doesn't show a real-world fish with a human face.", "Yeh, Charles.  【假影片】人臉魚在LINE瘋傳？湖邊驚現怪魚是假的！電腦動畫\r\n    MyGoPen.   24 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]