["“People are going door to door handing out masks. They say it’s a new initiative from local government. They ask you to please put it on to see if it fits. It’s doused with chemicals which knocks you out cold. Then they rob you!!” claim the posts. The warning started circulating in late March 2020.", "One April 5, 2020 post from a user whose profile says she is based in the US state of Georgia was shared more than 41,000 times. The claim also circulated on Instagram here, here and here.", "In April and May 2020, a photo with a version of the claim on a flyer was also shared more than 14,000 times from a user in Tampa, Florida, 5,900 times from a user in the state of New York, and more than 500 times from a Saskatoon, Canada user.", "Another view of the poster shows that it appears to have been put up by the board of directors at the Townhomes of Westbay Cove, a community in Tampa, Florida.", "However, there is no evidence of a rash of thefts taking place after people accepted masks from strangers.", "“I haven’t heard of any of that,” Jamel Laneè, a spokeswoman for the Tampa Police Department said.", "Julie Clark, a public affairs official for the Saskatoon Police Service in Canada, said by email: “We have not heard of this scam in Saskatoon. Investigators have not received any reports of this.”", "Colleen Book, spokeswoman for the Saskatchewan Ministry of Health, added: “Government of Saskatchewan is not handing out masks through any kind of public program and we are not sending representatives door-to-door at this time.”", "Similarly, Carlos Campos of the Atlanta Police Department said via email that he was not aware of “any crime” like the one described in the post happening in the capital city of Georgia.", "AFP Fact Check also debunked the claim after it circulated in Dutch.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]