["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Republicans have high hopes that they will topple Democratic Sen. Mark Pryor of Arkansas in 2014. The campaign of U.S. Rep. Tom Cotton, R-Ark., poses a real threat in a state that has gone Republican by ever wider margins in the last four presidential elections. In 2012, President Barack Obama got just 37 percent of the vote.", "Cotton’s ads aim to tie Pryor to Obama, and the latest one titled \"Good for the Gander\" focuses on Obamacare. The tone is jaunty with geese popping up on the screen, but the message is sharp. Here’s the text:", "What’s good for the goose ought to be good for the gander. But not in Washington.", "Mark Pryor cast the deciding vote to make you live under Obamacare. But Pryor votes himself and everyone in Congress special subsidies so they’re protected from Obamacare. Exceptions and special subsidies for Mark Pryor. Higher insurance premiums for you.", "Mark Pryor. Voting with Obama. Voting against Arkansans. Like you.", "The charge that this or that Democrat cast the deciding vote for the Affordable Care Act has shown up before. In June, a conservative group leveled it at Sen. Bill Nelson, D-Fla, (PolitiFact Florida rated that Mostly False), and in 2012, a Republican challenger made the same claim about Sen. Sherrod Brown, D-Ohio (PolitiFact Ohio rated that False).", "The reality is that if any Democratic senator deserves the distinction of clearing the way for the health reform law, it is Sen. Ben Nelson of Nebraska. As was widely reported at the time, Nelson delivered the 60th vote needed to send the bill to the floor for a vote.", "We spoke with Cotton’s staff and they didn’t actually say that Pryor played a unique role. They hold Pryor accountable because, \"All of the votes were critical.\" But Pryor’s support for the Affordable Care Act was known well before the final vote.", "However, in this fact check, we wanted to look at the weightier claim that Pryor voted to give everyone in Congress a special subsidy to protect them from Obamacare.", "Not so special", "The \"special subsidy\" has its roots in a wrinkle in the Affordable Care Act. The law has a provision, pushed by Republicans, that requires members of Congress and their staff to buy health coverage through the government marketplaces that opened for business on Oct. 1. This clause treats lawmakers and congressional workers unlike any other workers in the country.", "At least three-quarters of Americans get insurance through their jobs, with employers paying part of the insurance premium. For the most part, Obamacare doesn’t touch that relationship. The clear exception is lawmakers and congressional workers. They must drop their current coverage and find something equivalent from insurance companies participating in the Marketplaces.", "But within the marketplaces, there is no explicit provision for the federal government to continue to pay the share of the premiums that it had before. The full cost would fall on the congressional workers with a price tag of thousands of dollars for each person.", "Even the National Review, the conservative magazine that is none too fond of Obamacare, recently wrote that the provision treats lawmakers and staff \"particularly badly...People who happen to be paid by the federal treasury don’t deserve to have the entire value of their existing coverage stripped away, as almost no Americans will experience.\"", "As a fix, the Office of Personnel Management, the agency in charge of federal worker benefits, ruled that it would take the same money that it would have spent on the government’s old health insurance and spend it on whatever lawmakers and their staffs purchased on the Obamacare marketplaces. In other words, it would do what every other employer does.", "Continuing that cost-sharing is the \"special subsidy\" the Cotton ad refers to.", "What Pryor voted for", "Republicans in the House and Senate proposed language that would block the federal government from splitting the cost of the premiums with congressional workers.The measure passed in the House but died in the Senate on Sept. 30 on a straight party-line vote. Pryor voted with all the other Democrats to table the House legislation.", "Cotton’s office told us that by blocking the Republican measure, Pryor was allowing Congress to do something that other employers can’t do until 2017. They cited a provision in Obamacare.", "\"Sec. 1312 (f)(2)(B)(i) specifically prohibits large businesses from doing so until 2017 and does not provide an exception for anyone to do so before that date,\" Cotton’s staff said. \"Following OPM's ruling, only members of Congress and their staff can receive an employer contribution from a large business on the small business exchange in 2014.\"", "That interpretation is questionable. The law says, \"Beginning in 2017, each state may allow issuers of health insurance coverage in the large group market in the State to offer qualified health plans in such market through an exchange.\"", "Timothy Jost, professor of law at Washington and Lee School of Law and a national expert on the text of the health care law, said Cotton’s office misreads the law.", "\"The provision doesn’t say large employers can't contribute,\" Jost said. \"It says large group insurance through the exchange won’t be offered to them.\"", "Another specialist in health care law, Mark Hall at the Wake Forest University School of Law, is equally emphatic.", "\"This provision does not prevent the Office of Personnel Management or the federal government contributing to government worker’s premiums on the exchange prior to 2017,\" Hall said. \"And doing so does not give them a special exception beyond what the ACA allows.\"", "Jost said in one place, the Affordable Care Act tells Congress to offer members of Congress and staffers insurance through the marketplace, and in another, it blocks states from offering large group insurance plans through the marketplaces for several years.", "\"The two are completely unrelated,\" Jost said.", "Our ruling", "Cotton said Pryor voted for \"special subsidies\" for lawmakers and staff in congress \"so they’re protected from Obamacare.\" The subsidy referred to is the government continuing to share the cost of insurance premiums as is standard practice in every establishment that offers insurance to its workers. There is nothing special about that. The only thing special about Obamacare and Congress is that the law treated Congress and its workers differently than any other group of workers.", "Cotton relies on an interpretation of the law that independent experts say is wrong.", "The assertion falls wide of the facts, and we rate this claim False.", "Tom Cotton for Senate, \"Good for the Gander,\" Oct. 7, 2013", "U.S. Congress, The Patient Protection and Affordable Care Act, Jan. 5, 2010", "PolitiFact, GOP Rep. Jeb Hensarling assails \"sweetheart\" deal for lawmakers, staff under Obamacare, Oct. 1, 2013", "PolitiFact Ohio, Josh Mandel says Sherrod Brown cast the deciding vote for a government takeover of health care, May 30, 2012", "PolitiFact Florida, Was Florida's Bill Nelson \"the deciding vote\" on the health care law?, June 14, 2013", "Boston Globe, \"Democrats grab final vote for health bill,\" Dec. 20, 2009", "New York Times, \"Democrats clinch deal for deciding vote on health bill,\" Dec. 10, 2009", "Dictionary.com, Definition of ‘deciding’", "Washington Post, Tom Cotton sends Mary Pryor’s outlook from bad to worse, July 31, 2013", "USElectionAtlas.org, Presidential election results 2000, 2004, 2008, 2012", "U.S. Senate, Roll call vote 211,Sept. 30, 2013", "Congressional Record, Continuing Appropriations - Senate, Sept. 30, 2013", "Email interview with Caroline Rabbit, communications director, Rep. Tom Cotton, Oct. 8, 2013", "Interview with Timothy Jost, professor of law, Washington and Lee School of Law, Oct. 8, 2013", "Email interview with Mark Hall, professor of law and public health, Wake Forest University School of Law, Oct. 8, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]