["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrat Russ Feingold is a former U.S. senator from Wisconsin. (Associated Press)", "Social Security and Medicare reform could be front and center in 2017.", "Key funds for Social Security are likely to be depleted by 2034, according to a June 2016 report, and Medicare’s hospital insurance trust fund may be insolvent by 2028.", "Meanwhile, Republicans in Congress — notably House Speaker Paul Ryan (R-Janesville) — have their own plans, which could largely privatize Medicare.", "In light of those challenges and policy differences, we returned to a statement about Social Security that struck us during the 2016 election.", "It’s from Russ Feingold, who said in an October television interview during his U.S. Senate race that the idea for Social Security \"was basically invented up on Bascom Hill, my alma mater here; that's where Franklin Roosevelt got the idea.\"", "Is Feingold correct?", "Edwin Witte, a graduate of UW-Madison and economics professor there from 1933-1957. Roosevelt appointed Witte chairman of the Presidential Committee on Economic Security, which essentially crafted the plan for Social Security in 1935.", "Arthur Altmeyer, a UW-Madison graduate and professor who also sat on the committee. Altmeyer later served on the federal Social Security Board and was the first Social Security commissioner. Roosevelt called Altmeyer \"Mr. Social Security,\" according to the Social Security Administration.", "UW-Madison professor John Commons, under whom Witte and Altmeyer studied. Commons was a labor economist at UW from 1904-1933 where he helped develop the state’s employee compensation program and civil service law. He was known as the \"spiritual father of Social Security,\" according to the Wisconsin Historical Society.", "Wilbur Cohen, who served as a research assistant to Witte after graduating from UW-Madison in 1934. Cohen sat on the Committee on Public Administration of the Social Science Research Council and also advised the Social Security Board.", "Current UW-Madison professor Pamela Herd agreed that Wisconsinites tied to the university were key figures in the development of Social Security.", "\"There were a lot of people involved in the creation of this program, but some of the most important players were from Wisconsin,\" said Herd, an expert on Social Security.", "Our rating", "The Washington Post, \"Trump promised over and over to 'save' Medicare and Social Security. Will he?,\" Dec. 1, 2016", "CBS DFW, \"8 Donald Trump quotes on healthcare — 'Repeal it, replace it, get something great!',\" Sept. 14, 2015", "The New York Times, \"Donald Trump Says He May Keep Parts of Obama Health Care Act,\" Nov. 11, 2016", "The Wall Street Journal, \"Clinton vs. Trump: Sharpest Exchanges and Highlights From the Second Debate,\" Oct. 10, 2016", "The New York Times, \"Donald Trump Drops Threat of New Hillary Clinton Investigation,\" Nov. 22, 2016", "Wisconsin Public Television, \"Russ Feingold, U.S Senate candidate - full interview,\" Oct. 7, 2016", "PolitiFact, \"Sen. Ron Johnson claims Russ Feingold is a career politician,\" Feb. 4, 2016", "Social Security Administration, \"Research Note #8: The Special Role of the University of Wisconsin in the History of Social Security,\" last visited Dec. 6, 2016", "University of Wisconsin-Madison University Housing, \"Edwin E. Witte,\" last accessed Dec. 6, 2016", "Social Security Administration, \"Never A Finished Thing: A Brief Biography of Arthur Joseph Altmeyer--The Man FDR Called 'Mr. Social Security,'\" last accessed Dec. 6, 2016", "Wisconsin Historical Society, \"John R. Commons, 1862-1945,\" last accessed Dec. 6, 2016", "University of Wisconsin-Madison Robert M. La Follette School of Public Affairs, \"Pamela Herd,\" last accessed Dec. 6, 2016", "National Public Radio, \"Paul Ryan's Plan to Change Medicare Looks A Lot Like Obamacare,\" Nov. 26, 2016", "Social Security Administration, \"Fact Sheet: Social Security,\" last accessed Dec. 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]