["The image was published on Facebook here on August 25, 2020.", "A post’s Hindi caption translates to English as: “The country will not tolerate such disrespect. Facebook’s Ankhi Das made tri-colour cake and cut that. The media would have made it such a big issue if a Muslim would have done this.”", "Ankhi Das is Facebook’s public policy head for India, South and Central Asia. Das recently made headlines after the Wall Street Journal reported she allegedly pursued policies that were favourable to India’s ruling Bharatiya Janata Party ahead of the 2014 general election.", "The photos were also shared alongside the same claim on Facebook here, here, here and here; and on Twitter here, here, here and here.", "However, the claim is false.", "Reverse image and keyword searches on Google found that the photos in fact show the Indian Ambassador to Belarus, Sangeeta Bahadur, cutting a cake in celebration of India’s Independence Day on August 15, 2020.", "Bahadur posted photos of the ceremony at the Indian Embassy in the Belarusian capital of Minsk on her Facebook page here.", "The photos show an identical cake, the same flag-lined backdrop and Bahadur wearing the same saree.", "Below is a screenshot comparison showing the similarities in the photos in the misleading Facebook post (L) and Bahadur’s Facebook photos (R):", "The Indian Embassy in Minsk also published matching photos and videos from the ceremony on Facebook here and on Twitter here.", "An archived version of Bahadur's Facebook post also shows that it originally included three more photos of her cutting the cake. Below is a screenshot of the photos seen in the archived link:", "The photos appear to have been removed after social media users -- for example on Twitter here and here -- began accusing Bahadur of disrespecting the Indian flag.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]