["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Wisconsin Gov. Scott Walker promoted his budget-repair bill in February 2011 by saying it would balance the state budget and \"give government the tools to deal with this and future budget crises.\"\n\nOne tool was designed to sharply curtail the collective bargaining powers of most state and local government employees, and eliminate collective bargaining altogether for others. It was that part of the Republican governor’s bill that led Democratic state senators to hotfoot it to Illinois and protesters to stage daily demonstrations in Madison.\n\nWalker issued a number of statements touting the bill, including two entitled \"Collective bargaining is a fiscal issue.\" The second statement, issued Feb. 22, 2011, made this claim:\n\n\"In Milwaukee County alone, because the union collectively bargained for paid time off, 14 employees receive salary and benefits for doing union business. Of the 14, three are on full-time release for union business. Milwaukee County spent over $170,000 in salary alone for these employees to only participate in union activities such as collective bargaining.\"\n\nAnother Walker news release repeated the claim the next day and added: \"The budget-repair bill reforms would help counties, like Milwaukee County, save on these costs.\"\n\nThe dollar sign in Walker’s claim made us wonder:\n\nDid Milwaukee County pay employees over $170,000 not to do work for the county, but for their unions?\n\nWalker’s claim was made more than two months ago, but collective bargaining remains at the top of the state’s political agenda. The issue is part of efforts to recall state senators from office. And on June 6, 2011, the state Supreme Court is scheduled to hold a hearing about whether it should be the court to consider a legal challenge to Walker’s measure.\n\nWe asked the governor’s office what the $170,000 referred to, and were told Milwaukee County spent more than that amount in 2010 on salaries for county employees for doing union work.\n\nAs support, the governor’s office forwarded a report it received from Milwaukee County payroll manager Sue Drummond the day before it issued the news release that made the $170,000 claim. The report listed county employees who received pay in 2010 for time they spent carrying out union duties.\n\nFor several decades, union contracts agreed upon by Milwaukee County provide for certain employees to be paid when they are doing union activities. The activities can include attending County Board meetings, representing a worker in a disciplinary hearing and participating in contract talks, among other things.\n\nIn this item, we’re not weighing in on the merits of the practice; we’re checking the accuracy of Walker’s claim on the cost to Milwaukee County. We’ll also check a few other places, including the city of Milwaukee and the state, for some added context.\n\nThe report forwarded to us by the governor’s office did not tally how much in salaries the county paid to employees doing union work. But an analysis provided by the governor’s office said the county in 2010 paid $170,593 in salaries to county employees for doing union work.\n\nWe then asked the county directly to provide figures. A report issued to us May 6, 2011 from county controller Scott Manske showed that in 2010:", "Zunker, who heads Milwaukee County’s largest union with some 1,100 members, said the system for paying some county employees to do union work is a benefit county employees have earned as part of the give-and-take that occurs in bargaining contracts with the county.\n\nChris Pegelow, a former Milwaukee County employee who served as president of the same union, said putting county employees in union positions full time arguably saves the county money and time in settling workplace disputes that might otherwise escalate into legal cases. Because they are full-time union presidents, those employees are more accessible to county officials and more knowledgeable about workplace issues, he said. The system is also less disruptive than if the union presidents worked full-time in county positions and had to be released from those duties each time a workplace issue arose, he said.\n\nThe City of Milwaukee spent more than the county in 2010 on employees doing union work. The city spent $291,253 on salaries and $215,419 in benefits for seven employees who hold full-time union positions, said city labor relations officer Joe Alvarado. The figures, which are set by contract between the city and the unions, will be the same for 2011, he said.\n\nThe city pays full benefits to the president, vice president and secretary/treasurer of the police union, plus half the salary of the vice president and secretary/treasurer, Alvarado said.\n\nFor the other four employees who do union work full-time, the city pays the full salary and benefits, Alvarado said  The employees include the heads of the unions that represent firefighters, sanitation workers, the Department of Public Works and other departments, and truck drivers and service equipment workers.\n\nAlvarado said the system has been in place since the Milwaukee Police Association negotiated for one such position some 40 years ago.\n\nMeanwhile, the state does not pay any employees to do only union work, said Carla Vigue, spokeswoman for the state Department of Administration. But it does allow employees to conduct union activities at various times while they’re on the clock.\n\nIn 2010, according to a summary provided by Vigue, employees representing 16 unions spent 30,783 work hours on union activities. Those hours, which Vigue said were logged by 466 employees, amounted to $705,731 in salaries, according to the summary.\n\nIt remains to be seen how many government employees would continue to be paid for doing union business if Walker’s bill, which was adopted into law by the Legislature, survives court challenges. Unions representing police officers, firefighters and state troopers could continue to collectively bargain for such arrangements, since they are exempted from Walker’s bill.\n\nHowever, unions representing other public employees would be allowed to bargain only for base pay. That means it would be up to the government to decide whether to continue to pay some employees for doing union work, said Walker spokesman  Cullen Werwie.\n\nLet’s wrap up.\n\nGov. Walker said Milwaukee County spent more than $170,000 in 2010 on salaries for employees doing union activities. The actual tally, according to the county -- for three union presidents who did union work full-time and other employees who did occasional union work -- was $180,385. We rate Walker’s statement True.", "Gov. Scott Walker, \"Collective bargaining is a fiscal issue\" news release, Feb. 21, 2011\n\nGov. Scott Walker, \"Collective bargaining is a fiscal issue: Part 2\" news release, Feb. 22, 2011\n\nGov. Scott Walker, union pay report analysis, provided May 2, 2011\n\nGov. Scott Walker, \"Governor Walker’s budget-repair bill would save local governments over $700 million per year\" news release, Feb. 23, 2011\n\nPolitiFact Wisconsin, \"Wisconsin Gov. Scott Walker says Wisconsin is broke,\" March 3, 2011\n\nMilwaukee Journal Sentinel, \"Walker calls for cuts or big layoffs,\" Feb. 11, 2011\n\nMilwaukee Police Association website, Board page\n\nMilwaukee Professional Firefighters Local 215 website, Elected Officials page\n\nMilwaukee Area Labor Council AFL-CIO website, Local Unions page\n\nAFSCME District Council 48 website, Local 33 page\n\nAFSCME District Council 48 website, Local 423 page\n\nAFSCME District Council 48 website, Local 567 page\n\nAFSCME District Council 48 website, Local 594 page\n\nAFSCME District Council 48 website, Local 645 page\n\nAFSCME District Council 48 website, Local 882 page\n\nAFSCME District Council 48 website, Local 1654 page\n\nMilwaukee Deputy Sheriffs’ Association website, Executive Board page\n\nInterview and e-mail, Wisconsin Department of Administration spokeswoman Carla Vigue, May 4 and 5, 2011\n\nWisconsin Department of Administration, \"2010 summary of union activity with pay hours and dollars,\" provided May 4, 2011\n\nInterview and e-mail, City of Milwaukee labor relations officer Joe Alvarado, May 3, 4 and 6, 2011\n\nE-mail and phone interview, Gov. Scott Walker spokesman Cullen Werwie, May 3, 4 5 and 6, 2011\n\nInterview and e-mail interview, Milwaukee County Controller Scott Manske, May 4 and 6, 2011\n\nMilwaukee County, union pay report by controller Scott Manske, May 6, 2011\n\nMilwaukee County, union pay report by payroll manager Sue Drummond, Feb. 21, 2011\n\nInterview, AFSCME Local 882 president Kurt Zunker, May 5, 2011\n\nInterview, former AFSCME Local 882 president Chris Pegelow, May 5, 2011\n\nInterview, Milwaukee Police Association president Mike Crivello, May 6, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]