["UPDATE, 11:15 a.m., March 7, 2011: After this article was published, readers alerted us to President Obama's Aug. 31, 2010, trip to Fort Bliss in El Paso. According to a transcript of his remarks, Obama thanked the soldiers and talked about his upcoming address to the nation on Iraq and Afghanistan; he made no mention of the border situation or Mexico during his two-hour visit.", "Gov. Rick Perry told an interviewer Wednesday that he’d dearly love to be part of Thursday’s White House meeting between President Barack Obama and Mexico President Felipe Calderon. Perry then told Greta Van Susteren of Fox News: \"You know, neither one of them have been on the border to see what's happening to the citizens of Mexico, and for that matter the citizens of Texas.\"", "For real?", "We asked Perry’s office for back-up information, simultaneously trying to reach Calderon’s press contact and the White House on whether and why each president has ventured to the border.", "An online search yielded news articles showing that both Calderon, sworn in as president in 2006, and Obama, president since early 2009, have been to the U.S.-Mexico border, though it appears Obama has traveled there just once, while he was seeking the Democratic nomination for president. As president, he went to Mexico City in 2009.", "At least three times in 2010, Calderon visited Ciudad Juarez, the city adjoining El Paso, in the wake of January 2010 slayings that drew international attention. The Mexican city had experienced more than 2,500 killings in 2009, according to a CNN dispatch, which also quoted Calderon saying there: \"I come mostly to listen... we're looking for solutions from Juarez because you are the ones living it.\"", "Also in 2010, Calderon visited Matamoros, across the border from Brownsville, and Piedras Negras, opposite Eagle Pass, in the wake of a hurricane. He also helped open an international bridge in Reynosa, near McAllen, at a cross-border event where Obama’s emissary was U.S. Trade Representative Ron Kirk, the former Dallas mayor.", "And Obama? In February 2008, according to a CBS News report, then-candidate Obama courted Brownsville voters. The report says he and state Rep. Eddie Lucio III briefly stood near the U.S. bank of the Rio Grande, looking across the border. According to the report, Obama joked: \"This is the first time that I've been this close here, in Texas. I've been in Mexico when I was in college and was going to school in Southern California. I can't entirely talk about it.\"", "Obama went to Mexico City in April 2009 as part of a swing through Latin America. An April 16, 2009 news article in the New York Times says Obama was the first American president since Bill Clinton to visit Mexico’s capital, where he hoped to shore up Calderon’s \"efforts to combat the rising tide of cross-border drug violence.\"", "This February, Homeland Security Secretary Janet Napolitano invited Republican and Democratic U.S. House leaders to join her at the Mexican border this spring, according to a Feb. 10 Politico news article.", "Republicans have urged Obama to visit the border.", "In March 2010, Texas U.S. Sens. Kay Bailey Hutchison and John Cornyn sent Obama a letter including an invitation to join them on a visit to the border region. \"Such a visit would draw national attention to a national priority,\" the letter says, \"and allow you to thank the federal and local officials who are doing heroic work to protect our communities.\"", "In September 2010, U.S. Sen. John McCain told a Fox News interviewer that he wanted Obama to visit the border. \"I’d love for the president to come and visit the border. Unfortunately, he hasn’t had time to do so,\" the Wall Street Journal quoted McCain saying.", "Next, we asked CBS News’ White House correspondent Mark Knoller to check his well-respected log of presidential trips. Knoller said by e-mail that as president, Obama has not made any U.S.-Mexico border stops. He said Obama’s predecessor, George W. Bush, delivered a speech on border security in El Paso in March 2002, also watching a demonstration of technology that detects contraband in border-crossing vehicles. Knoller said Bush also came to Tucson and El Paso in November 2005 and in May 2006 made a trip to Yuma to observe National Guard troops on the border.", "Finally, we asked political scientist David Shirk, director of the non-partisan Trans-Border Institute at San Diego University, how he’d appraise Perry’s claim. Shirk said Perry’s wrong about Calderon, but correct per Obama who, Shirk said, \"has not visited the border region since the start of his presidency to examine the circumstances that we’re facing here in communities like San Diego and El Paso, places where we are very close to the violence and there’s been a lot of discussion about the possible spillover effects.\"", "As for whether Obama is \"right for not visiting the border,\" that’s a separate question, Shirk said, adding that the answer depends on whether the \"situation and the (status) of border residents today (is) more important\" than other issues on the nation’s agenda.\n\nTo our inquiry about Obama’s border travels, White House spokesman Adam Abrams declined comment. We didn’t hear back from Perry and failed to connect with Calderon’s office.\n\nPerry’s statement appears to be accurate per Obama, but it’s unmoored regarding Calderon. We rate it Half True.", "Christian Science Monitor, news article, \"Mexico killings: President Calderón visits Juarez to tout new social programs,\" March 16, 2010 (accessed March 3, 2011)\n\nCNN, news post, \"Calderon to violence-plagued Juarez: 'We're looking for solutions'\", Feb. 11, 2010 (accessed March 3, 2011)\n\nThe Brownsville Herald, news article, \"Rio Grande rises against banks and levees,\" July 9, 2010 (accessed March 3, 2011)\n\nCBS News, news article,  \"Obama's Visit to the Border,\" Feb. 29, 2008 (accessed March 3, 2011)\n\nChristian Science Monitor, news article, \"Mexico killings: President Calderón visits Juarez to tout new social programs,\" March 16, 2010 (accessed March 3, 2011)\n\nCNN, news post, \"Calderon to violence-plagued Juarez: 'We're looking for solutions'\", Feb. 11, 2010 (accessed March 3, 2011)\n\nU.S. Sen. John Cornyn, press release, Texas Senators Hutchison, Cornyn request action from President Obama on escalation violence in Mexico, March 17, 2010\n\nE-mails (excerpted), Mark Knoller, White House correspondent, CBS News, responses to PolitiFact Texas, March 3, 2011\n\nFox News, news video, interview by Greta van Susteren, \"Uncut: Gov. Rick Perry On the Record, March 2, 2011\n\nInterview, David Shirk, political scientist, director, Trans-Border Institute, University of San Diego, March 3, 2011\n\nMetro Noticias de Tamaulipas, news article, \"Inaugura Felipe Calderón cruce Internacional Reynosa-Mission,\" Nov. 1, 2010 (accessed March 3, 2011)\n\nThe New York Times, news article, \"In Mexico, Obama Seeks Curbs on Arms Sales,\" April 16, 2009 (accessed March 3, 2011)\n\nPolitico, Janet Napolitano invites Hill leaders to Mexican border, Feb. 10, 2011", "Territorio de Coahuila y Texas, magazine news post, \"Visita el presidente Felipe Calderón un sector de Piedras Negras,\" July 12, 2010 (accessed March 3, 2011)\n\nWall Street Journal, news article, \"McCain Invites Obama to Visit U.S.-Mexico Border,\" Sept. 5, 2010 (accessed March 3, 2011)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]