["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "With the economy growing at 4.1 percent in the last quarter, the White House sees vindication of its policies ahead of the midterm elections.", "Larry Kudlow, top economic adviser to President Donald Trump, pressed a point about the Republican tax cuts in the closing seconds of a CBS interview Sunday.", "\"Even the CBO numbers show now that the entire $1.5 trillion tax cut is virtually paid for by higher revenues and better nominal GDP,\" Kudlow told Face the Nation host Margaret Brennan on July 29. \"These are all good things, Margaret.\"", "In light of the Congressional Budget Office’s forecast that deficits will continue to grow, Kudlow’s statement that CBO now projects that the tax cuts will pay for themselves bears a closer look.", "When the CBO looked at the impacts of the tax cut law, it found that it increased the deficit by a total of $1.8 trillion between 2018 and 2028. That included the economic growth effects of the tax cuts.", "The CBO’s latest long-range forecast predicted lower revenues than it had before passage of the tax cut law. In the 2018-28 period, the government would collect $884 billion less than the CBO previously forecast.", "Economists, including a member of CBO’s Board of Economic Advisers, could not identify the source in CBO reports that supported Kudlow’s claim.", "The central argument for tax cuts is that with lower rates, companies will invest more in plants and equipment, which will make workers more productive. And individuals will have more incentive to work because Uncle Sam will get a smaller slice of their paychecks.", "A growing economy will, the argument goes, make up for the money the government would have collected through higher tax rates.", "It would be a big deal if the CBO agreed with this argument. The agency is the nonpartisan budget arm of Congress.", "The problem for Kudlow is that the CBO hasn’t.", "\"I am quite familiar with the CBO analysis and have no clue what Larry Kudlow is talking about,\" said Alan Auerbach, an economist at the University of California Berkeley and a member of CBO's board of economic advisers.", "The CBO pointed to its April 2018 report. It devoted an appendix to the tax law alone. In this key table below, the section on \"macroeconomic feedback\" is where the CBO puts its estimate of how higher economic growth from the tax cuts is expected to increase revenues.", "Tax analyst Nicole Kaeding at the conservative Tax Foundation said Kudlow had exaggerated. Citing the table, she said the CBO expects the tax cuts to reduce deficits by a total of $461 billion over 11 years.", "\"This is well below the $1.5 trillion in static cost of the Tax Cuts and Jobs Act,\" Kaeding said.", "The foundation ran its own analysis that assumed the economic impact would be greater than the CBO predicted. It still came up short.", "\"We estimated a net cost of approximately $450 billion,\" Kaeding said.", "Overall, the CBO estimated that the tax cuts would add $1.8 trillion to the nation’s debt.", "Harvard University economist Greg Mankiw, former chairman of the President’s Council of Economic Advisers under George W. Bush, told us, \"I do not know what numbers Larry (Kudlow) is referring to.\"", "\"A reasonable rule of thumb, in my judgment, is that about one-third of the cost of tax cuts is recouped via faster economic growth,\" Mankiw told PolitiFact in 2017.", "That is pretty much what the CBO estimated.", "It’s not as though the tax cuts don’t juice the economy.", "The CBO said they would boost growth by 0.3 percent in 2018 and by 2022,  the level of GDP would be a full 1 percent higher than it would have been. The trouble is, the growth alone doesn’t close the revenue gap, and with deficits higher than they would have been, interest rates would also edge up as government borrowing rose.", "Higher interest rates means Washington will pay more for its borrowed money. That further undercuts the ability of tax cuts to pay for themselves.", "We reached out to the White House and did not hear back.", "Kudlow said the CBO agreed that \"the entire $1.5 trillion tax cut is virtually paid for by higher revenues and better nominal GDP.\" The CBO reports do not reach that conclusion.", "The CBO pointed to its analysis showing the growth impact of the tax cuts reducing deficits by a bit less than a third of the cost of the tax cuts themselves.", "Economists who know the CBO’s work told us the congressional budget forecasters did not say what Kudlow asserted.", "We rate this claim False.", "CBS News, Face the Nation, July 29, 2018", "Congressional Budget Office, The Budget and Economic Outlook: 2018 to 2028, April 9, 2018", "Congressional Budget Office, The 2018 Long-Term Budget Outlook, June 26, 2018", "Tax Foundation, Preliminary Details and Analysis of the Senate’s 2017 Tax Cuts and Jobs Act, Nov. 10, 2017", "PunditFact, Do tax cuts pay for themselves? Evidence is thin, April 28, 2017", "Email interview, Nicole Kaeding, director of special projects, Tax Foundation, July 30, 2018", "Email interview, Greg Mankiw, economist, Harvard University, July 30, 2018", "Email interview, Alan Auerback, economist, University of California Berkeley, July 30, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]