["By Angelo Fichera", "Posted on January 28, 2019", "There is no evidence that “18 million illegal immigrants” received “government checks” during the government shutdown this month, contrary to Facebook posts.", "Immigrants in the country illegally are not eligible for most federal benefits.", "But viral posts on social media distort that fact by claiming millions of unauthorized immigrants have been receiving money from the government, even amid the partial government shutdown that caused hundreds of thousands of federal workers to go without pay.", "“18 Million Illegal Immigrants got their government checks this month…” the Facebook posts read, “Federal workers … let that sink in.”", "That vague claim offers no support for its assertion, and we could find no evidence to back it up.", "Michael Fix, a senior fellow at the Migration Policy Institute, told FactCheck.org that the notion of that many unauthorized immigrants receiving benefits was “implausible to say the least.”", "First of all, Fix said in an email, many estimates figure there to be somewhere around 11 million unauthorized immigrants in the country.", "The numbers fluctuate: In a 2018 report, the U.S. Department of Homeland Security said that there were about 12 million immigrants in the country illegally as of January 2015. The Pew Research Center, meanwhile, found the number had dropped to about 10.7 million in 2016. One recent study suggested much higher numbers — with a mean estimate of 22.1 million unauthorized immigrants living in the U.S. — but some, including Fix and his colleagues, have contested its methodology and findings.", "What’s more, Fix said, “unauthorized (immigrants) have for decades been barred from all cash and in-kind public benefit programs — and applications for those programs have been screened through the SAVE,” referring to the Systematic Alien Verification for Entitlements system. He also noted that they are “barred from federal employment” and that “applications for employment for federal positions are themselves screened” through the E-Verify system.", "Many of the public-benefit restrictions on unauthorized immigrants were codified in a 1996 welfare reform law known as the Personal Responsibility and Work Opportunity Reconciliation Act.", "The nonpartisan Congressional Research Service said in a 2016 report that such immigrants are not eligible for programs including SNAP (Supplemental Nutrition Assistance Program); Supplemental Security Income; Temporary Assistance for Needy Families; and Medicaid.", "Some exceptions: treatment under Medicaid for emergency medical conditions, temporary in-kind emergency disaster relief and immunizations. Immigrant children are also not barred from accessing public education.", "But none of this lends credence to the unsupported claim that “18 million illegal immigrants” are receiving “government checks.”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on the social media network.", "Fix, Michael. Senior fellow, Migration Policy Institute. Emails sent to FactCheck.org. 25 Jan 2019.", "Passel, Jeffrey S., and D’Vera Cohn. “U.S. Unauthorized Immigrant Total Dips to Lowest Level in a Decade.” Pew Research Center. 27 Nov 2018.", "Siskin, Alison. “Noncitizen Eligibility for Federal Public Assistance: Policy Overview.” Congressional Research Service. 12 Dec 2016.", "U.S. Department of Homeland Security. “Population Estimates – Illegal Alien Population Residing in the United States: January 2015.” December 2018.", "Wasem, Ruth Ellen. “Unauthorized Aliens’ Access to Federal Benefits: Policy and Issues.” Congressional Research Service. 17 Sep 2012.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]