["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Providence Mayor David Cicilline has made Providence's falling crime rate one of the key selling points in his campaign in the 1st Congressional District. He repeated it during the July 13 debate with his three Democratic challengers, saying the city now has \"the lowest crime rate in three decades.\"\n\nIn addition, the mayor's website says, \"Under his leadership, Providence has seen crime drop to its lowest rate in 30 years.\"\n\nWe asked the campaign for numbers to support that assertion. They provided statistics collected by the Providence Police Department on various crimes going back to 1960.\n\nCicilline is basing the claim on the sum of all reports of murder, rape, robbery, aggravated assault, burglary, larceny and motor vehicle theft, which the police call the \"crime index.\"\n\nThose numbers show that in 2009, there were 9,252 such crimes reported in the capital city. The last time the number was that low was in 1965, when 8,521 crimes were logged in those categories. That's a span of 44 years.\n\nSo by that measure, Cicilline's claim is understated. The annual number of reported crimes hasn't been this low in more than four decades, not three.\n\nBut is the mayor's leadership responsible for that decline?\n\nWhen we invited Karen Watts, the mayor's director of communications, to address that issue, she responded in an email that, \"I think I'll just let the facts speak for themselves.\"\n\nWe compared the rise and fall of crimes in Providence to the national pattern, using numbers from the Bureau of Justice Statistics, part of the U.S. Department of Justice. Over the years, the Providence trends have been very similar to the U.S. numbers. The number of crime reports rose steadily, except for some sporadic dips, throughout the 1960s, '70s and '80s.\n\nAround 1990, things began to change. Nationally, the numbers began a gradual decline. Chris Menton, a professor of criminal justice at Roger Williams University, said there are lot of theories for the trend, but one of the most solid holds that when there are more young people in a population, the crime rate is higher.", "Beginning in the 1960s, the Baby Boomers were of an age where they were more likely to get into trouble and, in reaction, \"our tolerance for deviant behavior went down.\" That upward trend changed after the early '90s because the population was older and a booming economy meant more jobs, which helps keep younger people out of trouble.\n\nLocally, the numbers fell dramatically, beginning around the time then-Mayor Vincent A. \"Buddy\" Cianci Jr. began his second administration. Then, during Cianci's final three years, before he went to prison on a federal corruption charge, crime made a sharp spike upward again, a trend that was far more muted on the national level.\n\nIt was after this 2001-2002 peak that Cicilline took over and - with the exception of a bump in 2008 when the number of incidents went up by 6 percent over the previous year - the number of reported crimes has fallen steadily.\n\nSo the decline in the number of crimes reported in Providence coincides with a similar, although much less steep, decline nationally. In other words, whatever effect Cicilline or his administration might have had on the crime rate, national forces were likely at work as well.\n\nA few other issues complicate this analysis. For example, Cicilline is talking about the crime rate when the number his administration is using is the total number of crime reports, which is different. But when we looked closely, we found that those issues didn't actually affect the conclusion. For a discussion of those factors, CLICK HERE.\n\nIn the end, the number of incidents of crime in Providence has declined since Cicilline took office and the number of incidents reported in 2009 is the lowest in 44 years, which makes the mayor's claim seem modest.\n\nEven though the ebb and flow of crime reports roughly mirrors what's been going on in the rest of the nation, and it's not clear how much he or his administration is directly responsible for a rate that began dropping during the second Cianci administration, we rate his statement as True.", "Debate, Democratic candidates for the 1st Congressional District, WPRI.com, accessed July 13, 2010\n\nWeb page, \"Meet David Cicilline,\" David Cicilline for U.S. Congress, accessed July 7, 2010\n\nCrime statistics for Providence - 1960-2009, Providence Police Department\n\nEmails, Karen Watts, director of communications, office of Mayor David Cicilline, July 13, 14 and 15, 2010\n\nUniform Crime Reports, FBI.gov, accessed July 14, 2010\n\nBureau of Justice Statistics, \"Reported Crime in the United States - Total,\" accessed July 15, 2010\n\nUnited States Crime Rates 1960-2008, The Disaster Center, accessed July 13, 2010\n\nInterview, Chris Menton, professor of criminal justice, Roger Williams University, July 15, 2010\n\nInterviews, Chief Dean Esserman, Cmdr. Paul Kennedy and Sgt. Raymond Hull, Providence Police, and Jim Lucht, director of the information group, and Bruce Boucek, urban information specialist, The Providence Plan, July 14, 2010.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]