["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "Since the early months of the COVID-19 outbreak in the U.S., rumors circulated that authorities planned to impose mandatory vaccinations to end the pandemic. One viral video, for instance, spewed a conspiracy theory that the government would forcibly round up unvaccinated people, while another popular meme falsely claimed schools would force COVID-19 vaccinations on children returning to classes in fall 2020.", "The online campaign aimed to discredit what epidemiologists viewed as one of the best ways to defeat the virus: a widely available vaccine, which as of this writing did not exist.", "By mid-September 2020, as immunization manufacturers scrambled to develop a viable product, Snopes received numerous inquiries about a new piece of viral content — a Sept. 16 web page titled, The Government Has Released Their Initial Plans to Force a Vaccine on Everyone. It alleged:", "Trump has the military lined up and ready to distribute this vaccine to the public, whether you want it or not. The plan is to distribute the vaccine first to health care and other vital workers, as well as those most vulnerable (likely the older populations). After production ramps up, it will be made available to all Americans who want it. If you decide you don’t want it, don’t worry, the military will help convince you. [...]", "Once this vaccine gets into your bloodstream, you cannot take it back out. This one is different from every other vaccine made, and it’s going to be necessary if you want to get groceries or leave your house. Mandatory or not, they will do what they can to convince you to take this vaccine.", "In other words, the page claimed the U.S. Department of Defense (DOD), which oversees the military, was preparing to make citizens get an eventual COVID-19 vaccine if they want to frequent public spaces — all under directions from U.S. President Donald Trump.", "To debunk this theory, we considered the source of the claim. The web page existed on a website called Before It's News. The site attempted to brand itself as a news outlet accepting content from \"a community of individuals who report on what's going on around them, from all around the world,\" according to its About us page. Anyone with a free account on the website can publish stories, and the most popular entries as of late October 2020 did not apply news writing standards but rather showed stream-of-consciousness writing on conspiracy theories. Considering the site's lack of, or nonexistent, editing structure and news judgment, we considered Before It's News a hub of what Snopes calls junk news.", "Next, we analyzed a transcript from a Sept. 16 White House press briefing, which appeared to be the basis for the web page's allegation of forced vaccinations.", "At the press conference, the Trump administration outlined its plan for getting vaccines to Americans when the U.S. Food and Drug Administration (FDA) authorizes mass distribution. The president said the military was \"lined up\" to help with the plan's logistics — confirming one aspect of the above-displayed claim — though no one at the event said vaccinations would be forced on people or that citizens would need the shots to leave their homes.", "After that, we reviewed federal documents with more details about the government's plans. A congressional report said the Department of Health and Human Services was leading vaccine research, while the DOD was partnering with the Centers for Disease Control and Prevention (CDC) to distribute the final product. All parties were working to ensure \"every American who wants to receive a COVID-19 vaccine can receive one,\" per the report. Nowhere in the documents did the government say it would force vaccinations on people.", "During our analysis, we also considered remarks by Dr. Anthony Fauci, director of the NIH's National Institute for Allergy and Infectious Diseases and a member of the White House coronavirus task force, at a virtual event hosted by George Washington University on Aug. 19. During the event, a student asked if Fauci supports a nationwide mandate of a COVID-19 vaccine. Fauci responded:", "No, definitely not — you don't want to mandate and try and force anyone to take a vaccine. We've never done that. You can mandate for certain groups of people, like health workers. But for the general population, you can't. I mean, here at my own hospital, at the NIH, we get influenza vaccines, and if you refuse with no good reason other than you just don't want to take it, then we don't allow you to take care of patients on the wards during the influenza season. So that's a mandate. But we don't want to be mandating from the federal government to the general population. It would be unenforceable and inappropriate.", "In addition to health care facilities, schools may require students and staff to receive certain immunizations before they can take classes, and employers can require workers to get vaccinations under certain conditions.", "But here's what's key in the debate over a government-issued order: The U.S. Constitution does not grant the federal government authority to impose a vaccine on all citizens.", "By legal standards, any violation of government mandates could result in fines, taxes, or other punishments. And according to Dorit Reiss, a law professor at the University of California Hastings College of the Law in San Francisco, existing laws \"almost certainly\" prevent the federal government from creating a comprehensive COVID-19 vaccine mandate, NBC's \"Today\" reported. The story said:", "The federal government has some ways to get people to vaccinate, imposing it as a condition of getting a passport, for example.", "That hasn’t happened before, but such a requirement would be within the federal government’s powers, Reiss noted.", "However, Reiss said state and city governments — not the federal government — have the authority to establish vaccine mandates so long as those proposed requirements are \"reasonable, proportional and enforced in a nondiscriminatory fashion,\" according to the story.", "In sum, considering no evidence showed a U.S. federal agency, including the DOD, was preparing to make COVID-19 vaccinations mandatory for people to visit public spaces, as well as the federal government's limited power in terms of establishing such a mandate, we rate this claim \"False.\"", "Centers for Disease Control and Prevention.   \"The Difference between Flu and COVID-19.\"\r\n    Accessed 23 October 2020.", "Pawlowski, A.   \"Will The COVID-19 Vaccine Be Mandatory?\"\r\n   USA Today.   3 September 2020.", "C-SPAN.  \"Dr. Fauci Discusses The Pandemic With George Washington University.\"\r\n    19 August 2020.", "Kaminer, Debbie.   \"Could Employers and States Mandate COVID-19 Vaccinations? Here's What the Courts have Ruled?\"\r\n    21 July 2020.   The Conversation.", "White House.   \"Remarks By President Trump in Press Briefing. August 11, 2020.\"\r\n    11 August 2020.", "Operation Warp Speed.   \"From the Factory to the Frontlines.\"\r\n    Accessed 23 October 2020.", "Fujiwara, Sarah.   \"Is Mandatory Vaccination Legal in Time of Epidemic?\"\r\n    AMA Journal of Ethics.   2006.", "Centers for Disease Control and Prevention.  \"State Vaccination Requirements.\"\r\n    Accessed 23 October 2020.", "Ciolli, Anthony.   \"Mandatory School Vaccinations: The Role of Tort Law.\"\r\n   Yale.   September 2008.", "Malone, Kevin and Alan Hinman.   \"Vaccination Mandates: The Public Health Imperative and Individual Rights.\"\r\n   Centers for Disease Control and Prevention.   Accessed 23 October 2020.", "David and Michael Belcher.   \"State-mandate COVID-19 Vaccination is Constitutional.\"\r\n   SCOCABlog.  9 August 2020.", "Health and Human Services.   \"Trump Administration Releases COVID-19 Vaccine Distribution Strategy.\"\r\n    16 September 2020.", "Raymond, Adam.   \"Here's What a Mandatory COVID-19 Vaccine Means.\"\r\n   Spectrum News1.   23 October 2020.", "White House.   \"Remarks by President Trump in Press Briefing. September 16, 2020.\"\r\n    16 September 2020.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]