["About this rating", "The use of the terms \"illegal immigrant\" and \"illegal alien\" to describe non-citizens who are present in the United States without documentation has become controversial in recent years, in part because of their pejorative connotations, and in part because they blur critical distinctions in immigration law.", "As the American Civil Liberties Union (ACLU) has pointed out, simply being present in the U.S. in violation of federal immigration statutes is not, in and of itself, a crime:", "Entering the United States without being inspected and admitted, i.e., illegal entry, is a misdemeanor or can be a felony, depending on the circumstances. 8 U.S.C. § 1325. But many undocumented immigrants do not enter the United States illegally. They enter legally but overstay, work without authorization, drop out of school or violate the conditions of their visas in some other way. Current estimates [as of 2006] are that approximately 45% of undocumented immigrants did not enter illegally.", "Undocumented presence in the United States is only criminally punishable if it occurs after an individual was previously formally removed from the United States and then returned without permission. 8 U.S.C. § 1326 (any individual previously “deported or removed” who “enters, attempts to enter, or is at any time found in” the United States without authorization may be punished by imprisonment up to two years). Mere undocumented presence in the United States alone, however, in the absence of a previous removal order and unauthorized reentry, is not a crime under federal law.", "Violations of immigration law that don't involve improper entry are dealt with in civil proceedings (which can result in deportation), not criminal courts. This is the distinction most people have in mind when they say undocumented immigrants haven't necessarily broken any laws.", "It is also, apparently, the point argued in a statement widely attributed on social media to Speaker of the House Nancy Pelosi (D-California):", "\"Just because someone is here illegally doesn't mean they broke any of our laws,\" Pelosi supposedly said (at an unspecified time and place). Despite the implication in memes such as the one seen above that the statement is forehead-slappingly ridiculous, it is logically coherent in terms of the aforementioned legal distinction. \"Just because X doesn't mean Y\" is the same as saying \"Y doesn't necessarily follow from X\" -- i.e., someone who is here illegally hasn't necessarily broken the law.", "It's plausible to suppose that Pelosi holds such a view. She said in a 2006 PBS News Hour interview, for example, that not everyone who is an undocumented immigrant entered the country illegally:", "JIM LEHRER: Well, let's go back to the beginning here. What is your explanation as to why there are more than 11 million illegal immigrants, people who came in illegally, still here living here illegally? What's gone wrong? Is it a broken system? Is it the result of what?", "REP. NANCY PELOSI: Well, all of them didn't come in here illegally; some did. Some came and their visas expired or they're on a backlog at the immigration service, when it was called the immigration service.", "And so a number of reasons why people's documents are not in order, but many did come in illegally. And that is that we do have to strengthen security at the border; there is no question about that. Everyone agrees to that.", "Judging from Pelosi's statements on her House.gov web page, we don't see that her overall stance on immigration has changed significantly in the ensuing years. While calling for \"strong, smart border security,\" she has also supported the Dream Act and the DACA program, and she has harshly condemned the Trump administration's \"zero tolerance\" immigration enforcement policy that resulted in the separation of children from their families at the U.S.-Mexico border.", "Even after sifting through her many pronouncements on immigration, however, we have not been able to verify that Pelosi ever said, in so many words, \"Just because someone is here illegally doesn't mean they broke any of our laws.\" We couldn't find the statement in any published sources (including books and periodicals), nor did we find sources cited in any of the social media posts attributing the quote to her.", "That having been said, we did run across instances of other public figures' uttering roughly the same thought. Ingrid M. Delgado, a spokesperson for the Florida Conference of Catholic Bishops, said in testimony before the Florida House Judiciary Subcommittee on Criminal Justice that \"Unlawful presence is not a crime. It is a civil violation.\"", "In 2016, then-California Attorney General (and now Democratic U.S. Senator) Kamala Harris tweeted that \"An undocumented immigrant is not a criminal.\"", "Former New Jersey Governor Chris Christie, a Republican, said the following while serving as U.S. Attorney for the District of New Jersey in 2008:", "\"Being in this country without proper documentation is not a crime,\" Christie told more than 60 residents and town officials. \"The whole phrase of 'illegal immigrant' connotes that the person, by just being here, is committing a crime.\"", "Being undocumented may be a civil wrong, but it's not a criminal act, Christie said.", "And in 2012, U.S. Supreme Court Justice Anthony Kennedy wrote, in the majority opinion in the case Arizona v. United States, 567 U.S. 387, that \"As a general rule, it is not a crime for a removable alien to remain in the United States.\"", "We attempted to get in touch with Speaker Pelosi's office for help authenticating the quote attributed to her but did not receive a response in time for publication.", "O'Connor, Julie.   \"Christie: Immigrants Are Not Criminals.\"\r\n    The Star-Ledger.   27 April 2008.", "American Civil Liberties Union.   \"Criminalizing Undocumented Immigrants.\"\r\n    February 2010.", "Justia.com.   \"Arizona v. United States, 567 U.S. 387 (2012).\"\r\n   24 June 2012.", "PBS News Hour.   \"House Minority Leader Pelosi Blasts GOP's Iraq Policy.\"\r\n    30 March 2006.", "Pelosi.House.gov.   \"Pelosi Statement on Immigration Priorities.\"\r\n    30 November 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]