["About this rating", "In September 2017, repeat offender Our Land of the Free published an article reporting that former United States President Barack Obama left a personal message to his successor President Donald Trump in the Oval Office, the contents of which remained unrevealed for several months:", "Senior Correspondent Art Tubolls reports from the White House that the letter released to the media from former President Obama to President Trump is an incomplete, watered down version presented by the fake news media:", "“President Trump was very clear that he wanted the entire letter released but several agencies pushed him to reconsider. the media then made the final decision, telling the WHOIP that they absolutely would not carry such a private message that would be ‘twisted’ by the alt-right.", "We instead decided to release the personal message through back channels so the truth would be known without hurting the feelings of the poor ‘news’ networks that would have had to report it.”", "The personal message, added to the letter as a post-script on a second sheet of paper, reads:", "“On a personal note, this country has fought back hard from the recession your pals caused. If you destroy everything the American people have rebuilt I will come for you. You have no friends in this town.", "You’ve been warned.", "~B.\"", "The letter itself is real. Obama did in fact leave a personal note for Trump, continuing a long and friendly tradition of outgoing presidents welcoming (and sometimes warning) the next U.S. leader. The actual letter, which Donald Trump showed to Oval Office visitors, reads as follows:", "Congratulations on a remarkable run. Millions have placed their hopes in you, and all of us, regardless of party, should hope for expanded prosperity and security during your tenure.", "This is a unique office, without a clear blueprint for success, so I don't know that any advice from me will be particularly helpful. Still, let me offer a few reflections from the past 8 years. First, we've both been blessed, in different ways, with great good fortune. Not everyone is so lucky. It's up to us to do everything we can (to) build more ladders of success for every child and family that's willing to work hard.", "Second, American leadership in this world really is indispensable. It's up to us, through action and example, to sustain the international order that's expanded steadily since the end of the Cold War, and upon which our own wealth and safety depend.", "Third, we are just temporary occupants of this office. That makes us guardians of those democratic institutions and traditions — like rule of law, separation of powers, equal protection and civil liberties — that our forebears fought and bled for. Regardless of the push and pull of daily politics, it's up to us to leave those instruments of our democracy at least as strong as we found them.", "And finally, take time, in the rush of events and responsibilities, for friends and family. They'll get you through the inevitable rough patches.", "Michelle and I wish you and Melania the very best as you embark on this great adventure, and know that we stand ready to help in any ways which we can.", "Good luck and Godspeed,\nBO", "Although there legitimately is a tradition of outgoing U.S. presidents leaving letters for the next person who assumes the position, Our Land of the Free's interpretation of it is not legitimate. An often-overlooked (or, perhaps, ignored) disclaimer notice on the web site's \"About\" page warned all of its content should be considered \"fake news\":", "Ourlandofthefree.com makes no guarantee that anything you find here will be based at all in reality. All posts should be considered satirical and all images photoshopped to look like something they’re not.", "We believe in the right to be free. No matter what, the freedom to do what we want, say what we want and publish what we want comes first.", "Therefore we make no guarantee that what you read here is true. In fact, it most definitely is not.", "Our Land Of The Free is here to entertain you with the kind of whimsical satire conservatives enjoy.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]