["About this rating", "A Saudi prosecutor is seeking the death penalty in a case involving Shia activist Israa al-Ghomgham (among others).", "Israa al-Ghomgham's trial is ongoing, so she has not yet been sentenced to death or executed.", "In August 2018, scattered online reports, some purporting to be backed by video evidence, claimed that Saudi authorities had executed the prominent Shia human rights activist Israa al-Ghomgham, whose name is also sometimes rendered \"Esra al-Ghamgam.\" For example, on 22 August the Fort Russ News, an arm of the Center for Syncretic Studies, wrote:", "Saudi sources as well as human rights sources of various stripes have confirmed the reporting that the Saudi human rights activist, Esra al-Ghamgam, was executed on the KSA’s prosecutor’s orders on Sunday ... A video, which FRN is in possession of, but out of respect to the deceased, will not share, shows an executioner placing her in prone position on the ground before decapitating her with a sword, as security forces stood by.", "Three days earlier, the Young Journalists Club, a website run by Islamic Republic of Iran Broadcasting, offered the headline \"Saudi Arabia beheads female activist in public\" and went on to add:", "The Thefreethoughts Twitter account and other Saudi sources said the female, named as Esra al-Ghamgam, was executed on the prosecutor’s orders on Sunday. It shared a video showing an executioner fixing her in a recumbent position on the ground before decapitating her with a sword as security forces stood by. Ghamgham was detained alongside her husband Seyyed Musa Ja’afar Hashem during a security raid on their house in the mainly Shia region of Qatif in Eastern Province on December 8, 2015. Citing the Twitter account, London-based al-Quds al-Arabi newspaper reported earlier that her detention had come in response to her “anti-establishment” activities.", "These reports are false. The video shared online on and after 19 August actually showed the execution of Laila Bint Abdul Muttalib Basim, a Burmese woman who was beheaded in Mecca in 2015, despite her having pleaded her innocence to charges that she murdered her stepdaughter, as France 24 reported at the time:", "[S]ecretly filmed images show the public execution of a woman in the streets of the Saudi city of Mecca.", "Laila Bint Abdul Muttalib Basim, an immigrant originally from Burma, lived in Saudi Arabia. The country's ruling authorities had found her guilty of sexually abusing and killing her seven-year-old stepdaughter.", "In the video, several policemen can be seen holding her to the ground in the street. She can be heard shouting and proclaiming her innocence until the moment she's executed, when a man strikes her three times with a sword.", "Fort Russ News' article has undergone three updates since first being published. As of 29 August, the most recent of those updates noted:", "DESPITE THREE DECENT SOURCES REPORTING ON THIS, WE ARE PRESENTLY AWAITING CONFIRMATION FROM FURTHER SOURCES. IT HAS BEEN BROUGHT TO OUR ATTENTION AS OF 3:00am GMT+2 THAT THE THREE LISTED SOURCES MAY HAVE BEEN IN ERROR. THIS IS UNCLEAR TO US AT THIS TIME. CHECK FRN FOR FURTHER UPDATES. WE WILL PRINT A RETRACTION IF NEW FACTS POINT US THAT WAY.", "On 28 August, the international non-governmental organization Human Rights Watch confirmed that al-Ghamgam was not executed on 19 August, and that she had not even been sentenced to death by that time. Rather, a Saudi prosecutor had recommended the death sentence against al-Ghamgam and five other activists from the country's Shia Muslim minority on a collection of somewhat vague charges, as Human Rights Watch noted:", "Despite widespread rumors, the Saudi Shia activist Israa al-Ghomgham has neither been executed nor sentenced to death. After more than three years in pretrial detention, she is now on trial alongside her husband and four other activists on protest-related charges at Saudi Arabia’s notorious terrorism court. But if the Public Prosecution -- an entity that reports directly to the king -- has its way, al-Ghomgham, 29, may become one of the first women sentenced to death for her peaceful activism ...", "While the authorities have often attempted to accuse Shia protesters of committing violent acts or of incitement to violence, neither al-Ghomgham nor the other five defendants have been charged with acts of violence. In the absence of a written penal code or narrowly worded regulations, judges and prosecutors in Saudi Arabia can essentially make up offenses and criminalize a wide range of acts under broad, catch-all categories. In al-Ghomgham’s trial, the Public Prosecution is seeking the death penalty against five of the six activists based on a host of vague charges that include “participating in protests,” “attempting to inflame public opinion,” “filming protests and publishing on social media,” and “providing moral support to rioters.”", "Ali Adubisi, director of the European Saudi Organisation for Human Rights, also refuted reports that al-Ghomgham had been executed in August 2018. Interviewed by Check News, the fact-checking arm of the French newspaper Libération, Adubisi said: \"Her trial should resume in October [2018]. The prosecutor asked that she be sentenced to death. The judge could decide to go along with the penalty requested by the prosecutor, but he could also choose a different sentence.\"", "Flores, Joaquin.   \"Rest in Power: Esra Al-Ghamgam Brutally Executed by Saudi Arabia.\"\r\n     Fort Russ News/The Center for Syncretic Studies.   22 August 2018.", "The Young Journalists Club.   \"Saudi Arabia Beheads Female Activist in Public: Report.\"\r\n    19 August 2018.", "France 24.   \"Woman Publicly Beheaded in Broad Daylight in Mecca.\"\r\n     France 24.   31 December 2015.", "Zayadin, Hiba.  \"We Have Two Months to Save Israa al-Ghomgham's Life.\"\r\n  Human Rights Watch.  28 August 2018.", "Pezet, Jacques.  \"Y a-t-il une Confirmation de l'Exécution de la Militante Israa al-Ghomgham en Arabie Saoudite?\"\r\n  Check News/Libération.  21 August 2018.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]