["About this rating", "Editor's note: Shortly after this article was published, U.S. President Donald Trump vetoed the National Defense Authorization Act. You can read more about Trump's veto here from the Associated Press. The original article continues below.", "House Resolution 6395, or the National Defense Authorization Act for Fiscal Year 2021 (NDAA), was surprisingly controversial during the final weeks of 2020. U.S. President Donald Trump threatened to veto the military budget bill, which passed the House and Senate with more than a two-thirds majority vote, because it did not call for the removal of Section 230, an unrelated piece of legislation that provides internet publishers legal immunity from third-party content.", "On Dec. 22, 2020, conservative commentator Chuck Callesto claimed that there was another reason Trump might want to veto the bill. Callesto wrote that the NDAA contained a provision that \"Nullifies the President's use of the Insurrection Act.\"", "While Callesto presents his claim as if he is quoting directly from the bill, the phrase \"nullifies the President's use of the Insurrection Act\" does not appear anywhere in the NDAA (which numbers 1,480 pages, not 5,893 as Callesto claimed), the full text of which can be found here.", "It's a bit of a moot point, however, as this amendment did not make it into the final bill. As of this writing, the NDAA does not include any language pertaining to the Insurrection Act.", "The Hill reported on Dec. 6 that the amendment pertaining to the Insurrection Act was removed as Congress debated the NDAA:", "The NDAA also includes a modest rebuke of Trump’s use of Pentagon funding on his southern border wall. The compromise includes House-passed language capping emergency military construction spending at $100 million annually for domestic projects. Trump took $3.6 billion from military construction funds to build the wall.", "The compromise jettisoned some rebukes of Trump, including House-passed language to restrict a president’s Insurrection Act powers and block funding for a nuclear test. But this year stands in stark contrast to last year, when most of House Democrats’ efforts to box in Trump on defense policy were stripped from the final product.", "In summary, the viral tweet claiming that the NDAA \"nullified\" the Insurrection Act is based on a House amendment proposed in July that would have restricted (not nullified) the president's use of the Insurrection Act. This amendment, which would have required the president to make certifications to Congress before invoking the Insurrection Act, did not make it into the final form of the legislation.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]