["About this rating", "On 24 March 2015, the Facebook page \"March Against Monsanto\" published a link to an article reporting that popular Nutella brand sweetened hazelnut cocoa spread was \"downright toxic\":", "On 17 February 2016, Business Insider also referenced the increasing spread of rumors that Nutella contains harmful ingredients:", "People on social media are accusing Nutella of containing harmful ingredients.", "Blog posts such as \"Say no to Nutella, it is poisoning you and your children\" and \"Why you'll want to think twice before feeding your kids Nutella\" are being shared by thousands on Facebook.", "The posts claim that the artificial ingredient vanillin, which Nutella contains, is a neurotoxin that kills brain cells.", "The article to which \"March Against Monsanto\" linked in March 2016 was not new; rather, it was original published on 7 November 2014 to the web site Living Traditionally, and claimed that the \"scariest thing that people don’t know about Nutella is that it contains monosodium glutamate (MSG), also known as E621,\" which was \"cleverly hidden inside an artificial flavor called vanillin which is labeled on every Nutella jar.\"", "Claims about Nutella's purported toxicity primarily hinge on the product's use of vanillin and the purported (unstated) presence of MSG:", "When most people see vanillin, they think ... oh it has vanilla. However, this is likely one of the most harmful ingredients in Nutella. Scent and flavor of vanillin are nothing but chemicals. When we talk about actual real-life non-imitation vanilla flavor, what we're really talking about is a bunch of molecules that are extracted from a vanilla bean.", "The grandest chemical of all of these is vanillin. Sure, vanilla has plenty of other odor molecules, but vanillin is about 95% of the scent. And, thanks to technology, you can make it cheaply from petroleum and in a lab. The largest vanillin manufacturers in the world are in China and more than 90% of food products manufactured contain vanillin from China including Nutella.", "The worst part of vanillin is that it contains unlabeled MSG. It is not a nutrient, vitamin, or mineral and has no health benefits. The part of MSG that negatively affects the human body is the “glutamate”, not the sodium. The breakdown of MSG typically consists of 78% glutamate, 12% sodium, and about 10% water. Any glutamate added to a processed food is not and can not be considered naturally occurring. Natural glutamate in plants and animals is known as L-glutamic acid. MSG Lurks As A Slow Poison In Common Food Items Without Your Knowledge and vanillin is one of them.", "MSG has been proven to act as an excitotoxin which stimulates the reward system of the brain, so we think it tastes better (than it actually does) and consequently consume more.", "There are a growing number of Clinicians and Scientists who are convinced that excitotoxins play a critical role in the development of several neurological disorders, including migraines, seizures, infections, abnormal neural development, certain endocrine disorders, specific types of obesity, and especially the neurodegenerative diseases; a group of diseases which includes: ALS, Parkinson's disease, Alzheimer's disease, Huntington's disease, and olivopontocerebellar degeneration.", "However, vanillin is widely recognized as a safe food additive, both in the United States and globally, with a document published by the United Nations Environment Programme (UNEP)'s Organization for Economic Cooperation and Development (OECD) (called a Screening Information Dataset, or SIDS) stating that:", "During the present reviewing of the available toxicity data for vanillin, no particular risk has been identified which should give reason to concern or additional toxicity testing in animals. The use of vanillin as a food additive is approved by authorities world wide, and FDA has granted GRAS [generally recognized as safe] status to its use. This is in agreement with the experience with vanillin in consumer products during many years without any confirmed report of adverse events.", "Nutella's ingredients are listed on the packaging as follows: \"Sugar, Peanut Oil, Hazelnuts, Cocoa, Skim Milk, Reduced Minerals Whey, (From Milk), Partially Hydrogenated Peanut Oil, Soy Lecithin (An Emulsifier), Vanillin (An Artificial Flavor).\"  We contacted Nutella's parent company to ask whether the vanillin in Nutella contains MSG (an ingredient not listed in their labeling). A Nutella representative replied that the claim was completely false, that Nutella contains no MSG (nor any GMO-derived ingredients).", "While rumors about Nutella's supposedly \"harmful\" or \"toxic\" ingredients remain pervasive on social media, those claims stem from unsubstantiated concerns about vanillin (which has not proved to pose a health risk to consumers) and MSG (which has not been proved to be present in Nutella).", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]