["One version of the video has been viewed more than 148,000 times since it was posted on Facebook on September 6. We’ve archived the video here. “The video has graphic images,please open at your own discretion. Nigerians bombed the South African Embassy in Nigeria,” reads the caption.", "The same video was posted here, shared more than 2,800 times and seen by nearly 66,000 Facebook users. This particular post claims the bomb blast was carried out in Lagos. “Breaking news: Bomb blast at the south africa embassy in lagos many feared dead,” the caption read.", "South Africa has two main diplomatic missions in Nigeria, neither of which officially goes by ‘embassy’ -- it has a High Commission in Abuja and a Consulate-General in Lagos.", "The South African government announced on September 5 that it was temporarily closing both of these offices as a security measure during a spate of attacks against South African-owned businesses in Nigeria. These came as reprisal attacks following a wave of xenophobic attacks in South Africa, including many directed against Nigerian-owned businesses and properties.", "While tensions have been high between the two countries, neither the South African high commission nor the consulate-general in Nigeria have been hit by a bomb attack during this month’s unrest.", "The Nigerian government dismissed claims of a bomb attack against one of South Africa’s diplomatic mission as “fake news”.", "“The video of the purported bomb explosion which is being circulated on the social media, is that of the bomb explosion at Emab plaza, near Banex, in Abuja on June 25, 2014,” read a statement from Lai Mohammed, minister of information and culture.", "The Nigerian Police Force also called the video “another classical example of a disingenuous piece of Fake News”.", "The above video is another classical example of a disingenuous piece of Fake News. There was no explosion in the South African High Commission or any other part of Nigeria today. The public are therefore advised to disregard the information in its entirety. pic.twitter.com/tkNF4kup8p", "According to the Nigerian government, the video shows a bombing in Abuja in 2014. The bombing at the Emab Plaza shopping mall, which killed at least 21 people, was widely reported at the time, including by AFP.", "We wanted to confirm if the video was really filmed at the scene of the Abuja bombing.", "Using video verification tool inVID, we found that still frames within the video had been on the internet for a long time. But the metadata of the shared videos had been wiped, making it difficult to pin the video to a particular date or location.", "Forensic analysis showed that a version of the video was uploaded to the Zambian Facebook page using an Apple computer. But not much else could be proven from the other data.", "Reverse image search for many screenshots from the video also came up with no older versions of the video.", "Watching the video time and again, we spotted a few green cabs, popular in Abuja, Nigeria’s capital.", "So, we resorted to trying different search terms on YouTube that included the terms “car bomb” and “in Abuja”.", "We eventually found this video, uploaded by popular YouTuber Adeola Fayehun in June 2014, with the caption “Abuja Emab plaza Bomb Blast June 2014”.", "The footage is the same as that making the rounds this week -- proving that it was indeed online five years ago and does not show a recent attack on a South African diplomatic mission in Nigeria.", "Fayehun cautions in the description that she does not own the video, saying only that she hopes “more people will see the impact of the explosion” after she shared it.", "So we cannot be 100 percent sure, from this video alone, that the footage shows the aftermath of the Emab Plaza bombing.", "However, a comparison of the video with photographs taken at the scene of the bombing shows similarities.", "While the quality of the video is grainy, the building seen in the background at the blast site appears to be a low three-story structure, like the Emab Plaza mall.", "Comparing this screenshot from the video with a photo used in CNN’s coverage at the time, you can see what appears to be the same tall tree to the left of the shot and the same black and white road barrier. You can also see what appears to be one of the same green taxis burning outside the building.", "All the available evidence therefore suggests that the video was indeed filmed at the site of the Emab Plaza mall bombing in Abuja in 2014.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]