["About this rating", "Two consecutive mass shootings by a single gunman targeting Muslims at the Al Noor Mosque and the Linwood Islamic Centre in Christchurch, New Zealand, on 15 March 2019 killed 50 people.", "In the days after, social media posts shared an image of a blood-stained Quran that was said to have been found at the scene of the tragedy:", "We don't know the specific origins of this image, but we can say with certainty that it does not depict a Quran connected with the March 2019 mass shootings in New Zealand, as it had already been posted online six months earlier, in September 2018. In that latter case, it was offered as a photograph of a \"Quran stained with the blood of children massacred in a US drone strike in Somalia that destroyed a Qur'an school and a Hospital\":", "A Quran stained with the blood of children massacred in a US drone strike in Somalia that destroyed a Qur'an school and a Hospital. pic.twitter.com/qDBdWh0RdO", "— muslim daily (@BirdsOfJannah) September 20, 2018", "The United States has been carrying out air and drone strikes against Islamist militant targets in Somalia for about 10 years, and in 2017 the Trump administration reportedly \"relaxed some of the rules for preventing civilian casualties when the American military carries out counterterrorism strikes in Somalia.\" We can't say whether this image truly stemmed from one such drone strike, but we do know its association with the Christchurch shootings is not accurate.", "Savage, Charlie and Eric Schmitt.   \"Trump Eases Combat Rules in Somalia Intended to Protect Civilians.\"\r\n    The New York Times.   30 March 2017.", "New America.   \"Drone Strikes: Somalia.\"\r\n    Accessed 20 March 2019.", "The Bureau of Investigative Journalism.   \"Somalia: Reported US Actions 2018.\"\r\n    Accessed 20 March 2019.", "Perry, Nick et al.   \"New Zealand’s Darkest Day: 36 Minutes of Terror.\"\r\n    Associated Press.   18 March 2019.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]