["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In this March 27, 2020 file photo, President Donald Trump signs the coronavirus stimulus relief package in the Oval Office at the White House in Washington. (AP/Evan Vucci)", "A Facebook post claims that despite being married to immigrants, President Donald Trump and Republican Senate Majority Leader Mitch McConnell blocked Americans married to immigrants from receiving stimulus checks.", "\"Trump and McConnell are blocking stimulus checks for Americans married to immigrants. While they are both married to immigrants,\" said the April 23 Facebook post.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "First lady Melania Trump was born in Slovenia. Elaine Chao, who serves as U.S. Secretary of Transportation and is married to McConnell, was born in Taiwan. So the part of the claim about Trump and McConnell being married to immigrants is correct.", "What about the claim that they are \"blocking\" stimulus checks for Americans married to immigrants? The $2 trillion Coronavirus Aid, Relief, and Economic Security Act, or CARES Act, was signed into law by Trump on March 27. But it did not become law against Democratic wishes. The bill passed unanimously in the Senate and only three House Democrats opposed it.", "Under the CARES Act, eligible people who filed tax returns for 2018 or 2019 and earned up to $75,000 are set to receive $1,200; married couples who jointly earned up to $150,000 are expected to get $2,400. Eligible tax filers with dependent children under 17 years old are expected to get $500 per qualifying child.", "Individuals and couples who earned more than the $75,000 and $150,000 thresholds — but not more than $99,000 or $198,000 — will get some aid, but not as much as those who earned less.", "What about Americans married to immigrants?", "The Facebook post gives the misleading impression that all Americans married to immigrants won’t get a check. That’s not the case.", "U.S. citizens are ineligible for a stimulus check if they filed a joint tax return with a spouse who used an Individual Taxpayer Identification Number. There is an exception to that rule: If either spouse is a member of the U.S. military at any time during the taxable year, then only one spouse needs to have a valid Social Security number.", "Americans and immigrant spouses who filed a tax return both using a Social Security number are eligible for the stimulus check (if they meet the income criteria).", "Being married to someone who has an ITIN instead of a Social Security number is not a disqualifying element by itself, either. If the couple filed their taxes separately, then whoever filed using a Social Security number is eligible for the check.", "ITINs are issued by the IRS for tax purposes, so that foreign nationals and other individuals who don’t have a Social Security number can use it to pay income taxes. Some immigrants in the country illegally pay taxes using an ITIN.", "About 1.8 million spouses who are either U.S. citizens or green-card holders will be excluded from the stimulus payments, according to estimates from the Migration Policy Institute.", "A Facebook post said, \"Trump and McConnell are blocking stimulus checks for Americans married to immigrants.\"", "The post wrongly makes it seem as if the law providing the stimulus payment was a doing only of Republicans. The CARES Act passed with bipartisan support.", "Not all Americans married to immigrants are barred from getting a stimulus check. That applies to couples that filed a joint tax return, one using a Social Security number and the other using an ITIN. That exempts military families.", "If a couple files tax returns separately, the spouse who filed with a Social Security number is eligible for the payment.", "The statement contains an element of truth but ignores critical facts that would give a different impression. We rate it Mostly False.", "Facebook post, April 23, 2020", "Migration Policy Institute, Vulnerable to COVID-19 and in Frontline Jobs, Immigrants Are Mostly Shut Out of U.S. Relief, April 24, 2020", "Congress.gov, Elaine Chao nomination", "Congress.gov, H.R.748 - CARES Act", "WhiteHouse.gov, Melania Trump", "IRS.gov, Economic Impact Payment Information Center, Page Last Reviewed or Updated: 29-Apr-2020; Individual Taxpayer Identification Number, Page Last Reviewed or Updated: 16-Apr-2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]