["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Faced with complaints about airport delays being caused by the sequester, Congress last month halted a furlough of air traffic controllers that had been part of its budget-cutting agreement.", "U.S. Sen Mark Warner, D-Va., recently wondered why members of Congress -- frequent fliers, themselves -- haven’t shown the same urgency to protect disadvantaged 3- and- 4-year-olds who also are being hurt by the spending cuts.", "\"Everybody gets up in arms when people have to wait to get an airplane ride and Congress acts immediately because that’s visible,\" he said during a May 14 interview on WHRV-FM in Norfolk. \"What’s not visible is the 70,000 kids who have lost their Head Start slots...\"", "For several years, Warner has been seeking a bipartisan solution to the nation’s budget stalemate that includes spending cuts and tax increases. He has called the sequester, which began triggering automatic cuts to defense and domestic programs on March 1, \"the most stupid option on the table.\" During his recent radio interview, he also lamented sequester-caused reductions in federal grants for college students and research at the National Institute of Health.", "We were struck by his claim that 70,000 children have lost access to Head Start, an educational program that prepares disadvantaged kids to start elementary school, and decided to see whether Warner is right.", "More than a million children --  from families that live below the poverty line or receive public assistance -- are enrolled in Head Start half-day or full-day programs. The federal government offers competitive contracts to public and private providers, so many groups may offer Head Start programs in a locality.", "As PolitiFact Florida recently noted examining a similar claim, Head Start enrollment hit record highs in recent years because the Obama administration nearly doubled the number of children eligible for Early Head Start, which serves eligible children up to the age of eligibility for Head Start. Congress then decided to spend more money on Head Start to maintain enrollment for those children.", "A month before the sequester began, Health and Human Services Secretary Kathleen Sebelius sent a Feb. 1 letter to the Senate Appropriations Committee detailing cuts to programs under her purview. Among them, she wrote, \"up to 70,000 children would lose access to Head Start and Early Head Start services.\"", "Warner’s statement went a step further, saying 70,000 children \"have lost their Head Start slots.\"", "When we asked his office for an explanation, spokesman Kevin Hall emailed us two news releases and two news articles about the sequester that were written after Sebelius’ letter. He included a Feb. 8 White House fact sheet on the harm of the sequester. At the top of the list, it said \"70,000 young children would be kicked off Head Start …\"", "Hall also sent news articles written by NPRand Education Week and web postings from the National Head Start Association -- a group of the agencies that run local programs -- that, in varying ways, say a reduction of 70,000 Head Start slots may or will happen.", "Annual funding for Head Start is being cut by 5.27 percent. HHS spokesman Ted Froats said Sebelius’ estimate of losing up to 70,000 spots hasn’t changed. But he also said HHS does not know how many children have been dropped since the sequester began and that the agency is gathering that data and hopes to release a report in June.", "Each local program across the nation has the flexibility to determine how it will adjust to its budget cuts and news reports say many are exploring solutions that don’t involve reducing enrollment, such as switching from a full-year to a nine-month program, closing one day a month, or fundraising.", "For Virginia, the White House estimated that up to 1,000 children would lose Head Start or Early Head Start services before the end of the year. But state officials don’t yet know what the results will be.", "Maxine McKinney, executive director of the Virginia Head Start Association, wrote in an email that she thinks most state programs so far have been able to maintain programs because the sequester did not begin until well into their budget year, which runs from the start from July to the end of June. But she hasn’t received figures yet on how the local programs will cope with the coming budget year.", "\"Many programs are reducing enrollment,\" she said. \"Others are able to absorb the cuts by eliminating non-mandated services, reducing staff, etc.\"", "Of the 21 programs she’s heard from so far, 10 are reducing their slots by 263. But the 21 programs accounts for fewer than half in the state.", "Our ruling", "Warner said 70,000 children have \"lost their Head Start slots\" because of the sequester. He strains the limit of an Obama administration estimate that \"up to\" that number of children may lose out.", "There’s no doubt that many children will lose Head Start spots as the budget cuts sink in, but at this point, nobody knows how many already have. HHS is gathering that information. The White House estimate assumes that local Head Start organizations will respond to funding cuts by reducing slots, but that isn’t the only option. Many organizations are exploring different options, such as fundraising and reducing hours.", "Warner’s statement contains an element of truth in that some children already have lost Head Starts slots and others have less access to the program. But by and large, he assumes that a worst-case scenario for Head Start has already taken place.", "We rate his statement Mostly False.", "HearSay interview, May 14, 2013.", "PolitiFact Florida, \"Kathy Castor says 70,000 children will lose access to Head Start including 2,000 in Florida,\" May 13, 2013.", "U.S. Department of Health and Human Services, \"History of Head Start,\" accessed May 14, 2013.", "Secretary of Health and Human Services, Letter to Sen. Barbara Mikulski, Feb. 1, 2013.", "White House, \"Fact Sheet: Examples of How the Sequester Would Impact Middle Class Families, Jobs and Economic Security,\" Feb. 8, 2013.", "EdWeek.org, \"Head Start Centers Feeling ‘Sequester’ Pain,\" May 14, 2013.", "NPR.org, \"Sequester Slams Head Start Programs,\" May 6, 2013.", "National Head Start Association, \"Sequestration Action Resources,\" accessed May 15, 2013.", "Franklin News-Post,\"Sequestration is hitting home,\" May 6, 2013.", "White House, \"Impact of March 1st Cuts on Middle Class Families, Jobs and Economic Security: Virginia,\" accessed May 15, 2013.", "New York Times, \"Stories of struggle and creativity as sequestration cuts hit home,\" May 5, 2013", "Email from Joron Moore Planter, public relations practitioner at Virginia Department of Social Services, May 16, 2013.", "Emails from Maxine McKinney, executive director at the Virginia Head Start Association, May 14 and 15, 2013.", "Interview with Jim Schuyler, executive director of the Virginia Community Action Partnership, May 21, 2013.", "Roanoke Times, \"TAP to see 4 percent funding cut from federal sequester,\" April 12, 2013.", "Roanoke Times, \"Spending cuts start to hit home in Southwest Virginia,\" March 15, 2013.", "Politico, \"Mark Warner blasts sequestration as `stupid,'\" Feb. 25, 2013.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]