["About this rating", "On 15 December 2017, junk science site NaturalNews.com published a screed comparing cell phone use to \"Big Tobacco\" and arguing the devices should be banned because the radiation they emit is making people insane. The post, written by repeat offender Mike Adams, manages to entwine bigotry and quackery by claiming cell phones cause brain damage that lead to the \"mental illness\" of belonging to the LGBT community:", "The bigger question here, however, is what I’m posing today: By ignoring the very real health risks of brain damage caused by cellphone radiation exposure, have we allowed an entire generation to become brain damaged? It’s hard to look at \"snowflakes\" today and not conclude they are mentally deranged lunatics.", "[...]", "As these videos demonstrate, a shocking number of today’s youthful people are nothing short of raging lunatics. This is especially evident in the LGBT / trans community, which is now expanding its “tolerance” acronyms to include men who enjoy having intercourse with the tailpipes of automobiles. Every freakish, deranged sexual deviancy is now claimed to be a “protected” victim group, and there’s no question the deranged Left will soon demand special protection for bestiality, pedophilia and those who engage in sexual acts with corpses. (Love wins! Um… dude, maybe that isn’t the kind of love you should be looking for…)", "There is no scientific evidence that the radio waves emitted from cell phones cause mental illness, and to say members of LGBT communities are lunatics or mentally ill is a bogus line of propaganda employed by hate groups. After maligning these already-marginalized groups, Adams takes the cop-out route by saying he's \"just raising the question here for future debate.\" (It's worth noting Adams linked to a web site that equated \"the Left's ATTACKS on white people\" with the Holocaust.)", "Research into the health effects of cell phone use has focused the risk of cancer, although no conclusive evidence that a link between cell phone use and cancer exists. Further, scientific research points to biology determining sexual orientation.", "According to the World Health Organization, there's no concrete evidence cell phones or towers produce and adverse health effects:", "Mobile phones allow people to be within reach at all times. These low-power radiowave devices transmit and receive signals from a network of fixed low power base stations. Each base station provides coverage to a given area. Depending on the number of calls being handled, base stations may be from only a few hundred metres apart in major cities to several kilometres apart in rural areas.", "Mobile phone base stations are usually mounted on the tops of buildings or on towers at heights of between 15 and 50 metres. The levels of transmissions from any particular base station are variable and depend on the number of calls and the callers' distance from the base station. Antennas emit a very narrow beam of radiowaves which spreads out almost parallel to the ground. Therefore, radiofrequency fields at ground level and in regions normally accessible to the public are many times below hazard levels. Guidelines would only be exceeded if a person were to approach to within a metre or two directly in front of the antennas. Until mobile phones became widely used, members of the public were mainly exposed to radiofrequency emissions from radio and TV stations. Even today, the phone towers themselves add little to our total exposure, as signal strengths in places of public access are normally similar to or lower than those from distant radio and TV stations.", "However, the user of a mobile phone is exposed to radiofrequency fields much higher than those found in the general environment. Mobile phones are operated very close to the head. Therefore, rather than looking at the heating effect across the whole body, the distribution of absorbed energy in the head of the user must be determined. From sophisticated computer modeling and measurements using models of heads, it appears that the energy absorbed from a mobile phone is not in excess of current guidelines.", "Concerns about other so-called non-thermal effects arising from exposure to mobile phone frequencies have also been raised. These include suggestions of subtle effects on cells that could have an effect on cancer development. Effects on electrically excitable tissues that may influence the function of the brain and nervous tissue have also been hypothesized. However, the overall evidence available to date does not suggest that the use of mobile phones has any detrimental effect on human health.", "According to the National Cancer Institute, \"Cell phones emit radiofrequency energy (radio waves), a form of non-ionizing radiation, from their antennas. Tissues nearest to the antenna can absorb this energy.\" But studies have not shown a definitive link to cancer, although research is ongoing. So far, the only consistent physical impact from cell phone usage is localized heating.", "Natural News regularly traffics in conspiracy theories and nonsense some may call alternative science. Per RationalWiki, Adams \"is a flat-out opponent of modern medicine,\" noting: \"If you cite NaturalNews on any matter whatsoever, you are almost certainly wrong.\" After a gunman opened fire on a crowd at a country music festival in Las Vegas on 1 October 2017, killing dozens, Adams helped spread the false rumor that there was a second shooter.", "In recent days Adams has taken time out from his apparent mission of bringing life expectancy back to Dark Age-levels to hawk anti-LGBT hate, fretting in an 8 January 2018 post that the \"LGBT mafia\" was \"indoctrinating\" children because primary school textbooks in California now include include the contributions of LGBT historical figures.", "World Health Organization. \"What Are Electromagnetic Fields?\"", "National Cancer Institute. \"Cell Phones and Cancer Risk.\"", "Scheeres, Julia. \"Mendocino, CA: Microwave Hot Seat.\"\r\n  Wired. 22 January 2002.", "Kim, Eun Kyung. \"This Town Lives Without Cellphones, Wi-Fi: Meet Green Bank, West Virginia.\"\r\n  Today.com. 29 January 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]