["In celebration of 60 years of Independence President Buhari made a number of claims in his address, we looked into these claims.", "President Muhammadu Buhari’s independence day speech included claims about Nigeria’s historical and current population, the legacy of military rule, reduced government revenue and oil prices in other countries.", "His claims about the country’s population at independence and today are correct, as is a claim about the years Nigeria has spent under military rule.", "But claims about reduced federal government revenue and a drop in oil prices are unproven, while a comparison of oil prices in Nigeria and Saudi Arabia is misleading.", "​​​​​​As Nigeria marked 60 years of independence on 1 October,  president Muhammadu Buhari gave a speech that occasionally looked to the past.", "At independence, Nigeria had a population of 45 million", "Nigeria’s population figures have historically been controversial, with resource allocation identified as a key reason for this.", "Gbolahan Oni is professor of demography and social statistics at Covenant University in southwestern Nigeria. He told Africa Check that only United Nations and World Bank population estimates should be relied on when looking at previous years.", "“These organisations have demographers who use scientific formulas to derive the population estimates, reducing the effect of overcounting and undercounting that occur in our census,” Oni said.", "Data from the World Bank and the UN’s department of economic and social affairs shows Nigeria’s population was 45.1 million in 1960.", "That estimate was specifically for 1 July 1960, three months before independence day, the UN department told Africa Check.", "Nigeria’s urban population at independence was approximately 7 million", "For the share of Nigeria’s population classified as urban in 1960, Dr Thomas Spoorenberg directed us to the latest estimate from the World Urbanization Prospects: The 2018 Revision.", "This was prepared by the UN’s department of economic and social affairs. Spoorenberg is the population affairs officer in the department’s population estimates and projection section.", "The report estimates Nigeria’s 1960 urban population at 6.96 million.", "Countries define urban in different ways, the UN’s population division says. Most – “nearly two thirds” – use an administrative definition “but almost all of them add an element such as population size, density, economic occupation or urban functions” to characterise urban areas.", "Denmark and Iceland, for example, define urban locals as only 200 inhabitants or more, while the Netherlands and Nigeria have a threshold of 20,000.", "‘Today, we grapple with multiple challenges with a population exceeding 200 million.’", "Buhari said that while Nigeria’s landmass, which he gave as 910,768 square kilometres, remained the same,  the population had grown to more than 200 million people. Nigeria’s last population census was in 2006, when the National Population Commission recorded 140.4 million people. Even that count faced controversy.", "Since then the population has been based on estimates, most recently 199 million in 2017, a figure from the National Bureau of Statistics. National media have reported that a new census is in the offing.", "The population commission currently estimates Nigeria’s population at 206.3 million, it was confirmed to Africa Check.", "As of 1 July 2020, the UN estimated that Nigeria was home to more than 206 million people. Its population division shared a graph of how the population has changed with time.", "Nigeria’s most recent official population estimate is from 2016, using 2006 census figures as a starting point. But while the UN has “used and considered” these official estimates up to 2016, Spoorenberg told us, details about the mortality, fertility and migration assumptions made were not available.", "Nigeria’s official national population figure for 2016 is higher than the UN’s population estimate by about 7.7 million, Spoorenberg said.", "The UN population unit said it had used several data sources, including the 2006 and previous population censuses, to inform its estimates about Nigeria. These go back to 1950.", "The most recent information used is the 2016/17 Multiple Indicator Cluster Survey, Spoorenberg said. This survey was not part of official estimates because the latter are population projections based on the 2006 census.", "The UN “reappraises every other year” the population estimates for all countries to take into account any new information. “A certain degree of uncertainty surrounds the size and structure of the population of Nigeria but given the demographic inertia a population cannot change overnight,” said Spoorenberg.", "“By mobilising fertility and mortality estimates from the most recent surveys, demographers can offer fairly accurate population estimates for Nigeria.”", "52% of Nigeria’s current population lives in urban areas", "The UN’s department of economic and social affairs estimates Nigeria’s 2020 urban population at 107.11 million.", "Another 99.04 million live in rural areas, for a total population estimate of 206.15 million.", "Based on these figures, 51.96% of Nigeria’s population lives in urban areas.", "Leo Sanni, statistical information officer at the National Bureau of Statistics, confirmed that in Nigeria an area is considered to be urban if it has a population of above 20,000. It also requires social infrastructure such as electricity, water supply and paved roads.", "The data also shows the country’s urbanisation rate has risen steadily from 15.4% in 1960 to 52% in 2020.", "‘For a cumulative 29 of our 60 years of existence as a nation, we have been under military rule.’", "Nigeria’s first experience of military rule started in 1966 with a coup, and lasted 13 years. In 1979, the country’s fourth military leader handed over power to an elected government.", "A second coup in 1983 brought on 16 more years of army rule, including Buhari’s regime from 1983 to 1985. Military rule ended in 1999. So the president is correct on this score.", "But how do these two forms of rule broadly compare?", "There isn’t much to choose between them, Silvanus Ebohon, professor of political science at the University of Benin in southern Nigeria, told Africa Check.", "“One can argue that there has been better freedom of speech and association under civil rule, but in terms of development, there is no real difference,” he said.", "Corruption was a common theme across both civilian and military rule, Ebohon said, describing the country’s political system as “dysfunctional”.", "Professor Kamilu Fage teaches political science at Bayero University in the northern Nigerian city of Kano. He was also of the view that politicians have not done any better than the military.", "“Democracy is better than military rule for the elements of accountability and free speech,” he told Africa Check.", "In his view, the Nigerian experience was that the military had done better than civilians in terms of governance, security and promoting national unity.", "Fage added that corruption had cut across both military and civilian rule.", "There has been a 60% drop in government revenue", "To justify increased petrol prices, Buhari said lower earnings from both internal and external sources had caused a sharp drop in government revenue.", "It is not clear what time frame he used, or if this was due to the pandemic, lower oil prices, or both. We have contacted the presidency for more information.", "He also did not specify whether he was referring to the total revenue going into the federal account, or just the revenue retained by the federal government after sharing with state and local governments. (For more on this, read our ‘Is Nigeria ‘officially broke’? fact-check published in August 2020.)", "Documents from the budget office show that in revising the 2020 budget, the gross oil and gas revenue target was pared back from N7.67 trillion to N3.03 trillion.", "But as of May, N1.99 trillion had been banked in the first five months of 2020, instead of the projected oil and gas revenue of N1.26 trillion. This is a 57.4% surplus.", "After official deductions, Nigeria’s net oil and gas earnings from January to May were N1.45 trillion – N575.66 billion or 66.1% more than what it expected to earn during that period.", "For non-oil revenue such as taxes, the country was projected to earn N4.81 trillion in 2020 after deductions, of which N2 trillion ought to have come in by May. But it only earned N1.25 trillion in the first five months, a 37.4% shortfall.", "These figures do not support the claim of a 60% drop in revenue relative to the revised budget, at least in the first five months of 2020. Nor do the 2021 budget proposals.", "In 2019, net oil revenue was short by 62.8% and net non-oil revenue by 11.9%, but the shortfall can’t be attributed to Covid-19. Without knowing for sure the period or factors considered by the president, we can only rate this claim as unproven.", "There was a 40% drop in oil prices", "Oil, Nigeria’s main export, accounts for 90% of foreign exchange and more than half of government revenue.", "The president’s speech was not clear on when the oil price dropped by 40%. The price has fallen at different rates in different periods.", "For example, from January to April 2020 monthly average prices dropped 73%, according to July 2020 data from the Nigerian National Petroleum Corporation. When daily prices are considered for the same period, a fall of up to 90% was recorded.", "And in the year to the president’s speech, from 1 October 2019, prices fell 36.5%. We have asked the presidency for clarification.", "Changes in oil prices do have a direct impact on foreign exchange, Ndem Ndiyo, an economics professor at the University of Calabar in southern Nigeria, told Africa Check.", "“The frequent fluctuations in oil price has continued to impact Nigeria’s economy because we have continued to depend largely on oil,” Ndiyo said. “When oil prices drop it affects government revenues which are used to service the economy. However, GDP does not fluctuate as frequently as oil prices.”", "‘It makes no sense for oil to be cheaper in Nigeria than in Saudi Arabia.’", "Nigeria’s recent increases in pump prices have been unpopular. In his speech, Buhari compared the new prices to those in other oil producing countries such as Chad, Niger and Ghana.", "“Further afield, Egypt charges N211 per litre. Saudi Arabia charges N168 per litre. It makes no sense for oil to be cheaper in Nigeria than in Saudi Arabia,” he said. The president gave the price in Nigeria as N168.", "GlobalPetrolPrices.com, a website that tracks the prices of petrol in more than 160 countries, gives different figures. They also fluctuate significantly but, broadly, Nigeria’s prices are lower than the countries he mentioned. (Note: The site doesn’t track Niger.)", "We’ve asked the presidency for more clarity on the comparison and will update this report with their response.", "But experts told Africa Check that it was not a straight comparison. “Prices of commodities such as petrol should not be compared in isolation,” said Olusegun Ajibola, a professor of monetary economics at Caleb University in Lagos.", "“For you to arrive at a reasonable conclusion you must also compare other prices, such as the cost of labour including salaries, interest rates, rent and the inflation rate,” he told us.", "“The true value of a currency is not its exchange rate but what it can buy. One pound might not be worth much in the streets of London but its naira equivalent can feed a whole family in a day in some parts of Nigeria.", "“My salary as a professor converted to the US dollar is not enough to pay a driver in New York. But I am living on it here. So purchasing power parity must be considered in comparisons like this.”", "Another economics professor, Christopher Ekong of the University of Uyo in southern Nigeria, agreed that purchasing power parity calculations should be applied when comparing Nigerian prices with those in Egypt and Saudi Arabia.", "But the comparison with neighbouring countries is more complicated.", "“Petrol is more expensive in neighbouring countries because much of the petrol imported for sale in Nigeria is smuggled to its neighbours and sold at a higher price,” Ekong said.", "Please complete this form to receive the HTML sharing code.", "We examine three claims in a Cape Talk interview with the National Sea Rescue Institute on world drowning prevention day.", "Covid has trained a spotlight on causes of death and how deaths are recorded across the world. We disentangle what paperwork has to be filed...", "In a widely listened-to podcast, the BBC made the startling claim that more than a million Africans die each year on the continent’s roads. ...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]