["The video was published on Facebook here on June 28, 2020. It has been viewed more than 220 times.", "The 30-second clip shows a man beating another man with a stick, while a third man looks on.", "The post’s caption reads: “#CPEC :Chinese Engineer in Karachi caught on video beating #Pakistani driver for submitting fake petrol bill. Engineer from Power China Gansu Energy Company came to #Pakistan under CPEC.”", "CPEC is an acronym for the China Pakistan Economic Corridor, a major energy and infrastructure investment project between the two countries.", "The video was also shared alongside a similar claim on Facebook here, here, here and here and on Twitter here and here.", "The claim is false.", "The same footage was published by The Star, a Malaysian newspaper, here on November 29, 2016. The report bears a Kuala Lumpur dateline and is headlined: “Police seek info on violent caning shown in viral video”.", "A closer analysis of the video reveals the men are speaking Malay, the official language of Malaysia. One of the men is seen wearing a shirt that features the logo of Global Bersih 5, a campaign for fair elections that was organised in Malaysia in 2016.", "The video also circulated in 2016 on Malaysian Facebook pages. The footage was published here in a post that has been viewed 490,000 times and shared 10,000 times.", "The Malay-language post translates to English as: “Let’s viral make this case explode!!! Think the country is lawless, whipping people happily??? #PDRM.”", "PDRM is an acronym for the Royal Malaysia Police.", "Below is a screenshot comparison of the video in the misleading Facebook post (L) and the 2016 video (R):", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]