["In Wales you cannot sit in the park on a bench.", "When the Facebook post the claim is from was shared the Welsh government said you shouldn’t spend a prolonged period on a park bench. This guidance has now changed slightly and says it’s okay to be out for a walk in a park and to stop to sit down so long as you spend most of the time out of the house exercising.", "In Wales you cannot drive to your place of exercise.", "This is correct as of 11 May.", "In Wales you can exercise near your home more than once a day if you wish but only with members of your household.", "This is correct as of 11 May.", "In Wales you cannot use your car to visit places other than shopping for essentials, helping someone who is shielding, or to work.", "These are some of the main reasonable excuses for leaving the house according to Welsh law as of 11 May. There is nothing to say you cannot use a car to do these things.", "A post on Facebook with over 10,000 shares makes a number of claims about lockdown rules in Wales. The post was shared after Boris Johnson’s televised address on Sunday 10 May.", "“It doesn't matter what Boris Johnson has just said, it DOES NOT apply to you in Wales. You CANNOT sit in the park on a bench , you CANNOT drive to your place of exercise. WALES stays the same as before for another 3 weeks. You must exercise near your home more than once a day if you so wish ONLY with members of your household. You must stay home unless absolutely necessary. Wales regulations are not permitting you to jump in your car to visit places other than shopping for essentials, helping someone who is shielding, or to work.”", "Facebook user, 10 May 2020", "It’s correct that Boris Johnson’s statement on easing lockdown applied to England only, and the Facebook post’s claims about what is allowed in Wales are partly correct at the time of writing.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "“You CANNOT sit in the park on a bench , you CANNOT drive to your place of exercise. WALES stays the same as before for another 3 weeks. You must exercise near your home more than once a day if you so wish ONLY with members of your household.”", "The Welsh guidance currently says: “Going for a walk and also stopping to have something to eat or sit in a park, for example, is intended to be permitted. Most of the time away from home should, however, be spent exercising.”", "When the Facebook post was first shared, on Sunday 10 May, the guidance for Wales was slightly different and said: “Going for a walk and then having a picnic or spending a prolonged period on a park bench, for example, is not considered to be exercise and is not intended to be a reasonable excuse.”", "The Welsh government has said that the lockdown in Wales will be extended for another three weeks with “minor adjustments”. These changes were that people could exercise more than once a day and that certain garden centres would be allowed to open.", "And it’s true that in Wales exercise must still start and end at home, so you cannot drive to a location to exercise, though there are exceptions for some people for whom this isn’t possible. On 8 May, the Welsh government announced that from Monday 11 May, people would be allowed to exercise more than once a day, but that “exercise should start and end at home and not involve going a significant distance from home.” This has not changed since lockdown in Wales began.", "Also, the post claims that in Wales you can exercise only with members of your household. This is correct. By comparison, in England, Boris Johnson has said that from Wednesday 13 May, people may “sit in the sun in your local park” and “drive to other destinations”. Further guidance published the day after his televised address said you can “sit and rest outside” and “drive to outdoor publicly accessible open spaces irrespective of distance”. It adds that the public should check whether these places are open before they travel.", "The guidance also clarified that you can also exercise or spend time outside with one person who is not in your household, as long as you stay two metres apart at all times.", "For England, from Wednesday 13 May, people may take unlimited amounts of outdoor exercise, with members of their household.", "The post also says: “Wales regulations are not permitting you to jump in your car to visit places other than shopping for essentials, helping someone who is shielding, or to work.”", "This is basically correct. The law in Wales, as in England, says you should not leave your home without a “reasonable excuse”. Shopping for essentials, helping the vulnerable and travelling to work are among the reasonable excuses listed, though there are other reasons given such as escaping the risk of harm. There’s nothing that says you can’t use a car to do these things.", "The Welsh government has specified that garden centres will be allowed to open from Monday 11 May, if they have social distancing measures in place, so you will presumably be allowed to drive to these as a customer if they are open.", "In England, from 13 May, the government says “Day trips to outdoor open space, in a private vehicle, are permitted”. It also adds you shouldn’t use a car with anyone who is not a member of your household.", "The Institute for Government says: “the UK government can only change the ‘lockdown’ regulations in England.”", "“The respective devolved governments are responsible for making any changes to the rules on social distancing in Scotland, Wales and Northern Ireland (for example, to allow for exercise more than once a day).”", "This article is part of our work fact checking potentially false pictures, videos and stories on Facebook. You can read more about this—and find out how to report Facebook content—here.\n\n        For the purposes of that scheme, we’ve rated this claim as true\n            because the rules on lockdown are slightly different for Wales, the claims in the post were basically correct when the post was shared and the situation has only changed slightly since then.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]