["About this rating", "Since American writer Margaret Wise Brown and Illustrator Clement Hurd published the children's book \"Goodnight Moon\" in 1947, people globally have recited the story of \"little rabbit\" observing the surroundings of his bedroom and then saying goodnight to supposedly notable items, including a \"cow jumping over the moon.\"", "Among readers of this roughly 30-page picture book, of course, were parents and caregivers. Some of them took to social media in recent years, however, to report an alleged finding of their repeated analysis of Brown and Hurd's work: The fictional rabbit supposedly spent 70 minutes preparing for sleep, based on two illustrated clocks in the character's bedroom.", "\"If you look at the clock on the mantle in 'Goodnight Moon', you can see an entire hour go by while the bunny bip bops not going to sleep,\" one reader tweeted.", "We obtained electronic illustrations of \"Goodnight Moon\" from publisher HarperCollins Publishers to investigate this claim and show our work.", "According to our analysis, page one was absent of any illustrations, reading in black text: \"In the great green room; There was a telephone; And a red balloon; And a picture of—\"", "Then, on page two (displayed below), readers saw the fictional rabbit's bedroom for the first time, including visualizations of an analog clock on a fireplace mantle (blue) and another on a nightstand (yellow).", "While the position of the hour hand on the mantle clock was not entirely discernible, the yellow clock showed a clear 7 p.m. For that reason, we considered 7 p.m. the rabbit's start time in his multi-step process of getting ready for bed.", "Four pages later, readers saw the blue clock on the mantle again. That time, it showed approximately 7:10 p.m.", "Then, after the narrator observed \"a comb and a brush and a bowl full of mush\" — as well as \"a quiet old lady who was whispering 'hush' — both clocks put the time at roughly 7:20 p.m.", "The next indication of time occurred three pages later, when the clocks showed 7:30 p.m. Based on that evidence, the fictional rabbit spent 10 minutes saying good night to the moon, cow jumping over the moon, light, red balloon, bears, and chairs.", "By about 7:40 p.m., per the mantle clock, the narrator had also said good night to two kittens, pairs of mittens, the clocks and socks.", "Add another ten minutes or so, and the main character had said good night to the house, mouse, comb, and brush, according to both clocks.", "Then, supposedly at 8 p.m., the \"old lady\" whispered \"hush.\"", "The yellow nightstand clock, shown on the accompanying page, also documented 8 p.m. for the time when \"the old lady\" apparently urged silence.", "Lastly, the concluding good night — \"good night noises everywhere\" — happened on the final page of the book, where the yellow clock showed roughly 8:10 p.m.", "Using screenshots of the book's illustrations for the mantle clock, which was shown more frequently than the nightstand clock, as well as GIPHY software, Snopes created the below-displayed visualization to see how time passed during the fictional tale.", "In sum, it was accurate to claim that illustrated clocks in \"Goodnight Moon\" documented 70 minutes of little rabbit, the story's main character, saying good night.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]