["About this rating", "Did U.S. President Donald Trump once admit to reading the book Mein Kampf and being an admirer of its author, Nazi dictator Adolf Hitler?", "Those were the central claims in an internet meme that began making the social media rounds in mid-April 2019, which purported to quote Trump's praising Hitler in a Time magazine interview published in 2002. We found instances of the meme's being shared on both Twitter and Facebook, including a popular Facebook page titled \"Joe P. Kennedy III for President 2020,\" which does not appear to be owned or operated by Kennedy himself:", "\"Reading Mein Kampf in college had a profound affect [sic] on me. Very, very interesting. Of course there were many problems in Germany at the time, they were losers, they lost. But Adolf Hitler, that is to say, I don't agree with everything he was saying at the time of course but I do respect him. As a leader. Tremendous respect. And I suppose you could say, I try to incorporate some of his teachings into everything I do to this day. In business, my daily life and my politics.\"\n   - Donald J. Trump\n     (Interview with Time Magazine, 2002)", "Not only were we unable to locate an original source for this quote, or evidence that Time magazine even interviewed Trump in 2002, but we found no discernible record of its existence before the meme first surfaced in April 2019. Yet it's the kind of statement that would have been quoted ad nauseum in the press had Trump said it. No such references exist.", "Nor were we able to find isolated instances of Trump praising Mein Kampf or Adolf Hitler in public statements. The cadence and grammar of the passage are Trump-like (\"... but I do respect him. As a leader. Tremendous respect.\"), but all indications point to its being fabricated.", "That said, Trump was quoted in 1990 as saying he had been given a copy of Mein Kampf by a friend — though it turned out he was mistaken about which of Hitler's books had been given to him.", "In their September 1990 issue, Vanity Fair ran a lengthy, unflattering profile of Trump written by Marie Brenner. The subject of Hitler came up in a decidedly strange passage about his alleged ownership of a book containing the Nazi dictator's speeches called My New Order:", "Donald Trump appears to take aspects of his German background seriously. John Walter works for the Trump Organization, and when he visits Donald in his office, Ivana told a friend, he clicks his heels and says, “Heil Hitler,” possibly as a family joke.", "Last April, perhaps in a surge of Czech nationalism, Ivana Trump told her lawyer Michael Kennedy that from time to time her husband reads a book of Hitler’s collected speeches, My New Order, which he keeps in a cabinet by his bed. Kennedy now guards a copy of My New Order in a closet at his office, as if it were a grenade. Hitler’s speeches, from his earliest days up through the Phony War of 1939, reveal his extraordinary ability as a master propagandist.", "“Did your cousin John give you the Hitler speeches?” I asked Trump.", "Trump hesitated. “Who told you that?”", "“I don’t remember,” I said.", "“Actually, it was my friend Marty Davis from Paramount who gave me a copy of Mein Kampf, and he’s a Jew.” (“I did give him a book about Hitler,” Marty Davis said. “But it was My New Order, Hitler’s speeches, not Mein Kampf. I thought he would find it interesting. I am his friend, but I’m not Jewish.”)", "Later, Trump returned to this subject. “If I had these speeches, and I am not saying that I do, I would never read them.”", "To recap, Trump's then-wife Ivana (from whom he was separated) told people he owned a book of Hitler's speeches and read from it occasionally; Trump said he was given a copy of Mein Kampf by a Jewish friend (who, in fact, was not Jewish and said the book was My New Order); then Trump refused to acknowledge whether he owned the book and said that if he did, he would never read it.", "In a subsequent television interview with Barbara Walters, Trump did acknowledge receiving a copy of My New Order, though he appeared to bristle at the implication that he admired Hitler's speeches:", "WALTERS: In the current issue of Vanity Fair, the author, Marie Brenner, says that you read from Hitler's collected speeches, My New Order, and that these are speeches that you seem to admire. What's your reaction? Do you have this book? Do you have these speeches?", "TRUMP: It is the most ridiculous thing I've ever heard. A friend of mine sent me a book. A man who I think is Jewish, although I don't know, sent me a book. It happened to be that book. All of a sudden Marie Brenner somehow found out that he had sent me a book. It is the most ridiculous thing I've seen, and I'm probably going to sue Vanity Fair over it.", "Trump later called the Vanity Fair article \"one of the worst ever written about me.\" In an infamous coda to the episode, Trump walked up behind Brenner at a public event and poured a glass of wine down her back (an incident both Trump and Brenner acknowledged happening).", "As the evidence stands, no strong case exists for the claim that Trump read or admired Hitler's Mein Kampf. A quote attributed to him in which he supposedly lauded Mein Kampf and its author was clearly fabricated. It appears, on the other hand, that Trump did (and perhaps still does) own a collection of Hitler's speeches that a friend presented to him as a gift. According to Vanity Fair, Ivana Trump told her lawyer that her husband kept the book near his bedside and occasionally read from it. Also according to Vanity Fair, however, Trump insisted he had never read it, nor would he.", "In a 2016 column for The New York Times, Maureen Dowd reported Trump's response to questions she asked about both books. \"I wondered about ex-wife Ivana telling her lawyer, according to Vanity Fair, that Trump kept a book of Hitler’s speeches by his bed,\" Dowd wrote. \"Or the talk in New York that in the ’90s he was reading Mein Kampf. Nein, he said. 'I never had the book,' he said. 'I never read the book. I don’t care about the book.'\"", "It's unclear which book he was referring to.", "Questions about what he read or didn't read aside, we have yet to stumble upon a verifiable instance of Trump expressing respect or admiration for Adolf Hitler. What we did find is that people (including some close to him) have been insinuating that Trump has an affinity for Hitler for the better part of 30 years, which in and of itself is interesting.", "Brenner, Marie.   \"After the Gold Rush.\"\r\n    Vanity Fair.   September 1990.", "Dowd, Maureen.   \"Will Trump Be Dumped?\"\r\n    The New York Times.   19 March 2016.", "Eckardt, Stephanie.   \"A Brief History of Donald Trump Spitefully Pouring Wine Down Women's Backs.\"\r\n    W.   14 November 2017.", "20/20.   \"Barbara Walters Interviews Donald Trump.\"\r\n    17 August 1990.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]