["About this rating", "On Dec. 28, 2019, a video supposedly showing a cow in Uganda with three large horns was widely circulated on social media:", "We were initially skeptical of this footage for a number of reasons.", "For starters, this video first went viral when it was shared by a cattle keeper in Uganda, but he wasn't the original source of the footage. Cattle keeper Frank Rubabinda Jr. (@RubabindaJR) told us that he first encountered the video on WhatsApp, but we have been unable to find that iteration of the footage, or any others, that predate the user's December post.", "Without the source video, it was difficult to glean details about where and when this video was shot, or with what intent it was originally shared. Instead, we had to base our judgement of this footage solely on what we could see, and to our eyes, this video looked a bit suspicious.", "For instance, around the six-second mark of the above-displayed video, as the middle horn passes over a tree in the background, it appears the superfluous horn changes texture and size and becomes briefly transparent. We slowed down that moment in the gif below:", "However, this wasn't definitive proof that the footage is fake. As we noted earlier, the tweet that went viral in December 2019 did not contain the original footage, and it appears some degradation in the quality of the video occurred since it was originally uploaded. The low quality of this footage might explain some of the odd artifacts.", "As it turns out, this is a genuine three-horned Ankole cow in Uganda. Rubanida Jr., with the help of NTV Uganda and the Ankole Cattle Breeders Society, were able to track down this animal. And on Jan. 23, 2020, they posted a second (and much clearer) video of this amazing animal:", "We've reached out to Rubanida Jr. and will update this article if we learn any more details about this cow.", "While this animal is certainly unusual, this isn't the first time a three-horned cow has been captured in video. In 2018, a video showing such a cow in Brazil went viral. In 2016, some photos showed a three-horned cow in India.", "https://www.youtube.com/watch?v=b4NgrIOIuq4&feature=emb_title", "Damarla, Prashanth.   \"Three Eyed and Three Horned Cow Found in India: Facts.\"\r\n    Hoax of Fact.   19 September 2016.", "Hooper, Ben.   \"Three-Horned Cow Caught on Video in Brazil.\"\r\n    UPI.   12 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]