["About this rating", "On 12 November 2016, the disreputable web site The Rightists published a hoax news article reporting that New York Times columnist David Brooks said that Donald Trump would 'resign, be impeached, or get assassinated' within the first six months of his presidency:", "From Brooks' column: \"Finally, it seems important to be humbled and taught by this horrific election result…Trump's bigotry, dishonesty and promise-breaking will have to be denounced. We can't go morally numb. But he needs to be replaced with a program that addresses the problems that fueled his assent. After all, the guy will probably resign or be impeached within a year.\"", "However, while commenting on his column in a subsequent interview with KYRQ Radio in New York City, Brooks said, \"Oh, and by the way – I forgot to mention 'assassinated.'\" The columnist then went on to say that \"the whole 'pen is mightier than the sword' philosophy might have worked if we were talking about Hillary Clinton, but when it comes to Donald Trump, you don't really need a pen, because he'll bury himself soon enough.\" \"At the rate he's going, I'm starting to wonder if he'll make it through the first six months, let alone an entire year,\" Brooks said.", "The Rightists is a \"hybrid\" web site that publishes stories containing a mixture of true and inaccurate information:", "This is HYBRID site of news and satire. part of our stories already happens, part, not yet. NOT all of our stories are true!", "In this case, it is true that Brooks wrote a column in which he stated that Trump would probably \"resign or be impeached within a year.\" However, the part where Brooks later went on a radio show and said that he forgot to mention \"assassinated\" is untrue.", "While The Rightists claimed that Brooks made his comments on the New York radio station KYRQ, no such station exists in New York, although there is a KYRQ in Natalia, Texas (and since New York is east of the Mississippi River, the call letters of any radio station there would begin with \"W,\" not \"K.\")", "Furthermore, this site is the only source for Brooks' alleged comments. If the New York Times columnist truly had made such inflammatory remarks, there would be more than one obscure web site reporting the story.", "The Rightists has previously published fake news stories claiming that Joe Biden called American women \"lazy,\" that Tim Kaine threatened to ban the Catholic Church from the United States, and that Hillary Clinton said that Donald Trump would make a great president during a 2013 speech.", "Brooks, David.   \"The View From Trump Tower.\"\r\n    New York Times.   11 November 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]