["The 6-minute video has been viewed more than 1.3 million times since it was posted on Facebook here on November 25, 2019.", "The footage was published with a Thai-language caption that claims the snake, which has a visibly bulged midsection, had swallowed a woman.", "Below is a screenshot of the misleading post:", "The post's caption translated to English reads in part:", "“One of the most horrifying news stories that happened a few days ago is the story of an Indonesian woman being swallowed by a 7-metre long boa.", "“Although this is a very rare event, it is considered to be the cause of human death. This is the second snake attack that has happened in Indonesia within a year.”", "But the claim is false; the snake seen in the video actually swallowed a wild boar.", "Reverse image searches on Yandex using video screenshots, and keyword searches on Google, found the same video was uploaded to YouTube here on June 7, 2019, where it has been viewed more than 2.4 million times.", "The video’s Indonesian-language caption translated to English reads: “Moment when a 7-metre long python bit a snake handler in Talo district of Seluma Regency - Bengkulu Province”", "“A 7-metre python was successfully caught by people of the Talo district of Seluma Regency, Bengkulu province. But unfortunately, the python that just swallowed a wild boar attacked its handler, leaving a bite wound on his right calf.", "“Lucky for him people who were watching helped the handler and they put the python in a box.”", "Below is a screenshot comparison of the video in the misleading post (L) and the YouTube video (R):", "AFP contacted the publisher of the YouTube video, Arya Gading, who confirmed that he had shot the video.", "“It is my video. I took it when I covered the incident in a village in Ilir Talo Ka district. You can check the publication date and who published it first,” Gading told AFP on November 27, 2019, through Facebook direct message.", "Gading also noted that the \"Arya Gading\" watermark visible in his YouTube video was blurred in the misleading Facebook post.", "Below is a screenshot of the blurred watermark (L) and the original watermark (R):", "Tribunnews.com, a Jarkarta-based news outlet, also reported this story, which is topped with a screenshot of the video, on August 15, 2019.", "Below is a screenshot of the article:", "The report's Indonesian-headline translated to English reads: “Snake Handlers in Bengkulu Bitten by a 7-metre Python After Swallowing a Wild Boar”.", "The location of where the incident happened can be found here on Google Maps:", "The misleading Facebook post is accurate to say that, although extremely rare, large snakes have killed and swallowed people in Indonesia.", "Here is an AFP report about a 54-year-old Indonesian woman who was swallowed by a giant python in June 2018.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]