["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Trump blamed a lack of \"proper Forest Management\" for California’s deadly wildfires in a tweet on Tuesday, repeating his overly simplistic claim about the cause of the infernos that have ravaged the state in recent years.", "Eighty-six people were killed and 14,000 homes destroyed in November when the Camp Fire tore through Northern California’s Butte County, making it the most deadly and destructive fire in state history.", "With better forest management, the fires \"would never happen,\" Trump asserted in his tweet.", "The president also repeated his threat to withhold billions of dollars in federal fire recovery money.", "\"Billions of dollars are sent to the State of California for Forest fires that, with proper Forest Management, would never happen. Unless they get their act together, which is unlikely, I have ordered FEMA to send no more money. It is a disgraceful situation in lives & money!\"", "We fact-checked a similar claim in a November Trump tweet and rated it False:", "\"There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor,\" Trump charged.", "We'll review the facts on what causes California's fires, and rate Trump's latest claim.", "Our research", "California’s firestorms aren’t caused by just one factor. Instead, climate change, forest management and urban sprawl all contribute, according to forestry, fire and climate experts.", "Thinning out forests, setting prescribed burns and clearing brush can help reduce the severity of fires. But California’s stronger winds, higher temperatures and drier conditions, all attributed to climate change, make fires worse. So does the fact that more people and power lines are now situated in forested areas, increasing the chances of sparking an inferno.", "\"It is a complex situation. Simple pronouncements on a subject like this are almost always in error,\" Keith Gilless, a UC Berkeley professor of forest economics and chairman of the California Board of Forestry and Fire Protection, told us in November.", "Additionally, Trump’s claim suggests the state controls most forest management decisions. In reality, California owns just 2 percent of forest land in the state while the federal government owns upwards of 60 percent.", "The rest is owned by private landowners, timber companies and Native American tribes.", "Responses to Trump’s tweet", "California Professional Firefighters President Brian Rice responded in a statement on Tuesday to Trump’s tweet:", "\"The president’s attempt to pin sole blame for California’s wildfire problems on the state’s forest management is flat wrong. While forest health can be a contributing factor in large fires, more than 60 percent of these forests are controlled by the federal government, not California. And yet, the federal government has cut $2 billion from the US Forest Service even as California has spent more on forest management.\"", "Meanwhile, GOP Rep. Doug LaMalfa, who represents Butte County where the Camp Fire destroyed 14,000 homes and killed 86 people in November, said he shares \"the President’s great frustration with California’s choking regulations from the stranglehold environmental groups have on the state,\" and the need for more forest management.", "The congressman added, however, \"the immediate problem for fire victims is the first need, and threats to FEMA funding are not helpful and will not solve the longer term forest management regulatory problems.\"", "Democratic Gov. Gavin Newsom criticized the president’s threat, saying on Twitter:", "\"Mr. President -- Just yesterday, @OregonGovBrown, (and Washington) @GovInslee, and I sent a letter asking the federal government to work with us in taking on these unprecedented wildfires. We have been put in office by the voters to get things done, not to play games with lives.\"", "Our ruling", "President Trump claimed California’s deadly wildfires \"would never happen\" with \"proper Forest Management.\"", "Experts on climate, forestry and firefighting all rejected a similar assertion by Trump in November, calling it overly simplistic. They said forest management is just one element, while climate change and urban sprawl are also key contributors.", "Trump has, once again, erroneously placed the blame on just one factor.", "We rate his latest claim False, as well.", "We rate the claim False.", "FALSE – The statement is not accurate.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "President Trump, tweet, Jan. 9, 2019", "Brian Rice, president, California Professional Firefighters, statement, Jan. 9, 2019", "California Gov. Gavin Newsom, tweet, Jan. 9, 2019", "PolitiFact California, Trump’s overly simplistic and false claim on California’s wildfires, Nov. 10, 2018", "Sacramento Bee, Camp Fire: Trump threatens to halt California FEMA wildfire relief again, Jan. 9, 2019", "Rep. Doug La Malfa, press release, Jan. 9, 2019", "California Legislative Analyst’s Office, Improving California’s Forest and Watershed Management, April 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]