["On Dec. 4, Harrison Deal, a campaign staffer for Sen. Kelly Loeffler, R-Ga., was killed in a crash in Pooler, Ga., according to police and news reports.", "Deal, 20, was also a former intern for Sen. David Perdue, R-Ga., and a close friend of Gov. Brian Kemp’s family. One of Kemp’s daughters has called Deal her best friend.", "Deal’s hometown newspaper, the Statesboro Herald, reported that Deal was killed after his vehicle was struck from behind on Interstate 16.", "But conspiracy theories are swirling on social media, alleging without any evidence that Deal was murdered. And some posts suggest that the man behind the killing is the president-elect.", "\"Did Joe Biden’s team just blow a kid up to threaten GA governor?\" one Facebook post asks, sharing a video that speculates the crash wasn’t an accident but caused by a car bomb because Kemp called on the Georgia secretary of state’s office to conduct a signature audit of ballots there.", "\"It looks like a drone dropped a bomb,\" the man in the video says about Deal’s car in the wake of what USA Today described a \"fiery three-vehicle crash.\"", "This Facebook post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A spokesperson for the Pooler Police Department did not immediately respond to a message PolitiFact left asking for more details about the incident.", "But the Statesboro Herald reported that the department’s public information officer, Lindsey Heintzman, said Deal’s car was struck from behind by a flatbed truck hauling black plastic tubing. The impact caused Deal’s vehicle to crash into a third vehicle and catch fire. Neither of the other drivers was seriously injured.", "Autopsy and accident reports are still pending, and police have not released the identities of the other drivers, according to the Herald.", "The paper quoted Heintzman as saying that the investigation \"could take weeks, even months, to complete.\"", "We found nothing to support the idea that Deal was murdered, or that Biden was involved in any way.", "Loeffler tweeted her condolences to Deal’s family, writing that it was \"with an extremely heart that we mourn the loss of Harrison Deal.\"", "\"Today we lose a member of our ‘Kemp Strong’ family and words cannot express how much Harrison Deal’s life, love, and support meant to us,\" said a statement from Kemp’s family. \"Our prayers are with the Deal Family — and countless others — as they mourn the tragic loss of Harrison.\"", "Deal’s obituary said that he died \"in a tragic motor vehicle accident\" while traveling to the Savannah airport for a campaign event with Vice President Mike Pence.", "We rated this Facebook post False.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Facebook post, Dec. 5, 2020", "Atlanta Journal-Constitution, Loeffler campaign staffer, 20, dies in South Georgia crash, Dec. 4, 2020", "Statesboro Herald, Body of county commissioner’s son to be brought back to Statesboro, Dec. 6, 2020", "Statesboro Herald, Few details released in fatal crash, Dec. 7, 2020", "USA Today, Sen. Loeffler campaign staffer killed in car wreck, Dec. 6, 2020", "New York Post, Daughter of Georgia Gov. Kemp mourns Loeffler aide, calls him her ‘best friend,’ Dec. 5, 2020", "CBS 46, Governor Kemp calls on GA SOS to conduct signature audit of ballots, Dec. 4, 2020", "Harrison Deal obituary, visited Dec. 8, 2020", "Kelly Loeffler tweet, Dec. 4, 2020", "Statement from the Kemp family on the passing of Harrison Deal, Dec. 4, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]