["A year into the coronavirus pandemic, which has now infected more than 24 million Americans and killed more than 400,000 others, a mass vaccine dispersal is underway in the U.S. Roughly 9.7 million people have received the first dose of the vaccine, while another 1.3 million are fully vaccinated.", "Health officials are working to increase trust in the vaccine, with prominent officials, including President Joe Biden, receiving the vaccine publicly.", "According to the nation's leading infectious disease expert, Dr. Anthony Fauci, as many as 90% of Americans would need to get vaccinated to reach herd immunity, allowing the country to return to some sense of normalcy.", "Yet social media is flooded with false claims about the safety and efficacy of the coronavirus vaccine.", "One Facebook post from the satire account Detox, AntiVax and Woo Insanity, includes a screenshot from another account of a COVID-19 vaccine \"warning label\" with claims about side effects, ingredients and potential death.", "The satire page was founded by a survivor of polio who was \"alarmed by the meteoric rise of vaccine disinformation on Facebook, and decided it was time to join the fray on the side of science.\"", "The account pokes fun at the label, but the screenshot shows it was originally posted by an account that appeared to take it seriously. The screenshot was submitted to the parody page by one of its followers.", "\"When we point out how utterly ridiculous the information shared by the anti-science community is and share a good laugh at it, we’re taking away the power disinformation can have when shared on social media,\" a representative of the page said.", "The post has also been shared seriously by other Facebook users, like this one shared on Oct. 29, before the first vaccine was given emergency FDA approval. That user has not responded to USA TODAY's request for comment.", "The \"warning label\" contains various claims about the development, side effects and risk of the COVID-19 vaccine, with the ultimate warning that it may kill recipients — and vaccine makers are not accountable.", "Let's break them down.", "The first claim, that \"COV-19 Vax clinical trials have caused brain damage, paralysis, & many illnesses in previously healthy volunteers,\" does not come with any sourcing or evidence. The U.S. Food and Drug Administration's emergency authorization review of Pfizer and Moderna's vaccines details common minor adverse reactions — injection site pain, fatigue, headaches, muscle pain, joint pain and chills — which are side effects typically shared post-vaccination with any vaccine.", "Serious adverse events, or SAEs, did occur in the Moderna trial but not frequently enough to be considered causally related, the FDA concluded. Among 30,000 human participants, the most common events were heart attack (0.03%), inflammation of the gallbladder (0.02%) and kidney stones (0.02%). It is worth noting, SAEs were \"numerically higher\" in the placebo group compared to the vaccine arm, the common ones being COVID-19 infection (0.1%), pneumonia (0.05%) and pulmonary embolism, or blockage in the blood vessels of the lungs (0.03%).", "In the Pfizer trial of over 43,000 participants, nonfatal SAEs occurred about the same rate in the vaccine and placebo group, at 0.06% and 0.05%. Appendicitis (0.04%), acute myocardial infarction, or heart attack (0.02%) and stroke (0.02%) were common among the vaccine group; pneumonia (0.03%), irregular heartbeat (0.02%) and temporary loss of consciousness (0.02%) were more common among the placebo group. Particularly with the cases of appendicitis, the study's investigators concluded the illnesses did not occur any more frequently than expected in a population; the FDA concurred.", "And while there were eight combined cases of Bell's palsy, a neurological condition of unknown etiology that results in facial paralysis or weakness, among Moderna and Pfizer participants (seven in vaccine group and one placebo), these cases resolved on their own. Just as with the other SAEs, Bell's palsy, which affects about 40,000 people in the U.S. per year, was not deemed vaccine-related.", "Ruling: FALSE. Side effects of brain damage and paralysis were not mentioned in the FDA's review of Pfizer and Moderna's COVID-19 vaccines. Minor adverse effects did occur. Other serious adverse effects, like heart attack, kidney stones, appendicitis or Bell's palsy, did not occur at a frequency that would indicate they were caused by the vaccine.", "The post again does not cite a source or evidence but claims that \"COV-19 Vax uses new experimental technology never before used on humans. Some contain nano chips which can electronically track recipients.\"", "The claim that coronavirus vaccines are actually a cover to track recipients is a common conspiracy theory that fact checkers have debunked.", "It is unclear what the post means by \"new experimental technology never before used on humans.\" Vaccines have existed since the creation of the smallpox vaccine in the late 18th century and even further back. The technology used by Moderna and Pfizer using messenger RNA as a vaccine delivery system was first proposed in in the early '90s and developed over the last 30 years.", "Ruling: FALSE. Despite the prevalence of this conspiracy theory, the vaccine does not contain tracking devices. The vaccine technology used by Pfizer and Moderna for their COVID-19 vaccines is not experimental and has been in development for the last 30 years.", "Without citing a source, the post claimed that \"no independent scientific monitoring has been carried out,\" and that \"No double-blind randomized placebo controlled study has ever been done to test the efficacy or safety of this vaccine.\"", "While the coronavirus vaccines were developed more quickly than any others in the past — due to previous SARS research, global collaboration, accelerated manufacturing as well as extreme need — the same protocols required for the approval of any vaccine were applied.", "More:Fact check: The vaccine for COVID-19 has been nearly 20 years in the making", "The process of research and development for any drug or therapy, vaccines included, entails many phases: exploratory stage, pre-clinical stage, clinical development, regulatory review and approval, manufacturing and quality control. Scientific monitoring is baked in at every step with clinical trial monitors, who ensure the trials are following good clinical practices such as properly recording data and reporting adverse events, and data and safety monitoring boards, or DSMBs.", "These independent bodies are made up of outside experts who monitor participant safety and efficacy while the clinical trial is underway. If something about the study does not sit right, DSMBs have the power to halt it altogether.", "According to Kaiser Health News, there is usually one DSMB for every product but for the COVID-19 vaccine with its many manufacturers and clinical trials, \"a joint DSMB with 10 to 15 experts,\" consisting of scientists and statistical experts from the National Institute of Allergy and Disease and the National Institute of Health, \"will review unblinded data across trials for multiple coronavirus vaccines whose development the U.S. government has helped fund.\"", "The \"double-blind randomized placebo controlled study\" that the post mentions is a type of study in which neither the participants nor the experimenters know who is receiving treatment, in this case the coronavirus vaccine. Contrary to the post's claim, this double-blind format was used to test the efficacy of coronavirus vaccine candidates. Moderna and Pfizer both used this double-blind format in their trials.", "Following months of research and trials, the U.S. Food and Drug Administration approved two vaccines — from Pfizer/BioNTech and Moderna — for emergency use authorization. Other vaccines are still in various levels of the approval process.", "Ruling: FALSE. COVID-19 vaccine developers and institutions followed the same protocols required for any vaccine, including using drug and safety monitoring boards and double-blind studies.", "The post wraps up with the claim that the vaccine \"may kill you\" and that vaccine makers \"cannot be held liable for any harm or deaths caused.\"", "While there have been deaths post-vaccination among older individuals reported in Norway and Germany, those have been ruled out as age-related, not connected to the COVID-19 vaccine. The report earlier this month of a Florida physician who died from a brain hemorrhage 16 days after receiving the Pfizer vaccine is under investigation.", "\"We are actively investigating this case, but we don't believe at this time that there is any direct connection to the vaccine,\" said a Pfizer spokesperson to CBS Florida affiliate CBS12.", "The Florida Department of Health stated it would be involved in the investigation as well.", "\"The CDC and FDA are responsible for reviewing COVID-19 vaccine safety data and presenting that information for federal recommendations on vaccine administration,\" communications director Jason Mahon said in an email to USA TODAY. \"The state will continue to provide all available information to the CDC as they lead this investigation.\"", "Of course, this meme was created in October, long before any adverse reactions to the vaccines would've been known.", "When it comes to liability, compensation for vaccine-related injuries has been around since the passage of the National Childhood Vaccine Injury Act in October 1986 which became fully operational in 1988 with the establishment of the National Vaccine Injury Compensation Program. Since then, the program has paid out approximately $4.5 billion for almost 8,000 vaccine injury cases, although only a few hundred of those involved death.", "Compensation for any COVID-19-related vaccine injury is possible but is not handled by the NVICP, the Health Resources and Services Administration states. In early 2020, U.S. Department of Health and Human Services Secretary Alex Azar invoked the Public Readiness and Emergency Preparedness Act, enacted in 2005 as means to provide immunity to individuals or organizations involved in manufacturing, distributing or dispensing much needed medical supplies or countermeasures. This has meant the exclusion of the COVID-19 vaccine but its inclusion in a different program: the Countermeasures Injury Compensation Program.", "There are significant differences between the NVICP and CICP. Compensation under the CICP is \"for only the most serious injuries, has a higher burden of proof than the (N)VICP, has a 1-year statue of limitations after the date of vaccination, and limits awards for damages,\" the New England Journal of Medicine reports.", "\"As a result, people who are vaccinated during the declared public health emergency will be less likely to obtain compensation for injuries associated with COVID-19 vaccines than they would be for injuries from vaccines included in the VICP. Furthermore, the process for pursuing compensation will be lengthier, more difficult, and more expensive because reimbursement for attorneys' fees is unavailable. People vaccinated during a declared public health emergency can never pursue injury claims under the VICP, even if their symptoms manifest or are linked to the vaccine after the declaration is lifted,\" NEJM further adds.", "Ruling: PARTLY FALSE. There have been deaths following the COVID-19 vaccines reported in Norway and Germany among the older population and ruled unrelated to the vaccine itself. The death of a Florida physician earlier this month after receiving the Pfizer-BioNTech vaccine is under investigation but is believed not likely due to the vaccine, according to Pfizer. Compensation for vaccine-related injury has existed since the late '80s through the National Vaccine Injury Compensation Program but due to the PREP Act invoked in early 2020, any COVID-19 vaccine injuries go through the Countermeasures Injury Compensation Program instead. The CICP is noted to be less generous and accessible compared to the NVICP.", "The claims in the post are a mixture of false and partly false, with falsehoods dominating. While one of the pages that posted the claims acknowledges it was intended to mock the original sharing of the falsehoods, the fake vaccine label has been shared seriously by other users. Overall we rate the post as FALSE, based on our research.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]