["Is there a link between police killing people during routine patrols and the sheer number of police departments in the country?", "Former Philadelphia Police Commissioner Charles Ramsey argued that there is.", "A traffic stop for a broken taillight in Falcon Heights, Minn., left Philando Castile dead. Falcon Heights only has about 5,500 residents and contracts its police service from the not much larger city of St. Anthony, population about 8,500.", "Ramsey, co-chair of a recent presidential policing task force, teased out the connections between law enforcement and race with Meet the Press host Chuck Todd on July 10, 2016.", "Todd said major urban police departments have been taking steps to ease racial tensions and asked Ramsey if the smaller departments had the same kind of resources. Ramsey painted a picture that went well beyond core funding.", "\"There are approximately 18,000 departments in the United States,\" Ramsey said. \"I would try to cut the number in half in the next 10 years or so, because you're always going to have these kinds of issues as long as you have this many departments with different policies, procedures, training and the like.\"", "The numbers back Ramsey up on the number of departments. The final report from the task force he led said there are 17,985 U.S. police agencies.", "But that includes everything from college campus patrols, to sheriffs, to local police, to federal agents. For strictly local law enforcement, police and sheriff departments with armed officers, the total is closer to 15,400, according to the latest report from the Bureau of Justice Statistics.", "Those are the kinds of departments involved in some of the more prominent deadly encounters with police in the past few years.", "Still, 15,400 is a big number, and half of those departments have fewer than 10 officers.", "These smaller units face some real challenges.", "David Weisburd, executive director of the Center for Evidence-based Crime Policy at George Mason University, said while some do fine work, the quality ranges widely.", "\"There is little consistency in training or procedures across them,\" Weisburd said. \"There are many departments that simply poorly train and lead their officers.\"", "Turnover is a common complaint. The police chief in Canon City, Colo., wrote in a 2013 article that the combination of rising suburban crime and limited budgets meant \"agency personnel are stretched in many cases beyond the breaking point, making retention of quality personnel increasingly challenging.\"", "The biggest urban agencies demand more education for their officers. About 30 percent of the very largest departments require at least a two-year college degree. In the smallest communities, only 10 percent do.", "The shooting death of Michael Brown in Ferguson, Mo., produced a scathing report on the dangers that come when each small town boasts its own police department. Community leaders invited the Police Executive Research Forum, a leading national policy group, to take a look at the issues with the policing system across the wider St. Louis area.", "The report said fragmentation led to unprofessionalism and widespread mistrust of the police. About a third of the departments served territories of less than one square mile. Inefficiency was rife, and \"just one-quarter of the police departments in St. Louis City and County are accredited by the Commission on Accreditation for Law Enforcement Agencies.\"", "The task force Ramsey co-chaired highlighted the testimony of criminologist Lawrence Sherman, who said \"so many problems of organizational quality control are made worse by the tiny size of most local police agencies.\"", "Our ruling", "Ramsey said that the country has about 18,000 departments that conduct some sort of policing. In the broadest sense, that is accurate. If you include every college campus security department, tribal land unit, sheriff office, local police department, state police, and every federal agency, you get to 17,985.", "In terms of the most common local law enforcement agencies, that is sheriff and local police departments, the number is about 15,400. These are the ones where the issue of deadly encounters between police and citizens is front and center.", "Ramsey was making the case that when it comes to policing, small often is not beautiful, and plenty of evidence backs that up. But for the problem facing the country, the smaller number is most applicable.", "We rate his statement Mostly True.", "NBC News, Meet the Press, July 10, 2016", "President’s Task Force on 21st Century Policing, Final report, May 2015", "Bureau of Justice Statistics, Local Police Departments, 2013: Personnel, Policies, and Practices, May 2015", "Police Chief, Transforming Underperforming Smaller Police Agencies into High-Performance Organizations, April 2013", "Police Executive Research Forum, Overcoming the Challenges and Creating a Regional Approach to Policing in St. Louis City and County, April 30, 2015", "Police Executive Research Forum, Re-Engineering Training On Police Use of Force, August 2015", "Federal Bureau of Investigation, Uniform Crime Reports, 2015", "USA Today, Lack of training, standards mean big problems for small police departments, June 23, 2015", "Email interview, David Weisburd, executive director, Center for Evidence-based Crime Policy, George Mason University, July 10, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]