["Asylum seekers in the UK get somewhere to live, a cash allowance or both.", "Correct, but only if they are “homeless or don’t have money to buy food”.", "Asylum seekers in the UK can choose whether they want a flat, house, hostel or bed and breakfast.", "Incorrect. The government specifies that those eligible for support can’t choose where they live and may be placed in any of these types of housing. They are only eligible if they are homeless or don’t have money to buy food.", "Asylum seekers get £37.75 for every person in their household, loaded onto a debit card each week.", "If asylum seekers are homeless or don’t have money to buy food, they can apply for asylum support, which can include a cash allowance of this amount.", "If an asylum seeker is refused asylum, they get somewhere to live and £35.39 per person on a payment card.", "Correct, if they are homeless, unable to buy food and there’s a reason they can’t leave the UK yet. They can only get the payment card if they take the offer of somewhere to live.", "Asylum seekers may see a doctor or get hospital treatment for free, and free prescriptions for medicine, free eye tests and free glasses.", "Asylum seekers aren’t charged for GP visits, hospital treatment, or prescriptions. They may be eligible for free eye tests and vouchers for glasses.", "Asylum seekers are offered a £300 maternity payment for having a baby.", "Correct.", "Asylum seekers are often here illegally.", "It is legal to apply for asylum in the UK. You can’t be penalised if applying for asylum if you entered or are in the country illegally.", "In March 2018 close to 50,000 people were in receipt of these kind of benefits.", "Correct, 46,700 were in receipt of either asylum support or were failed asylum seekers receiving support because they were destitute. More recent figures show that total was around 47,500 in September 2018.", "“Let me tell you what you’ll get if you’re an asylum seeker in the UK…”", "Katie Hopkins, 4 January 2019", "Commentator Katie Hopkins has made several claims about the financial support asylum seekers can receive in a video which has now been shared over 30,000 times. Several of our readers have asked us to check it.", "To be eligible for asylum in the UK, you must be unable to live safely in your country out of fear of persecution because of characteristics like race, religion or political opinions that put you at risk there. Asylum seekers are those who are waiting for a decision on their asylum application. If asylum is granted, they get refugee status.", "Katie Hopkins makes claims about the financial support asylum seekers can apply for while they wait for a decision, and while most of these are broadly correct, one important thing is left out: only those who are destitute qualify for almost all of the financial support mentioned. Also, asylum seekers getting living support can’t choose the type of accommodation they get.", "“Let me tell you what you’ll get if you’re an asylum seeker in the UK, whether you’re actually an asylum seeker or whether you were perfectly safe in France for example...”", "A potential asylum seeker who didn’t make an application in France can make an application in the UK, no matter the legality of their route, or how safe France may or may not be for them. However, if there’s evidence they’ve passed through an EU country, they may be returned there under EU law.", "We’ve looked at that claim here.", "“You’ll get somewhere to live, a cash allowance or both.”", "Asylum seekers in the UK can apply for financial support, a place to live, or both, but only if they are “homeless or don’t have money to buy food”. In almost all circumstances, asylum seekers cannot work while their application is being considered.", "The government says decisions on straightforward claims are usually made “within six months”, but if it takes longer than 12 it is possible to apply for permission to work while the application is processed.", "“You can choose whether you want a flat, a house, a hostel or bed and breakfast.”", "This is not correct. If an asylum seeker qualifies for asylum support, the government says the place they are given to live “could be in a flat, house, hostel or bed and breakfast”. The government specifies that people “can’t choose where” they’ll live, and accommodation is unlikely to be in London or south-east England.", "“Cash support, you’ll get £37.75 for every person in your household, to help you pay for things like food, clothing and toiletries… Your allowance will be loaded onto a debit card each week.”", "That’s the correct amount, but to qualify for this support, asylum seekers must be homeless or not able to afford food. £37.75 per person in each household is loaded onto a debit card each week. They may also get extra money (between £3 and £5 per week) if they are expecting a baby or have a child under the age of three.", "Asylum seekers cannot work or claim other types of benefits while they’re waiting for the decision on their application.", "“And even if you’ve been refused… you’ll be given somewhere to live and £35.39 per person on a payment card.”", "If someone is refused asylum, they may be eligible for somewhere to live, and £35.39 per person on a payment card. They cannot take the payment card unless they take the offer of somewhere to live.", "This is only for people whose asylum applications have been refused and their appeals rights are exhausted. Again, to be eligible, they must be homeless, not have money for food, and “can show that there’s a reason why [they] can’t leave the UK yet”.", "Failed asylum seekers haven’t necessarily made bogus applications, their circumstances may not have met the specific criteria the UK government has for making its decisions. Even if asylum is refused, the government may grant someone permission to stay for humanitarian or other reasons.", "“And then we go on to tell them, you may get free National Health Service such as to see a doctor or to get hospital treatment, you’ll get free prescriptions for medicine, free eye tests, free glasses.”", "All asylum seekers and their dependents (and refused asylum seekers) in England, Wales, Scotland and Northern Ireland are exempt from charges for GP treatment and consultations, whether or not they are receiving the asylum support described above.", "In England, Wales, Scotland and Northern Ireland, asylum seekers are exempt from charges for hospital treatment. In England, where there are prescription charges, asylum seekers are usually exempt from these. For Great Britain, the government says asylum seekers may receive “help paying for glasses”, rather than free glasses.", "The rules are more complicated for refused asylum seekers.", "All refused asylum seekers can receive free GP treatment, and in Scotland, Wales and Northern Ireland they can get free secondary healthcare—like hospital treatment—too. In England, only failed asylum seekers who are receiving some type of asylum support can get free secondary healthcare.", "In the UK, there are certain services like A&E treatment, family planning and treatment for infectious diseases that are free for anyone, regardless of immigration or asylum status.", "“Have you been offered £300 maternity payment just because you’re having a baby?”", "Asylum seekers on asylum support can apply for a one-off £300 maternity payment if their baby is due in less than eight weeks, or less than six weeks old. If someone has been refused asylum they can apply for a similar £250 payment.", "Separate to asylum support, it’s worth noting that UK residents in England, Wales and Northern Ireland (who are expecting their first child, or a multiple birth, and they or their partner are receiving certain benefits) can apply for the Sure Start Maternity Grant—a one-off payment of £500. Similar payments of up to £600 are available in Scotland.", "“These are people who are here often illegally and this is what we promise them.”", "It is legal to apply for asylum in the UK, and this can only be done once someone arrives in the UK. This country is a signatory of the 1951 UN Refugee Convention, so is supposed to grant asylum to those who are unable to live safely in their own country because of a well-founded fear of persecution there.", "The video was posted at the same time as reports about people crossing the English Channel in small boats made headlines. Although getting to the UK in this way is not legal, potential asylum seekers can’t be penalised for how they get into the country if it’s to make a legitimate claim for asylum. The UN Refugee Convention says refugees can’t be penalised for illegal entry or presence in a country “provided they present themselves without delay to the authorities and show good cause for their illegal entry or presence”.", "“In March 2018 close to 50,000 people were in receipt of these kind of benefits.”", "This is correct, around 46,700 were in receipt of either asylum support (the vast majority) or were failed asylum seekers receiving support because they were destitute. More recent figures for the end of September 2018 show around 47,500 were receiving support—43,400 were asylum seekers, and around 4,100 were failed asylum seekers.", "The figure for asylum support is much lower than it used to be. At the end of 2003, over 80,000 people were receiving asylum support.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]