["People look from a pedestrian bridge, Monday, Dec. 28, 2020, to view the area several blocks away where an explosion took place Christmas Day in Nashville, Tenn. (AP)", "There is no evidence to suggest that the Dec. 25 explosion was election-related. Both companies have denied the posts’ claims, saying that there was no such audit and that Dominion’s machines were not recently transported to Nashville, Tenn.", "In the wake of the Christmas morning explosion in Nashville, Tenn., a baseless conspiracy theory started circulating online that claims Nashville’s downtown AT&T complex, which was damaged in the blast, had gotten a contract to conduct a \"forensic audit\" on Dominion Voting Systems machines. The post implies that the bombing was an attempt to stop the audit and cover up voter fraud.", "\"AT&T got a contract to do forensic audit on Dominion voting machines and those machines were being moved to Nashville this past week,\" one Dec. 27 post says. \"So, the explosion ‘just happened’ to be at the AT&T location where they ‘just so happen’ to control the cooling system for the super computer and house the dominion voting machines and drives for forensic audit…\"", "\"Wait, the bombing in Nashville was at the AT&T data center right after they got the contract to audit the Dominion voting machines?,\" one from Dec. 26 reads. \"That’s an interesting coincidence.\"", "But none of this is true. AT&T does not hold a contract to audit Dominion’s software or machines and did not have any of the company’s equipment in its Nashville building.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The FBI confirmed that a man named Anthony Warner was responsible for the bombing and was killed in the blast. The bomb was located in a recreational vehicle owned by Warner.", "The explosion injured three other people and damaged businesses in downtown Nashville, including an AT&T switching center, which resulted in widespread communications outages.", "Law enforcement authorities have suggested that Warner may have been paranoid about 5G technology, a QAnon-related conspiracy theory that makes an array of unproven claims including that it helps spread COVID-19 and is used as a spying tool by the government.", "Spokespeople for both AT&T and Dominion have confirmed that AT&T did not hold a contract to audit Dominion, nor had any of Dominion’s equipment been moved to Nashville in preparation for such an audit.", "Jim Greer, associate vice president for corporate communications at AT&T, was blunt in an email response to PolitiFact: \"That is not true,\" he wrote.", "Dominion representatives have also denounced the conspiracy theory, calling it another \"bizarre lie\" with \"zero credibility.\"", "Some posts take the claim a step further, alleging that the former owner of the building was a board member of a firm that owns Dominion.", "However, the firm cited in that version of the claim — Cerberus Capital Management — doesn’t own Dominion nor is it connected to Staple Street Capital, which acquired Dominion in 2018.", "A public relations firm told the Associated Press on behalf of Dominion that the company \"has no connection to AT&T, the building, Nashville, family members of the Bidens or the Clintons, and Staple Street is not owned by Cerberus. These are conspiracies manufactured out of whole cloth.\"", "In an email to PolitiFact, a Dominion spokesperson said the company and AT&T are calling on everyone to reject these baseless rumors: \"Americans should continue to seek information from verifiable, trusted sources, such as law enforcement authorities.\"", "Posts online claim that the Christmas Day bombing in Nashville was an attempt to cover up election fraud because AT&T was conducting an audit of Dominion Voting Systems machines and that the equipment was recently relocated to the company’s building that was damaged in the blast.", "This is bogus. There is no evidence that suggests that the explosion was election-related. Both companies have denied the posts claims, saying that there was no such audit and that Dominion’s machines were not recently transported to Nashville.", "Pants on Fire!", "Facebook post, Dec. 27, 2020", "Email interview, Jim Greer, associate vice president for corporate communications at AT&T, Dec. 29, 2020", "Email interview, Dominion Voting Systems spokesperson, Dec. 29, 2020", "Dominion Voting Systems Acquired by its Management Team and Staple Street Capital, July 16, 2018", "New York Times, Nashville Explosion: What to Know, Dec. 26, 2020", "AFP Fact Check, Conspiracy theory links false claim of AT&T election audit to bombing, Dec. 28, 2020", "Associated Press, AT&T not conducting voting machine audit near Nashville explosion site, Dec. 28, 2020", "Reuters, Fact check: Debunking conspiracy links between Nashville explosion, Dominion and AT&T, Dec. 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]