["About this rating", "It's standard operating procedure during a U.S. presidential election year for the duly nominated candidate of each party to receive one or more national security briefings after the close of the Republican and Democratic conventions. On 29 July 2016, the day after the Democratic National Convention wrapped up in Philadelphia, the mainstream media reported that Hillary Clinton and Donald Trump would receive their first such briefings as early as the following week.", "The briefings aren't as detailed as those a sitting president gets, the Washington Post reported, nor is the information shared in them deeply sensitive, nor, in fact, are the briefings even required, according to historian Michael Beschloss.  They began under the Truman administration in 1952 and are provided strictly as a courtesy to the candidates.", "One respect in which the 2016 campaign differs from others in recent memory is the fact that there have been calls from some in both political parties to deny the other's candidate access to secret intelligence on the grounds that they can't be trusted — Clinton because classified information was found on her private e-mail server and Trump because he publicly called for President Vladimir Putin of Russia — albeit jokingly, Trump later said — to spy on Clinton's e-mail traffic.", "As if made to order, a flap erupted on 29 July when Trump gave a speech in Colorado Springs in which he reiterated a familiar complaint about NATO member nations not contributing their fair share to pay defense costs, this time expressing displeasure that \"We pay rent for our base in Saudi Arabia.\"", "As noted by The Guardian and others in reporting on the speech, the U.S. closed its main military base in Saudi Arabia in 2003.  (Also, Saudi Arabia is not a member of the North Atlantic Treaty Organization.)", "Talk of Trump revealing classified information at that moment appears to have originated via Twitter with this exchange initiated by journalist Ben Jacobs:", "Trump is now complaining \"we pay rent for our base to Saudi Arabia\"", "— Ben Jacobs (@Bencjacobs) July 29, 2016", "@yarotrof @Bencjacobs why? Wouldn't that violate his 1st Amendment rights? What statute do you think applies here?", "— Dan Mangan (@_DanMangan) July 29, 2016", "@_DanMangan @yarotrof @Bencjacobs If he signed the secrecy agreement already as part of getting the briefing, he could be prosecuted.", "— Bradley P. Moss, Esq (@BradMossEsq) July 30, 2016", "A short time later, Jameson Parker posted an article on IfYouOnlyNews.com entitled \"Trump May Have Leaked Classified Info on His First Day Getting Intelligence Briefings.\" Parker wrote:", "If America does still have a base in Saudi Arabia it was a site not meant to be made public. The consequences of having that exposed could quite have massive consequences for America’s role in the Middle East.", "There are two possibilities here: Either Donald Trump is so woefully out of touch with American foreign policy that he thinks a base that closed down 13 years ago is still open – or he just leaked a staggering nugget of classified information. Should it come to light that there is indeed a secret base in Saudi Arabia, you can forget about homebrew servers – Trump just committed a massive crime.", "Reverb Press followed suit, making essentially the same case. That article was tweeted, retweeted, and ultimately reposted on Daily Kos, Democratic Underground and other left-leaning sites, none of which appeared too concerned (at least initially) that what they were repeating was purely speculative; it was also false.", "Consider this: Nowhere has it been reported that Donald Trump actually had an intelligence briefing before he gave the speech in Colorado Springs. In fact, he gave that speech on the same day the Washington Post reported that candidate briefings could take place \"perhaps as early as next week.\"", "Moreover, Trump's complaint about Saudi Arabia and NATO countries not paying their share of defense costs is a familiar refrain — he mentions it in virtually every speech he makes about foreign policy issues. In point of fact, erroneously on his part or not, Trump has raised the specific issue of the U.S. having to pay rent on bases in Saudi Arabia before. He did it most recently in an interview with the New York Times on 25 March 2016 — months before he was nominated and became eligible to receive intelligence briefings:", "From China to Japan to South Korea to the Middle East, many states in the Middle East, for instance, protecting Saudi Arabia and not being properly reimbursed for every penny that we spend, when they're sitting with trillions of dollars, I mean they were making a billion dollars a day before the oil went down, now they're still making a fortune, you know, their oil is very high and very easy to get it, very inexpensive, but they're still making a lot of money, but they were making a billion dollars a day and we were paying leases for bases? We're paying leases, we're paying rent? OK? To have bases over there? The whole thing is preposterous.", "There is no evidence that Donald Trump received a national security intelligence briefing before his 29 July 2016 speech in Colorado Springs, nor did he say anything he hasn't said before about U.S. military bases in Saudi Arabia.", "As of 30 July, Reverb Press had published a retraction and Daily Kos had deleted their page speculating that Donald Trump may have revealed classified information in his speech.", "Belisle, Mark.  \"Trump May Have Just Leaked A HUGE Intelligence Secret Only HOURS After His First Briefing.\"\r\n  Reverb Press.  29 July 2016.", "Bump, Philip.  \"Clinton and Trump Will Soon Receive Classified Briefings. Here's How That Works.\"\r\n  Washington Post.  29 July 2016.", "Jacobs, Ben and Hesse, Josiah.  \"Donald Trump Says He's 'Taking the Gloves Off' As Party Conventions Wrap.\"\r\n  The Guardian.  30 July 2016.", "Parker, Jamison.  \"Trump May Have Just Leaked Classified Info on His First Day Getting Intelligence Briefings.\"\r\n  IfYouOnlyNews.com.  29 July 2016.", "\"Transcript: Donald Trump Expounds on His Foreign Policy Views.\"\r\nNew York Times.  26 March 2016.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]