["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Nearly 300 University of Wisconsin-Milwaukee faculty members unanimously passed a no-confidence measure against UW System President Ray Cross and the Board of Regents during a meeting on campus on May 10, 2016. (Rick Wood photo)", "Not to get all inside-baseball, but news releases issued by Gov. Scott Walker are usually pretty plain, like the white chalk lines that meet at home plate.", "So, it was a surprise to see Walker’s May 10, 2016 release about the faculty at the University of Wisconsin-Milwaukee, which arrived like a pitch thrown at a batter’s chin.", "Walker called a no-confidence vote being taken that day by the Milwaukee faculty a mere \"fuss.\" The professors were expressing \"their collective groan\" about budgeting and \"job-for-life tenure.\" The school \"should not be about protecting the interests of the faculty, but about delivering value and excellence to Wisconsin.\"", "For a Walker news release, pretty vitriolic stuff.", "But in another way, the release was more typical, as it was filled with bullets of factual claims -- including this one, about the ratio of students to faculty at UW-Milwaukee:", "\"At 2.8 students per faculty,\" the release declared, \"average student enrollment per instructor is currently tied for second-lowest in its history since 1994.\"", "Fewer than three students for every faculty member?", "That would be a swing and a miss.", "No-confidence votes", "UW-Milwaukee’s total enrollment of 27,000 (22,000 undergraduates) makes it the second-largest school, behind UW-Madison (43,000 and 31,000), in the University of Wisconsin System. The system is overseen by members of the Board of Regents, nearly all of whom are appointed by the governor.", "Since Walker took office in 2011, the system campuses have received budget cuts and professors have seen tenure protections partially weakened.", "Those are key reasons for a series of no-confidence votes directed at the UW System, beginning with one approved by UW-Madison faculty eight days before the UW-Milwaukee vote.", "Walker’s pre-emptive statement was issued less than two hours before nearly 300 Milwaukee faculty members unanimously passed their no-confidence vote. That represented roughly 40 percent of the full-time faculty.", "Walker’s figure", "To back the 2.8 ratio claim, Walker’s office cited a UW System chart on \"average individual instruction.\" The latest figure, for fall 2013, shows a ratio of 2.8 for UW-Milwaukee.", "But that is not a ratio of the total students per faculty member, as Walker says in the news release. It is a much narrower measure.", "As the chart itself explains, that is the ratio is for \"individualized instruction, such as independent study or thesis research.\" Indeed, you would expect a ratio of 2.8 students per faculty member for such one-on-one-style instruction.", "But Milwaukee’s overall ratio is much different.", "The actual ratio", "Robin Van Harpen, UW-Milwaukee’s vice chancellor for finance and administrative affairs, gave us figures for fall 2015.", "Using full-time-equivalents, the school had 22,491 total students and 779 faculty (faculty being full, associate and assistant professors).", "That’s a student-to-faculty ratio of 29 to 1.", "Moreover, in 1994, the year Walker referenced in his news release, the ratio was actually lower: 21 to 1. And it has steadily trended upward since then.", "In other words, the ratio of students to faculty at UW-Milwaukee is growing, not shrinking.", "Two final points:", "Lecturers and adjunct instructors, who also teach, are not considered faculty. But if you include them in the count, the current ratio is 19 to 1 -- still far above what Walker claimed.", "The day after the Milwaukee vote, Walker’s office essentially corrected itself in a statement on a no-confidence vote at UW-Green Bay. The statement cited the same 2.8 statistic as it applied to Green Bay -- but added a line to make clear that the ratio referred only to individualized instruction.", "Our rating", "Charging that the ratio of students to faculty at UW-Milwaukee is shrinking, Walker said the school has \"2.8 students per faculty\" member, \"tied for second-lowest in its history since 1994.\"", "But Walker cited the wrong statistic.", "In fact, UW-Milwaukee has 29 students for every professor, associate professor and assistant professor -- and that ratio has been growing, not shrinking, since 1994.", "For a statement that is false and ridiculous, our rating is Pants on Fire.", "https://www.sharethefacts.co/share/9b0f3e97-bf70-4e81-9fcb-0e2efdd28a55", "Gov. Scott Walker, news release, May 10, 2016", "Email, Gov. Scott Walker deputy communications director Tom Evenson, May 11, 2016", "Interview, Gov. Scott Walker deputy communications director Tom Evenson, May 12, 2016", "Email, University of Wisconsin-Milwaukee University Relations & Communications Director of Media Services Michelle L. Johnson, May 12, 2016", "University of Wisconsin-Milwaukee vice chancellor for finance and administrative affairs Robin Van Harpen, May 12, 2016", "Milwaukee Journal Sentinel, \"UW-Milwaukee faculty unanimously backs protest vote,\" May 10, 2016", "University of Wisconsin System, \"Average Individual Instruction,\" 2000-2013", "Fox 11 News, Gov. Scott Walker statement, May 11, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]