["A picture of BJP spokesperson Sambit Patra purportedly dining with a homeless couple on a footpath is doing the rounds on social media. Posting the same picture, journalist Niranjan Takle took potshots at the Modi government saying, “Bjp candidate Sambit Patra has exposed all Modi lies in single photo. House for everybody , Ujwala Gas, Digital India, Electrification, 2 crore Jobs, Swacch Bharat, Smart city etc etc.” Later, the tweet was deleted. An archived version of the tweet can be accessed here.", "Actor-turned-politician and Congress leader Nagma Morarji also tweeted the same photo with identical text.", "#Bjp candidate Sambit Patra has been exposed all #Modis lies in a thic pic is for al to see . House for everybody , Ujwala Gas, Digital India, Electrification, 2 crore Jobs, Swacch Bharat, Smart city etc etc. pic.twitter.com/6S814owIRU", "— Nagma Morarji (@nagma_morarji) April 6, 2019", "Political commentator and writer Zainab Sikander tweeted the image with the caption, “कुछ लोगों की भूख का कोई अंत ही नहीं होता। (Some people have no end to their hunger)”. The tweet has now been deleted.", "Sasidharan Pazhoor, a Twitter user posted the image taking a jibe at Patra, “Hey @sambitswaraj, are you addicted to eating? I haven’t seen you doing anything else in your campaign.”", "Hey @sambitswaraj , are you addicted to eating? I haven’t seen you doing anything else in your campaign. pic.twitter.com/lqYMyY1qGQ", "— Sasidharan Pazhoor (@inquestioner) April 6, 2019", "Reverse searching the image on Google yields no results. After flipping the image horizontally and then performing a reverse search of the image, Alt News found a 2016 article which had the original photograph.", "BJP has fielded its spokesperson Sambit Patra as a candidate for Puri parliamentary constituency in Odisha. As a part of the election campaign, Patra has posted several pictures of his visit to the constituency.", "Having lunch with Pipli BJP assembly candidate Arshit Pattnayak Ji and karykartas@BJP4Odisha #PhirEkBaarModiSarkar pic.twitter.com/o9Z0BnUXbw", "— Chowkidar Sambit Patra (@sambitswaraj) March 31, 2019", "In the photoshopped image, Patra was cropped from one of the images posted above and superimposed on another, to suggest that he was eating on a footpath. This photoshopped image was earlier debunked by BoomLive.", "A photoshopped image of Sambit Patra was shared by several prominent individuals suggesting that it depicts the failure of Modi government.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]