["Boss Mustapha said that N-Power, a government social protection programme, had “yielded over two million direct and indirect employment opportunities” and “lifted 5 million Nigerians out of extreme poverty”.", "President Buhari and his government have emphasised their commitment to job creation in his second term, but the most recent data does not support Mustapha’s claims about N-Power’s success.", "According to Nigerian development experts, Mustapha’s claims cannot be proven.", "Nigeria’s President, Muhammadu Buhari, is “strongly committed” to creating more jobs in his second term. This is what finance minister Zainab Ahmed told a National Economic Council meeting in August 2019.", "But the jury is still out on Buhari’s first term job-creation record. A claim by Boss Mustapha, another senior public official, that the economic fortunes of millions of Nigerians have improved has stoked public debate.", "Representing Buhari at an international meeting on youth employment in the administrative capital Abuja in August 2019, Mustapha credited this to the government’s social protection programmes.", "One of these, the N-Power programme, had in the “past three and a half years… yielded over two million direct and indirect employment opportunities,” Mustapha said in his keynote address.", "The programme had also “lifted 5 million Nigerians out of extreme poverty,” he added. We checked if the available evidence supported these numbers.", "The N-Power programme has yielded over 2 million direct and indirect employment opportunities", "According to its website, N-Power seeks to give young Nigerians aged between 18 and 35 “requisite skills” and “work experience opportunities”. It was launched in 2016.", "Both the presidency and the agency that oversees N-Power, the National Social Investment Office, are yet to respond to our requests for the source of these figures.", "(Note: Africa Check has for weeks sought this data, but was only directed to a top official who headed the project in Buhari’s first term. He did not work on Mustapha’s speech, he said.)", "The most recent numbers on the social office’s website are from a June 2019 update, and are much lower than Mustapha’s. The update said that as of August 2018, some 500,000 graduates were working in sectors like teaching, health, agriculture and tax. The graduates are volunteers but are paid a monthly stipend of N30,000 (about US$98) by the government.", "Some 26,000 non-graduates are in training or are interns, the update said. A year later in an August 2019 interview with a national newspaper, Mary Uwais, a top official with the N-Power programme, cited the same numbers.", "It is unlikely that N-Power could have created multiple employment opportunities, Dr Anthony Orji, a development economist who teaches at the University of Nigeria, Nsukka, said.", "This is because it is not really an entrepreneurship programme, he told Africa Check. “I don’t think it can really generate many indirect jobs, because many of the beneficiaries are engaged in teaching in schools and as health workers. “And they are paid N30,000 a month. They can’t build businesses that employ many people.”", "The programme says it provides training and information on entrepreneurship, but does not break down how many of its beneficiaries have started their own businesses.", "To support its jobs claim, the government should have given details, including where the jobs are located, Orji said.", "“Ideally, it is the National Bureau of Statistics that should verify and present the numbers from the programme,” he said. But the national data agency does not have any role in the programme including verifying jobs, Dr Isiaka Olanrewaju, the agency’s director of household statistics, told Africa Check.", "According to the most recent data, some 55.4% of Nigerian youths between ages 15 to 35 are underemployed or unemployed. This translates to 24.5 million youth who are doing in-between jobs, or have nothing to do.According to the most recent official data, some 43.1% of all Nigerians, or 39.14 million, are either unemployed or underemployed. These numbers, from the third quarter of 2018, are the most recent yet.In the absence of publicly available data showing how the 2 million jobs supposedly created by N-Power are distributed, we rate this claim as unproven.", "The N-Power programme has lifted over 5 million Nigerians out of extreme poverty", "Nigeria’s statistics bureau counts anyone living on less than US$2 a day as poor, and as extremely poor if they live on less than $1.25 a day.", "The most recent nationally representative survey of poverty was in 2009/10. For this, the National Bureau of Statistics drew the absolute poverty line at N55,235 per person per year, with 62.6% of Nigerians (102.2 million) falling into this category.", "In a preceding survey in 2003/04, some 64.2% of Nigerians were classified as absolutely poor, with the poverty line drawn at N28,837.", "There have been more recent attempts at estimating absolute poverty in Nigeria. In June 2018, US-based Brookings Institute caused a stir in Nigeria after it said that the country had overtaken India as having the largest number of people living in extreme poverty.", "Brookings Institute said there were 87 million such Nigerians in May 2018. In August 2019, this had risen to 94.1 million. The researchers used the UN’s definition of extreme poverty. This is anyone earning less than $1.90 at 2011 internationally adjusted prices, Kristopher Hamel, the CEO of World Data Lab, which calculates the data, told Africa Check in 2018.  (Note: You can read more about its approach here.", "An expert told Africa Check that without open numbers the claim that N-Power has lifted 5 million Nigerians out of extreme poverty is difficult to verify. Dr Olukemi Lawanson, an associate professor of labour and development economics at the University of Lagos said that the government should produce the evidence to support its position.", "“If the N-Power programme has yielded about 500,000 jobs for graduates, it does not seem likely to me that those jobs could have resulted in lifting up to 5 million Nigerians out of extreme poverty,” Lawanson told Africa Check.", "“But then it is possible depending on the kind of jobs and how much they pay. The government should present the facts to prove it.”", "Lawanson said that if, for instance, a graduate gets a job paying the recently approved minimum wage of N30,000 monthly, they are not likely to be above extreme poverty if they support at least one person, which is usually the case.", "“Earning N30,000 in a month comes down to living on about $3 in a day for one person. When you add dependants to it, they all remain in extreme poverty.”", "Please complete this form to receive the HTML sharing code.", "We examine three claims in a Cape Talk interview with the National Sea Rescue Institute on world drowning prevention day.", "Covid has trained a spotlight on causes of death and how deaths are recorded across the world. We disentangle what paperwork has to be filed...", "In a widely listened-to podcast, the BBC made the startling claim that more than a million Africans die each year on the continent’s roads. ...", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]