["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Rep. Sean Patrick Maloney claimed most people on Medicaid are children, seniors, or have a disability. (Courtesy: Maloney's Facebook page)", "One-third of New York state residents are on Medicaid, the federal-state program that helps pay for health care.", "We recently rated that claim True in a fact-check on U.S. Rep. John Faso of the Hudson Valley.", "Rep. Sean Patrick Maloney, a Democrat whose district neighbors Faso’s, responded to that statement with a claim about the Republican replacement for Obamacare.", "\"I heard [Faso] say recently that too many people are on Medicaid,\" Maloney said. \"I'm just wondering which people he thinks we should throw off their insurance, because most people on Medicaid are kids, or seniors, or the disabled.\"", "The replacement would have reduced federal Medicaid spending increases, a measure Democrats oppose. The bill is now in limbo after failing in the Senate last month.", "Democrats in New York state want to preserve the Medicaid program, often citing the number of people who rely on it. But is Maloney right that most people in the program are children, seniors, or have a disability?", "National numbers", "The average monthly Medicaid enrollment in 2016 was nearly 71 million, according to the most recent estimates from the U.S. Centers for Medicare and Medicaid Services.", "The agency’s report breaks down the numbers:", "• 28 million recipients were children.", "• 5.7 million recipients were age 65 or older.", "• 10.6 million recipients had a disability or were blind.", "• The remaining 28.1 million were adults below 65 without a disability or residents in U.S territories.", "A total of 44.3 million Medicaid recipients were children, seniors, or had a disability in 2016 according to the estimates. That’s almost two-thirds of the Medicaid population.", "Enrollment data from 2014, the latest official count, shows those groups made up about 65 percent of the Medicaid population that year.", "That distribution is not out of the ordinary, said Sara Rosenbaum, a professor of health law and policy at George Washington University.", "\"It’s because of how the program is structured and it’s because of who the people are,\" Rosenbaum said. \"For the elderly and the disabled, Medicaid is the means by which we do long term support for services in the United States.\"", "Medicaid is used by seniors who need long term care but cannot afford a private insurance plan to supplement Medicare, which does not cover long-term care. People with a disability also rely on the program to cover continuous care.", "The share of children on Medicaid, meanwhile, is a reflection of how many children live in poverty, Rosenbaum said.", "\"Families know that if your children need insurance, you turn to the Medicaid program,\" Rosenbaum said.", "New York numbers", "Maloney spoke in the context of national numbers, but the same claim would be true for New York state.", "The average monthly Medicaid enrollment was 6.1 million in New York as of April, according to the state Department of Health.", "• More than two million beneficiaries in New York are children.", "• Another 700,527 either have a disability or are blind.", "• Another 639,488 are people age 65 or older.", "• The remaining 2.8 million are adults below 65 without a disability.", "The three categories Maloney mentioned make up more than 3.3 million of New York’s Medicaid enrollees, or about 55 percent.", "Our ruling", "Maloney said \"most people on Medicaid are kids, or seniors, or the disabled.\"", "The word \"most\" may mean different things to different people. Not even dictionaries are clear, where meanings vary from \"the majority of\" to \"nearly all of.\"", "Nationally, two-thirds of people on Medicaid are either children, seniors or disabled, according to data from the Centers for Medicare and Medicaid Services.", "For us, we rate two-thirds as Mostly True.", "Rep. Sean Patrick Maloney on WAMC’s Congressional Corner, Aug. 3, 2017", "Email conversation with Ian Lee, spokesperson for Maloney", "PolitiFact New York: One in three people in New York is on Medicaid, July 21, 2017", "Email conversation with press staff from the U.S. Centers for Medicare and Medicaid Services", "New York State Medicaid population data obtained from the New York State Department of Health", "Interview with Sara Rosenbaum, Harold and Jane Hirsh Professor of Health Law and Policy at George Washington University", "Email conversation with Gail Wilensky, senior economist and fellow at Project HOPE and former senior adviser on health and welfare issues to President George H.W. Bush", "Email conversation with Scott Harrington, Alan B. Miller Professor in the Health Care Management and Insurance and Risk Management departments at the Wharton School, University of Pennsylvania", "Email conversation with Amy Shefrin, Program Officer at the New York State Health Foundation", "2016 CMS Medicaid Population Estimates", "2014 CMS Medicaid Population Statistics", "Kaiser Family Foundation 2014 Medication Population Breakdown", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]