["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Speaker Nancy Pelosi of Calif., left, joined by House Intelligence Committee Chairman Rep. Adam Schiff, D-Calif., right, arrive for a news conference on Capitol Hill, Oct. 2, 2019 (AP)", "In a Facebook ad that started running Nov. 14, the day after the first public hearing of the impeachment inquiry, President Donald Trump declared:", "\"Nancy Pelosi, Adam Schiff, and the rest of the corrupt Democrats made a promise to their crazy left-wing base that they would impeach me even BEFORE I took office.\"", "Did the two California House members — Speaker Pelosi and impeachment inquiry leader Schiff — and other Democrats pledge to impeach Trump even before his inauguration on Jan. 20, 2017?", "We found no evidence of it.", "In fact, Pelosi and Schiff long resisted calls by other Democrats for the current impeachment inquiry.", "There was some early talk about possible impeachment.", "In April 2016 — before Trump even won the GOP nomination — Politico reported that there was talk of impeaching Trump soon after he took office, were he to be nominated for the presidency and win. Then-U.S. Rep. Alan Grayson, D-Fla., said at the time that if Trump insisted on building a wall at the U.S.-Mexico border despite Congress’s opposition, his actions could lead down a path toward impeachment.", "In December 2016, five Democratic senators, including 2020 presidential candidate Elizabeth Warren, announced they would introduce a bill to require Trump to divest assets that could pose a conflict of interest in his role as president. They said the legislation would symbolically make violations of federal conflict-of-interest rules \"a high crime or misdemeanor under the impeachment clause of the U.S. Constitution.\"", "But those are only examples of Democrats raising the possibility of impeachment — far short of promising to do it. And Pelosi and Schiff were not involved.", "The same is true of two statements cited to us by the Republican National Committee to back Trump’s claim in the ad.", "(The ad, by the way, was placed by the Trump Make America Great Again Committee, a joint fundraising committee composed of the Trump campaign and the Republican National Committee. As of Sept. 30, 2019, it had raised more than $96 million during 2019, according to the latest figures from the Federal Election Commission.)", "1. A Schiff tweet on Dec. 22, 2016, said: \"There’s no question the Emoluments Clause applies to POTUS – including Trump. Severe remedies if its violated, including impeachment.\"", "The Constitution’s emoluments clause bars officials from receiving payments from foreign entities and is the basis for lawsuits challenging foreign payments to Trump’s Washington hotel. It has rarely been tested in court.", "At the time, the federal Office of Government Ethics was urging Trump to sell his business holdings as the \"only way to resolve these conflicts of interest.\" Similarly, Schiff was calling on the president-elect to \"divest completely,\" raising impeachment as one possible consequence if Trump didn’t, but not pledging to impeach.", "2. U.S. Rep. Maxine Waters, another California Democrat, said four days before the inauguration that if there was evidence the Trump campaign colluded with the Russians by using hacked information from Democratic National Committee emails against Hillary Clinton in the 2016 election, it would be an impeachable offense. Waters has repeatedly called for Trump’s impeachment, but those demands didn’t start until the months after Trump took office.", "The RNC didn’t provide us any information about Pelosi. A Pelosi spokesman denied to us that Pelosi ever promised before Trump took office that she would seek to impeach him.", "It’s also important to note that Pelosi and Schiff long resisted calls by other Democrats to initiate an impeachment inquiry. Pelosi launched the inquiry, in September 2019, only after evidence emerged Trump allegedly pressured the president of Ukraine to open a corruption investigation of former Vice President Joe Biden, a leading contender for the 2020 Democratic presidential nomination, and his son.", "Trump said, \"Nancy Pelosi, Adam Schiff, and the rest of the corrupt Democrats made a promise to their crazy left-wing base that they would impeach me even BEFORE I took office.\"", "The Republican National Committee, on Trump’s behalf, cited no evidence of such promises and we did not find any.", "We rate Trump’s statement False.", "Facebook, Trump Make America Great Again Committee ad, Nov. 14, 2019", "Email, Nancy Pelosi spokesman Drew Hammill, Nov. 16, 2019", "Email, Republican National Committee spokeswoman Cassie Smedile, Nov. 18, 2019", "Politico, \"Could Trump be impeached shortly after he takes office?\" April 18, 2016", "Twitter, Adam Schiff tweet, Dec. 22, 2016", "Real Clear Politics, \"Maxine Waters: If There Was ‘Collusion’ With Russia, Trump Committed Impeachable Offense,\" Jan. 16, 2017", "Vanity Fair, \"Democrats Are Paving The Way To Impeach Donald Trump,\" Dec. 15, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]