["All of the major news networks and media outlets declared former Vice President Joe Biden the winner of the presidential contest on Nov. 7 after they projected that he had reached the required 270 electoral votes.", "Nevertheless, electoral maps from a few conservative outlets and websites show President Donald Trump in the lead.", "An electoral vote map from the Epoch Times — last updated at 10:30 a.m. Nov. 11 in the screenshot in a Facebook post — showed Trump at 232 electoral votes and Biden at 227.", "Similarly, an electoral vote map from Gateway Pundit — also as of Nov. 11 — had Trump at 232 and Biden at 226.", "And a map from EveryLegalVote.com had Trump at 232 and Biden at 212.", "Elizabeth Johnston, a conservative influencer known as \"Activist Mommy,\" posted a screenshot of the map from Epoch Times with the caption \"Bet CNN isn’t showing you this!!! Holy Guacamole!!\" Her post was shared over 41,000 times in 24 hours.", "In a statement from USA TODAY, Johnston wrote that her post \"went viral for a reason.\"", "\"Americans know the mainstream media is lying to them, and they are fed up with the psychological warfare being waged against them,\" she wrote.", "The Hip Hop Patriot also posted the Epoch Times and EveryLegalVote.com maps to Facebook with the caption \"BREAKING: We are winning!!!!! Sooner or later the others will join!\"", "Jeremy Herrell, the individual behind the Hip Hop Patriot, told USA TODAY in an emailed statement that the mainstream media has \"zero authority to call an election.\"", "\"At this time, ALL STATES that would give either candidate the win are either still counting, recounting or tied up in litigation,\" Herrell wrote.", "The Epoch Times, Gateway Pundit, and EveryLegalVote.com have not responded to requests from USA TODAY for comment.", "More:How Joe Biden flipped the electoral map and won the presidency with room to spare", "In reality, all major news networks and media outlets have Biden in the lead, with more than the 270 votes required to win.", "Some outlets, like The New York Times, CNN and MSNBC, show the count at 279 to 217, as of Nov. 11-12. That's 279 votes for Biden, 217 votes for Trump, and 42 votes unaccounted for. Those outlets consider Arizona, Georgia, and North Carolina all too close to call.", "Other outlets, like Fox News and USA TODAY, show the count at 290 to 217, also as of Nov. 11-12. That's 290 votes for Biden, 217 votes for Trump, and 31 votes unaccounted for. That's because those outlets have already called Arizona for Biden. Likewise, though, they consider Georgia and North Carolina too close to call.", "USA TODAY relies on data from the Associated Press to make its calls.", "\"Only when AP is fully confident a race has been won – defined most simply as the moment a trailing candidate no longer has a path to victory – will we make a call,\" the Associated Press explains in a FAQ on how it calls races.", "Regardless, the results of Arizona, Georgia, and North Carolina would have no impact on the overall result of the election — even if Trump wins all three, he will still lose.", "The outcome is clear: Biden has passed 270.", "2020 Election Results | USA TODAY", "The Epoch Times is a conservative media outlet affiliated with Falun Gong, a secretive spiritual movement that has long faced persecution in China.", "Since 2016, it has become \"a leading purveyor of right-wing misinformation\" that \"has repeatedly pushed fringe narratives into the mainstream,\" and is very pro-Trump, according to The New York Times.", "Its electoral map shows Trump at 232 and Biden at 227 because it excludes electoral votes from every state with pending litigation or recounts — specifically, Arizona, Georgia, Michigan, Pennsylvania and Wisconsin.", "\"These states have ongoing litigation or other challenges by the candidates, or have not finished counting,\" the map explains as to why it has excluded their results.", "But the Epoch Times also shows North Carolina as a win for Trump, despite the fact that ballot counting there was ongoing because absentee ballots could be received through Nov. 12.", "Their website claims, \"Election Outcome Unclear Amid Pending Recounts and Legal Challenges.\"", "Johnston, one of the users who posted the map, told USA TODAY that \"the Epoch Times did the only responsible thing a media outlet could do.\"", "\"They are awaiting the results of recounts and pending legal action, and that is precisely what CNN, Fox News and other outlets should have done,\" she wrote.", "But experts on both sides of the aisle have said the results of litigation and recounts won't change the result of the election.", "The number of votes in question in each lawsuit, or likely to change as a result of a recount, is too small to make a meaningful difference for Trump, per USA TODAY.", "\"Basically, the election is over. There isn't anything that has come out that could plausibly affect the outcome,\" said David Boies, who led Al Gore's legal team in 2000. \"There's no legal avenue for the Trump campaign to plausibly dispute the results in any one state.\"", "Karl Rove — a veteran Republican strategist who has advised Trump in the past — also concluded that the election result will not be overturned in an op-ed in the Wall Street Journal on Nov. 11.", "\"The president’s efforts are unlikely to move a single state from Mr. Biden’s column, and certainly they’re not enough to change the final outcome,\" he wrote.", "More:Fact check: Wisconsin county did not have a glitch that stole votes from Trump", "The maps from Gateway Pundit and EveryLegalVote.com follow a similar logic to Epoch Times — exclude all the states with pending litigation or recounts.", "Both have Trump at 232 votes, like the Epoch Times, since they likewise show him taking the state of North Carolina. But they differ in counts for Biden.", "Gateway Pundit is a pro-Trump, far-right media website which has been known to promote conspiracy theories in the past, per the Washington Post.", "Its map has Biden at 226, rather than 227, because it excludes the result from Nebraska's 2nd Congressional District. It's unclear why; the Associated Press called the district for Biden last week, and the outcome has not been disputed.", "More:Nebraska and Maine's district voting method could be crucial in this election. Here's why.", "EveryLegalVote.com names The Economic WarRoom, Allied Security Operations Group and Liberty Center for God and Country — three far-right sites — as its founding sponsors.", "Its map had Biden at 212 on Nov. 11, when users like the Hip Hop Patriot posted its map to Facebook. Now, on Nov. 12, EveryLegalVote.com has Biden at 214.", "That's because on top of excluding results from Arizona, Georgia, Michigan, Pennsylvania and Wisconsin, it also excludes the result from Virginia, which has 13 electoral votes. There is no pending lawsuit, recount or credible fraud allegation in Virginia.", "Regardless, experts and lawmakers on both sides of the aisle — such as Boies and Rove — agree that the race is over, and Biden has won. Lawsuits and recounts are very unlikely to change that.", "More than a dozen Republicans have already recognized Biden as the president-elect or said Biden should begin his transition work, per NBC News.", "They include Sens. Mitt Romney, Susan Collins, Lisa Murkowski, and Marco Rubio; Govs. Charlie Baker, Phil Scott, Larry Hogan, and Mike DeWine; and former President George W. Bush and his brother, former presidential candidate and Florida Gov. Jeb Bush.", "Based on our research, the claim that the current electoral vote count has President Donald Trump in the lead at 232 votes is FALSE. All the major news networks and media outlets called the race for Joe Biden when wins in key battleground states placed his Electoral College vote total over 270. Those organizations all place Trump at 217.", "Epoch Times, Gateway Pundit, and EveryLegalVote.com show a different count for two reasons: They excludes states with pending litigation or recounts, subtracting votes from Wisconsin, Michigan, Pennsylvania, Nevada, Arizona, and in one case Virginia, from Biden. They also called North Carolina for Trump, though the state was not done counting as of publication time and has not been called by the Associated Press.", "Experts and media outlets say litigation and recounts are unlikely to change any state's result, let alone the national outcome.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]