["About this rating", "On 23 June 2017, frequent purveyor of misinformation YourNewsWire.com posted an article (\"Women Absorb and Retain DNA from Every Man They Have Sex With\") that made the claim that \"a new study\" demonstrates that cells transferred from a man to a woman during intercourse become integrated into that woman’s body after sex. Every single time.", "In actuality, however, that study (which was published in PLOS ONE in 2012, despite being billed as \"new\" in 2017) demonstrated for the first time the presence of genetically distinct male cells in the brains of women (who had been examined in autopsy). The existence of male cells in the bodies of females, in general, is not news. As discussed in a PLOS ONE blog post describing that 2012 study, their presence is typically ascribed to cells from a male fetus from a prior pregnancy:", "The idea of two genetically distinct populations of cells, or their DNA, residing in one individual isn’t new. It’s called microchimerism. [...] Medical chimerism arises after a transfusion or transplant, and it may follow pregnancy. Our microbiomes, the bacteria within us, are more like guests than body parts.", "[The research groups responsible for the 2012 study] found Y chromosome DNA sequences in several brain regions in autopsy slides from 37 out of 59 women. Such DNA liberated from fetal cells can come from several sources: children, fetuses that never made it to be born, older siblings, or twins. Both son and daughter DNA partake in this “feto-maternal trafficking,” but female DNA, at the chromosomal level, is harder to detect amid the maternal two X’s.", "The significance, in the case of that specific research paper, was that it demonstrated that these male cells — wherever they came from — were able to cross what is known as the blood-brain barrier — a semi-permeable membrane that prevents most chemicals in the blood from entering the brain. The linked study, in fact, does not once mention sexual intercourse as a proposed mechanism. This is as close as you will get from the PLOS ONE paper:", "The most likely source of male [microchimerism, Mc] in female brain is acquisition of fetal Mc from pregnancy with a male fetus. In women without sons, male DNA can also be acquired from an abortion or a miscarriage. The pregnancy history was unknown for all but a few subjects in the current studies, thus male Mc in female brain could not be evaluated according to specific prior pregnancy history. In addition to prior pregnancies, male Mc could be acquired by a female from a recognized or vanished male twin, an older male sibling, or through non-irradiated blood transfusion.", "At least that’s what they want you to think, according to YourNewsWire:", "Through the study the researchers assumed that the most likely answer was that all male DNA found living in the female brain came from a male pregnancy. That was the safe, politically correct assumption. But these researchers were living in denial. Because when they autopsied the brains of women who had never even been pregnant, let alone with a male child, they STILL found male DNA cells prevalent in the female brain.", "At this point the scientists didn’t know what the hell was going on. Confused, they did their best to hide the evidence until they could understand and explain it. They buried it in numerous sub studies and articles, but if you sift through them all you will find the damning statement, the one line that gives the game away and explains exactly where these male DNA cells come from.", "In an odd chronologic twist that necessitates abandoning the notion that time progresses linearly in one direction, YourNewsWire then used text from a paper published in 2005 to support the argument that scientists buried this salacious truth, discovered in 2012, in other \"sub studies\". That 2005 paper, which does indeed show the presence of male cells in women who had never given birth to males (or, in some cases, at all), makes only passing reference to the possibility that sexual intercourse alone could contribute male microchirality to women, noting that the issue has yet to be studied:", "Another possibility that has not been investigated is whether male DNA can be detected in a woman’s circulation from sexual intercourse without pregnancy.", "That explanation is the authors' speculative fourth suggestion (out of four) after three more plausible, and actually researched, theories:", "One potential explanation for male microchimerism could be a nonrecognized (male) miscarriage. [...]", "A second potential source is from a “vanished (male) twin.” A vanished twin is thought to be a relatively common phenomena resulting from spontaneous resorption of one sac or embryo in a twin pregnancy. [...]", "A third possibility is from an older male sibling transferred by the maternal circulation to the fetus of a later pregnancy. [i.e. you are born with male DNA your older brother left behind in your mother’s body].", "A paper published, fittingly, in the journal Chimerism in 2015 investigated this topic further, concluding that — potentially — all of those potential mechanisms may contribute. That paper, which was fairly limited in its dataset, makes it clear that the sexual intercourse transfer of male chimerism remains entirely speculative:", "A total of 154 girls were studied of which 21 (13.6%) tested positive for male microchimerism. There was a tendency that girls were more likely to test positive for male microchimerism if their mothers previously had received transfusion, had given birth to a son or had had a spontaneous abortion. Furthermore, the oldest girls were more likely to test positive for male microchimerism.", "However, less than half of microchimerism positivity was attributable to these factors. In conclusion, data suggest that male microchimerism in young girls may originate from an older brother either full born or from a discontinued pregnancy or from transfusion during pregnancy. We speculate that sexual intercourse may be important but other sources of male cells likely exist in young girls.", "Far from demonstrating that 100 percent of a woman's male sexual partners have male cells that de facto become part of their body, the studies cobbled together by YourNewsWire show that even if sexual intercourse transferred cells from a male that later became incorporated into the female partner’s body (which science has only speculated about at this point), it clearly wouldn't happen in all cases.", "We are also unsure, for the record, what motivation would exist for scientists to hide the truth about male microchimerism in the first place.", "Dmitry, Baxter.   \"Women Absorb And Retain DNA From Every Man They Have Sex With.\"\r\n    YourNewsWire.com.   23 June 2017.", "Chan, William F. N., et al.   \"Male Microchimerism in the Human Female Brain.\"\r\n    PLOS ONE.   26 September 2012.", "Lewis, Ricki.   \"Male DNA in Female Brains Revisited.\"\r\n    PLOS ONE DNA Science Blog.   25 October 2012.", "Yan, Z., et al.   \"Male Microchimerism in Women Without Sons: Quantitative Assessment and Correlation With Pregnancy History.\"\r\n    American Journal of Medicine.   August 2005.", "Müller, A.C., et al.   \"Microchimerism of Male Origin in a Cohort of Danish Girls.\"\r\n    Chimerism.   October 2015.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]