["On July 30, eight Marines and one Navy sailor were killed during a routine training exercise off the coast of Southern California when a Marine landing craft sank.", "Only one of the service members’ bodies was recovered from the tragic scene: That of Lance Cpl. Guillermo Perez of New Braunfels, Tex. Presumed dead are Pfc. Bryan Baltierra, Lance Cpl. Marco Barranco, Pfc. Evan Bath, Navy Hospitalman Christopher Gnem, Pfc. Jack Ryan Ostrovsky, Cpl. Wesley Rodd, Lance Cpl. Chase Sweetwood and Cpl. Cesar Villanueva.", "On Aug. 1, however, a Facebook post featuring the photos of seven different Marines started circulating online.", "\"7 Marines killed in training exercise yesterday,\" the post says.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The Marines in the photos were killed in a helicopter crash, but not on July 31. They died in 2015 during a training mission in Florida when a Black Hawk helicopter crashed in dense fog. Four National Guard soldiers were also killed.", "Though there was a more recent fatal training exercise involving Marines, this Facebook post misuses the images of and deaths of seven men who perished five years ago.", "We rate this post Mostly False.", "Facebook post, Aug. 1, 2020", "I Marine Expeditionary Force, 15th MEU identifies personnel killed in AAV mishap, Aug. 2, 2020", "I MEF tweet, Aug. 2, 2020", "The Associated Press, U.S. Marines ID all 9 people killed in sea-tank sinking, Aug. 3, 2020", "Stars and Stripes, 7 Marines killed in helicopter crash are identified, March 13, 2015", "The Associated Press, Names of 7 Marines killed in helicopter crash released, March 13, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]