["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mail carrier Annie Johnson gathers mail for her routes at the post office in midtown Atlanta. The American Postal Workers Union says the Postal Service is funded through stamps and postage, and doesn’t run on tax dollars. (AJC photo/Jason Getz)", "There’s been a lot of conversation lately about proposed cuts to the U.S. Postal Service, particularly the idea of ending Saturday delivery.", "PolitiFact Georgia reader Wallace Cooper said he was skeptical about a specific claim in a recent television ad about the taxpayer cost of delivering the mail and asked us to do some fact-checking.", "\"Members of the American Postal Workers Union handle more than 165 billion letters and packages a year. That’s about 34 million pounds every day. Ever wonder what this costs you as a taxpayer? Millions? Tens of millions? Hundreds of millions?\" a voice says in the 30-second ad.", "The answer: \"Not a single cent.\"", "Deliveries are solely funded by stamps and postage, the voice says.", "The ad was put together by the American Postal Workers Union. The union writes on its website that the ad was created to combat \"detrimental legislation.\"", "The Postal Service boasts that nothing will keep its mail carriers from their appointed rounds. We at PolitiFact Georgia share a similar intrepid ethic regarding getting to the bottom of a claim. So what did we find?", "The Postal Service says on the facts page of its website that it does not receive tax dollars for its operations, but some context is necessary here.", "First, let’s look at its current situation.", "Before 1971, the Postal Service received annual appropriations from the federal government. Since then, it has operated independently, with revenues generated through the sales of postage stamps and services.", "But Congress does give the Postal Service $100 million a year to compensate the agency for revenue loss by providing, at congressional direction, free mailing privileges to blind people and overseas voters, a congressional report noted. The $100 million is less than 1 percent of the Postal Service’s annual budget.", "In 2012, the Postal Service pulled in about $65 billion in revenue, it says on its website. That’s $10 billion less than what collected in 2008, the year the Great Recession took hold. By some reports, the Postal Service is losing $25 million a day. The volume of mail the Postal Service handles has declined by nearly 27 percent since 2008, as Americans rely more on email  communications instead of letters.", "The Postal Service’s debt rose from nothing to $10.2 billion between federal fiscal years 2005 and 2009, according to a congressional report. The federal fiscal year begins Oct. 1 and concludes Sept. 30.", "Another congressional report found Postal Service operating costs may be the largest reason for its financial troubles. In 2006, Congress passed legislation requiring the Postal Service to pre-fund its future retirees’ health benefits at a cost of approximately $5.6 billion per year.", "The Postal Service has cut expenses through a hiring freeze, offering early retirement to longtime employees and closing some district offices. It’s also increased revenue in recent years through several increases in the price of a postage stamp.", "In 2009, the Postal Service began borrowing money from the U.S. Treasury Department to deal with its troubles. Some news accounts report the service reached its borrowing limit of $15 billion in September 2012.", "Sally Davidow, a spokeswoman for the union, said the Postal Service had to borrow the money to offset the health benefit changes. She argued that health benefits are not part of the Postal Service’s operating expenses.", "\"(The Postal Service) is required to pay that money back,\" Davidow added. \"Borrowing money is different than relying on taxpayers.\"", "Davidow argued in the union’s defense that the Postal Service has $46 billion in its retiree health benefits fund, but the federal government won’t let the agency borrow from it.", "The Postal Service wrote in a November 2012 press release that it had a record fiscal year deficit of nearly $16 billion. The agency attributed about 70 percent of that net loss to the health care requirement.", "To sum up, the American Postal Workers Union claimed in its television ad that the U.S. Postal Service doesn’t operate on taxpayer dollars and and it’s solely funded by stamps and postage. The Postal Service has borrowed money from the government in recent years, primarily it says, to cover the cost to pre-fund employee health benefits.", "The first part of the statement is on target. The second part, however, gets a return to sender.", "We rate this claim Half True.", "American Postal Workers Union television ad campaign, July 8, 2013, www.apwu.org/news/nsb/2013/nsb08-130708-adcampaignrenewed.htm", "American Postal Workers Union, \"Congress is Killing the Postal Service, Guffey Declares,\" May 28, 2013, www.apwu.org/news/forthepress/pressrel130528-fed-govt-loots-usps.htm", "Congressional Research Service, \"U.S. Postal Service Workforce Size and", "Employment Categories, 1990-2010,\" April 4, 2011, journalistsresource.org/wp-content/uploads/2013/02/U.S.-Postal-Service-Workforce-Size-and-Employment-Categories-1990-2010.pdf", "Congressional Research Service, \"The U.S. Postal Service’s Financial Condition:", "Overview and Issues for Congress,\" Jan. 19, 2010, www.postalmuseum.si.edu/industrywhitepapers/R41024_20100119.pdf", "Fox News, \"Postal Service renews push to stop Saturday delivery,\" July 18, 2013, www.foxnews.com/politics/2013/07/18/postal-service-renews-push-to-stop-saturday-delivery/", "Govtrack.us, \"Postal Accountability and Enhancement Act,\" www.govtrack.us/congress/bills/109/hr6407/text", "Telephone interview with American Postal Workers Union spokeswoman Sally Davidow, July 18, 2013.", "U.S. Postal Service facts 2013, about.usps.com/who-we-are/postal-facts/#H2", "U.S. Postal Service, \"Postal Service $15.9 Billion Loss Highlights Urgent Need for Legislative Reform in Congressional Lame Duck Session,\" Nov. 15, 2012, about.usps.com/news/national-releases/2012/pr12_131.htm", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]