["About this rating", "In October 2018, with the November mid-term elections just weeks away, reports emerged that the U.S. Supreme Court had issued a ruling that would keep in place North Dakota laws which, according to their critics, could prevent thousands of Native Americans -- who favor Democratic candidates -- from casting their ballots.", "On 12 October, the NDN Collective, a group that advocates on behalf of the rights of indigenous peoples, posted a widely-shared meme with the message that \"The government [says] if you’re a tribal resident, you get a PO Box, not a street address. Also the government [says] you can only vote with a street address. THIS is voter suppression, North Dakota\":", "As NDN indicated, these words were originally published by the social justice activist Brittany Packnett, in a tweet the previous day:", "The government: if you’re a tribal resident, you get a PO Box, not a street address.", "Also the government: you can only vote with a street address.", "THIS is voter suppression, North Dakota. https://t.co/yjvNvJQVDw", "— Brittany Packnett (@MsPackyetti) October 11, 2018", "On 13 October, the progressive writer Brandon Weber posted the same meme along with his own introductory message: \"The U. S. 'Supreme' Court this week agreed to allow the elimination of voting rights for 70,000 Native Americans in North Dakota alone. This is an attack on all voters.\"", "North Dakota is the only state in the U.S. without voter registration. Instead, voters have historically been able to verify their identity at a polling station by presenting a subset of many different types of identification showing a date of birth and home address, as documented by the U.S. District Court for North Dakota. These forms of identification included driver's licenses (in- or out-of-state), a U.S. passport, a tribal ID, a non-driver's license ID, a federal agency ID, a student ID, a military ID, a recent utility bill, and the like.", "A single ID presented by a voter did not have to contain both a birth date and a home address; instead, a voter could present two forms of ID which in combination established a date of birth and address. If a voter could not meet this standard, North Dakota law allowed for two \"fail-safes\" at polling stations.", "First, a poll worker could simply vouch for the identity of a given voter. This method was particularly useful and relevant in many of the smaller, rural voting precincts where poll workers would be quite likely to personally know many voters. Second, a voter lacking any acceptable form of ID could sign an affidavit at the polling station, swearing under penalty of perjury to being a legitimate voter in that particular precinct.", "In 2013, the North Dakota legislative assembly passed a new law (H.B. 1332) which got rid of the two \"fail-safes\" and also limited the number of acceptable forms of ID to just three: an in-state driver's license, a North Dakota state-issued ID card, and a tribal ID card. The law allowed the North Dakota Secretary of State to designate other forms of alternative ID, which included student IDs and long-term care IDs.", "In 2015, the legislative assembly imposed even more restrictions on voter ID options with H.B. 1333. That law denied the Secretary of State the ability to choose additional alternative forms of ID, removed a student ID card as an acceptable option, and stipulated that driver's licenses and North Dakota ID cards must not be expired. The 2013 and 2015 restrictions were codified in Section 16.1-05-07 of the North Dakota Century Code.", "In January 2016, seven Native American voters led by Richard Brakebill, a U.S. Navy veteran and member of the Turtle Mountain Band of Chippewa Indians, filed a motion against North Dakota's Secretary of State Alvin Jaeger, asking the U.S. District Court in that state to declare that the 2013 and 2015 voter ID restrictions violated the Equal Protection clauses of both the U.S. and North Dakota constitutions, as well as Section 2 of the Voting Rights Act.", "Brakebill had been prevented from voting in the November 2014 elections because his tribal ID did not contain his address and his North Dakota state ID was expired, thus running afoul of the new restrictions imposed under H.B. 1332. He had tried to obtain a form of ID containing his residential address, but had not been able to do so because of difficulty in getting a copy of his Arkansas birth certificate.", "The January 2016 lawsuit began a near two-year period of legal wrangling and appeals between the group of seven Native American voters and North Dakota's Secretary of State, which ultimately came before the nation's highest court in October 2018.", "The plaintiffs, who were later joined by lawyers from the Native American Rights Fund, argued that the restrictions disproportionately disenfranchised Native American voters because many Native Americans had P.O. box addresses rather than residential addresses, and the comparatively high levels of homelessness and poverty among Native Americans also meant that the requirements of obtaining the increasingly limited forms of identification were more likely to be prohibitive for them.", "The group also argued that no compelling public interest justified imposing additional voter ID restrictions, since (contrary to the claims of Jaeger and others) no significant pattern of voting fraud had existed to begin with. In their civil complaint, lawyers for the Native American voters wrote:", "Due to social and economic conditions caused by and linked to historical and ongoing discrimination, including poverty, unemployment, lower educational attainment, higher rates of disability and lack of access to transportation, Native American voters are disproportionately burdened by HB 1332 and 1333.", "In August 2016, U.S. District Court Judge Daniel Hovland ruled in favor of the Native American voters, ordering the state of North Dakota not to implement the restrictions contained in HB 1332 and 1333:", "The Plaintiffs have met their burden of establishing the necessity of a preliminary injunction at this early stage. The public interest in protecting the most cherished right to vote for thousands of Native Americans who currently lack a qualifying ID and cannot obtain one, outweighs the purported interest and arguments of the State. It is critical the State of North Dakota provide Native Americans an equal and meaningful opportunity to vote in the 2016 election. No eligible voter, regardless of their station in life, should be denied the opportunity to vote...", "In the past, North Dakota allowed all citizens who were unable to provide acceptable ID’s to cast their vote under two types of “fail-safe” provisions - which were repealed in 2013. The ill-advised repeal of all such “fail-safe” provisions has resulted in an undue burden on Native American voters and others who attempt to exercise their right to vote. There are a multitude of easy remedies that most states have adopted in some form to alleviate this burden.", "As a result of Hovland's order, voting in 2016 went ahead under the historical conditions that prevailed in North Dakota before the introduction of HB 1332 and 1333 in 2013 and 2015.", "However, in April 2017 North Dakota legislators adopted HB 1369, which went into effect on 1 August 2017 and introduced certain backup provisions for voters who did not possess the acceptable forms of ID set out in HB 1332 and 1333:", "If an individual's valid form of identification does not include all the information required under subsection 2 or the information on the identification is not current, the identification must be supplemented by presenting any of the following issued to the individual which provides the missing or outdated information:", "(1) A current utility bill; (2) A current bank statement; (3) A check issued by a federal, state, or local government; (4) A paycheck; or (5) A document issued by a federal, state, or local government.", "H.B. 1369 also allowed for something called a \"provisional ballot\" (or \"set aside ballot\"), whereby a voter could mark a ballot with chosen candidate(s) and have that ballot be aside, to be counted if the voter produced a valid form of ID within six days.", "Brakebill and the six other plaintiffs also challenged the constitutionality of H.B. 1369, filing another motion against Jaeger in February 2018. Once again, U.S. District Court Judge Hovland largely sided with the voters, ruling in April that Jaeger must also allow voters to provide ID cards that showed mailing addresses (e.g., P.O. boxes), must accept as valid ID cards issued by tribal authorities and the Bureau of Indian Affairs, and must carry out a public information program in North Dakota to properly explain to voters how the provisional ballot component of H.B. 1369 works.", "Jaeger, who wanted the voter ID restrictions in place in time for the June 2018 primary elections, quickly appealed Hovland's ruling to the U.S. Court of Appeals for the Eighth Circuit. The court denied Jaeger's request to stay Judge Hovland's ruling on H.B 1369, meaning the June 2018 primaries went ahead under the voter ID conditions that had been in place up to 2013.", "However, the Eighth Circuit ultimately sided with Jaeger, ruling on 24 September 2018 that Hovland's order should be stayed, meaning that the state of North Dakota could enforce H.B. 1369 for the time being. Among other conclusions, the court held that allowing anyone who could prove they held a P.O. box in a particular precinct to vote there could cause harm to the state through the potential for voting fraud:", "If the Secretary must accept forms of identification that list only a mailing address, such as a post office box, then voters could cast a ballot in the wrong precinct and dilute the votes of those who reside in the precinct. Enough wrong-precinct voters could even affect the outcome of a local election ... The inability to require proof of a residential street address in North Dakota also opens the possibility of fraud by voters who have obtained a North Dakota form of identification but reside in another State while maintaining a mailing address in North Dakota to vote...Even if the State can prosecute fraudulent voters after the fact, it would be irreparably harmed by allowing them to vote in the election.", "The Eighth Circuit also held that the November elections were far enough off for anyone adversely affected by the provisions of H.B. 1369 to make the necessary arrangements required to vote:", "Election day is November 6, and early voting in North Dakota does not begin until fifteen days before then ... Any North Dakota resident who might have relied on the district court’s order allowing a voter to present identification with a mailing addresses [sic] has more than a month to adapt to the statute’s requirement to present identification, or a supplemental document, with a current residential street address. The Secretary also should have sufficient time to educate and train election officials about that single change.", "The Native American voters and their attorneys then took the case to the highest court in the country, filing a motion on 28 September which asked the U.S. Supreme Court to vacate the Eighth Circuit's ruling. This would have left District Court Hovland's order in place, preventing North Dakota from requiring residential address IDs for voting in November.", "However, on 9 October the Supreme Court voted to deny the motion brought by Brakebill and the other plaintiffs. (Contrary to one viral rumor, Justice Brett Kavanaugh did not take part in the court's deliberations.) This meant that Hovland's order, which required North Dakota to accept IDs that list P.O. box addresses, was suspended, leaving the provisions of H.B. 1369 in place and forcing tens of thousands of would-be voters to obtain acceptable forms of ID by November.", "Justices Ruth Bader Ginsburg and Elena Kagan both dissented from the court's majority ruling, with Ginsburg writing:", "The risk of voter confusion appears severe here because the injunction against requiring residential-address identification was in force during the primary election and because the Secretary of State’s website announced for months the ID requirements as they existed under that injunction. Reasonable voters may well assume that the IDs allowing them to vote in the primary election would remain valid in the general election.", "If the Eighth Circuit’s stay is not vacated, the risk of disfranchisement is large. The Eighth Circuit observed that voters have a month to “adapt” to the new regime. But that observation overlooks specific factfindings by the District Court:", "(1) 70,000 North Dakota residents -- almost 20% of the turnout in a regular quadrennial election -- lack a qualifying ID; and (2) approximately 18,000 North Dakota residents also lack supplemental documentation sufficient to permit them to vote without a qualifying ID.", "It's important to note that, contrary to some news reports, the U.S. Supreme Court did not precisely \"uphold\" North Dakota's voter ID laws on 9 October 2018.", "The court did not issue any ruling on the constitutional or legal merits of H.B. 1369 itself (or 1332 and 1333, which remain on the statute books but are unenforced due to Hovland's 2016 District Court injunction). Rather, the Supreme Court issued a very narrowly defined ruling on a specific legal question, leaving a lower court's ruling in place by declining to reverse the Eighth Circuit's stay of the U.S. District Court's injunction covering the state of North Dakota's enforcement of H.B. 1369.", "It is true that many tribal members in North Dakota do not have residential street addresses and instead rely upon P.O. boxes, thus leaving them vulnerable to the restrictions implemented under H.B. 1369.", "However, Secretary of State Jaeger has written to tribal leaders, outlining the process by which anyone without a street address can acquire one and then obtain written confirmation of the new address -- either as a means of obtaining a new form of ID, or as supplemental documentation (as allowed under H.B. 1369) to be brought to a polling station on Election Day:", "If you encounter anyone who says to you that they do not have a residential street address to provide to either the [Department of Transport] or the tribal government to obtain an ID, please encourage them to reach out to the 911 Coordinator in the county in which their residence exists to start the simple process to have the address assigned.", "The North Dakota Association of Counties maintains a list of all 53 County 911 Coordinators. A simple phone call to this individual can start this no charge process that can usually be completed in an hour or less when the individual can describe the location of the home. After the address is assigned, the office assigning it will provide a letter upon request that confirms this new address. This letter can be used either to obtain an ID or as supplemental documentation for voting purposes for those individuals whose ID includes a mailing address rather than a residential address.", "In February 2020, after this fact check was published, Brakebill and the other Native American plaintiffs settled their lawsuit against the state of North Dakota. Under the terms of that settlement, the state was obliged to distribute photo IDs, free of charge, in all tribal reservations, within 30 days of statewide elections and voters could, if necessary, point out their residence on a map at polling stations.", "This means that voters without a residential street address can, in principle, vote in person in the November 2020 elections. That settlement was not in place in 2018, when the memes and news articles about the U.S. Supreme Court's decision emerged, and although those claims were accurate at the time they were published, that is no longer the case. As a result, we are changing our rating from \"True\" to \"Outdated.\"", "Hovland, Daniel L.   \"Brakebill et al v. Jaeger -- Order Granting Plaintiffs' Motion for Preliminary Injunction.\"\r\n    U.S. District Court for the District of North Dakota.   1 August 2016.", "North Dakota Legislative Assembly.   \"North Dakota Century Code, Chapter 16.1-05-07 -- Poll Clerks to Check Identification and Verify Eligibility, Poll Clerks to Request, Correct, and Update Incorrect Information Contained in the Pollbook.\"\r\n    Accessed 15 October 2018.", "Brakebill, Richard et al.   \"Brakebill et al v. Jaeger -- Complaint for Declaratory and Injunctive Relief.\"\r\n    U.S. District Court for the District of North Dakota.   20 January 2016.", "North Dakota Legislative Assembly.   \"North Dakota Century Code, Chapter 16.1-01-04.1 --Identification verifying eligibility as an elector.\"\r\n    Accessed 15 October 2018.", "Brakebill, Richard et al.   \"Brakebill et al v. Jaeger -- Plaintiffs' Second Motion for Preliminary Injunction and Response to Defendant's Motion to Dissolve Preliminary Injunction.\"\r\n    U.S. District Court for the District of North Dakota, Southwestern Division.   16 February 2018.", "U.S. Court of Appeals for the Eighth Circuit.   \"Brakebill et al v. Jaeger -- Order.\"\r\n    U.S. Court of Appeals for the Eighth Circuit.   8 June 2018.", "U.S. Court of Appeals for the Eighth Circuit.   \"Brakebill et al v. Jaeger -- Order on Renewed Motion for Stay Pending Appeal.\"\r\n    U.S. Court of Appeals for the Eighth Circuit.   24 September 2018.", "Olson, Walter.   \"18,000 Facebook Shares Later: A Tale of Legal Misinformation.\"\r\n    Overlawyered.com.   13 October 2018.", "Bader Ginsburg, Ruth.   \"Brakebill et al v. Jaeger -- Justice Ginsburg, Dissenting.\"\r\n    U.S. Supreme Court.   9 October 2018.", "Segers, Grace.   \"North Dakota Voter ID Law Upheld by Supreme Court Could Affect Senate Race.\"\r\n    CBS News.   12 October 2018.", "Weber, Peter.   \"Supreme Court Upholds North Dakota Voter ID Law That Hits Native Americans, a Key Democratic Constituency.\"\r\n    The Week.   10 October 2018.", "Levine, Carrie.   \"What Stands in the Way of Native American Voters?\"\r\n    The Center for Public Integrity/Public Radio International.   12 October 2018.", "Updated [28 October 2020]: Added section relating to the February 2020 settlement in Brakebill, et. al v. Jaeger, and its implications for in-person voting in North Dakota in the November 2020 elections. Changed rating from \"True\" to \"Outdated.\"", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]