["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "House Majority Leader Kevin McCarthy of Calif., accompanied by Rep. Cathy McMorris Rodgers, R-Wash., speaks with reporters on Capitol Hill in Washington, Tuesday, May 2, 2017, following the Republican Caucus meeting. (AP Photo/Cliff Owen)", "One of the biggest backers for building new dams and reservoirs in California is House Majority Leader Kevin McCarthy of Bakersfield.", "The Republican, who’s been described as the most powerful Californian in Washington D.C., recently spoke on the House floor in favor of a bill to speed up studies on five water storage projects in the state.", "\"Water is not optional. Not in my district. Not in California. Not anywhere,\" McCarthy told his colleagues. \"But over the past five years my constituents have struggled to survive without life-giving water in the face of a catastrophic drought.\"", "As part of his push for the bill, H.R. 23, McCarthy made a claim about the dearth of water storage construction in the state in recent decades.", "McCarthy makes his statement at about the 1:35 minute mark.", "\"While California’s population has doubled since the 1970s, we haven’t completed a single major storage project in that time,\" McCarthy said. \"Now that’s worth restating. With California’s population having doubled since the 1970s we have not completed a single major storage project in that time. How can California grow and thrive in the future if we depend on inadequate infrastructure from nearly 50 years go?\"", "Not a single major water storage project since the 1970s? We wondered: Does the congressman’s claim hold water?", "We set out on a fact check.", "Our research", "In April 2016, we rated Mostly True a related though somewhat different claim by Sen. Feinstein. She said California had \"the same water infrastructure\" as it did in the 1960s.", "Our research showed large portions of the state’s modern-day water system, including the State Water Project and the federal government’s Central Valley Project, were built mainly in the 1960s or earlier.", "Construction started in the late 1950s on the State Water Project, a massive set of reservoirs, aqueducts and pumping plants that store and deliver water up and down the state to 25 million Californians. The backbone of the project, including Lake Oroville and the California Aqueduct, was finished in the 1960s and early 1970s.", "The Central Valley Water Project, which irrigates the San Joaquin Valley, was started in the late 1930s and completed in the early 1970s.", "This evidence mostly supported Feinstein’s claim. But we also found that regional water districts constructed several significant storage projects in the 1990s and that a new part of the state’s water infrastructure, a large ocean desalination plant, was built two years ago in San Diego County.", "Using that fact check as a reference, we zeroed in on McCarthy’s claim.", "McCarthy’s claim", "The first portion of the congressman’s statement, about California’s population doubling since the 1970s, is basically correct. In 1970, the state was home to 19.9 million people, according to the U.S. Census Bureau. As of July 2016, California’s population was 39.3 million.", "The second portion of McCarthy’s claim about the lack of major water storage projects built since the 1970s is open to broader interpretation.", "Asked for evidence to support that part of the statement, McCarthy’s spokesman told us by email that \"the last major (1M+ acre-feet) reservoir/dam we built in CA was in 1978 and it was New Melones Reservoir.\"", "The spokesman did not explain why only reservoirs with a capacity of one million acre-feet or more are considered \"major.\"", "One acre-foot of water equals about 326,000 gallons. The average California household uses between one-half and one acre-foot of water per year.", "The capacity at New Melones, which sits on the Stanislaus River in the central Sierra Nevada foothills, is 2.4 million acre-feet. Its dam was, indeed, completed in 1978 by the federal government, according to the U.S. Department of Reclamation.", "But was that really California’s last major water storage project? Is it fair to describe only those projects with a capacity larger than one million acre-feet as major? And are dams and reservoirs the only way the state adds to its water supply?", "Given that his spokesman cited New Melones, one might interpret McCarthy’s statement as meaning the federal government hasn’t built any major water storage projects in California since the 1970s. The congressman, however, doesn’t make this point clear in his speech. Given the broad nature of the claim, we took it to mean no layer of government has built a large-scale storage project in decades.", "Experts weigh in", "Based on interviews with water experts, we found there’s some truth to McCarthy’s assertion. We also found it omits some key information and takes things out of context.", "California has not constructed any new statewide water storage projects to match the scale of those started in the 1950s under the State Water Project. For some context, the largest reservoirs on that system are Lake Shasta, with a capacity of 4.5 million acre-feet, and Lake Oroville, with a capacity of 3.5 million acre-feet.", "The bill supported by McCarthy would advance proposed reservoirs such as Temperance Flat on the San Joaquin River in Fresno County and Sites, an offstream reservoir in the Sacramento Valley west of Colusa. Both would have a capacity of more than one million acre-feet.", "\"It is true that the federal and state governments have not added much,\" said Jay Lund, director of the UC Davis Center for Watershed Sciences. \"But local and regional efforts have been quite effective, without new federal storage projects.\"", "Lund said McCarthy’s statement \"is missing a lot of new functional storage,\" in the form of groundwater projects. One such project, the Kern Water Bank, is expected to store 400,000 acre-feet of water this year, Lund said.", "Recent projects", "Here’s a look at some of the largest water storage projects built in California since the 1970s:", "Diamond Valley Lake in Riverside County is the largest reservoir in Southern California. It was completed in 2000 by the Metropolitan Water District of Southern California and holds up to 800,000 acre feet of water, \"almost as big as Folsom (Lake),\" Lund noted.", "Lake Sonoma, a reservoir in Sonoma County, was constructed in 1983. It has a capacity of 381,000 acre feet.", "New Spicer Meadow reservoir was completed in 1989. It sits on a tributary of the Stanislaus River and holds up to 189,000 acre-feet of water.", "Los Vaqueros Reservoir, completed in 1998 by the Contra Costa Water District near Brentwood. It holds 160,000 acre feet.", "Peter Gleick of the Pacific Institute, an Oakland-based think tank that advocates for sustainable water policies, said in an interview that McCarthy’s statement \"is just wrong.\"", "He explained that California has continued to build smaller but still significant water storage projects in recent decades while adopting new water supply strategies.", "In a 2009 column in the San Francisco Chronicle, Gleick wrote the state had added more than 1.6 million acre-feet of water storage since 1979. \"And these numbers don’t include new groundwater storage systems or the vast ‘reservoirs’ of saved water we’ve created through conservation and efficiency programs. Are we adding new traditional storage more and more slowly? Yes. We’ve built on all the good dam sites.\"", "Our ruling", "House Majority Leader Kevin McCarthy recently claimed California hasn’t completed a single major water storage project since the 1970s.", "His claim is partially accurate. Nothing built since that time compares with the massive reservoirs built in the 1950s and 60s as part of the State Water Project.", "That doesn’t mean California hasn’t added anything of significance. Regional water districts have built large projects including the 800,000 acre-foot Diamond Valley Lake, built in 2000, the largest reservoir in Southern California.", "To describe \"major\" water storage projects, McCarthy’s spokesman used what amounts to an arbitrary marker of those with the capacity of one million acre-feet or more.", "But as water policy experts point out, California has continued to build water storage on a smaller but still significant scale. It’s also adopted new water supply strategies, including groundwater storage and conservation.", "McCarthy’s statement ignores these important facts and context.", "We rate his claim Half True.", "HALF TRUE – The statement is partially accurate but leaves out important details or takes things out of context.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Kevin McCarthy, speech on House floor, July 12, 2017", "Jay Lund, director, Center for Watershed Sciences at UC Davis, interview July 18, 2017", "Peter Gleick, co-founder of the Pacific Institute, interview July 17, 2017", "Matt Sparks, spokesman for Rep. Kevin McCarthy, July 18, 2017", "SFgate.com, blog by Peter Gleick, The Number of New Dams Built in California in the Past 50 (or 40 or 30 or 20) Years is Not Zero, June 5, 2009", "PolitiFact California, Does California ‘have the same water infrastructure’ as it did in the 1960s?, April 3, 2016", "US Census Bureau, \"Quick Facts: California,\" July 1, 2016", "US Census Bureau, \"Resident Population and Apportionment of the U.S. House of Representatives,\" July 18, 2017", "Kern Water Bank Authority, \"FAQs,\" July 18, 2017", "US Bureau of Reclamation, Mid-Pacific Region History, April 11, 2017", "House of Representatives Bill 23, accessed July 2017", "The Porterville Recorder, \"Water Agencies urge development of Temperance Flat Reservoir,\" April 3, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]