["About this rating", "The image shows truck driver and attack victim Reginald Denny, who was beaten during the 1992 Los Angeles Riots following the Rodney King verdict.", "The image is being circulated 24 years after the fact and has no bearing on the modern Black Lives Movement to stop police violence.", "An image posted to Facebook on 13 August 2016 shows the badly-injured face of Reginald Denny, a truck driver who in 1992 found himself an unwilling participant in history when he was beaten during riots that ensued in Los Angeles after four LAPD officers were acquitted of charges of excessive force stemming from the notorious videotaped beating of black motorist Rodney King:", "The image shows Denny's beaten face with the caption:", "This is Reginald.... Reginald stopped his car for black rioters blocking the road and was attacked for being white.... Don't be like Reginald... if \"protesters\" are blocking the road hit the GAS not the breaks", "Aside from encouraging people to commit a felony, the post seems to link violence in Milwaukee in August 2016 over the police shooting of an African-American man with the Los Angeles riots of nearly a quarter of a century ago. While Denny's beating was caught by news helicopters and broadcast live on television, Milwaukee city officials have told us there were no reported incidents of racially-motivated violence during the unrest in Milwaukee.", "Furthermore, while Denny was beaten by people who were actively taking part in a riot, modern-day Black Lives Matter protesters typically utilize the tactic of blocking roadways as a form of protest, but without violence.", "The Los Angeles riots began at the intersection of Florence and Normandie in South Central Los Angeles. Denny was driving his truck through the intersection when he was pulled out and beaten by three men. He was also rescued and taken to the hospital by four African-American L.A. residents who saw him being beaten on live television and came to his aid.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]