["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In a pool photo provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich., on April 27, 2020. (Michigan Office of the Governor via AP)", "Two bills passed in the Michigan Senate would limit the scope of Gov. Gretchen Whitmer’s authority to impose a state of emergency.", "As of April 29, neither bill had passed the state House of Representatives. And the governor has said she will veto any legislation that restricts executive power during the coronavirus pandemic.", "Whitmer’s stay-at-home order does not prohibit the sale of any particular product, as the Instagram post claims.", "Social media posts are targeting some state governors after they extended stay-at-home orders in response to the novel coronavirus.", "An April 27 Instagram post includes a screenshot of a tweet that claims the Michigan Legislature stripped Gov. Gretchen Whitmer of her emergency powers because of the actions she’s taken against COVID-19. The tweet, which was posted April 26, links to a story from Neon Nettle, a website that has published misinformation in the past.", "\"Michigan's Democrat governor, Gretchen Whitmer, has just been stripped of her emergency coronavirus powers by her state legislature after she abused that power with insane orders such as blocking sales of vegetable seeds and American flags, etc.,\" the post reads.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook, which owns Instagram.) It has more than 4,700 likes.", "(Screenshot from Instagram)", "Whitmer has been the subject of several hoaxes about her handling of the coronavirus pandemic in Michigan, where thousands protested the governor’s stay-at-home orders in mid-April. So we wanted to check out this Instagram post, too.", "Michigan’s Republican-controlled Legislature has moved to restrict Whitmer’s emergency powers. But the bills have only passed the Senate, and the governor has said she will veto any legislation that restricts executive power during the coronavirus crisis. Plus, Whitmer has not banned the sale of vegetables or American flags, as the post claims, though her orders have restricted the types of retail businesses and store departments that can stay open.", "Whitmer first declared a state of emergency March 10 and issued a stay-at-home order nearly two weeks later. On April 24, Whitmer signed an executive order to extend the stay-at-home restrictions through May 15, but loosened some provisions.", "Although the number of new COVID-19 cases has slightly decreased in Michigan, Whitmer’s aggressive actions against the coronavirus have attracted the ire of Republicans in her state and across the country who say they are unnecessarily strict and harm the economy. Ronna McDaniel, chair of the Republican National Committee, has said the governor is turning Michigan into a \"police state.\" Several businesses and groups have filed lawsuits challenging the orders.", "On April 16, Republicans in the state House of Representatives and Senate introduced bills that would repeal the 1945 Emergency Powers of the Governor Act, which gives the governor broad authority to declare a state of emergency in times of \"great public crisis.\" Another pair of bills would amend the Emergency Management Act of 1976 to decrease the number of days the governor can declare an emergency from 28 to 14.", "The Senate versions of both pieces of legislation passed in roll call votes April 24. But, as of April 29, they had not yet passed the House, which is also Republican-controlled. Whitmer has said she will veto the measures.", "\"Of course, I will veto bills that they send over to limit the executive power. I've been very clear about that from day one,\" she said April 23. \"Those blatant power grabs are bad in good times and dangerous in times of crisis.\"", "The Instagram post also errs in saying that Republicans targeted Whitmer’s emergency powers because she used them to issue orders \"blocking sales of vegetable seeds and American flags.\" We rated two similar claims False — Whitmer’s executive orders do not ban the sale of any particular product.", "Since Michigan legislators have moved to limit the governor’s emergency powers, the Instagram post contains an element of truth. But Whitmer’s emergency powers have not yet been repealed, and she has said she will veto the legislation if and when it reaches her desk.", "We rate the post Mostly False.", "Associated Press, \"Whitmer extends stay-home order through May 15, eases rules,\" April 24, 2020", "Detroit Free Press, \"Michigan Legislature wants to create committee to oversee Whitmer's coronavirus response,\" April 23, 2020", "Detroit Free Press, \"Republicans introduce bills to strip power from Whitmer, but she promises a veto,\" April 16, 2020", "Instagram post, April 27, 2020", "Michigan Legislature, House Bill 5708 (2020), accessed April 28, 2020", "Michigan Legislature, House Bill 5713 (2020), accessed April 28, 2020", "Michigan Legislature, Senate Bill 0857 (2020), accessed April 28, 2020", "Michigan Legislature, Senate Bill 0858 (2020), accessed April 28, 2020", "MLive, \"Michigan sees smallest increase in new coronavirus cases in 5 weeks,\" April 27, 2020", "Neon Nettle, \"Michigan Democrat Gov Whitmer Has Emergency Powers Repealed by State Legislature,\" April 25, 2020", "NPR, \"Michigan Stay-At-Home Order Prompts Honking, Traffic-Jam Protest,\" April 15, 2020", "PolitiFact, \"Chloroquine is not banned in Michigan, New York and Nevada,\" April 2, 2020", "PolitiFact, \"Governor’s office says Gretchen Whitmer didn’t visit her vacation home,\" April 24, 2020", "PolitiFact, \"Michiganders aren’t banned from buying American flags,\" April 14, 2020", "PolitiFact, \"Michigan's COVID-19 order doesn’t ban gardening or sale of seeds and fruit,\" April 15, 2020", "Reuters, \"Michigan Governor Whitmer aims to begin reopening state economy on May 1,\" April 17, 2020", "Tweet, April 26, 2020", "The Washington Post, \"Michigan Gov. Gretchen Whitmer is a rising star for Democrats and a target for Republicans,\" April 18, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]