["A 30-second video of water gushing inside a bus with passengers on board is viral with the claim that the incident happened in Delhi. Punjab Congress shared the video on both Twitter and Facebook writing, “Kejriwal’s Delhi model”.", "ਕੇਜਰੀਵਾਲ ਦਾ ਦਿੱਲੀ ਮਾਡਲ pic.twitter.com/tGKiBgSdRp", "— Punjab Congress (@INCPunjab) July 24, 2021", "It has also been shared by other pages.", "Congress national media panellist Abhishek Dutt had tweeted the same video earlier in August. He wrote, “What will Kejriwal advertise tomorrow morning through full-page newspaper ads?” How to make pakoras with tea during heavy rainfall? (Whatsapp)”", "#केजरीवाल जी कल सुबह किस बात का प्रचार फुल पेज ऐड अखबारों के माध्यम से देंगे ? बारिश में जल भराव के समय चाय के साथ पकोड़े कैसे बनाए ? (Whatsapp) pic.twitter.com/xSOJ8wkSsU", "— Abhishek Dutt (अभिषेक दत्त) (@duttabhishek) August 13, 2020", "Congress leader Alka Lamba retweeted Dutt’s tweet.", "Delhi Youth Congress tweeted the same video and wrote, “Arvind Kejriwal ji, your development starts sinking as soon as the rain comes. This video shows the work done by the Delhi government in these 6 years, no work has been done except cheating and looting.” This tweet has now been deleted. Gurpreet Kaur Chadha, vice president of the Mumbai Mahila Congress, also tweeted the video as Delhi and later took down her tweet.", "Republic Bharat anchor Ashutosh Chaturvedi tweeted the video claiming it shows a DTC bus in Delhi. A user @Being_Habibi also shared it targeting Delhi Chief Minister Arvind Kejriwal. The video has over 60,000 views as of this writing.", "Kejriwal ji delhi walon ko Venice ka tour DTC mein karate hue😉🤣😂 pic.twitter.com/G4tPojWPcL", "— Binod Caravaan 2.0 (@Being_Habibi) August 13, 2020", "A reverse image of a frame of the video led to media reports which claim that the incident took place in Jaipur, Rajasthan. A report in Patrika from August 11, 2020, carried a screenshot of the video. The article said that the incident happened in Jaipur.", "NDTV journalist also tweeted the video as Jaipur.", "बस बनी नाव! जयपुर का सत्य बताया जा रहा है ये!", "भू. चू. ले. दे. pic.twitter.com/eZfHnviLlF", "— Umashankar Singh उमाशंकर सिंह (@umashankarsingh) August 11, 2020", "At 58 seconds in the video, we can spot ‘Jaipur Bus’ written on the side of the vehicle.", "At 54 seconds, a board of ‘नसियां भट्टारकजी’ (Nasiyan Bhattarak Ji) is also visible which is a Jain temple in Jaipur.", "However, there have been reports of waterlogging due to heavy downpours in the capital.", "Therefore a video from Jaipur was shared as Delhi. Republic Bharat’s Ashutosh Chaturvedi later tweeted the same.", "Donate Now", "Priyanka Jha specialises in monitoring and researching mis/disinformation at Alt News. She also manages the Alt News Hindi portal.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]