["About this rating", "A common form of glurge is the inspirational tale of faith, one meant to encourage Christians not to waver in their beliefs even in the face of denunciation by an unchallengeable authority figure.", "This theme is echoed in a often-shared tale about a religious army recruit whose disdainful CO decides to show the young man up by ordering him to park a jeep despite knowing that he can't drive:", "THE IMPOSSIBLE GOD OF A YOUNG SOLDIER", "A young man in the army was constantly humiliated because he believed in God. One day, the Captain wanted to humiliate him in front of the army.  He called out to the young man and said, \"Young man, come here, grab the key, and go and park the Jeep in front.\"", "The young man replied, “I can't drive!”", "The captain said, \"Well, then ask your God for help! Show us that He exists!\"", "The young man took the key, went to the vehicle, and began to pray ... then he parked the jeep in the spot perfectly, just as the captain wanted.", "The young man came out of jeep and saw everyone around him crying. They all said together, \"We want to serve your God!\"", "The youngest soldier was amazed and asked, \"What's going on?\"", "Crying, the captain lifted the hood of the jeep, showing it to the young man -- the car had no engine!", "Then the young man said, \"Look, this is the God I serve, the God of the impossible, the God who gives life to that which does not exist. You may think that there are impossible things, but with God everything is POSSIBLE.\"", "YOU WHO READ THIS, PLEASE LORD WORK FOR SUPER WONDERS IN YOUR LIFE TODAY In the name of Jesus, I pray.", "In this narrative, a young soldier mocked for his belief in God is able to successfully start, drive, and park a jeep despite not only not knowing how to drive, but despite the fact that jeep lacks an engine! The miraculous event thereby not only puts the scornful authority figure in his place, but it also shepherds numerous new recruits to the young man's faith.", "As for the literal truthfulness of this narrative, although many people have certainly managed to drive automobiles competently despite having no previous instruction or experience, we have not yet come across a documented case of anyone's successfully starting and driving a vehicle that was completely lacking an engine or motor (outside of coasting one downhill).", "We also note that the image of the crying soldier commonly circulated with this narrative has nothing to do with the story. It's a picture of Fin Doherty, who was photographed in 2019 wearing the maroon paratrooper's beret that belonged to his older brother Jeff, who was fatally wounded during a Taliban ambush in Afghanistan in 2008.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]