["By FactCheck.org", "Posted on January 27, 2020", "A post on Facebook falsely claims comedian Sam Hyde is responsible for the spread of the new coronavirus. Researchers are still working to determine the source of this latest coronavirus, though evidence suggests it was first transmitted to humans from an animal.", "In late December, the World Health Organization learned that several patients in Wuhan, China had contracted pneumonia from a virus that did not match any known viruses. In early January, officials in China concluded that the virus was a new coronavirus, a group of viruses that can cause illnesses ranging from the common cold to severe acute respiratory syndrome, known as SARS, and Middle East respiratory syndrome, known as MERS.", "A post on Facebook makes the bogus claim that “authorities have identified that the international chemical-warfare terrorist ‘Samuel Whitcomb Hyde’ is behind the deadly China ‘coronavirus.'”", "Sam Hyde is actually an actor, known for his work with sketch comedy group, “Million Dollar Extreme.” The group created a series called World Peace, which aired in 2016 on the channel Adult Swim, and was cancelled after being accused of promoting racism, sexism, and bigotry.", "Hyde has been a target of other bogus internet conspiracy theories, usually involving mass shootings, as Forbes magazine documented in 2016. “If Twitter is to be believed, second-rate Internet comedian Sam Hyde is behind every nationally publicized shooting of the past year — that’s more than a dozen since last October,” the Forbes article said.", "BuzzFeed produced a video last year that carried the headline: “Why ‘Sam Hyde’ Goes Viral After Every Mass Shooting.” It opens with CNN’s coverage of a mass shooting in Sutherland Springs, Texas, in 2017, and Rep. Vincente Gonzalez of Texas mistakenly telling CNN that Hyde was the suspected shooter.", "“Apparently, his name was released as Sam Hyde,” Gonzalez wrongly told CNN. “That was a name I was — I was given. We don’t know any more details.”", "Gonzalez “fell for a long-running hoax,” as the New York Times explained at the time. Gonzalez’s office issued a statement that said he “deeply regrets” the error, the Times reported.", "The latest hoax about Hyde also claims that the virus is spreading at an “unprecedented rate” and has “affected approximately 18 million people so far.” As of early Jan. 27, there had been nearly 2,900 confirmed cases globally and 81 reported deaths. So far, all of the deaths have been in China, with the vast majority of cases occurring in China. In the United States, there have been five confirmed cases, as of Jan. 27, according to the Centers for Disease Control and Prevention.", "Officials are still working to determine how quickly the virus is spreading, and travel restrictions in Wuhan and surrounding cities have affected an estimated 50 million people.", "As we’ve reported, the first cases of the new respiratory illness were linked to a fish market in Wuhan that also sold a variety of live animals. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, told Scientific American on Jan. 22 that the new virus “almost certainly” came from an animal. The virus, however, now shows signs of person-to-person spread, according to the CDC.", "— By Chloe Wilson", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Novel Coronavirus (2019-nCov). World Health Organization. Undated. Accessed 26 Jan 2020.", "Q&A on coronaviruses. World Health Organization. 9 Jan 2020.", "“Million Dollar Extreme.” Facebook. Undated. Accessed 26 Jan 2020.", "“Million Dollar Extreme Presents: World Peace.” IMDB.com. Undated. Accessed 26 Jan 2020.", "Blistein, Jon. “Adult Swim Cancels Controversial Show ‘Million Dollar Extreme.’” Rolling Stone. 6 Dec 2016.", "Eordogh, Fruzsina. “How 4Chan Tricked The Internet Into Believing This Comedian Is A Mass Shooter.” Forbes. 2 Jun 2016.", "“Why “Sam Hyde” Goes Viral After Every Mass Shooting.” BuzzFeed YouTube channel. 2 Jul 2019.", "Wuhan Coronavirus (2019-nCoV) Global Cases. Data visualization by Johns Hopkins University. Accessed 24 Jan 2020.", "Moritsugu, Ken. “Xi calls situation grave as China scrambles to contain virus.” Associated Press. 25 Jan 2020.", "2019 Novel Coronavirus, Wuhan, China. CDC. Accessed 73 Jan 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]