["Despite overwhelming evidence that Barack Obama is a natural born citizen of the United States and eligible to be  president, there are still plenty of people out there who believe that President Obama is a fraud. One of our loyal readers forwarded us a chain e-mail with several claims that we just couldn't pass up.", "In the chain e-mail is an article titled \"Very Quietly Obama's Citizenship Case Reaches the Supreme Court.\" You would think this would have been big enough news that we would have heard about it, but this \"article\" has a dateline of April 1 (hint, April Fool's Day) and is also credited to the the Associated Press.", "In the article, the headline is further expanded upon, \"Under growing pressure from several groups, Justice Antonin Scalia announced that the Supreme Court agreed on Tuesday to hear arguments concerning Obama's legal eligibility to serve as President in a case brought by Leo Donofrio of New Jersey.\"\n \nYou heard about this, right?", "For a plethora of reasons, we didn't expect that this was a legitimate AP article, but we decided to check with them anyway. It is not, according to Jack Stokes, an AP spokesperson.", "Still, maybe, somehow, this forged article contains some factual information?\n \nLeo Donofrio, a lawyer from New Jersey, did sue New Jersey Secretary of State Nina Wells in an attempt to block the election of Barack Obama. Donofrio claimed that since Obama's father was a British citizen, Obama was granted dual citizenship at birth and therefore was not eligible to be elected President.", "The case was submitted to the Supreme Court, but the court did not agree to hear it. The first tidbit that tipped us off was that the e-mail said Justice Scalia announced that the court agreed to hear arguments. That's not how it works. In order for the Supreme Court to hear a case, at least four justices have to be in favor of hearing it. At that point they issue a \"writ of certiorari,'' colloquially reffered to as \"cert.\" However, an individual justice doesn't make such an announcement. Such information typically comes from the court's public information office.\n \nDonofrio's case first went to Justice Souter, who denied the request. At that point it got bounced to Clarence Thomas, who submitted the case to committee. Just because Thomas sent the case to committee does not necessarily mean he supported hearing it, only that he thought it was worth it for the court to consider hearing the case.", "The court denied \"cert\" for Donofrio's case and that was the end of it. Still we wondered if the case had any legitimacy.", "This is an extremely misleading chain e-mail. First, it is not an Associated Press article, despite posing as one. Second, an individual justice would not speak for the court when agreeing to hear a case. Third, the case was, in fact, denied cert by the court. It's a ridiculous and misleading claim, so we give it a Pants On Fire.", "Interview with Elder Witt, author of Guide to the U.S. Supreme Court 2nd ed., June 7, 2010.", "Interview with Peter Spiro, Professor of Law at Temple University, June, 11, 2010.\n\nInterview with Ilya Shapiro, Senior Fellow in Constitutional Studies at the Cato Institute, June 11, 2010.\n\nE-mail Interview with Jack Stokes, Manager of Media Relations at The Associated Press, June 7, 2010.\n\nLeo Donofrio, \"Why Obama is ineligible -- regardless of his birthplace,\" World Net Daily, April 01, 2010.\n\nJoe Miller, \"Does Barack Obama Have Kenyan Citizenship?\" FactCheck.org, September 3, 2009.\n\nSupreme Court of the United States, \"Donofrio vs. Wells.\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]