["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Jim Kenney, then mayor-elect, at a Philadelphia neighborhoods town hall. Credit: Facebook", "Mayor Jim Kenney boasted of his administration’s diversity numbers at the Better Bike Share Conference in Philadelphia Thursday.", "Clarena Tolson, deputy managing director of the Office of Transportation and Infrastructure (oTIS) had just given well received remarks to introduce the mayor. When addressing the crowd, seemingly in reference to Tolson, he said, \"I have some advice for anyone who wants to be successful in their career: Hire and promote smart women. Because they’ll get it done.", "\"We went about doing that in the beginning of the administration through [the] transition. We are well represented both racially, ethnically and gender-wise.\"", "Kenney has received both good and bad attention for his hiring. A month into his administration, Philadelphia Magazine noted that 55 percent of his appointees were women. The magazine also reported that 34 percent his appointees were people of color. Does that mean it’s diverse?", "There are multiple ways we could measure diversity in the Kenney administration. Using this organizational chart as a basis, PolitiFact PA estimates at least 60 percent of the administration’s top brass is white, while some 50 percent are women. Exempt employees making more than $90,000, according to the city, are 61 percent white. Reacting to demographics for certain city departments, Council President Darrell Clarke called racial representation across execs \"clearly problematic\" during a budget hearing.", "City employees overall are 57 percent of color. (Philadelphia demographically is 44 percent black, 14 percent Hispanic, seven percent Asian, one percent Native American or Pacific Islander, and 34 percent white.) The disparity between the racial makeup between high-level employees versus the overall workforce predates Kenney’s term. Philly.com analysis found that in 2015, 64 percent of Nutter adminstration staffers making more than $85,000 were white, comparable to the current admistration’s numbers.", "This issue is by no means unique to Philadelphia. Kenney is among a recent wave of American mayors tackling this City Hall hiring gap with new tactics, perhaps following the lead of Boston’s Marty Walsh, Pittsburgh’s Bill Peduto, and former Seattle Mayor Greg Nickels. Kenney appointed the city’s first Chief Diversity and Inclusion Officer, Nolan Atkinson, whom he named before taking office.", "Many observers might say that the disparity needs closer examination. (Kenney’s spokeswoman Lauren Hitt said as much before the mayor’s swearing-in, in an email to Billy Penn last November.) Advocates and politicians have pointed to hiring practices and a less-than-ideal pipeline that’s not tracking candidates of color for the top jobs. Also of interest: according to Philadelphia Magazine, 57 percent of Kenney’s appointees, \"at least,\" had worked in the previous administration.", "\"[T]he City has some complicated, underlying barriers to racial and gender diversity, which the Mayor has acknowledged on multiple occasions,\" Mike Dunn, another city spokesperson, said in an email. \"It’s why he created the position of the Chief Diversity and Inclusion Officer, so that is one office’s full time responsibility to address these barriers in a systemic, focused way.\"", "Dunn mentioned that Pew is currently studying their workforce diversity, looking into policy fixes and best practices. \"The outcome of the study will likely lead to changes made by the City to make city employment more representative of the population,\" Dunn wrote.", "Our ruling", "Kenney said his administration was \"well-represented both racially, ethnically and gender-wise.\"", "Philadelphia is the only major city where women constitute the majority of workers. It’s a slight majority, and that’s close to what Kenney’s administration looks like. This is something for which Kenney has been celebrated. The other categories in his comment are another story, though.", "Pittsburgh Mayor Bill Peduto gets praise— his administration has been called Pittsburgh’s most diverse ever— for appointing a comparable percentage of blacks. But Pittsburgh is about two thirds white. Philadelphia is roughly two thirds of color.", "The Kenney administration’s numbers racially aren’t representative of Philadelphia. Sixty-one percent of the city’s top earners are white. While African-Americans are underrepresented, Asians and Latinos are even more so: Four percent of employees paid more than $90,000 are Hispanic; another four percent are Asian. In the city’s population as a whole, those two groups represent more than 2.5 times that.", "We rate this claim Mostly False.", "\"Clarke: Lack of Diversity in Some City Departments Is ‘Problematic,’\" Philadelphia Magazine, April 20, 2016.", "\"Jim Kenney’s Team: Mostly White, Majority Women,\" Philadelphia Magazine, February 7, 2016.", "\"As America Diversifies, So Should Government Jobs From Top to Bottom,\" Next City, April 7, 2015", "\"Philly’s workforce secret: A bigger share of women than any major U.S. city,\" Billy Penn, March, 29, 2016", "\"Why Jim Kenney thinks Philadelphia needs a diversity officer in City Hall,\" Billy Penn, November 20, 2015", "\"White-collar, black-collar:", "Philly's public sector divide, Part two,\" The Next Mayor, Philly.com, Fall 2015", "\"How The Mayor Of Pittsburgh Hired The Most Diverse Staff In The City's History,\" Fast Company, February 2, 2015", "Philadelphia Quick Facts, Census, 2015 data", "Emails, Mike Dunn, deputy director of communications, City of Philadelphia, June 23, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]