["About this rating", "Chelsea Clinton, who has stirred controversy in the past with her outspoken advocacy of women's reproductive rights, provoked a new torrent of criticism with remarks she made during a 13 September 2018 SiriusXM Town Hall discussion about the future of Roe v. Wade.", "Responding to a question about what motivates her to keep going in the multi-generational struggle to ensure safe access to abortion, Clinton spoke of what life was like for women before Roe v. Wade and tied her feelings about the 1973 Supreme Court decision to her personal religious convictions:", "[W]hen I think about all of the statistics, that are painful, of what women are confronting today in our country, and what even more women confronted pre-Roe, and how many women died, and how many more women were maimed because of unsafe abortion practices, we just can’t go back to that. That's unconscionable to me.", "Also, and I'm sure this will unleash another wave of hate in my direction, but as a deeply religious person, it’s also un-Christian to me.", "﻿", "There was indeed a swift partisan reaction to her remarks, which were sometimes paraphrased accurately by online news sources (\"Chelsea Clinton: It would be 'un-Christian' to go back to pre-Roe era,\" reported the Washington Examiner) and other times re-worded to skew their meaning.", "The pro-life websites LifeNews.com and LifeZette ran articles criticizing Clinton's statements under variants of the headline, \"Chelsea Clinton Says It Would be “Un-Christian” to Protect Babies From Abortion.\" There were other formulations (including one site's claim that Clinton said it's un-Christian \"to not support slaughter of unborn\"), but the readers who contacted Snopes asking us to authenticate the statement focused on the former.", "Clearly, Chelsea Clinton did not literally say it would be un-Christian to protect babies from abortion.", "One can argue in defense of that paraphrase by pointing out the obvious, that reversing Roe v. Wade would likely have the effect of reducing the number of abortions performed in the United States, but that logic works both ways. If it's fair to equate \"It would be un-Christian to go back to pre-Roe days\" with \"It would be un-Christian to protect babies from abortion,\" then it's no less fair to equate \"The Christian thing to do would be to reverse Roe v. Wade\" with (using Clinton's formulation) \"The Christian thing to do would be to stop protecting women from being maimed and killed by illegal, unsafe abortion practices.\"", "What makes these jarring equivalencies possible is that each side in the abortion debate frames the issue in completely different terms and under a different set of moral priorities (as revealed in the charged language both use, such as \"killing babies\" vs. \"women's right to choose\"). For that matter, the Clinton controversy shows that deep divisions exist even among people who call themselves Christians as to what it means to be a sincere, \"deeply religious\" member of that faith.", "We do not wish to take sides in this clash of world views, but merely to point out that so sharp is the disconnect between them that both are comfortable asserting that they're upholding \"Christian\" values while taking diametrically opposite stands on abortion. That each each finds the other's viewpoint morally objectionable is not a surprise.", "Bilger, Micaiah.   \"Chelsea Clinton Says It Would Be 'Un-Christian' to Protect Babies From Abortion.\"\r\n    LifeNews.   14 September 2018.", "Sullivan, Peter.   \"Chelsea Clinton: Undoing Roe v. Wade Would Be 'Un-Christian.'\"\r\n    The Hill.   14 September 2018.", "LifeZette.   \"Chelsea Clinton: It Would Be 'Un-Christian' to Protect Babies from Abortion.\"\r\n    14 September 2018.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]