["Former Vice President Joe Biden said that part of the opioid epidemic is fueled by doctors who over prescribe.", "Biden, a University of Pennsylvania presidential professor of practice expected to soon launch a bid for president, cited one research paper that pointed to a high number of prescriptions for a minor injury.", "\"People show up in the emergency room with a sprained ankle, 25 percent of them get an opioid prescription,\" Biden said during a panel discussion on the opioid epidemic at Penn on April 11.", "Pennsylvania is among the states with the highest rates of drug overdose deaths. Overdose deaths involving prescription opioids were five times higher in 2017 than in 1999, according to the U.S. Centers for Disease Control and Prevention.", "Biden was referring to a study by Penn doctors published in the journal Annals of Emergency Medicine in 2017. The study found that that about one in four ankle sprain patients who were treated in emergency rooms received an opioid prescription. But Biden left out the good news: The study found that prescribing rates in emergency departments were falling.", "The researchers and  identified all first-time adult patients with ankle sprains between 2011 and 2015, relying on claims data of privately insured U.S. patients.", "The study included 30,832 patients treated in the emergency department for an ankle sprain who had not filled a prescription for opioids in the previous six months. The researchers chose ankle sprains because they are common minor injuries that generally improve after a short amount of time with rest, ice, elevation and over the counter medication, such as ibuprofen.", "Nationally, they found the median prescription rate was 24.1 percent for those years. The rate declined during the study period, from 28.1 percent in 2011 to 20.4 percent in 2015.", "Although the prescriptions declined, the prescription rate and regional differences gave researchers reasons for concern.", "\"The prescribing rate was greater than 10 times higher in some states versus others,\" the study says. \"This is concerning because ankle sprains are a minor, self-limited condition for which there is likely to be little clinical benefit from opioids.\"", "The researchers compared prescribing rates in the states with expected rates, factoring in demographics and socioeconomic factors and chronic medical conditions. They found varying rates in the states, ranging from 40 percent in Arkansas to 3 percent in North Dakota, in 2014 and 2015. Above-average rates were largely in the South.", "It’s hard to pinpoint why the rates vary by area. Factors could include differences in clinician culture and patient expectations and differences in state prescribing guidelines, said M. Kit Delgado, lead author of the study and Penn assistant professor of emergency medicine and epidemiology.", "Other research from around the same time also indicates a high rate of opioid prescriptions. Scott Weiner, an associate professor of emergency medicine at Harvard, pointed to his study that examined emergency department patients treated during a single week across the country in 2012.", "Researchers found 17 percent of discharged patients were prescribed opioid pain relievers. The most common diagnoses associated with opioid pain reliever prescribing were back pain, abdominal pain, extremity fracture or sprain.", "However, much has changed since 2015, the end of the study period for the Penn study, Weiner told PolitiFact.", "\"There has been a total sea change in our approach to opioid prescribing since then,\" he said.", "Weiner and co-authors looked at the 2012 implementation of opioid prescribing guidelines in Ohio. They found that prescriptions were dropping precipitously before the emergency department guideline implementation, and even more so afterward.", "In the two emergency departments where Weiner works, he said opioid prescriptions issued at discharge have dropped from about 600 per month in July 2015 to 150 in February 2019.", "The CDC found that the overall national opioid prescribing rate declined from 2012 to 2017, and in 2017, the prescribing rate had fallen to the lowest it had been in more than 10 years.", "The American College of Emergency Physicians is working with emergency departments around the country to implement a program for opioid alternatives.", "\"There is now a recognition that opioids are harmful and that alternatives to opioids work just finem\" Weiner said. \"So now, ankle sprains get a splint, crutches (if needed), ice, elevation, ibuprofen, acetaminophen, etc., and patients do fine.\"", "Biden said, \"People show up in the emergency room with a sprained ankle, 25 percent of them get an opioid prescription.\"", "A national study found nearly one in four patients with ankle sprains were prescribed opioids in the emergency department from 2011 to 2015. But rates fell during that time period, to about 20 percent of patients treated for ankle sprains in 2015. More awareness about overprescribing and strengthened state guidelines appear to be driving the decline, experts said.", "We rate this statement Mostly True.", "NowThis, University of Pennsylvania panel with Joe Biden, April 11, 2019", "Annals of Emergency Medicine, National Variation in Opioid Prescribing and Risk of Prolonged Use for Opioid-Naive Patients Treated in the Emergency Department for Ankle Sprains, May 2017", "University of Pennsylvania, Research brief, August 2018", "Annals of Emergency Medicine, The Effect of Opioid Prescribing Guidelines on Prescriptions by Emergency Physicians in Ohio, December 2017", "Annals of Emergency Medicine, Opioid Prescribing in a Cross Section of US Emergency Departments, September 2015", "U.S. Centers for Disease Control and Prevention, Prescription opioids, Aug. 29, 2017", "U.S. Centers for Disease Control and Prevention, Opioid Prescribing is Still High and Varies from County to County, July 6, 2017", "U.S. Centers for Disease Control and Prevention, Understanding the epidemic, Dec. 19, 2018", "U.S. Centers for Disease Control and Prevention, U.S. Opioid Prescribing Rate Maps, Oct. 3, 2018", "American College of Emergency Physicians, E-QUAL Network Opioid Initiative, Accessed April 15, 2019", "PolitiFact, Have more died from opioids in two years than in Vietnam War? Nov. 15, 2018", "Interview, Bill Russo, Joe Biden spokesman, April 14, 2019", "Interview, M, Kit Delgado, University of Pennsylvania Assistant Professor of Emergency Medicine and Epidemiology and a practicing trauma center emergency physician, April 12, 2019", "Interview, Andrew Kolodny, Co-Director of Opioid Policy Research at the Heller School for Social Policy and Management at Brandeis University, April 12, 2019", "Interview, Jeanmarie Perrone, Professor of Emergency Medicine at the Hospital of the University of Pennsylvania and Director, Division of Medical Toxicology, Department of Emergency Medicine, University of Pennsylvania, April 12, 2019", "Interview, Scott Weiner, associate professor of Emergency Medicine at Harvard,April 12, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]