["About this rating", "Images purportedly showing the moment before a disastrous incident struck an unknowing photographic subject are continually popular on the Internet. Although some of these incredible pictures are authentic, more often than not they are created through some form of photographic trickery.", "We've covered a number of these images over the years: No, this isn't a selfie before a shark attack; no, not a bear barging into a tent; no, not a tourist at the World Trade Center before the 9/11 attack.", "In July 2018 we came across another image of this ilk, but this time the photograph purportedly showed a bear getting dangerously close to a fisherman showing off his catch for the camera in the middle of a river:", "This image has occasionally been shared with the caption \"Canadian Food Chain,\" but it is most often attached to the title \"Completely Oblivious.\" Not only does this title refer to the fisherman's supposed state of awareness, but also to the origins of this Photoshopped picture.", "This image was created for a digital editing contest on the web site \"Worth 1000\" (now DesignCrowd) with the title \"Completely Oblivious 4.\" The guidelines for the contest, which was held in August 2012, read as follows:", "Have you ever seen a photo of someone who is completely unaware of the surreal chaos or danger going on around them?", "That's the idea behind this contest. We want you to create images where the people in the photo are totally unaware of some chaos or danger or surreal situation going on behind them. Think of tourists posing for a photograph in front of the Empire State building in New York City, without realizing that King Kong is actually climbing up the side of it. Think of firemen proudly posing for a group photo in front of their fire station, completely oblivious to the fact that it's currently burning down behind them. Subtlety is a good idea here, although it could be even funnier if the unnoticed chaos is somehow directly tied to the subject of the photo. For instance, a janitor at the local Zoo smiling for the camera while mopping up a tiger cage with a tiger club clinging to a stick (instead of using an actual mop).", "Worth 1000 user ufurgger earned the bronze prize for this entry.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]