["About this rating", "A photograph shows surplus apples hanging from a fence in Norway, which passersby are free to take.", "This is not a countrywide program; Norwegians are not expected to give away fruit after a successful harvest.", "A photograph showing several bags of apples hanging from a fence is frequently shared online along with messages claiming that this practice is common in Norway as a way to give away surplus fruit:", "This photograph was taken circa September 2018 and shows dozens of apples hanging from the fence around a home in Norway. The Norwegian news outlet Drammens Tidende spoke to the homeowner, Inger Garås, and found that she had given away more than 200 bags of apples this way:", "Here's an excerpt from the Drammens Tidende report (loosely translated via Google):", "Just today I hung out 30 bags with about one kilo of apples in each, and it was gone in an hour or two, Inger Garås tells Drammens Tidende.", "This past week she has hung apple bags on the white fence every day, and in total she has distributed around 200 bags of apples. About 200 kilos. But Inger points out that she hasn't counted all the bags every time ...", "... \"There are so many apples this year. Nice, clean and large. I don't get to use everything, and it becomes too much to throw away. Then it is much better to give them away, says the generous mouth watering.\"", "Drammens Tidende reported that Garås lives on a large property with several apple trees, some of which were planted as early as the 1850s. Garås said that she would keep hanging her apples from the fence so that less of them go to waste.", "While this picture does document one Norwegian woman's attempt to give away apples, this photograph is often shared as if it represents a common practice in the country. As far as we can tell, that simply isn't the case. Norwegians are not expected to give away their surplus fruit, and we haven't found anything (outside of this single image) to indicate that this practice is widespread in the country.", "In fact, the existence of this news report indicates that this was a rather rare occurrence. Drammens Tidende was not writing about a cultural phenomena in Norway. Rather, they were writing a story about one woman's kind act of giving away surplus apples for free.", "Furthermore, Norwegians frequently chime in when this image is shared online to dispute the idea that this is common practice. Some have noted that the premise of the meme was flawed because Norway doesn't have a large homeless population. Others noted that the word \"epleslang,\" which means \"stealing apples from a neighbor’s garden,\" wouldn't exist if this was common practice.", "While it's certainly possible that other Norwegians have put out similar bags to get rid of surplus fruit, this doesn't appear to be a common, countrywide practice.", "Pourramedani, Ali.   \"Marked decline in homeless people in Norway.\"\r\n    Norway Today. 7 June 2017.", "Christoffersen, Linn.   \"Inger Deler ut Gratis Epler Til Forbipasserende: – Det er Mange Som Spør «Kan Jeg Virkelig Ta»?\"\r\n    Drammens Tidende.   14 September 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]