["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Trump never wrote the tweet. It was fabricated.", "Facebook users are circulating an image of a fake tweet attributed to President Donald Trump that states he spoke with George Floyd’s family and they were \"honored\" to hear from him.", "The faux tweet is rife with grammatical errors. It reads:", "\"I spoke with George Floyd’s family. There voices told me they were honored to hear from me. I told them I didn’t want to see another black man die by a knee to the neck. It looked to painful. There’s better ways to die. No way is good, but that was very bad.\"", "This is not a legitimate tweet by the president.", "It doesn’t appear anywhere on Trump’s Twitter timeline on May 29, the date the screenshot shows it was supposedly posted.", "ProPublica, a nonprofit journalism organization, maintains a database of tweets deleted by politicians called Politwoops. The alleged post is not captured in the database, and we found no evidence that shows the tweet ever existed on the platform.", "Websites allow anyone to generate real-looking, but ultimately fake tweets using tweet generators.", "Trump did say on May 29 that he spoke with members of Floyd’s family. He described them as \"terrific people\" and said he reached out to them to express his sorrow.", "As for the fictitious tweet, we rate it Pants on Fire!", "Facebook post, May 31, 2020", "Twitter, @RealDonaldTrump, Accessed June 2, 2020", "ProPublica, Politiwoops deleted tweets database, Accessed June 2, 2020", "Reuters, Fact check: Trump did not tweet that George Floyd’s family were honored to hear from him, June 1, 2020", "NBC, Trump says he spoke with George Floyd's family: 'I just expressed my sorrow', May 29, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]