["The president’s record on the economy has been diminished by the devastating fallout of the coronavirus pandemic. Polls, however, tend to remain positive for him when voters are asked who they trust more to create jobs and economic growth.", "This sentiment stems from Trump’s career as a businessman, an early tax cut he signed as president and a strong stock market, which -- on paper at least -- boosts retirement savings. Regardless, Trump’s messaging on the economy is prone to exaggeration and hyperbole.", "AFP Fact Check examines the numbers.", "Did Trump create the ‘greatest economy?’", "Gross domestic product and job numbers are the main measures of US economic health. Trump has touted both, as well as chart-topping stock prices, as proof of his success. But his claims are misleading.", "In Trump’s favor, US unemployment hit a 50-year low of 3.5 percent in December 2019. In January this year, however, before states imposed lockdowns to try and contain the coronavirus, the Labor Department issued an update that was less positive; revised numbers showed job growth slowed significantly in the first three years of Trump’s presidency.", "Some 6.5 million jobs were added between 2017 and 2019 -- 2.109m, 2.314m (in 2018, Trump’s best year) and 2.096m. This compared to more than eight million jobs -- 3.004m, 2.72m and 2.345m -- in the three prior years, under Barack Obama.", "The pandemic has upended the job market.", "Unemployment peaked at 14.7 percent in April 2020 -- almost seven million Americans filed for government help in one week of March alone. Millions of those lost jobs have since returned.", "In August, the unemployment rate was 8.4 percent. The number of jobless people making new claims for benefits remains at a historic high -- 870,000 in the week that ended September 19 -- a sign that a patchy US economic recovery is losing steam.", "Gross Domestic Product (GDP)", "Growth measured by GDP has not set records under Trump. The best year of his presidency saw a three-percent rise in 2018, compared to 3.1 percent in 2015 under Obama. As recently as 2004 and 2005, under president George W. Bush, the economy grew 3.8 percent and 3.5 percent, respectively.", "None of these three presidents have run close to reaching a historic high; the 1950s and 1960s saw years when growth was more than five percent annually.", "The stock market", "US stocks reached historic highs under Trump. When he entered office on January 20, 2017 the Dow Jones Industrial Average stood at 19,827.25 points. The index peaked on February 12, 2020, at 29,551.42 points. But as business confidence plunged with the pandemic the Dow Jones cratered and closed at 19,173.98 on March 20, 2020, ending the index’s worst week since 2008.", "Much of that ground was later recovered. On September 29, hours before the first presidential debate, the Dow Jones closed at 27,452.66.", "The stock market, sensing an infusion of economic stimulus cash following Biden's November 3, 2020 election victory, surged again. The Dow Jones closed at 30,930.52 on January 19, 2021, Trump's last day in office.", "When percentage growth during Trump’s tenure is compared with Obama’s, however, a very different picture emerges.", "Obama inherited a market in the depths of the global financial crisis. The Dow Jones was at 7,949.09 points. By the start of his second term in 2013 it had risen to 13,649.70. When he left office the index had registered an overall cumulative growth of 148.3 percent over eight years.", "In Trump’s single term as president the Dow Jones grew 56 percent.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]