["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A video showing how the vapor generated by using an electronic cigarette can pass through masks is not evidence that masks don’t prevent the spread of COVID-19.", "Masks are meant to protect against the passing of larger respiratory droplets that can carry the coronavirus.", "The federal Centers for Disease Control and Prevention and other experts continue to recommend mask wearing as a key way to prevent spread of the virus.", "In a video clip being shared on Facebook, a retired anesthesiologist who rails against mask wearing to protect against COVID-19 purports to demonstrate their ineffectiveness by blowing out the vapor from an electronic cigarette. The video carries the headline: \"Doctor proves masks ‘don’t work.’\"", "But he doesn’t prove that at all.", "The fact that he can blow vapor through a mask is not evidence that masks don’t protect against passing the coronavirus. After all, people breathe in and out with masks on.", "\"By that illogic, the fact that air can pass through a mask could be cited as ‘evidence’ as well,\" said Dr. Amesh Adalja, senior scholar at the Johns Hopkins Center for Health Security.", "Cindy Prins, a clinical associate professor of epidemiology at the University of Florida, called the video \"completely misleading.\"", "\"Fabric and surgical/procedure masks are meant to help protect against larger droplet particles that may contain COVID-19,\" she said. \"You have to be able to breathe through a mask, and he is just blowing out water vapor, so that is expected to be able to go through a mask.\"", "The Facebook post that includes the video clip was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "The video is by Dr. Ted Noel, a former Florida anesthesiologist. Noel allowed his license to expire in 2014 after deciding to retire, the Florida Department of Health told us.", "Noel’s YouTube channel has more than 19,000 subscribers and has had more than 9 million views since it was started in 2016.", "In the three-minute clip, Noel blows e-cigarette vapor through a variety of masks, including a surgical-style mask and a cloth mask like those commonly worn to control the spread of COVID-19.", "When we asked Noel to back his position, he argued in an email that COVID-19 is spread by aerosols, and that 90% of aerosols and viruses \"go right through\" cloth masks. He also argued that \"basically, the only way droplets can spread COVID-19 is if an ill person happens to be quite close to an uninfected person who happens to be breathing in at the exact moment that the ill person expels the droplets.\"", "Noel has repeatedly railed against masks. On Jan. 31, he wrote: \"Most Americans intuitively recognize that masks don’t reduce infections. But they go along with the virtue signaling to be good citizens.\" In his email, he called Dr. Anthony Fauci, the nation’s leading infectious-disease expert, \"a lab rat turned bureaucrat who plays a doctor on TV.\"", "Noel's claims on countering the spread of the coronavirus are contradicted by public health experts.", "The clip demonstrates that \"to work properly, even the best masks or respirators need to fit properly, without gaps, and not everything that looks like a really good mask necessarily has good filtration,\" said Stephen Morse, professor of epidemiology at the Columbia University Medical Center.", "But \"it is a leap to go from there to generalizing that ‘masks don’t work,’\" he said. Many peer-reviewed studies show \"that masks do have a significant effect. They do work, when used properly.\"", "CDC guidance allows that the protection afforded by a mask depends on the type of mask and the nature of the substance in the air — whether it’s liquid droplets, gaseous vapor, or solid particles like soot or pollen.", "For example, cloth masks that are used to slow the spread of COVID-19 offer little protection against the tiny particles of wildfire smoke, the CDC said when addressing wildfires and COVID-19 in the summer of 2020.", "But, as Prins said, it’s the larger respiratory droplets that are the concern with COVID-19.", "The primary way people get COVID-19 is exposure to respiratory droplets that carry the virus, the CDC reiterated in a research brief in October 2020. The droplets can be transmitted between people through touch or through the air, typically when people are less than 6 feet apart.", "Measures such as mask wearing, social distancing and hand hygiene \"appear sufficient to address transmission both through close contact and under the special circumstances favorable to potential airborne transmission,\" the brief said.", "\"Multi-layer cloth masks block release of exhaled respiratory particles into the environment, along with the microorganisms these particles carry,\" the CDC said in a November 2020 research brief. \"Cloth masks not only effectively block most large droplets, but they can also block the exhalation of fine droplets and particles, also often referred to as aerosols.\"", "The CDC recommends that people wear masks \"in public settings, at events and gatherings, and anywhere they will be around other people\" to slow the spread of COVID-19, because masks provide a barrier that keeps the respiratory droplets from spreading between people.", "On Jan. 29, the CDC ordered that masks be worn on public conveyances, such as airplanes, subways, buses and cabs, and in transportation hubs such as airports and bus stations.", "A widely shared Facebook post that includes a video clip claims that a \"doctor proves masks don’t work\" by showing vapor from an electronic cigarette passing through a mask.", "Experts say the fact that masks allow e-cigarette vapor to pass through provides no evidence to back the claim. They say face coverings offer protection against COVID-19 by blocking larger respiratory droplets, as well as aerosols, that can carry the virus and pass between people. The CDC and other public health experts recommend mask wearing.", "We rate the claim False.", "UPDATED, Feb. 9, 11 a.m. ET: This story was updated to include additional context on how masks work.", "Facebook, post, Dec. 31, 2020", "Email, Dr. Ted Noel, Feb. 8, 2021", "Lead Stories, \"Fact Check: Many Studies Find Masks DO Work Against The Spread Of COVID-19,\" Nov. 25, 2020", "Email, Cindy Prins, clinical associate professor of epidemiology, University of Florida, Feb. 6, 2021", "Email, U.S. Centers for Disease Control and Prevention spokesman Tom Skinner, Feb. 8, 2021", "AFP Fact Check, \"Doctor with expired license falsely claims masks don’t work,\" Feb. 5, 2021", "Email, Dr. Amesh Adalja, senior scholar, Johns Hopkins Center for Health Security, Feb. 6, 2021", "Email, Florida Department of Health Communications, Feb. 8, 2021", "Email, Stephen Morse, professor of epidemiology at Columbia University Medical Center, Feb. 9, 2021", "U.S. Centers for Disease Control and Prevention, \"Masks Protect You & Me,\" Jan. 7, 2021", "PolitiFact, \"Face masks for wildfire smoke protection and COVID-19 play different roles,\" Sept. 14, 2020", "U.S. Centers for Disease Control and Prevention, \"Wildfire Smoke and COVID-19,\" Aug. 25, 2020", "U.S. Centers for Disease Control and Prevention, \"Use Masks to Slow the Spread of COVID-19,\" Feb. 2, 2021", "U.S. Centers for Disease Control and Prevention, \"Your Guide to Masks,\" Jan. 30, 2021", "U.S. Centers for Disease Control and Prevention, \"Scientific Brief: SARS-CoV-2 and Potential Airborne Transmission,\" Oct. 5, 2020", "U.S. Centers for Disease Control and Prevention, \"Scientific Brief: Community Use of Cloth Masks to Control the Spread of SARS-CoV-2,\" Nov. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]