["“The cry of freedom: the people of #Venezuela have rejected socialism and the authoritarianism that accompanies it,” says a tweet shared nearly 6,000 times. The tweet features an aerial video of a large crowd walking through in the streets of Caracas, supposedly to demand Maduro’s resignation after opposition leader Juan Guaido declared himself “acting president” on January 23, 2019.", "A Brazilian politician close to the far right, Fernando Holiday, published the same video on Facebook 15 minutes before, where it was viewed over 450,000 times.", "However, the video was not shot during the unrest that has shaken Venezuela since 27 soldiers rebelled on Monday, January 21, and told the population to follow their lead.", "The video, which began to be shared by other users around the world, was taken in Caracas on September 1, 2016, during “The Taking of Caracas,” another anti-Maduro protest. Using a reverse media search, the earliest iteration of the video found by AFP was featured in this tweet, published at the time, by opposition leader Henrique Capriles.", "Protesters at the time demanded a referendum on the resignation of President Maduro, the successor of Hugo Chavez. According to AFP reporting, the opposition estimated that between 950,000 and one million people marched in Caracas that day.", "Although anti-Maduro protests did take place in Caracas on Wednesday, the video being shared was several years older. Protesters on January 23, 2019 had come out to mark the anniversary of the 1958 coup d’etat that toppled Venezuelan dictator Marcos Perez Jimenez, as in previous years. This year, the opposition marched at the demand of self-proclaimed interim president Juan Guaido.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]