["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic nominee Joe Biden gestures while speaking during the first presidential debate on Sept. 29, 2020, in Cleveland, Ohio. (AP)", "• Joe Biden said “nobody’s going to build another coal-fired plant in America” during the first presidential debate.", "• He said under the Obama administration, he brought the cost of renewable energy down to “cheaper than or as cheap as” coal, gas and oil, and his energy plan states that “marketplace competition has continued to shift this country away from coal-fired electricity.”", "• His climate action plan does not include a ban on coal.", "Vice President Joe Biden has faced a lot of scrutiny when it comes to his position on fossil fuels. The first presidential debate was no exception.", "\"Biden made it clear..No More Coal Fired Power Plants!! So, No More Coal!! Wake Up WV, PA,OH, KY,\" reads one Facebook user’s text post. The Sept. 29 post, shared thousands of times, came the same night as the debate.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.) It resembles previous false claims by President Donald Trump and other Republicans, who have said Biden wants to ban fracking and kill jobs in Pennsylvania, a swing state that relies on the industry.", "Biden’s official position includes implementing clean electricity by 2035 and net-zero carbon emissions by 2050. When asked about Trump’s criticism that his plans would tank the economy in the debate, Biden did say there will be no new coal-fired power plants. But his comments implied companies would opt for renewable energy because of the cost of coal, not because he would ban coal if elected.", "Here’s what he said: \"During our administration in the recovery act, I was...able to bring down the cost of renewable energy to cheaper than or as cheap as coal, and gas, and oil. Nobody’s going to build another coal-fired power plant in America. No one’s going to build another oil-fired plant in America. They’re going to move to renewable energy.\"", "The Facebook post — which names West Virginia, Pennsylvania, Ohio and Kentucky — suggests that states’ economies that currently rely on coal would see the industry get taken away.", "But Biden’s climate plan acknowledges existing coal plants as part of the country’s energy portfolio.", "Biden’s campaign directed PolitiFact to the former vice president’s support for carbon capture projects, which could use coal power plants retrofitted to trap carbon dioxide before it’s emitted into the atmosphere. Biden’s action plan also promised to secure health care and benefits for coal miners and help communities transition into new jobs, as marketplace competition \"continues to shift the country away from coal-fired electricity.\"", "It’s not the first time Biden has mischaracterized his own stance on fossil fuels. In a March primary debate, he misspoke and seemed to say he would ban fracking. He has, however, said that he wants to ban the federal government from issuing new permits to drill on public land.", "The Facebook post claimed that Biden said \"no more coal-fired power plants!! So, no more coal!!\"", "Biden during the first presidential debate said that \"nobody’s going to build another coal-fired power plant in America,\" after explaining that renewable energy is \"cheaper or as cheap as\" coal, oil and gas.", "The claim is missing important context that Biden appeared to refer to marketplace competition, which would be consistent with his climate action plan.", "We rate this claim Half True.", "Facebook post, Sept. 29, 2020", "Joe Biden campaign, \"The Biden Plan for a Clean Energy Revolution and Environmental Justice,\" accessed Oct. 1, 2020", "PolitiFact, \"No, Joe Biden doesn’t want to ban fracking or kill the Pennsylvania jobs it supports,\" accessed Oct. 1, 2020", "PolitiFact, \"Fact-checking Trump’s claim that Biden would ‘immediately’ eliminate fracking and mining in Pa.,\" accessed Oct. 1, 2020", "Rev.com, \"Donald Trump & Joe Biden 1st Presidential Debate Transcript 2020,\" accessed Oct. 1, 2020", "Rev.com, \"2020 Joe Biden Donald Trump 1st Debate Part 2,\" accessed Oct. 1, 2020", "Houston Chronicle, \"Did Joe Biden just pledge to ban fracking in debate against Bernie Sanders?\" accessed Oct. 1, 2020", "Philadelphia Inquirer, \"Fact-checking Trump’s claim that Biden would ‘immediately’ eliminate fracking and mining in Pa.,\" accessed Oct. 1, 2020", "The New York Times, \"Oil and Gas Groups See ‘Some Common Ground’ in Biden Energy Plan,\" accessed Oct. 1, 2020", "The New York Times, \"Projects to Stash Carbon Dioxide Underground Get a Boost,\" accessed Oct. 1, 2020", "The Washington Post, \"Biden’s climate change plan calls for carbon-free electricity by 2035. Here’s how far we have to go,\" accessed Oct. 1, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]