["About this rating", "Cold Stone Creamery franchisees are free to offer location-specific discounts, one of which appeared to be available to visibly pregnant women.", "The policy exists at all Cold Stone Creamery locations.", "Vague discounts and freebies are some of the most pervasive rumors on social media; such was the case with a claim about free or discounted ice cream for visibly pregnant women at Cold Stone Creamery originally posted in May 2015.", "For unclear reasons, the post went viral in late December 2015; it held:", "Did you know we offer a pregnancy discount? 50% OFF any Love It Signature Creation! You must be visibly showing! Come and treat yourself (and your little one) to a delicious treat!", "Immediately, prospective problems with the purported offer were \"visibly showing\" on a first read. The scope of such a promotion (particularly chain-wide) could rapidly escalate to a point of excess, even if the idea pregnant women favor ice cream was disregarded entirely. And the issue of a pregnant woman's body shape at any given moment is a notoriously sticky one; an oft-repeated quip (commonly attributed to humorist Dave Barry) held one ought never to ask if a woman was expecting \"unless you can see an actual baby emerging from her at that moment.\" Myriad situations where such a proposition could go awry based on the visual criteria described inevitably sprang to mind, marking the rumor as somewhat suspicious.", "On 28 December 2015, the official page of Cold Stone Creamery published a status update to clarify the burgeoning rumor indicating that while it was possibly available at some franchised locations, the discount was never meant to be a national promotion:", "To Our Valued Fans & Customers: We’ve received many inquiries about a pregnancy discount that was posted on social media. At Cold Stone Creamery we pride ourselves on ensuring each store is able to provide its customers with relevant local offers based on the communities it serves. Each of our stores are individually owned and operated by local franchisees and they are able to offer discounts at their individual stores. This specific offer is not a national promotion that we offer and is only valid at select Cold Stone Creamery locations. We apologize for any confusion this may have caused and encourage you to contact your local store directly for more information on discounts that are available at their store.", "The problematic nature of the rumor was evident in the tone of the comments; one disgruntled ice cream consumer remarked:", "Yeah the visibly showing part is disgraceful! Somebody 12 weeks along is just as entitled to the offer as 21 weeks!", "Although many Cold Stone Creamery customers commented on the status and expressed interest in redeeming the offer, none specified any location at which such a promotion might be redeemed. Whether the original post originated with an individual Cold Stone Creamery location (or simply was a hoax) wasn't clear, and we were unable to locate any Cold Stone Creamery stores openly honoring the discount. While a few pregnant women might luck out and find a sympathetic location, it's unlikely anyone would be successful in attempting to secure the described discount.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]