["About this rating", "A botched drug smuggling attempt in 1985 left several packages of cocaine strewn about Chattahoochee National Forest in Georgia. A bear opened one of those packages, consumed less than a pound of cocaine, and died of an overdose.", "The bear did not consume 75 pounds of cocaine.", "On March 9, 2021, news broke that Elizabeth Banks would direct a new movie based on a real incident from 1985 involving a bear, a drug smuggler, and a lot of cocaine:", "As this news circulated on social media, one question continued to pop up: \"What?\"", "This was quickly followed by a second question: \"Did a bear really eat 70 pounds of cocaine?\"", "The story of cocaine bear, sometimes referred to as Pablo Eskobear, a reference to the infamous Colombian drug lord, starts in 1985 with Andrew Thornton II, a former narcotics officer turned drug smuggler, attempting a drug run over the Chattahoochee National Forest in Georgia. Thornton was planning on parachuting down to the forest after he dumped bags of cocaine from a plane, but his parachute never opened and he plummeted to his death.", "Shortly after Thornton's body was discovered, and soon after authorities found the plane wreckage, bags of cocaine started to turn up in the Chattahoochee National Forest.", "Fri, Nov 8, 1985 – 71 · Lexington Herald-Leader (Lexington, Kentucky) · Newspapers.com", "In December of 1985, investigators found remnants of what they believed was the final package of cocaine that had been dumped by Thornton. This package had been ripped open, however, and authorities found the remains of a dead bear nearby.", "Mon, Dec 23, 1985 – 1 · Lexington Herald-Leader (Lexington, Kentucky) · Newspapers.com", "The rumor that this bear ate 75 pounds of cocaine appears to stem from these early reports. After all, the bag found near this bear was practically empty. It was reported at the time that this bear may have eaten \"several million dollars' worth of cocaine.\"", "However, a necropsy was later performed on the bear and found that this was not the case. Fran Wiley of the GBI's drug enforcement office said shortly before the necropsy that the dead bear was found several months after this smuggling attempt. It was possible that one of Thornton's partners (or possibly just a hiker) had found and taken the cocaine. Or, it was possible that the cocaine had been scattered across the forest and, as it had recently snowed in the area, had simply dissolved.", "In either case, Wiley said \"the bear obviously did not eat 75 pounds of cocaine\":", "\"It appears the bear had gotten into the duffel bag because it was stripped,\" said Fran Wiley of the GBI's drug enforcement office in Gainesville. \"It wouldn't have taken very much to kill him. He could have eaten a half pound and that would have killed him.\"", "A medical examiner was scheduled to perform an autopsy on the bear today to confirm it died from an overdose of cocaine. Wiley estimated the 40 plastic containers once held 75 pounds of cocaine worth $15 million.", "\"The only thing that was left were the packages themselves,\" she said. \"No cocaine was recovered. We're not saying there's any foul play in that regard. We're looking at over two months since it was dropped there. It's had time to dissolve and there was snow on the mountain when we found it. The bear obviously didn't eat 75 pounds of cocaine.\"", "The necropsy confirmed Wiley's estimation. Dr. Kenneth Alonso, the chief medical examiner at the state crime lab, said that the bear had absorbed about 4 grams of cocaine into its blood system.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]