["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Shacks on stilts are common near Tanzania's rice fields where some of the poorest farmers live. (Jon Greenberg)", "Twitter followers of the cheekily named What the F*** Facts got some bold guidance recently.", "\"The world spent $1,735 billion on war in 2012,\" the outfit tweeted on Jan. 24, 2017. \"It would take $135 billion to eradicate global poverty.\"", "This claim has been popping up on the web since at least February 2013, but the 5.5 million followers of WTF Facts has to count as one of the widest audiences yet.", "The world spent $1735 Billion on war in 2012 it would take $135 billion to eradicate global poverty.", "We decided to vet the numbers. The takeaway is while $135 billion wouldn’t hurt, the statement glosses over a host of problems that undercut the core promise to end poverty.", "It isn’t central to this fact-check, but the military spending figure largely checks out using data from the Stockholm International Peace Research Institute.", "Now to assess the money needed to lift people out of poverty. We started with the number of people living on less than $1.90 a day, which is the current global poverty line. Estimates vary, but economists at the World Bank put the 2012 figure at 880 million people.", "Then we calculated how much more the average poor person in that group would need to make to get above $1.90 a day, with the help of World Bank economist Christoph Lakner. The approximate answer for 2012 is it would have taken about $187 billion to lift each person out of poverty that year, or $50 billion more than the $135 billion in the tweet.", "That’s a lot, but on the other hand, the economists we reached said none of the figures are rock solid.", "\"The numbers are approximate for several reasons,\" said Indermit Singh Gill, professor of public policy at Duke University. \"One is the correction for purchasing power. These are based on surveys every five years or so, done by different agencies in various parts of the world. The second are corrections within countries for cost of living — especially between rural and urban areas.\"", "Whatever the right amount it would take to eradicate poverty, economist Charles Kenny at the Center for Global Development in Washington, D.C., said the concept of giving the world’s poorest people more cash has a lot of merit.", "\"All the evidence is that if you give them money they spend it wisely on things that can increase their long-term earnings — better nutrition, health care, education, investments in equipment and so on,\" he said.", "But Kenny also said the practical challenge of getting the money to the right people is enormous.", "\"We have estimates of global poverty, but we don’t know which households are actually poor on this standard, and who they are changes a lot over the course of a year,\" Kenny said.", "Skeptics of simple cash tranfers abound. International development researchers David Steven and Ben Oppenheim at the New York University Center on International Cooperation emphasized that much more than a lack of income makes people poor.", "\"$135 billion is roughly the same as current overseas development aid, and it hasn't ended poverty yet,\" Steven said.", "Oppenheim said the quality of government makes a big difference and donor nations can’t \"buy development.\"", "\"If we could do that, Afghanistan would look more like Switzerland by this point,\" Oppenheim said. \"The central lesson from decades of semi-successful efforts at poverty reduction is that effective institutions are absolutely critical. And the ingredients for that are time and political will, not just capital.\"", "The tweet didn’t say that the money had to come from the wealthiest nations. Laurence Chandy, a senior fellow at the Brookings Institution, wrote recently that in many nations, local billionaires could make a big dent in their home country’s poverty. They note that the task is easier today than in 2012 because the world has far fewer poor people. Chandy and his colleagues Christine Zhang and Lorenz Noe asked what would happen if the uber-rich gave away half their wealth over a span of 15 years.", "The results varied from place to place. In Colombia, Georgia and Swaziland, they wrote, a single billionaire’s gift could end extreme poverty immediately.", "In other countries, it would take the generosity of all of their billionaires.", "\"This would end poverty in China, India, and Indonesia — countries that rank first, second, and fifth globally in terms of the absolute size of their poor populations,\" they said.", "An article from the Center for Global Development calculated that about three-quarters of global poverty could be eliminated if developing countries gave cash to the poorest by raising taxes on their wealthiest citizens, eliminating subsidies for fuel and reducing their military spending.", "Our ruling", "What the F*** Facts said that in 2012, $135 billion would eradicate global poverty. In 2012, there were about 880 million people living on less than $1.90 each day. Using World Bank numbers, the one-year price tag back then would have been closer to $187 billion. While the data are far from perfect, the tweet’s figure falls short by about 25 percent, which is a significant gap.", "But the bigger problem is the idea that a cash transfer alone would eradicate poverty. The experts we reached emphasized that good governments and other institutions were essential to eliminating poverty in the long-run. While money would help, it couldn’t deliver the desired results on its own.", "The statement has some superficial accuracy, but it suggests a simple fix to a much more complicated problem. We rate it Mostly False.", "https://www.sharethefacts.co/share/78722821-2985-4d39-9fb5-b31d18702078", "What the F*** Facts, tweet, Jan. 24, 2017", "World Bank, Financing the End of Poverty, July 10, 2015", "World Bank, Taking on inequality, 2016", "Center for Global Development, Gasoline, guns and giveaways, Aug. 2, 2016", "Brookings Institution, How to end poverty? Give the poor cash and access to mobile money and text them reminders to save and take their meds—not., Feb. 6, 2017", "Brookings Institution, The global poverty gap is falling. Billionaires could help close it, Jan. 20, 2017", "Stockholm International Peace Research Institute, Military Expenditure Database, accessed Feb. 2, 2017", "Foreign Policy, The Price Is Right, July 18, 2011", "World Bank Group, Grow, Invest, Insure: A Game Plan to End Extreme Poverty by 2030, November 2016", "CSNBBS, post, Feb. 6, 2013", "Christ Michael, blog post, May 28, 2014", "Interview, Christoph Lakner, economist, Development Research Group, World Bank, Feb. 6, 2017", "Email interview, Charles Kenny, senior fellow, Center for Global Development, Feb. 6, 2017", "Email interview, David Steven, senior fellow, New York University Center on International Cooperation, Feb. 6, 2017", "Email interview, Ben Oppenheim, fellow, New York University Center on International Cooperation, Feb. 6, 2017", "Email interview, Indermit Singh Gill, professor Of Practice of Public Policy, Duke University Sanford School of Public Policy, Feb. 6, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]