["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "North Carolina Gov. Roy Cooper, left, congratulates Cheri Beasley after naming her as the next Chief Justice of the NC Supreme Court during a press conference in Raleigh on Feb. 12, 2019. (News & Observer)", "After the chief justice of the North Carolina Supreme Court announced his plans to resign, Republicans called on Gov. Roy Cooper to hand the gavel to a Republican.", "State law mandates that the governor fill judicial vacancies. And Chief Justice Mark Martin is one of only two Republicans on the bench.", "But Cooper, a Democrat, announced on Feb. 12 his intention to move Supreme Court justice Cheri Beasley, a Democrat, into the chief justice seat.", "Republicans immediately criticized the move as partisan, arguing that Cooper should’ve appointed Republican Paul Newby, the senior associate justice, to the chief justice position. Many said it’s a \"tradition\" to appoint the senior associate justice.", "Newby himself criticized the move as \"raw partisan politics.\" NC Senate leader Phil Berger said it’s \"reasonable\" to conclude that Cooper passed over Newby \"because of his party affiliation\" and mentioned the appointment on Feb. 25 when he responded to Cooper’s State of the State address.", "NC GOP chairman Robin Hayes released a statement about the issue, suggesting that previous governors appointed chief justices from across the political aisle as part of a \"tradition.\"", "\"One can only believe the reason Cooper decided to ignore the longstanding, nonpartisan tradition of the Court was purely politics,\" Hayes is quoted saying.", "Several media outlets — including the Associated Press, WRAL and WTVD — referred to a \"tradition\" of appointing the senior associate justice in their reporting but didn’t provide a history of the appointments.", "When it comes to replacing a chief justice, is there a tradition? Has the governor always appointed the senior associate justice? And has the governor’s pick always been nonpartisan?", "PolitiFact consulted news stories and staff in the N.C. Supreme Court Library to review chief justice appointments dating back 50 years — finding that, while many chief justices were replaced by the longest-serving associate justice, the appointments were hardly nonpartisan.", "A PARTISAN TRADITION", "Prior to Cooper’s appointment of Beasley, North Carolina’s governors made seven appointments to the chief justice position over the last five decades.", "In six of the seven cases, the appointees were previously the senior associate justice. The last governor to break tradition? Republican Gov. Jim Martin in 1986, who skipped over a Democrat to appoint a Republican.", "In fact, in each of the seven instances since 1969 that the chief justice seat became vacant, the governor appointed a member from his own party. So by calling on Cooper to appoint Newby, Republicans asked Cooper to do something no governor had done in the last 50 years.", "Nor have Republican governors passed up opportunities to replace a member of the opposing party with a member of their own. They did so twice since 1986, including as recently as 2014.", "Contacted by PolitiFact, Dallas Woodhouse, executive director of the NC GOP, said Hayes’ statement was mostly intended to highlight the trend of appointing senior associate justices. Republican governors have had far fewer chances to appoint chief justices from across the aisle because Democrats dominated North Carolina politics for about 100 years, Woodhouse argued.", "THE TIMELINE", "In 2014, Republican Gov. Pat McCrory replaced Chief Justice Sarah Parker, a Democrat, with Martin (the Republican who just announced his resignation in 2019).", "In 2006, Democratic Gov. Mike Easley appointed Parker to replace I. Beverly Lake Jr., a Republican. (Lake won his seat as chief justice in the 2000 election)", "In 1999, Democratic Gov. Jim Hunt appointed Henry Frye, a Democrat, as chief justice to replace Burley Mitchell, also a Democrat.", "In 1994, Hunt swapped a Democrat for a Democrat when he appointed Mitchell to replace Chief Justice Jim Exum.", "In 1986, Republican Gov. Martin appointed Republican Rhoda Billings to replace Chief Justice Joseph Branch, a Democrat. Cooper’s pick aside, this is the only time in the last 50 years that a governor passed over the senior associate justice. Exum, a Democrat, was the senior associate at the time.", "In 1979, Hunt appointed Branch (Democrat) to replace Democratic Chief Justice Susie Sharp. (Sharp had gained the seat by beating Republican James M. Newcomb and Labor Party Candidate Stanley Ezrol in the 1974 election.)", "In 1969, Democratic Gov. Bob Scott replaced Chief Justice R. Hunt Parker, a Democrat, with Democrat William Bobbitt.", "POLITIFACT RULING", "The NC GOP said that Cooper, by appointing Beasley over Newby, ignored a \"longstanding, nonpartisan tradition.\" This statement suggests that North Carolina’s governors have always replaced an outgoing chief justice by appointing the senior associate justice —even if he or she was a member of a different political party.", "Over the past 50 years, governors picked senior associates on six out of seven occasions. But in every case, they picked someone from their own political party — often replacing a member of another party. The NC GOP claim has a kernel of truth, but distorts the partisan nature of chief justice appointments over the last 50 years. We rate this claim Mostly False.", "This story was produced by the North Carolina Fact-Checking Project, a partnership of McClatchy Carolinas, the Duke University Reporters’ Lab and PolitiFact. The NC Local News Lab Fund and the International Center for Journalists provide support for the project, which shares fact-checks with newsrooms statewide. To offer ideas for fact checks, email [email protected].", "Story by BlackPast.org, \"Henry Ell Frye,\" posted July 29, 2018.", "Story by carolana.com, \"Rhoda Bryan Billings.\"", "Story by carolana.com, \"William Haywood Bobbitt.\"", "Results from the Nov. 7, 2000 election in North Carolina posted on the NC elections board website.", "Transcript, \"Presentation of the portrait of William Haywood Bobbitt,\" from March 10, 1993.", "Email correspondence with J. Barrett Fish and Tom Davis, librarians for Public Services of the N.C. Supreme Court Library.", "Story by the News & Observer, \"Court changes would ‘seriously harm our judicial system,’ former NC chief justices say,\" published April 17, 2017.", "Story by The Charlotte Observer, \"Sarah Parker leaves legacy on Supreme Court,\" published Aug. 27, 2014.", "Story by the Greensboro News & Record, \"Jim Exum, moving out of the fast lane,\" published March 11, 1995.", "Story by the Wilmington Morning Star, \"Rhoda Billings sworn in as state’s new chief justice,\" published Sept. 4, 1986.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]