["About this rating", "A somewhat misleading infographic concerning the amount of tar deposited in smokers' lungs by marijuana is frequently shared on social media sites:", "The American Lung Association (ALA) does note that marijuana smoke contains four times as much tar as tobacco-based cigarette smoke:", "Like tobacco smoke, marijuana smoke contains cancer-causing chemicals. There are 33 cancer-causing chemicals contained in marijuana. Marijuana smoke also deposits tar into the lungs. In fact, when equal amounts of marijuana and tobacco are smoked, marijuana deposits four times as much tar into the lungs. This is because marijuana joints are un-filtered and often more deeply inhaled than cigarettes.", "However, although it may be true that marijuana smoke deposits more tar into a smoker's lungs than tobacco smoke, the above-displayed photograph does not accurately depict the difference in overall harm caused to a tobacco smoker's lungs versus a marijuana smoker's lungs. Marijuana contains many of the same cancer-causing chemicals as tobacco smoke, but a recent study found no link between marijuana and an increased risk of lung cancer. According to Dr. Hal Morgenstern, a University of Michigan epidemiologist, this factor was likely attributable to the differences between marijuana and tobacco use:", "When you think about people smoking 20 to 40 cigarettes a day for 40 years, they're smoking hundreds of thousands of cigarettes. The exposure that marijuana users get is more than a magnitude of difference less.", "However, a study funded by the National Institute on Drug Abuse found that even heavy marijuana smokers did not have an increased risk of developing lung cancer:", "We hypothesized that there would be a positive association between marijuana use and lung cancer, and that the association would be more positive with heavier use. What we found instead was no association at all, and even a suggestion of some protective effect.", "Donald Tashkin, a UCLA pulmonologist who has studied marijuana for 30 years, hypothesized that the chemical THC may prevent the cancer-causing chemicals in marijuana smoke from negatively affecting the body:", "The THC in marijuana has well-defined anti-tumoral effects that have been shown to inhibit the growth of a variety of cancers in animal models and tissue culture systems, thus counteracting the potentially tumorigenic effects of the procarcinogens in marijuana smoke.", "We don't know for sure, but a very reasonable possibility is that THC may actually interfere with the development of chronic obstructive pulmonary disease.", "In conclusion, although it may be true that marijuana smoke deposits more tar into the lungs than tobacco smoke, current evidence does not indicate that the former results in proportionally greater deleterious health affects.", "Biello, David.   \"Large Study Finds No Link Between Marijuana and Lung Cancer.\"\r\n    Scientific American.   24 May 2006.", "Kaufman, Mark.   \"Study Finds No Cancer-Marijuana Connection.\"\r\n    The Washington Post.   26 May 2006.", "Morgenstern, Kimberly et al.   \"Cannabis Smoking and Lung Cancer Risk: Pooled Analysis in the International Lung Cancer Consortium.\"\r\n    International Journal of Cancer.   30 June 2014.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]