["About this rating", "In March 2013, shortly after Cardinal Jorge Mario Bergoglio of Argentina (now Pope Francis) was selected to succeed the retiring Pope Benedict XVI as Pope of the Catholic Church, a transcript purporting to document an unaired interview between then-Cardinal Bergoglio and an American journalist was circulated on the Internet:", "The following is a transcript of an interview between CHRIS MATHEWS, MSNBC American journalist and then Cardinal Bergolio. It is clear why the interview was never broadcast. This Pope is a breath of fresh air; a very enlightening, clear understanding of social justice. It is clear that Chris Matthews never understood or learned a thing.CAMERA ON / BEGIN TRANSCRIPT", "REPORTER: Welcome Cardinal.", "BERGOGLIO: Thank you. Happy to speak with you.", "REPORTER: Well, let me get into it directly. Last conclave, you were almost elected Pope. Can this happen again?", "BERGOGLIO: What? That I will almost be the Pope, again?", "REPORTER: No. Will you be the next Pope?", "BERGOGLIO: Friend, I’m only jesting with you. I understand the question. I will not be the next Pope.", "REPORTER: Why not?", "BERGOGLIO: I chose not to. God has someone else in mind I’m certain.", "REPORTER: But you would take the job if it were offered.", "BERGOGLIO: I think not.", "REPORTER: Why not.", "BERGOGLIO: I believe I’m too embroiled in the secular fiasco. It is a spiritual job, and I’m a soldier. Look at the nature of power. In Europe first and now in America, elected men have taken it upon themselves to indebt their people to create an atmosphere of dependency. And why? For their own selfish need to increase their own personal power. I’ve been a keen observer of the effect this has on the people, especially the poor. They are very good at creating poverty where there is no reason to explain it. My job is try to alleviate poverty and if that means to oppose the cause then I will not be Pope.", "[Rest of transcript here.]", "The transcript was originally posted to the web site of the UK's Diocese of Salford, which introduced it with the following statement:", "The following is a transcript of an interview between an atheist American journalist and then-Cardinal Bergoglio. It is clear why the interview was never broadcast. In it, Cardinal Bergoglio makes mincemeat of the typical leftist interview techniques of so many people in the broadcast media.", "Although he was not named anywhere on the Diocese of Salford web site or in the transcript (which simply referred to a \"reporter\"), the mention of an \"atheist American journalist\" who supposedly conducted the interview was clearly intended to reference Chris Matthews of MSNBC, who (like the interviewer in the transcript) attended La Salle College High School and College of the Holy Cross.", "However, multiple pieces of evidence document that the transcript was nothing more than a prank, phony documentation of an interview that never took place:", "Let me start tonight with the election of a new pope. It brings with it a great hope, and not just for Catholics. It promises a progressive church on economic justice. Francis I is a Jesuit from Argentina. He's known for throwing off the trappings and the perks of power, living in a small apartment, taking the bus to work.The new pope has said things about capitalism and its failure to deliver economic justice that could drive the right wing nuts. He's the living illustration for what I`ve learned of the belief that free markets need to be offset by an active social justice toward those in need.", "This is the Catholic church that looks out for the poor, that distances itself from power and wealth, that is skeptical that capitalism will raise all, that the poor can count on the wealth of the rich to trickle down to the people living in the barrios and the favelas.", "So big surprise in Rome tonight, the cardinals picked a Jesuit, someone from the Americas, someone who identifies with the poor and those who don't get a break from sharp-elbowed capitalism. I find this fascinating and enormously surprising. Francis I — I like him already.", "Connor, Tracy.   \"Who's Next? 8 cardinal Contenders Who Could Succeed Pope Benedict.\"\r\n    NBCNews.com.   11 February 2013.", "Thompson, Damian.   \"Did Pope Francis Really Say That Socialism Causes Misery?\"\r\n    The Telegraph.   24 March 2013.", "NBCNews.com.   \"Hardball with Chris Matthews.\"\r\n    13 March 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]