["NHS hospitals have been hit with a 21% rise in business rates.", "That’s what was projected when changes to business rates came in last year. A more up to date estimate puts the 2019/20 bill at around 24% higher than in 2016/17.", "Private hospitals can register as a charity saving them up to 80% on their business rates.", "Correct.", "We’ve been asked by a reader to factcheck this image, which has been shared on Facebook over 20,000 times since 2017.", "The NHS does have to pay business rates on its properties, while private hospitals that are registered as charities can save up to 80% on that particular tax.", "A business rates company projected last year that the then-upcoming revaluation (where the tax bill was recalculated for eligible properties) might mean the bill for NHS hospitals in England and Wales could increase by 21%.", "The company that did those calculations told us that because of changes made since that estimate, the bill may now be closer to 24% higher in 2019/20 than 2016/17.", "We've not been able to replicate the figures exactly, but the estimates seem robust and plausible. There aren’t official figures on how many private hospitals are registered as charities, but one estimate by the same company suggests that around a quarter are.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "Business rates are a tax on non-domestic properties, for example shops, offices and warehouses, across the UK. To calculate how much needs to be paid in business rates you take the rateable value—the amount the property would cost to rent annually—and multiply that by a pence per pound value. For 2017/18 this value in England was 49.3p, giving a tax bill of around half of the rateable value.", "NHS hospitals have to pay it, as do most other buildings occupied by public bodies. The government said in early 2017 it had “no plans” to exempt NHS hospitals from these payments, and its position seemed unmoved in 2018.", "Rateable values in England, Wales and Scotland are normally updated every five years. Most recently they were revalued in 2015, and these changes came into effect from April 2017. The total amount of business rate revenue collected must remain the same after a revaluation, so if the rateable values of properties go up, the pence per pound value must go down to balance that out.", "Hospitals in England receive most of their funding from NHS England and ultimately central government (mostly from general taxation). These hospitals then pay business rates to councils, which keep some of the money to spend on services and give the rest back to the government. The government then redistributes that money to other councils using the Barnett formula, which is designed to distribute based on need.", "This claim comes from research done by property consultants CVS in January 2017, before the latest business rate revaluation took effect. CVS have since been acquired by another company, Altus Group.", "Altus Group told us the 21% figure came from projections of what the average annual business rate bill for all England and Wales NHS hospitals would look like after the 2017 revaluation, compared to what they paid in 2016/17. That was their estimate when the revaluation cycle was expected to last five years.", "Altus said the rateable values (that’s how much the buildings would cost to rent) for NHS hospitals in England and Wales increased by 19% in the revaluation. We found roughly the same thing from published figures. Altus told us they have access to an “up-to-date real time” list.", "That amounts to 21% higher actual business rate payments a year, according to the research, from around £303 million to £366 million. That took into account transitional relief (cash from the government used to soften the blow of suddenly increasing business rate bills) plus the then-forecasts for inflation.", "But they told us that research is now out of date, since the Chancellor announced the next revaluation would be brought forward a year to 2021. This means the current valuation cycle will last four rather than five years, which changes the tax bill because of transitional relief and inflation.", "Altus Group projects that the 2019/20 bill will be £386 million, which they say is a rise of around 24% compared to what hospitals would have paid in 2016/17. This isn’t calculated in quite the same way as the 21%, but it still represents the scale of increased costs the hospitals are facing.", "In 2017, the government said it didn’t know how much more NHS hospitals would have to pay when the rates changed.", "A bill introduced by an MP which would exempt NHS hospitals from business rate charges is due to be debated by parliament in October 2018.", "Charities can apply for charitable business rate relief of up to 80% if their property is used “for charitable purposes”. The government has confirmed private hospitals registered as charities can also do this.", "Charities in England and Wales are allowed to make a profit from selling goods and services to customers, and some private schools, galleries that charge for entry and private hospitals do. To qualify as charities these groups must prove they are “for the public benefit” and have only “charitable purposes”. Private hospitals may adhere to these criteria by having a purpose of “advancing health or the saving of lives” and arguing they do that by treating some members of the public.", "The government said in 2017 that it didn’t know how many private hospitals are registered as charities.", "The same company, CVS, used Freedom of Information requests to come up with an estimate of 27% of private hospitals being registered as charities. We’ve asked the Altus Group for more information on this.", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]