["About this rating", "Based on the limited information available as of October 2017, the Trump family's monthly travel expenditures during the early part of his administration exceeded the monthly spending averages of President Obama and family.", "The stated total of $147 million for President Trump and family's travel expenditures over nine months was vastly exaggerated and unsupported by actual data.", "The expenses incurred by United States presidents and their families on vacation trips and other travel away from the White House are an evergreen topic of partisan debate, given that much of those, including the requisite round-the-clock Secret Service protection and use of military aircraft for travel, are footed by the federal government. (By longstanding convention, even presidential vacation travel is categorized as \"official business\" for accounting purposes, since it is assumed, the Congressional Research Service tells us, that the president is always on duty.)", "In that vein, an Internet meme loosed on social media nine months into Donald Trump's presidency made the claim that taxpayer expenditures on vacations, golf, and personal security for the president, First Lady Melania Trump, and their youngest son Barron had thus far averaged more than $16 million per month, as compared to an average of about $1 million per month for travel by President Obama and immediate family during Obama's entire eight years in office.", "This is the text:", "As of October 14, 2017", "Taxpayer dollars spend on vacations, golf and personal security while not at the White house for Barack, Michelle, Malia and Sasha", "$98,000,000.00 over 8 years or $1,020,833.33 per month", "Taxpayer dollars spend on vacations, golf and personal security while not at the White house for Donald, Melania and Barron", "$147,000,000.00 over 9 months or $16,333,333.33 per month", "Not a peep from Conservatives.", "If accurate, the comparison is all the more striking in that Trump was an inveterate critic of President Obama's travel and vacation expenses for years:", "President @BarackObama's vacation is costing taxpayers millions of dollars----Unbelievable!", "— Donald J. Trump (@realDonaldTrump) January 5, 2012", "The Obama's Spain vacation cost taxpayers over $476K https://t.co/W6kIpd5x They love to spend money.", "— Donald J. Trump (@realDonaldTrump) April 27, 2012", "\"I would rarely leave the White House because there’s so much work to be done,” Trump told The Hill in 2015. \"I would not be a president who took vacations. I would not be a president that takes time off.\" While campaigning for the presidency in 2016, Trump said to the American people: \"I'm going to be working for you. I'm not going to have time to go play golf.\"", "In point of fact, according to a report in USA Today, Trump only spent five of his first 26 weekends as president holed up exclusively in the White House. The rest entailed trips to his nearby golf clubs. In early August 2017, CBS News White House correspondent Mark Knoller toted up how many days Trump had spent away from the White House versus the number of days Obama spent offsite and found that Trump's total, at all or part of 41 days away from Washington, was nearly twice Obama's, at all or part of 21 days away (although George W. Bush had them both beat at 61 days away).", "Although it's too soon as of October 2017, just nine months into his presidency, to render even a semi-complete portrait of the Trump family's travel expenses (such details are rarely released except in response to Freedom of Information Act inquiries, and sometimes not even then), preliminary indications are that Trump's past criticisms of Obama will come back to haunt him.", "Looking at the information we do have, the Obama family's travel expenses during the entire eight years of his presidency totaled approximately $106 million, according to the most recent FOIA numbers released by the conservative watchdog group Judicial Watch, who kept close tabs on Obama's spending. The Obamas' travel expenses therefore averaged about $1.1 million per month over the course of his term.", "Turning to Trump, the alleged $147 million already spent on travel by the president and his family during his first nine months in office wildly exceeds anything supported by actual data. That having been said, it does appear, based on the information available, that Trump and family have indeed likely outstripped the Obamas in terms of monthly travel costs, albeit by a smaller margin than claimed.", "Judicial Watch, who have vowed to monitor Trump's travel expenses as closely as they did Obama's (FOIA requests are already on file), reported in July 2017 that two months into Trump's presidency taxpayers were already on the hook for $3.58 million in charges for air travel alone (i.e., excluding auxiliary costs such as Secret Service housing, local transporation, police protection, etc.) by the president, first lady, and vice president during February and March. That's roughly $1.8 million per month, $700,000 more than the Obamas' monthly average, which included the auxiliary costs we don't yet have for Trump.", "Focusing just on Trump's Mar-a-Lago trips, of which there were seven between Inauguration Day and mid-August 2017, an attempt at a more comprehensive estimate by the progressive watchdog group Center for American Progress Action Fund settled on a cost of roughly $3 million per trip — a total of $21 million for all of Trump's Mar-a-Lago stays through August, amounting to $2.6 million per month). The reliability of that estimate has been rightly called into question, given that it was generalized from a Government Accountability Office report written well before Trump took office, but it is indicative of how high the Trump family's travel costs — when they are updated to include actual Secret Service expenses and incidentals  might well go.", "For that matter, obligatory Secret Service protection extends to all of Trump's children, including his two adult sons, whose security costs while traveling are borne by American taxpayers even though they don't work for the administration, instead running their father's international business holdings. According to CBS News, lodging and transportation costs for federal agents protecting Eric and Donald Trump Jr. on their travels had already surpassed $190,000 by the end of President Trump's third month in office.", "Also indicative is a USA Today report that in addition to his Mar-a-Lago residencies, as of 21 August Trump had racked up five visits to his private golf club in New Jersey. At these two locations, the Secret Service spent $60,000 on rent for the golf carts needed to protect the president. If that pattern continues, American taxpayers can expect to be dinged for as much as $103,000 per year in golf cart rentals alone.", "Although there isn't yet enough information to work up a detailed comparison of the Trump family's travel expenses versus the Obama family's, it seems a near certainty, barring a dramatic change in lifestyle, that the Trumps' expenses will continue to outpace the Obamas' by a healthy margin, although nowhere approaching the $15 million-a-month disparity alleged by Internet sources.", "Carroll, Lauren.  \"How Much Do Donald Trump's Trips to Mar-a-Lago Cost?\"\r\n  PolitiFact.  18 April 2017.", "Estepa, Jessica.  \"The Six Trump Properties President Trump Has Visited Almost Every Weekend in Six Months.\"\r\n  USA Today.  20 July 2017.", "Halchin, L. Elaine.  \"Presidential Travel: Policy and Costs.\"\r\n  Congressional Research Service.  17 May 2012.", "Johnson, Kevin.  \"Exclusive: Secret Service Depletes Funds to Pay Agents Because of Trump's Frequent Travel, Large Family.\"\r\n  USA Today.  21 August 2017.", "Kurtz, Judy.  \"Trump: 'I Would Rarely Leave the White House.\"\r\n  The Hill.  23 June 2015.", "Merica, Dan.  \"Trump on Pace to Surpass 8 Years of Obama's Travel Spending in 1 Year.\"\r\n  CNN.  11 April 2017.", "Strickler, Laura.  \"Secret Service Costs for Trump Family Protection Continue to Mount.\"\r\n  CBS News.  14 April 2017.", "Associated Press.  \"Here's How Much It Costs Taxpayers for Donald Trump to Stay at His Weekend Getaways.\"\r\n  8 May 2017.", "Government Accountability Office.  \"Presidential Travel: Estimated Costs for a Specific Presidential Trip to Illinois and Florida.\"\r\n  October 2016.", "Judicial Watch.  \"Judicial Watch Sues Pentagon, Secret Service for Records of Costs for Presidential and VIP Travel.\"\r\n  8 May 2017.", "Judicial Watch.  \"New Obama Travel Costs Bring Eight-Year Total Over $96 Million.\"\r\n  29 December 2016.", "Judicial Watch.  \"Total Obama Travel Costs So Far, $106 Million.\"\r\n  15 September 2017.", "Judicial Watch.  \"Trump Administration Air Travel Costs $3.58 Million.\"\r\n  14 July 2017.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]