["About this rating", "When Senator John McCain passed away from cancer in his home state of Arizona in August 2018, a memorial service was held for him in the capital city of Phoenix, then his remains were transported to Washington, D.C., to lie in the U.S. Capitol Rotunda.  Another memorial service was held for the late senator in Washington before he was laid to rest at the U.S. Naval Academy Cemetery in Annapolis.", "One of the more prominent elements of the news coverage surrounding John McCain's death and funereal services was the \"disrespect\" that critics maintained President Donald Trump had shown towards the late senator, with whom Trump had feuded:", "Leadership from two prominent veterans groups blasted White House officials for “disrespect” in their response to the death of former Arizona Sen. John McCain, insisting the Navy veteran deserved more national recognition.", "Flags at national buildings were lowered when McCain’s death was announced but raised just two days later, bucking a tradition of honoring well-known members of Congress for longer periods of time.", "President Donald Trump also did not issue an official proclamation marking McCain’s passing, instead writing a tweet that stated, “my deepest sympathies and respect go out to the family of Senator John McCain. Our hearts and prayers are with you!”", "AMVETS officials said McCain — “a war hero, twice a presidential contender, and a national treasure who devoted his entire adult life to protecting and improving the American way of life” — deserved more.", "\"It’s outrageous that the White House would mark American hero John McCain’s death with a two-sentence tweet, making no mention of his heroic and inspiring life,” Joe Chenelly, AMVETS national executive director, said in a statement.", "“By lowering flags for not one second more than the bare minimum required by law, despite a long-standing tradition of lowering flags until the funeral, the White House is openly showcasing its blatant disrespect for Senator McCain’s many decades of service and sacrifice to our country as well as the service of all his fellow veterans.”", "It was something of a surprise to many onlookers, then, to learn afterwards that McCain's body had been flown to Washington on a U.S. government Boeing C-32A typically reserved for the use of the vice president or first lady -- an act which would typically require the approval of the President himself.", "It shouldn't have been a surprise, however, as President Trump had issued a statement days in advance (only after being pressured to do by intense public disapproval, critics maintained) accommodating the  family's request by authorizing the use of military transport for Senator McCain's remains:", "Despite our differences on policy and politics, I respect Senator John McCain’s service to our country and, in his honor, have signed a proclamation to fly the flag of the United States at half-staff until the day of his interment.", "I have asked Vice President Mike Pence to offer an address at the ceremony honoring Senator McCain at the United States Capitol this Friday.", "At the request of the McCain family, I have also authorized military transportation of Senator McCain’s remains from Arizona to Washington, D.C., military pallbearers and band support, and a horse and caisson transport during the service at the United States Naval Academy.", "Finally, I have asked General John Kelly, Secretary James Mattis, and Ambassador John Bolton to represent my Administration at his services.", "Washington television station WUSA described the flight that carried John McCain to Washington for the last time:", "JOINT BASE ANDREWS, MD -- Members of the National Guard loaded the flag-draped casket into the familiar state blue and white aircraft, a symbol of American power serving presidents, vice presidents and first ladies for 20 years.", "The aircraft normally designated “Air Force Two” carried John McCain and his family to Washington, D.C. as he made his final flight across the country.", "The plane arrived with clear airspace just before 8 p.m., as President Donald J. Trump held a campaign-style rally in a different time zone, 700 miles away.", "McCain’s Air Force Boeing C-32A is indeed equipped to carry the president on short-range trips, and is usually reserved for the vice president or first lady.", "McCain’s motorcade left Andrews for an undisclosed location, awaiting the casket’s procession to the U.S. Capitol Rotunda.", "The trip marked the first time McCain returned to the Washington area since he left for Arizona, a week before Christmas 2017.", "Associated Press.   \"Trump Remarks on the Death of Arizona Sen. John McCain.\"\r\n    27 August 2018.", "Shane III, Leo.   \"Veterans Groups Furious with White House Over ‘Disrespect’ following John McCain’s Death.\"\r\n    Military Times.   27 August 2018.", "MacDonald-Evoy, Jerod.   \"John McCain's Body Will Fly on Air Force Two, Planes Reserved for VPs and VIPs.\"\r\n    Arizona Republic.   30 August 2018.", "Valerio, Mike.   \"'Air Force Two' Takes John McCain on His Final Flight to Washington.\"\r\n     WUSA-TV.   30 August 2018.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]