["Businessman Donald Trump may have called Sen. Ted Cruz \"Lyin' Ted,\" but a political action committee supporting Ohio Gov. John Kasich has picked up the moniker in an attack ad against Cruz.", "\"Many just call him 'Lyin' Ted,' \" the ad begins, as Cruz's nose begins to grow, curving around his head and neck. \"His TV ad about John Kasich? Lie! Stations had to pull it off the air. If Ted Cruz's mouth is moving, he's lying.\"", "We wanted details about an ad that was allegedly so wrong it had to be pulled. Our nosiness uncovered an important point: The ad that was pulled wasn't Cruz's ad.", "The super PAC that attacks Cruz as a liar is New Day for America, based in Kasich's home state. Spokeswoman Connie Wehrkamp said its ad is attacking an anti-Kasich ad released by another super PAC, Trusted Leadership, which supports Cruz.", "The pulled ad, released March 29, shows side-by-side images of Kasich and George Soros, a liberal billionaire investor who is backing Hillary Clinton. Soros is reviled among conservatives the way the Koch brothers are disparaged by liberals.", "The image on the screen shows side-by-side photos of Soros and Kasich with the words, \"Hundreds of thousands of dollars from George Soros.\" Simultaneously, the announcer says, \"Millionaires working side by side with George Soros are bankrolling (Kasich's) super PAC.\"", "PolitiFact Ohio ruled that ad False, because Soros has not given any money to Kasich or his super PAC, and the \"working side by side\" reference is tenuous. It refers to one donor who managed assets for Soros from 1988 to 2000 and another who is the former chief investment officer for Soros Fund Management and started his own hedge fund with $2 billion in seed money from Soros.", "New Day complained about the Trusted Leadership commercial to the Wisconsin television stations that aired it, saying that unlike ads from the candidates themselves, stations have no obligation to run false or misleading super PAC ads. At least four stations pulled it, according to New Day, which provided supporting correspondence.", "(Trusted Leadership subsequently replaced the anti-Kasich spot with a revised ad that took out the words \"Hundreds of thousands of dollars from George Soros,\" and used \"Hundreds of thousands of dollars from George Soros cronies\" instead.)", "There is, however, a larger problem with New Day's claim that this was another of Ted Cruz's \"lies.\"", "Neither Cruz nor his campaign were responsible for the deceptive ad.", "It was the super PAC that supports him. That's a big distinction.", "Under federal law, the Cruz super PAC is not allowed to coordinate with Cruz or his campaign, or vice versa, and no one has put forward any evidence of that here. (There's a lot of suspicion that this barrier to coordination is more of a screen door than a wall. A campaign can easily see what the candidate's super PAC is doing publicly, and vice versa. So no illegal consultation is necessary to get them both on the same page, making it look like coordination.)", "Despite that legal separation, the New Day commercial specifically blames Cruz, giving him the ever-elongating nose and stating that if Cruz's lips are moving, he's lying. That makes New Day's TV commercial as misleading as the TV commercial it's complaining about.", "File this under \"irony.\" And on the Truth-O-Meter, we rate it False.", "YouTube, \"John Kasich 2016 - 'Nose' - New day for America PAC,\"  \"Ted Cruz 2016 - 'Kasich Won't Play' - Trusted Leadership PAC\" (revised version), both March 31, 2016 and published April 1, 2016", "PolitiFact, \"No, George Soros is not bankrolling John Kasich's campaign,\" April 4, 2016", "Emails, Connie Wehrkamp, communications director, New Day for America, April 2, 2016", "Political TV Ad Archive, original Trusted Leadership PAC commercial, March 29, 2016", "FactCheck.org, \"Soros Not Funding Kasich PAC,\" March 31, 2016", "Wall Street Journal, \"Ted Cruz's distortions,\" March 31, 2016", "New Day for America's complaint about Trusted Leadership PAC ad, March 29, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]