["About this rating", "Heather Wick, a healthcare recruiter from Burlington, Vermont, was the subject of considerable controversy and speculation in January 2018, after a viral Facebook post dredged up a racially-insensitive joke she had made 12 months earlier.", "We received several enquiries about whether or not Wick actually made the remarks in question. She did, but has since apologized for what she said was intended as a \"satirical joke.\"", "On 20 January 2018, Josh Thomas posted a screenshot of Wick's slavery joke, as well as a screenshot of her LinkedIn and Facebook profiles, along with his own message: \"Sharing is caring kids. Make her famous.\" His post was shared 135,000 times within five days.", "Wick originally posted the offending joke to Facebook in January 2017. It read:", "Do you think Trump will bring back slavery? I could use a maid.", "Wick faced a backlash to the joke, and deleted the post -- and her Facebook account -- a few days later. Shortly after that, she apologized in an interview with the Vermont newspaper Seven Days:", "...I was making a satirical joke. I regret that I did it because it was a little too over the line. I meant it as a joke but I apologize if I offended anybody.", "Wick, who said she supported Bernie Sanders in the 2016 presidential election and was \"terrified\" by the victory of Donald Trump, continued:", "I was reading posts from Facebook friends who were saying, ‘Trump’s going to kill us all; he’s going to remove all protections for the LGBT community; he’s going to turn back civil rights.’ Finally, I got sick of hearing all these doomsayers, and I put up a post that said: ‘Hey, maybe Trump will bring back slavery. I could use a maid.’”", "According to Seven Days, she then reiterated her apology for the post.", "Wick has bipolar disorder, but it's not clear what role, if any, this may have had in her decision to post the remarks in the first place. In her interview with Seven Days, she said that she wasn't manic when she wrote the post, but added:", "Bipolar is one of those illnesses that, even if you’re stable, you can have minor blips on the radar. Unfortunately one minor blip on the radar was the comment I made about slavery.", "According to Wick, she and her family members were harassed and received online and telephone death threats in the aftermath of the controversy. Burlington police confirmed this to Seven Days, adding that they had advised Wick to change her phone number and leave her home for a short period as a safety precaution.", "Goldstein, Sasha.  \"The Internet Branded Her a Racist. Does It Matter That She's Bipolar?\"\r\n  Seven Days.  20 January 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]