["About this rating", "A commonly circulated online item about the dangers of benzene supposedly emitted by automobile components has been widely misunderstood:", "Do not turn on A/C immediately as soon as you enter the car! Please open the windows after you enter your car and do not turn ON the air-conditioning immediately.", "According to a research done, the car dashboard, sofa, air freshener emits Benzene, a Cancer causing toxin (carcinogen- take note of the heated plastic Smell in your car). In addition to causing cancer, it poisons your bones, causes anemia, and reduces white blood cells. Prolonged exposure will cause Leukemia, increasing the risk of cancer. May also cause miscarriage.", "Acceptable Benzene level indoors is 50 mg per sq. ft.. A car parked indoors with the windows closed will contain 400-800 mg of Benzene. If parked outdoors under the sun at a temperature above 60 degrees F, the Benzene level goes up to 2000-4000 mg, 40 times the acceptable level ... and the people inside the car will inevitably inhale an excess amount of the toxins.", "It is recommended that you open the windows and door to give time for the interior to air out before you enter. Benzene is a toxin that affects your kidney and liver, and is very difficult for your body to expel this toxic stuff.", "Many readers have come away from viewing this piece with the impression that it warns drivers not to use their cars' air conditioning because the A/C system itself is producing benzene, but what the article actually cautions against is the practice of turning on the air conditioning immediately upon entering an automobile. Motorists should instead, it says, roll down their windows in order to allow accumulated benzene fumes (allegedly emitted by other components, such as dashboards and upholstery) to vent from the car first before re-closing the windows and turning on the A/C.", "How much truth is there to this warning? Some evidence suggests an association between exposure to benzene and an excess risk of leukemia, as noted by the American Cancer Society (ACS):", "A considerable number of human studies provide evidence linking benzene and cancer. Initially, increased risks of leukemia, chiefly AML, were reported among workers with high levels of benzene exposure in the chemical, shoemaking, and oil refining industries. More recently, studies have focused on workers with relatively lower exposure.", "The human data are supported by animal studies. There is sufficient evidence for the carcinogenicity of benzene in experimental animals. Key animal studies support the finding of an excess risk of leukemia in humans from exposure to benzene by inhalation and ingestion. The details of these studies have been reviewed and found to support the association between benzene and cancer.", "But do automobiles really produce potentially cancer-causing levels of benzene? No studies have yet documented that claim to be true.", "A 2001 study of commuter exposure (in both cars and buses) in Korean urban areas found some relationship between automobile use and exposure to benzene, but its observations differed from the warning quoted above in some significant areas:", "The study found that exposure levels were significantly higher during the winter months, which suggests that automobile air conditioning use is not a major factor in benzene exposure.", "The Korean study itself did not establish a connection between commuter exposure to benzene and the onset of cancer.", "A 2007 German study on \"Toxicity of Parked Motor Vehicle Indoor Air\" which specifically tested the health effects of emissions from one new and one three-year-old vehicle exposed to \"parked in sunshine\" conditions found \"no apparent health hazard of parked motor vehicle indoor air\":", "Buters and his colleagues first collected molecules from the air inside a new car and a three-year-old vehicle of the same brand placed under 14,000 watts of light, where temperatures reached up to 150 degrees Fahrenheit. They next exposed these compounds to human, mouse and hamster cells grown in lab dishes. These are commonly used to test toxicity.", "New car smell does not appear to be toxic, the scientists found. Air from the new car did cause a slight aggravation of the immune response that could affect people with allergies, but the same was not seen with the older vehicle.", "(The German study also found the total amount of volatile organic compounds in a new car to be one-tenth the level claimed in the e-mail for benzene alone.)", "The ACS similarly noted of this warning that:", "We found no published studies that confirm the claims of this e-mail. Benzene levels that exceed recommendations for chronic workplace exposure have been observed in some moving cars, but these levels seem unlikely in properly maintained cars.", "The e-mail did get one thing right, though: Upon returning to a closed car on warm days, you should optimally open the windows for a minute or so rather than leaving them closed and immediately turning on the air conditioning. The reason has nothing to do with benzene levels, however; rather, it's because when a car is parked in the sun with its windows rolled up, that condition can create a greenhouse effect which causes the interior of the vehicle to warm up to a temperature considerably higher than that of the outside air. Opening the windows for a few moments allows for the exchange of hot air from inside the vehicle with cooler air outside, speeding up the process of cooling off the car more than air conditioning alone would.", "Sources:", "Benzene and Cancer Risk. https://www.cancer.org/healthy/cancer-causes/chemicals/benzene.html. Accessed 20 June 2022.", "Buters, Jeroen T. M., et al. “Toxicity of Parked Motor Vehicle Indoor Air.” Environmental Science & Technology, vol. 41, no. 7, Apr. 2007, pp. 2622–29. DOI.org (Crossref), https://doi.org/10.1021/es0617901.", "“Does Sunscreen Contain Harmful Chemicals?” Snopes.Com, https://www.snopes.com/fact-check/sunscreen-chemicals-harmful/. Accessed 20 June 2022.", "Buters, Jeroen T.M. et al.   \"Toxicity of Parked Motor Vehicle Indoor Air.\"\r\n    Environmental Science & Technology.   2 March 2007.", "Choi, Charles Q.   \"That New-Car Smell? Not Toxic, Study Finds.\"\r\n    LiveScience.com.   6 April 2007.", "Lee, Jin-Woo et al.   \"Commuter Exposure to Benzene While Traveling in Urban Areas.\"\r\n    The Science of the Total Environment.   May 2002   (pp. 219-228).", "Update [June 20, 2022]: Updates to SEO/social. Fixed formatting.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]