["About this rating", "Nancy Pelosi did utter the words attributed to her about the passage of the Affordable Care Act.", "The infamous soundbite doesn't reflect the full context and meaning of her remarks.", "On 21 June 2017, the web site Chicks on the Right reported that Democratic House Minority Leader Nancy Pelosi had said, of the Affordable Care Act, in 2010 \"We [need] to pass the bill in order to find out what [is] in it.\"", "The website contrasted this with Pelosi's tweet, on 20 June 2017, in which she declared that \"Americans deserve to know\" what was in the Republican health care bill being developed during the summer of 2017:", ".@SenJohnMcCain calling out Republican hypocrisy is music to my ears. Americans deserve to know what’s in the bill. #Trumpcare", "— Nancy Pelosi (@NancyPelosi) June 20, 2017", "And here's the video cited by Chicks on the Right, of her 2010 remarks:", "As can be seen, it's true that Pelosi did utter these words: \"We have to pass the bill so that you can find out what is in it\". However, the article left out important context, including the next few words of Pelosi's statement: \"We have to pass the bill so that you can find out what is in it, away from the fog of the controversy.\"", "Like much reporting and commentary surrounding that remark over the next seven years, the Chicks on the Right article also left out the remarks made by Pelosi in the lead-up to the now-infamous soundbite.", "Pelosi was speaking at the National Association of Counties' annual Legislative Conference on 9 March 2010, in Washington D.C. A full transcript of her speech can be viewed here, but we've included some relevant context surrounding her comments on the Affordable Care Act:", "Imagine an economy where people could follow their aspirations, where they could be entrepreneurial, where they could take risks professionally because personally their families [sic] health care needs are being met. Where they could be self-employed or start a business, not be job-locked in a job because they have health care there, and if they went out on their own it would be unaffordable to them, but especially true, if someone has a child with a pre-existing condition. So when we pass our bill, never again will people be denied coverage because they have a pre-existing condition.", "We have to do this in partnership, and I wanted to bring [you] up to date on where we see it from here. The final health care legislation that will soon be passed by Congress will deliver successful reform at the local level.  It will offer paid for investments that will improve health care services and coverage for millions more Americans. It will make significant investments in innovation, prevention, wellness and offer robust support for public health infrastructure. It will dramatically expand investments into community health centers. That means a dramatic expansion in the number of patients community health centers can see and ultimately healthier communities. Our bill will significantly reduce uncompensated care for hospitals.", "You’ve heard about the controversies within the bill, the process about the bill, one or the other.  But I don’t know if you have heard that it is legislation for the future, not just about health care for America, but about a healthier America, where preventive care is not something that you have to pay a deductible for or out of pocket. Prevention, prevention, prevention–it’s about diet, not diabetes. It’s going to be very, very exciting.", "But we have to pass the bill so that you can find out what is in it, away from the fog of the controversy.", "Although the point was not made clearly or explicitly, the sense of Pelosi's remarks was that the benefits (in her view) of the bill -- rather than the contents of the bill -- would only be fully revealed to the public after the legislation was passed and implemented.", "Pelosi explained and defended her 2010 remarks in June 2012 during a meeting with op-ed writers, as reported by the Washington Post:", "“In the fall of the year,” Pelosi said, “the outside groups ... were saying ‘it’s about abortion,’ which it never was. ‘It’s about ‘death panels,’’ which it never was. ‘It’s about a job-killer,’ which it creates four million [jobs]. ‘It’s about increasing the deficit’; well, the main reason to pass it was to decrease the deficit.” Her contention was that the Senate “didn’t have a bill.” And until the Senate produced an actual piece of legislation that could be matched up and debated against what was passed by the House, no one truly knew what would be voted on.", "“So, that’s why I was saying we have to pass a bill, so we can see, so that we can show you, what it is and what it isn’t,” Pelosi continued. “It is none of these things. It’s not going to be any of these things.”", "Most important, the contents of the Affordable Care Act had been publicly available and publicly debated for months when Pelosi made her remarks in March 2010. The bill, in its original form, was passed by the House of Representatives in October 2009, and in the Senate that December. Although the bill was unusually long (the act runs to 906 pages in the legislative record, with many more pages of regulations) its contents had been subjected to intensive debate and scrutiny in both houses of Congress.", "That process was fundamentally different to the secrecy surrounding the Republican-sponsored American Health Care Act, when Pelosi tweeted on 20 June 2017 that \"Americans deserve to know what's in the [Republican healthcare] bill.\" At that time, the architects of the legislation had not published any of its contents. (A draft of the bill was published on 22 June 2017, two days after Pelosi's tweet).", "Pelosi, Nancy.   \"Pelosi Remarks at the 2010 Legislative Conference for National Association of Counties.\"\r\n    DemocraticLeader.gov.   9 March 2010.", "Capeheart, Jonathan.   \"Pelosi Defends Her Infamous Health Care Remark.\"\r\n    The Washington Post.   20 June 2012.", "Government Publishing Office.   \"Public Law 111 - 148. Patient Protection and Affordable Care Act.\"\r\n    23 March 2010.", "U.S. Senate Budget Committee.   \"Discussion Draft - H.R. 1628.\"\r\n    22 June 2017.", "Correction [17 October 2017]: A previous version of this article stated that the Affordable Care Act was passed by the House of Representatives and Senate in July and August 2009.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]