["About this rating", "Protesters in many major U.S. cities used bricks to cause destruction — or, in some cases, to injure police — while walking on streets during the 2020 demonstrations.", "No evidence suggests a coordinated effort existed on behalf of government entities or billionaires to place bricks on protest routes to incite violence during the demonstrations. Also, evidence showed that in many cases \"suspicious\" bricks depicted on social media were on streets for ongoing construction projects, not \"planted\" for protesters.", "It is possible that protesters themselves could have strategically placed bricks in easily accessible spots to facilitate causing property damage, though no evidence proved that was indeed occurring.", "As American cities erupted in protests against racism and police brutality following the death of George Floyd in Minneapolis in May 2020, social media users began spreading posts alleging that some group — or person — with nefarious intentions had coordinated a scheme to incite and abet violence during the demonstrations by pre-placing piles of bricks along protest routes.", "The claim could be summarized like this: Government officials, law enforcement, billionaires, or protesters themselves had strategically placed caches of cinder blocks in cities nationwide — including Boston, Dallas, Kansas City, and New York City — so protesters could quickly grab the bricks and break windows or cause other property damage. Among the most popular posts was a video of someone who recorded a pile of bricks purportedly near a Dallas courthouse and called the pallets a \"setup\" while another person claimed, \"they put them there on purpose, bro.'\"", "It is unequivocally true that protesters in many major U.S. cities used bricks to cause destruction (or, in some cases, to injure police) during the protests against police brutality following the death of George Floyd — a 46-year-old, unarmed black man who died after a white Minneapolis police officer knelt on his neck for nearly nine minutes.", "But less is known about where, or from whom, the protesters got the bricks, and if the rumors on social media alleging a coordinated scheme on behalf of government, activists, or a powerful figure had any truth.", "What follows is a multi-prong examination into the claim. First, we describe the different groups behind the assertion, and then we investigate this specific theory: that the government, police, or another powerful entity formed a scheme to pre-place the bricks along protest routes so officers could retaliate against people who used them or to incite destruction. Lastly, we examine the possibility that the bricks were strategically placed on streets by protesters themselves.", "An array of people claimed pallets of bricks appeared in protest hot spots as some nefarious scheme, essentially forming three distinct groups that blamed different entities or people for the alleged conspiracy.", "First, some people said police officers or government authorities pre-placed the stacks of bricks to create what protesters called a \"trap\" set up by officers to quickly catch anyone who used them and have a reason to use excessive force. Many believers of that theory used the hashtag #baitbricks on social media to spread awareness of the alleged government-run scheme and circulated the below-displayed poster as a safety message for protesters:", "Other people were less specific with where, or on whom, they were placing blame for the alleged conspiracy to undermine Americans during the protests, and the perpetrators' rationale.", "They included followers of the QAnon movement and accounts that suggested without any proof that billionaire investor Warren Buffet, Microsoft founder and philanthropist Bill Gates, or financier George Soros owned the bricks and created a master plan to instigate violence. For instance, the Twitter account of an anti-vaccine advocate claimed in a June 2 video that went viral:", "The brick pallets are being dropped off for the rioters and antifa by Acme brick company — guess who owns ACME brick company, Berkshire Hathaway and Bill Gates recently stepped down from the board. It's also owned by the Marmon Group in Chicago who was founded by none other than Jay and Robert Pritzker and Berkshire Hathaway. Welcome to the rabbit hole.", "While the videographer did accurately state that Berkshire Hathaway owns the brick manufacturer, that Gates stepped down from Hathaway's board in March 2020, and that Hathaway owns the industrial holding company Marmon Group in Chicago that Jay Pritzker and Robert Pritzker founded, no evidence suggests any truth behind the video's underlying claim: that Acme Brick Company, the nation's largest brick maker, was indeed coordinating brick drop-offs for protesters.", "That brings us to our next point: Some accounts believed antifa (short for anti-fascist) activists — who include a variety of leftist groups that fight white supremacy and neo-Nazis — distributed the bricks on streets where they knew they would be protesting for easy access in the heat of the moment. Among that group of skeptics was a Twitter account with more than 145,000 followers to promote \"Felccas Talks\" — a pro-U.S. President Donald Trump media campaign — which tweeted the following, aiming to raise suspicion among his fans that bricks seemed too convenient for protesters to simply discover:", "By June 1, the Daily Mail, FOXNews, and Breitbart had published stories on the phenomenon, articles that essentially recirculated the claims from social media users without attempting to examine from where the bricks originated.", "Considering the variety and amount of video and photographic evidence that shows bricks in areas where protesters were planning to gather, or already had, we can conclusively state: Yes, pallets of bricks were indeed along protest routes in multiple U.S. cities in late May and early June 2020.", "But how they got there, in many cases, was less exciting than what conspiracists claimed. Per video footage, Google Maps, and other evidence, stockpiles of bricks in several cities with protests had been placed on streets long before the demonstrations following Floyd's death began, as part of a construction project in the area, or else the bricks had a destination that wasn't a protest site.", "In regards to that latter point, a video that was viewed more than 3.2 million times in just days (even after the user who apparently captured the footage deleted it) showed police officers in Boston preparing bricks in the bed of a pickup to allegedly drop off at protest sites, according to claims online. One Instagram caption to the footage read:", "They are trying to delegitimize protests and trick people into using the bricks. If people start throwing the bricks, they can use excessive force, and worse. #blacklivesmatter #acab #baitbricks", "But according to police authorities, viewers misinterpreted what police were doing with the bricks and where they were taking them.", "Per the Northeastern University Police Department (NUPD), which provides security and law enforcement for the Boston campus, the officers in the video are part of the campus force and were on a routine patrol on June 1 when they discovered a damaged brick sidewalk on a popular corridor. To prevent pedestrians from injuring themselves, the officers said they picked up the bricks, returned them to NUPD headquarters (shown in the video), and notified the city's police force about the sidewalk damage. The agency said on Twitter:", "Along the same lines of what appeared to be viral misinterpretations, the below-displayed photos made the rounds on social media, apparently referencing locations in Dallas.", "But by studying Google Map footage and other evidence related to the claim, a team of NBC journalists determined the photographs actually documented vehicles removing bricks — not leaving them on streets like the claim asserted — and the bricks had been in that location since February 2020, months before Floyd's death.", "A similar misunderstanding seemed to have transpired over a video titled \"Los Angeles Resident Finds Stash of Rocks by Bus Stop ... Antifa Terrorism\" that shows crates of bricks along Ventura Boulevard in Sherman Oaks, California, and includes audio of the videographer saying:", "This whole fucking boulevard is just right, right for the fucking taking. These people are going to have a field day here. ...Everything down this whole entire boulevard is full of glass and full of stores and shopping, and you've got a shitload of bricks right there.", "However, a Jewish community center on the street, Chabad of Sherman Oaks, said that claim was false, and that the center was responsible for installing the crates months before the protests began as a security precaution to protect the building. A Facebook post by the synagogue said:", "In New York City, the claim surfaced via the below-displayed tweet, which includes a video that's been viewed more than 3.7 million times and depicts protesters in Manhattan removing barricades surrounding a stack of bricks and then taking from the stockpile. The video stops before viewers see what they do with the cinder blocks, but people can be heard celebrating them.", "But according to our examination of the footage, construction scaffolding is nearby, suggesting that the bricks were part of an on-going construction project rather than some organized scheme. Also, a Google Map image from June 2019 confirms the presence of scaffolding and that the site is under construction.", "Similarly, in Frisco, Texas, where tweets claimed multiple pallets of bricks had been \"planted\" near where protests were scheduled, construction crews were seen covering the bricks with tarps as an effort to keep them to complete a purported highway project — not some strategic plan to instigate protesters.", "In response to another report in that city, the Frisco Police Department said a pile was part of a housing construction project near protesters' scheduled route, and police removed those stacks from the area to avoid any temptation by protesters. Frisco police Sgt. Evan Mattei told The Associated Press:", "\"At this point, our department has no intelligence to suggest that any bricks have been placed on this specific route in advance of this protest for violent purposes.\"", "On that same point, the San Francisco Police Department said pallets of bricks that social media users believed to be \"an attempt to escalate our protest\" were part of a construction project, and the department asked the contractor to remove them from the street.", "A similar story played out in Fort Myers, Florida, where city officials told the local NBC news station the bricks in question were part of a project to install optic fiber in the area. \"The bricks have been here for a long time,\" said a resident, who works in the downtown area.", "Meanwhile, in Fayetteville, North Carolina, someone recorded a video in which viewers can see protesters and what the narrator called \"some random-ass bricks\" near them. But those stacks, too, had apparently been in the area before demonstrations began and were part of a project to improve the walkway for pedestrians.", "A video that was uploaded to YouTube on May 24 (the day before Floyd's death) about the city's reopening during the COVID-19 pandemic confirmed this theory (it shows the bricks), as well as a 2018 document called \"Fayetteville comprehensive pedestrian plan\" that listed the site as one in need of crosswalk and signal improvements. Additionally, BBC misinformation specialists confirmed with the city of Fayetteville that construction crews had placed the bricks on the sidewalk recently for restoration work.", "Those misunderstandings aside, at least two government-run departments — the Kansas City Police and Houston Public Works — said they had received and investigated reports of \"bricks and rocks\" during the demonstrations.", "The former agency — without providing photographic evidence or further details — suggested the \"stashes\" were purposefully placed \"to be used during a riot,\" essentially suggesting an effort by someone or a group to cause property destruction with the cinder blocks.", "Furthermore, in reference to the claims that protesters, perhaps those who consider themselves anti-fascists, had pre-placed the bricks, it is important to note that not all activists who resist fascism use weapons or cause property destruction during protests. However, some antifa members believe any violence that does occur during protests is a form of self-defense to combat extreme right-wing ideologies.", "“Antifa: The Anti-Fascist Handbook,” which historian Mark Bray published in 2017 and explores the movement since the 1920s, includes several instances during protests in which followers of the leftist ideas hurled bricks or had the cinder blocks thrown at them. One group in a newsletter described its activism strategy as:", "In sum, since no evidence suggests there was a coordinated effort on behalf of government entities or billionaires to pre-place bricks on protest routes to incite violence during the 2020 demonstrations against police brutality, and considering the amount and variety of proof that showed many of the reports of suspicious bricks on social media were misunderstandings, we rate this claim \"Mostly False\" — with the caveat that it is possible that antifa members or other protesters could have strategically placed bricks in easily accessible spots to facilitate causing property damage.", "Fruen, Lauren.   \"Pallets of bricks 'randomly' appear during protests in NYC, Kansas City, Dallas and North Carolina sparking theories they were planted by cops or extremists to stoke violence\".\r\n   Daily Mail.   1 June 2020.", "DeMarche, Edmund.   \"Random piles of bricks reported at George Floyd protests\".\r\n   FOX News.   1 June 2020.", "Price, Matthew and Lorand Bodo.   \"George Floyd protests: Live updates from protests today\".\r\n   NBC News.   2 June 2020.", "Dupuy, Beatrice.   \"Bricks in Frisco, Texas, left for construction, not protest\".\r\n   Associated Press.   1 June 2020.", "Howard, Alex.   \"Pile of bricks builds fear during downtown Fort Myers protest\".", "Stantec Consulting Services Inc.   Fayetteville Comprehensive Pedestrian Plan.\r\n   The City of Fayetteville & North Carolina Department of Transportation.   Accessed 3 June 2020.", "Dienst, Jonathan.   \"'Felt Like I Got Shot': Lieutenant Hit With Brick Speaks Out As NYPD Braces For More Violence\".\r\n   NBC New York.   2 June 2020.", "Perez, Matt.   \"Bill Gates Steps Down From Microsoft's And Berkshire Hathaway's boards of Directors\".\r\n   Forbes.   13 March 2020.", "BBC.   \"Seven things you need to know about Antifa\".\r\n   BBC Radio.   Accessed 3 June 2020.", "Bray, Mark.   \"Antifa: The Anti-Fascist Handbook\".\r\n   Melville House.   August 2017.", "Jessica Lee is Snopes' Senior Assignments Editor with expertise in investigative storytelling, media literacy advocacy and digital audience engagement.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]