["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "For most couples, the ideal honeymoon getaway might entail a week of unwinding at a beach resort or a stay in a secluded mountainside cabin.", "Not Bernie Sanders. He chose a colder route. Sanders and his wife, Jane Sanders, spent their first days as newlyweds in the Soviet Union, claims George Will in a recent Washington Post column.", "Will’s Aug. 7 column focused mostly on the legacy of Robert Conquest, who died Aug. 3 at age 98, and whose writings on Soviet prisons documented the atrocities of the Stalin regime. A reader asked us to look into the accuracy of the final paragraph of Will’s column, which invoked Sanders’ \"honeymoon.\"", "It reads:", "\"Conquest lived to see a current U.S. presidential candidate, a senator, who had chosen, surely as an ideological gesture, to spend his honeymoon in the Soviet Union in 1988. Gulags still functioned, probably including some of the ‘cold Auschwitzes’ in Siberia, described in Conquest’s ‘Kolyma.’ The honeymooner did not mind that in 1988 political prisoners were — as may still be the case — being tortured in psychiatric ‘hospitals.’ Thanks to the unblinking honesty of people like Conquest, the Soviet Union now is such a receding memory that Bernie Sanders’s moral obtuseness — the obverse of Conquest’s character — is considered an amusing eccentricity.\"", "We wanted to see if Sanders actually honeymooned on the turf of the United States’ former adversary during the final years of the Cold War.", "Sister cities", "The trip took place while Sanders was mayor of Burlington, Vt., from 1981 to 1989. Toward the end of his mayoral tenure, the small city on Lake Champlain launched a sister-city program with Yaroslavl, located 160 miles northeast of Moscow.", "The program, which is still operating today, has facilitated exchanges between the two cities involving \"mayors, business people, firefighters, jazz musicians, youth orchestras, mural painters, high school students, medical students, nurses, librarians and the (Yaroslavl) ice-hockey team,\" according to its website.", "Along with sister-city relationships with Bethlehem in the West Bank and Puerto Cabezas, Nicaragua, the Yaroslavl program was part of Sanders’ unorthodox attempt to take on international issues from a small city in New England. Sanders also actively pursued his agenda outside of the country, writing letters to world leaders and even traveling to Cuba to meet with the mayor of Havana.", "\"Burlington had a foreign policy,\" he wrote in his 1997 book Outsider in the House, \"because, as progressives, we understood that we all live in one world.\"", "The bond between Burlington and Yaroslavl solidified when Sanders and his wife, as members of a 12-person delegation from Burlington, paid their Soviet counterparts a visit in 1988.", "The timing of the trip was unusual. Bernie and Jane were married May 28, 1988. The delegation left Burlington the next day.", "\"Trust me,\" Sanders writes in the book. \"It was a very strange honeymoon.\"", "When reached for comment, Sanders’ campaign said that the dates for the trip had already been set, and the couple \"set their wedding date to coincide with that trip because they didn't want to take more time off.\"", "In a 2007 interview, Jane Sanders also recalled the peculiar timing: \"The day after we got married, we marched in a Memorial Day parade, and then we took off in a plane to start the sister city project with Yaroslavl with 10 other people on my honeymoon.\"", "Bernie Sanders also refers to the trip sarcastically as \"quiet and romantic\" in his book.", "The \"honeymoon\" was dotted with meetings, interviews and diplomatic functions. A June 2015 profile in The Guardian described the former mayor’s meeting with Yaroslavl city officials:", "\"After receiving a rundown of central planning, Soviet-style, from Yaroslavl’s mayor, Alexander Riabkov, Sanders notes how the quality of both housing and health care in America appeared to be ‘significantly better’ than in the communist state. ‘However,’ he added, ‘the cost of both services is much, much, higher in the United States.’ \"", "An education in central planning probably wasn’t the only item on Sanders’ itinerary. Yaroslavl is home to historic churches and buildings, and the Sanderses would have been in for some good sightseeing, said Ariel Cohen, a senior fellow at the Atlantic Council.", "Will made it sound as if Sanders was visiting to condone Soviet torture practices, but the Burlington trip was more of a dialogue-building exchange program. The Vermont weekly newspaper Seven Days reported in 2009 that the sister-city relationship \"helped local residents who sought to ease tensions between the United States and Soviet Union by initiating citizen-to-citizen exchanges with a Russian city.\"", "Also, the Soviet Union was barely intact at the time of the trip.", "Negotiations had opened up between President Ronald Reagan and Soviet leader Mikhail Gorbachev a few years earlier. \"It was at the beginning of perestroika,\" said Michael Briggs, a spokesman for the Sanders campaign, referring to the restructuring policy Gorbachev instituted in the mid 1980s.", "Gulags still existed and political prisoners were still held in 1988, said Ariel Cohen, a senior fellow at the Atlantic Council. But a watershed moment came when Gorbachev allowed physicist Andrei Sakharov to return from internal exile two years earlier.", "\"The power of the Communist Party was being questioned and the confrontation with the West was winding down through negotiations,\" Cohen said.", "In 1987, Reagan and Gorbachev signed the Intermediate-Range Nuclear Forces Treaty, and in 1988, Reagan himself spoke in Moscow’s Red Square. One year later brought the fall of the Berlin Wall. Three years later, the Soviet Union collapsed.", "Participation in the Burlington-Yaroslavl program has waned over the years, though it was viewed as a \"glamorous endeavor\" by many in Burlington at the time, program leader Howard Seaver said in 2009.", "Will could not be reached for comment through his researcher.", "Our ruling", "Will wrote that Sanders chose \"to spend his honeymoon in the Soviet Union in 1988.\"", "Sanders and his wife did travel to Yaroslavl, a city in the Soviet Union, after their wedding in 1988. In the sense that the trip came after the couple were married, the trip was a honeymoon. The two have also referred to the trip that way, albeit sarcastically at times.", "But it was an unusual honeymoon, to say the least. The trip’s primary purpose was diplomacy, not leisure, and included about 10 extra guests.", "Will’s claim is accurate but is missing context about the trip’s underlying purpose. We rate his claim Mostly True.", "Washington Post, \"The man who helped kill the Soviet Union with information,\" Aug. 7, 2015", "Burlington Yaroslavl Sister Cities Program, \"About Us\"", "Daily Mail, \"EXCLUSIVE: Bernie Sanders' very 1960s love life revealed,\" Jul. 9, 2015", "Vermont Businesses for Social Responsibility, \"Q&A: Jane Sanders, President of Burlington College,\" Oct. 17, 2007", "The Guardian, \"Inside the mind of Bernie Sanders: unbowed, unchanged, and unafraid of a good fight,\" Jun. 19, 2015", "\"Outsider in the House\" by Bernie Sanders, 1997 (p. 69-70)", "U.S. State Department, Office of the Historian, \"U.S.-Soviet Relations, 1981-1991,\" Oct. 31, 2013", "Seven Days, \"Has Burlington Abandoned Its \"Sister Cities\" Around the World? Not Exactly,\" Jun. 24, 2009", "Email interview with Michael Briggs, press officer, Bernie 2016, Aug. 10, 2015", "Phone interview with Ariel Cohen, senior fellow at the Atlantic Council, Aug. 11, 2015", "Phone interview with Lance Janda, professor of history and government at Cameron University, Aug. 11, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]