["About this rating", "A common complaint among residents of every country at election times is the feeling that their votes make no difference; that the powers-that-be will run affairs as they see fit, regardless of any input from the citizenry. This expression of the seeming irrelevancy of the ballot box is encapsulated in a quote often incorrectly attributed to American humorist Mark Twain:", "Although the famed author of the Adventures of Tom Sawyer (among other works) has been connected to this bon mot by a number of websites, none of those sites provides any documentation about where and when Twain either uttered or wrote these words, and the quote is nowhere to be found among his literary writings, letters, or recorded speeches. Additionally, the wording of the quotation changes from source to source (e.g., \"If voting made any difference, it would be illegal\"; \"If voting made any difference it would never be allowed\"), which suggests it has no fixed origin.", "Additionally, Mark Twain's isn't the only name that has been attached to this though. American peace activist Phillip Berrigan and anarchist writer Emma Goldman have also been credited with originating this expression, although there is no evidence that either of them said or wrote it.", "An example of a non-attributed version of this sentiment can be found in a \"Voice of the People\" column published in the Lowell Sun in September 1976 and written by Robert S. Borden:", "\"Has it ever dawned on the editors that the attitudes of the 70 million projected non-voters may be very consistent with the reality that the concept of voting and electing representatives is basically dishonest and fraudulent. If voting could change anything it would be made illegal! There is no way any politicians can legally represent anyone because he was elected on a secret ballot by a small percentage of voters. He then claims to represent the people who voted against him and even those who wisely chose not to participate in such criminal activity.\"", "It is common with incorrectly attributed quotes that they issue from no identifiable source but are later attached to the name of a famous person in order to lend them an air of credibility or importance.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]