["A video of a leopard roaming inside a lodge is circulating on social media with the claim that this happened in Taj, Ranthambore. In the video, the leopard can be seen drinking water from a swimming pool.", "#Thrilling: Leopard enters swimming pool area in Ranthambhor, Rajasthan, drinks water and leaves. pic.twitter.com/KXh5OeHyv6", "— TEAM BHARAT (@TeamBharat_) September 16, 2020", "Retired Air Marshal Anil Chopra too tweeted the video. The tweet had garnered over 1,700 retweets before it was deleted.", "IPS officer HGS Dhaliwal tweeted the video with the claim that it was shot “somewhere in Lonavala”. Dhaliwal deleted the tweet before it was retweeted close to 100 times. An archived version of the tweet can be accessed here.", "India Today, which operates a fact-checking desk called AFWA, published an article on this trending video on September 16, 2020, which carried all the different claims shared along with the video.", "With a keyword search, we found an article published by New York Post on September 9, 2020. “A leopard recently wandered into the restaurant of a luxury hotel in South Africa while hunting its breakfast,” said the article.", "According to the article, the leopard was spotted at the restaurant of the Singita Ebony Lodge in the Sabi Sands Reserve. However, the video published along with the article, as well as on the official Facebook page of the conservation and ecotourism brand Singita, was different.", "According to our research, the viral video was shot at Singita’s Boulder lodge which is less than a kilometre away from Singita Ebony Lodge.", "We will now explain how we reached this conclusion. First, we found videos of the Boulders lodge posted on YouTube. A video posted by YouTube channel Celestielle accurately matches with the visuals seen in the viral video. “Celestielle #248 Singita Boulders Lodge, Sabi Sand Private Reserve, South Africa,” reads the title of the video posted on June 13, 2017.", "Then, we compared multiple frames from the viral video and the one posted by Celestielle. In the comparison below, we have juxtaposed a frame from the viral video with one of the frames seen in the YouTube video. The chairs and the tree near the swimming pool are highlighted in both the images.", "Moreover, another comparison of the frame taken from the viral video with the YouTube video shows that the wooden flooring and table, the sliding glass door and the balcony match.", "England cricketer and commentator, Kevin Pietersen, was one of the earliest social media users to upload this video, along with two more videos and an image from the area. He informed that the image is from South Africa’s Umganu lodge without specifying the details of the videos.", "So this is all in the last few days in one area. Watch the 3 videos and then the final picture was taken at my place yesterday – @umganulodge. I’m really hoping a nasty accident doesn’t happen soon. But, the good news though, is that we humans are not a predators prey. We also know that these animals are treated with utmost respect so they do live very well alongside humans in the Sabi Sands area. It’s fascination to see though that coming out of a full lockdown in SA, these animals are being seen by the public a lot closer to rooms/reception areas. Possibly due to their territories shifting without humans being around or they just feel less pressure being in those areas cos they’ve been doing it for the last 6 months with no one around. We have to protect these beautiful creatures. We have to respect their space. Never get over familiar cos that’s when an accident could happen & the human won’t win! Anyway, enjoy these videos! Nature is THE BEST! ❤️", "A post shared by  Kevin Pietersen 🦏 (@kp24) on Sep 3, 2020 at 5:46am PDT", "In conclusion, a video of a leopard passing through a lodge in South Africa was shared with the claim that the animal was spotted in different parts of India.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "Trigger Warning: Sexual Violence A distressing video of a girl forced to take her clothes…", "A clip featuring Pakistan men’s Cricket team captain Babar Azam is viral on social media…", "A 13-second clip featuring Bollywood actor Shah Rukh Khan is being shared on social media…", "Union minister of information and broadcasting Anurag Thakur on September 26 announced Waheeda Rehman as…"]