["The controversy over the president's tax returns reignited when the New York Times obtained more than two decades of tax return data, which reportedly show Trump paid $750 in federal income taxes in 2016 and 2017.", "The president called the claim that he paid no federal income taxes for 10 of the past 15 years \"fake news\" during a press conference, but he dodged specific questions about what he paid and when.", "\"Actually I paid the tax, and you'll see them as soon as my tax returns are done,\" Trump told White House reporters. \"It's under audit. They've been under audit for a long time. The IRS does not treat me well.\"", "That's the standard response from Trump whenever he's asked about releasing his tax returns — an act that was long considered standard practice for people who wanted to be America's chief executive.", "But it's also led some of his supporters to claim on social media that \"IRS Code section 7213 makes the unauthorized disclosure of any return or return information a felony.\" Therefore, \"Trump is required by law not to show his taxes to nosey liberals.\"", "Attempts to reach the poster through social media were not successful.", "More:President Trump's tax returns show he has company: How rich Americans avoid taxes", "The section of code referenced in the Facebook post outlines all the different people who are prohibited from sharing someone's tax returns and the penalties they could face.", "For example, federal employees could face felony charges and fines of up to $5,000.", "It does not, however, prohibit a person from releasing his or her own tax returns. No law does. Every major party presidential candidate since the early 1970s has released theirs except for Trump. (It's worth noting former New York City Mayor Michael Bloomberg redacted large portions of his returns.)", "If you want to peruse what's out there, Tax Notes, a website that provides news and analysis on tax issues, has a record of every return released by recent candidates. It includes 10 returns for Vice President Mike Pence, for example.", "That's something USA TODAY fact-checked when Trump first made the claim back in 2016.", "The IRS said in a statement at the time that federal privacy rules meant the agency couldn't discuss individual tax matters, but “nothing prevents individuals from sharing their own tax information.”", "We rate this claim as FALSE. People who release someone else's tax returns can face felony charges. But nothing in U.S. law prevents a person from releasing his or her own tax information.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here, for more."]