["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Georgia Lt. Gov. Casey Cagle said his state won’t tolerate sanctuary cities and cited as backup a federal report, claiming it found that more than 100 murders could have been prevented if communities worked with immigration officers.", "\"Sanctuary city\" is a term commonly used for a jurisdiction that limits its cooperation with immigration authorities. Federal officials send requests to local jails asking them to hold individuals scheduled for release so that immigration officers can pick them up. The extent of cooperation and scope of the policies implemented vary by jurisdiction.", "Cagle, who is running for governor, told a local news station that the City of Decatur may be in violation of a state law prohibiting sanctuary cities.", "\"How are they in direct violation?\" WSB-TV’s Craig Lucie asked Cagle. (Decatur said it complies with state law and called the sanctuary city label a misunderstanding.)", "\"Well, they are not cooperating with (U.S. Customs and Immigration Enforcement), and the important feature of this is that criminal illegal aliens, it was demonstrated with a Homeland Security study, that showed 120 murders took place that could have been prevented had communities been working with ICE and Homeland Security,\" Cagle said Oct. 9.", "President Donald Trump has claimed that sanctuary cities attract criminals and blamed their policies for the killings of Americans by immigrants in the country illegally. Given the national debate about sanctuary cities, we wondered if Cagle was right that the Department of Homeland Security had determined that 120 murders might not have happened if communities cooperated with immigration authorities.", "We found that DHS has not done a study on this issue. Cagle’s office pointed us to a 2015 letter from the Senate Judiciary Committee, which said that according to ICE data, \"up to 121 homicides in the U.S. could have been avoided\" between fiscal years 2010 and 2014 if ICE had deported criminal immigrants instead of releasing them back into the United States. But that letter is not about sanctuary cities’ lack of cooperation with ICE.", "David Lapan, spokesman for DHS, told PolitiFact that neither DHS or ICE had published a report showing that murders could have been prevented in communities if they complied with immigration authorities.", "\"However, there are instances where criminal aliens who were released from jails -- without allowing ICE to take custody -- who then went on to commit additional crimes, including murder,\" Lapan said.", "But information provided by Cagle’s office did not support the claim that 120 murders took place due to sanctuary city policies.", "A June 12, 2015, letter from Sen. Chuck Grassley, chairman of the Senate Judiciary Committee and then Sen. Jeff Sessions, who chaired the Subcommittee on Immigration and the National Interest, specified that 121 criminal immigrants were charged with homicide after their release from ICE custody from fiscal years 2010 and 2014.", "Of the 121 individuals released by ICE:", "• 33 were released on a bond set by the Justice Department’s Executive Office of Immigration Review;", "• 24 were released because a 2001 Supreme Court case, Zadvydas vs. Davis, prevents the indefinite detention of immigrants who can’t be deported (some countries won’t take back their nationals ordered removed);", "• 64 were released per ICE’s discretion.", "The letter does not say that the homicides for which the 121 individuals were charged could have been prevented if communities or sanctuary cities had cooperated with ICE. It centered on ICE’s release of the immigrants from their custody. The senators asked DHS, the State Department and the Attorney General to identify the jurisdictions to which the 121 criminal immigrants were released.", "A June 16, 2015, letter sent to ICE’s assistant secretary doesn’t cite a specific number of homicides that could have been avoided, but more broadly said 121 criminals who were not deported were charged with homicides after their release from ICE custody between fiscal years 2010 and 2014.", "The Center for Immigration Studies, a think tank that favors low immigration levels, reviewed data related to the 121 criminal immigrants.", "\"This tally does not include aliens who were released by sanctuary jurisdictions, nor those aliens that were released by local law enforcement agencies after ICE declined to take them into custody due to Obama administration prioritization policies. This list includes only those aliens that ICE arrested and then released,\" the center reported in March 2016.", "Cagle’s overarching message is that homicides could have been prevented if criminal immigrants were deported, his office said.", "\"The safety and security of every Georgian has been, and always will be, the top priority of Lt. Gov. Cagle,\" said Bo Butler, Cagle’s chief of staff. \"The point in referencing this shocking number of murders is that Homeland Security concluded at least 121 homicides were committed by convicted criminal illegal aliens. Had deportation occurred following the previous convictions, this loss of life could have been prevented.\"", "Cagle said that a Homeland Security study \"showed 120 murders took place that could have been prevented had communities been working with ICE and Homeland Security.\"", "Many elements of this statement are wrong. DHS said it had not published such a report. Cagle’s office actually referred to a 2015 letter from the Senate Judiciary Committee, citing ICE data, that said up to 121 homicides could have been avoided if ICE had deported criminal immigrants.", "While the letter started off saying 121 homicides were preventable, the document focuses on 121 being the number of criminal immigrants who were charged with homicide after being released by ICE. Most importantly, while homicides were committed, the letter does not claim they could have been avoided had sanctuary policies not been in place.", "Cagle’s statement is not accurate. We rate it False.", "WSB-TV, Lt. Governor says Decatur may be in violation of law over sanctuary cities, Oct. 9, 2017", "WSB-TV, Decatur says Lt. Governor's claim over sanctuary cities left city blindsided, Oct. 10, 2017", "Email and phone exchange, Georgia Lt. Gov. Casey Cagle’s press office, Oct. 11-12, 2017", "Email interview, David Lapan, Department of Homeland Security spokesman, Oct. 11, 2017", "U.S. Customs and Immigration Enforcement, ICE arrests 400th foreign fugitive in fiscal year 2017, July 19, 2017", "AJC.com, Decatur responds to sanctuary cities claims", "Miami Herald, Hundreds of immigrants convicted and not deported committed more crimes — even murder, Feb. 7, 2017", "Sen. Chuck Grassley’s website, 121 Criminals Charged with Murder Following Release from Custody Pending Deportation, June 15, 2015", "Sen. Chuck Grassley’s website, Senators Seek More Details on Criminals Charged with New Crimes Despite Receiving Deportation Orders, June 17, 2015", "Center for Immigration Studies, Free to Kill: 124 Criminal Aliens Released By Obama Policies Charged with Homicide Since 2010, March 14, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]