["The post was published here on Facebook on February 18, 2020.", "Below is a screenshot of the misleading post:", "The post’s caption translates to English as: “Taking a hot bath is also good to prevent coronavirus. Let us install Vigen (not stands for virus generator).”", "The post was published alongside three images of water heaters produced by the Indonesia-based manufacturers, Vigen. Its products can be seen for sale on the Indonesian marketplace Tokopedia here and here.", "COVID-19 has killed more than 14,000 people and infected nearly 333,000 others, according to this WHO report, dated March 23, 2020.", "A similar claim was also shared here, here, here and here on Facebook.", "The claim is misleading.", "Dr Dirga Sakti Rambe, an internist and vaccinologist at Jakarta’s OMNI Pulomas Hospital, told AFP by WhatsApp on March 19, 2020: “There has not been any scientific evidence to suggest that coronavirus can be killed with hot water.”", "The WHO has also issued a statement here on its website that “taking a hot bath will not prevent you from catching COVID-19”.", "It reads, in part: “Taking a hot bath with extremely hot water can be harmful, as it can burn you.", "“The best way to protect yourself against COVID-19 is by frequently cleaning your hands. By doing this you eliminate viruses that may be on your hands and avoid infection that could occur by then touching your eyes, mouth, and nose.”", "Below is a screenshot of the WHO statement and infographic:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]