["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As the COVID-19 coronavirus disease pandemic of March 2020 threatened to shut down businesses across America for an extended period of time, the U.S. government faced the difficult task of deciding which industries should be provided economic assistance to keep them afloat for the duration. Public sentiment in some quarters was strongly against government bailouts for businesses such as airlines and cruise companies, on the grounds that over the last several years many of the major operators had spent billions of dollars in profits buying up their own stock rather than paying down their debts. In USA Today, John M. Griffin and James M. Griffin wrote:", "Start with the airlines. Rather than using their profits from the past five years to pay off debts and save for a rainy day, the big four — American, United, Delta and Southwest — instead grew their combined liabilities to $166 billion, all while spending $39 billion on share repurchases. That number, which is only from the big four, is almost 80% of what they’re asking for now from U.S. taxpayers. Similarly, the three largest Cruise companies -- Carnival, Norwegian, and Royal Caribbean -- have liabilities of $47.5 billion and engaged in share repurchases of $8 billion.", "Had these companies paid down liabilities instead of using stock repurchases to bid up their stock prices, they would have been far better prepared to weather this emergency. Of course, higher share prices made their stock options more valuable. This allowed top airlines executives to pay themselves $666 million in compensation over the five-year period. The top cruise executives managed to haul in $448 million. Now, taxpayers are unwillingly being called upon to bail out their profligate behavior.", "A widely circulated meme on social media offered another reason why cruise lines were supposedly unworthy of government bailouts -- because although they might be headquartered in the U.S., their ships were foreign-flagged in order to put them out of reach of U.S. law:", "That nearly every major cruise line registers their ships somewhere outside the U.S. is hardly a disputable point. As a 2011 news report noted, only a single major cruise ship at the time was U.S.-flagged:", "[O]nly one major cruise ship -- NCL America's Pride of America -- is registered in the United States, according to data from CyberCruises.com. Most of the big boats fly Bahamian flags, but other popular registries include Panama, Bermuda, Italy, Malta and the Netherlands. In fact, according to Cruise Lines International Association, 90% of commercial vessels calling on U.S. ports fly foreign flags.", "The three cruise lines called out by name in the meme -- Disney, Celebrity, and Carnival -- do indeed engage in this practice. It's not difficult to verify that Disney cruise ships are registered in the Bahamas, Celebrity ships in Malta, and Carnival ships in Panama. Of course, the cruise industry and their critics offer differing reasons for why cruise ships are flagged in countries other than the U.S., with the former asserting that:", "CLIA [Cruise Lines International Association] maintains there are reasons for such policies: \"There are many factors that determine where a cruise ship -- or for that matter, any maritime vessel -- is flagged. Those determinations are made by individual cruise lines and other ship operators based on varying factors including the capabilities of the flag to deliver the services needed; representation and reputation of the flag in the international shipping community; the performance of the flag state, which dictates how a ship is prioritized by port states; the pool of seafarers able to meet the needs of the flag; and the flag's fees/charges and taxes,\" the association said by e-mail.", "This can be viewed as a robust free-market debate. Some maintain burdensome U.S. regulations have forced cruise operators to plant their flags elsewhere, while others say these corporations are seeking to attract American dollars while skirting American safety and consumer protection laws.", "On the other hand, an academic paper by Caitlin E. Burke of the University of Florida about \"Legal Issues Relevant to Cruise Ships\" made no bones of observing that reflagging of ships had long been used as a means of avoiding U.S. federal taxes, labor and safety laws, environmental laws, lawsuits, criminal investigations, and other regulations:", "Aside from the majority revenue generated by U.S. passengers, cruise lines are independent of the U.S. economy. Even though nearly 75 percent of passengers are U.S. citizens, “cruise line corporations and their ships are not traditionally American-owned or registered ...” (Tomlinson, 2007)", "Cruise line companies are not concerned about increasing minimum wage, rising insurance premiums, or higher corporate taxes. Cruise lines escape federal taxes and labor laws by registering their corporations and vessels in foreign countries [such as] Panama, Liberia, and the Bahamas. In fact, employees of cruise lines are often mistreated due to lackadaisical labor laws. Worst of all, employees will find little to no recourse pursuing litigation. Likewise, a U.S. citizen passenger faces the same predicament.", "A vessel’s country of registration is commonly referred to as the \"flag of convenience\" (FOC). Flagging a ship under a foreign flag for the convenience of the cruise line is nothing new, nor is it rare. The majority of cruise ships today are registered to Panama, Liberia, or the Bahamas. It is important to pay close attention as many vessels within the same fleet are often registered to different countries. Carnival Corporation, for example, has flagged their cruise vessel Celebration under Panama and Destiny under the Bahamas. Cruise lines often avoid drawing attention to the FOC of by using the term \"headquartered in Miami, Florida.\" It is important to understand that while the majority of these cruise lines have their headquarters in Miami, they are not registered in the U.S. Thus, U.S. laws do not apply and passengers are at the mercy of maritime law.", "That the practice of ship-reflagging is common and regular is undeniable. Whether cruise lines headquartered in the U.S. but operating ships registered in foreign countries \"deserve\" government bailouts in a time of pandemic is a subjective issue with no definitive answer, but certainly some critics have argued that they do not:", "Even in a crisis, companies with prudent balance sheets will survive and in time, thrive. Despite what politicians might tell you, the airplanes and ships of imprudent companies are physical property that will not suddenly disappear. They will fly or sail again under the same or different name, but hopefully with cheaper prices, better service and different executives. Like a college student sleeping off a hangover, a crisis is a time to sober up by removing debt from the system. It’s not time for another drink.", "McGee, Bill.   \"What Every Cruiser Should Know Before They Book.\"\r\n    USA Today.   26 April 2011.", "McGee, Bill.   \"Why Are Cruise Ships Registered in Foreign Countries?\"\r\n    USA Today.   11 December 2012.", "van Doorn, Philip.   \"Airlines and Boeing Want a Bailout — But Look How Much They’ve Spent on Stock Buybacks.\"\r\n    MarketWatch.   22 March 2020.", "Griffin, John M. and James M. Griffin.   \"Coronavirus Bailout for Airlines and Cruise lines Is Socialism for the Undeserving Rich.\"\r\n    USA Today.   20 March 2020.", "Burke, Caitlin E.   \"A Qualitative Study of Victimization and Legal Issues Relevant to Cruise Ships.\"\r\n    Accessed 23 March 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]