["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democrats have been dogging Nevada Republican Sen. Dean Heller ever since he sided with his party on a couple of key health care votes last year. The latest attack comes from the Democratic Senatorial Campaign Committee in an ad airing statewide in heavy rotation.", "In it, young Army veteran Kyle Rhodes tells his story.", "\"I served in Iraq, but when I got home, I couldn’t afford health insurance,\" Rhodes says. \"I finally got it when they expanded Medicaid. That helped a lot of us.", "\"I believed Dean Heller when he promised to protect our health care, but Dean Heller broke that promise.\"", "Rhodes ends with these uncompromising words:", "\"Dean Heller, you voted against us. Now it’s our turn to vote against you.\"", "Medicaid expansion covered nearly 9,000 veterans in Nevada in 2015, so the story Rhodes tells is not unique to him.", "Heller’s moves during the Senate’s push to repeal and replace Obamacare in 2017 play a prominent role in the Nevada Senate race. The charge that he broke a promise shows up repeatedly in Democratic ads.", "In this fact-check, we look at what Heller said and did between June and September of 2017.", "By June 22, 2017, the House had passed the American Health Care Act and the Senate had a draft of its replacement for Obamacare, the Better Care Reconciliation Act. The next day, Nevada Gov. Brian Sandoval and Heller held a joint news conference to protest the Senate bill.", "Heller said the Affordable Care Act had many problems, but \"this bill is simply not the answer.\"", "\"I’m announcing today that in this form, I will not support it,\" Heller said, waving a copy of the 167-page draft. \"Our first vote on this piece of legislation may be as early as Tuesday. We'll have a procedural motion, that we don't need to get into, but it's called getting on a bill so that we can have a final vote sometime on Friday. I'm just telling you this, if this is the bill, if this is the language on that procedural motion on Tuesday, I won't be voting for it.\"", "Tuck that away: Heller said he wouldn’t even vote on the procedural motion for the bill \"as written.\"", "Which brings us to the biggest problem in that version of the bill for both Heller and Sandoval –– Medicaid.", "Heller vowed to protect expanded Medicaid. Here’s what he said:", "\"If you want my support on legislation on health care that fixes the state of Nevada, that supports these people that are on expanded Medicaid, you’ve got to make sure that the Republican governors that have expanded this Medicaid sign off on it. The question is, what are the changes in here and what are the assurances that they will have insurance in the future. And I’m telling you right now, it doesn’t do that. It doesn’t protect Nevadans on Medicaid and the most vulnerable Nevadans.\"", "Under the Affordable Care Act, states got the option to extend Medicaid to any adult earning up to 138 percent of federal poverty. Nevada was one of 16 states with Republican governors that took Washington’s offer.", "The terms were better than for traditional Medicaid. Instead of Washington covering a little more than half of the cost (the average in 2012 was 57 percent), Washington promised to cover 90 percent of the tab for Medicaid expansion recipients over the long haul.", "The Senate plan changed that.", "It phased out the enhanced federal matching funds for the Medicaid expansion group and set a limit on federal funding through a per capita cap or, optionally, through a block grant for some enrollees.", "For Nevada, those changes meant an estimated loss of $4.2 billion over 10 years.", "The procedural vote that Heller expected quickly didn’t come for a month. In between, lawmakers tweaked the bill, but never fundamentally changed the funding rules for expanded Medicaid.", "Sandoval became a barometer of how well the Senate bill treated Medicaid. He never liked what he saw. Throughout the process, Sandoval remained opposed, saying he had \"great concern\" for what the legislation –– in all of its versions –– would do.", "After that news conference with Sandoval, Heller was in the crosshairs of everyone who wanted to get a bill through the Senate.", "Heller found himself on the receiving end of attack ads from a Trump-aligned super PAC America First Policies.", "Heller was invited to the White House where he was seated next to President Donald Trump. Trump pointed to Heller and said \"This is the one we were worried about. You weren’t there (on the bill.) But you’re going to be.\"", "Trump turned to the rest of the room and added, \"Look, he wants to remain a senator, doesn’t he?\"", "On July 25, Heller voted with 49 other Republicans to move the bill forward in the Senate. It was the procedural vote he had said he wouldn’t approve.", "Heller spokeswoman Megan Taylor said by that time, the measure had changed and he saw that vote as the best way to improve the bill.", "\"After it was clear that the bill was being modified and there would be an open debate and votes on amendments to the Senate’s bill, Sen. Heller voted to debate health care because he thought that ideas to improve our failing health care system should be discussed,\" Taylor said.", "But in terms of a threat to expanded Medicaid, the bill Heller green-lighted was largely the same as the version he rejected a month earlier.", "The welter of Senate votes that followed make the head spin, and through it all, Heller managed to be on both sides of the Medicaid issue.", "He voted against a Democratic move that would have protected benefits to anyone currently eligible for Medicaid.", "He voted for a motion that effectively killed the main Republican bill and its whittling away of expanded Medicaid.", "Heller offered a non-binding amendment that urged Senate members in a hoped-for conference committee to protect Medicaid expansion. The amendment also called for repeal of the Affordable Care Act and lost by a wide margin.", "He voted against the full repeal of Obamacare, which would have washed away everything, including expanded Medicaid.", "Few people followed the twists and turns more than Timothy Jost, professor emeritus at Washington and Lee University School of Law. Jost told us Heller’s record was decidedly mixed.", "\"He voted with the Republicans a number of times to proceed and on motions that kept the bill alive,\" Jost said. \"But he did vote against two bills that would have killed Medicaid expansion.\"", "Jost said he sees evidence for both sides of the argument on where Heller stood.", "In the end, the Senate plan crumbled. In a dramatic 1 a.m. vote, every Democrat and three Republican senators, including most notably John McCain, voted against it and the bill died. That version was stripped down and said nothing about Medicaid. Heller joined most Republicans and voted for it.", "In September, Heller joined a last-ditch push to pass a new health care law. He co-sponsored the Graham-Cassidy bill. That would have replaced expanded Medicaid with block grants to the states. It shifted traditional Medicaid funding from an open-ended commitment to a capped amount.", "Nevada would have the flexibility to use its block-grant money however it saw best to help subsidize health insurance premiums, create high-risk pools for those with pre-existing conditions or take other steps as necessary to make health insurance affordable and available.", "The impact on the people benefiting from Medicaid expansion was unclear, but the Kaiser Family Foundation estimated that overall, Nevada would lose about 8 percent or $870 million by 2026.", "Sandoval joined nine other governors to oppose Graham-Cassidy.", "The plan never came up for a vote.", "The Democratic Senatorial Campaign Committee said Heller broke his promise to protect expanded Medicaid.", "Heller said he would vote no on a procedural vote, and said any bill must pass muster with Republican governors in states with expanded Medicaid. His follow-up votes were mixed.", "Heller voted yes on the procedural vote. While the bill differed from the original draft, it had no significant differences on Medicaid expansion.", "Immediately after that, Heller both voted no on a move that explicitly protected expanded Medicaid and voted no on two bills that would have killed expanded Medicaid.", "Heller co-sponsored the Graham-Cassidy bill, which did not specifically curtail Medicaid expansion but reduced funds going to Nevada and created uncertainty about the program’s future. He had said he would not support health care changes that did not win Gov. Sandoval’s support, but Sandoval opposed Graham-Cassidy.", "His record can make the case either way. We rate the claim Half True.", "Democratic Senatorial Campaign Committee, Gutless, Oct. 16, 2018", "KSNV, Governor Sandoval & Senator Heller Press Conference, June 23, 2017", "U.S. Senate, Roll call vote on motion to Motion to proceed to H.R. 1628, July 25, 2017", "U.S. Senate, On McConnell Amendment No. 667 , July 28, 2017", "U.S. Senate Budget Committee, Better Care Reconciliation Act, June 26, 2017", "U.S. Congress, H.R.1628 - American Health Care Act of 2017: Actions, July 28, 2017", "U.S. Congress, S.Amdt.667 to S.Amdt.267, July 27, 2017", "Congressional Research Service, Comparison of the American Health Care Act (AHCA) and the Better Care Reconciliation Act (BCRA), July 23, 2017", "Kaiser Family Foundation, Better Care Reconciliation Act (BCRA): State-by-State Estimates of Reductions in Federal Medicaid Funding, July 19, 2017", "Bipartisan governor’s group, Letter to Senate leadership, Sept. 19, 2017", "Health Affairs, Senate GOP Wins Vote To Debate Health Care, Then Loses Vote On ACA Replacement Bill, July 26, 2017", "Kaiser Family Foundation, Restructuring Medicaid in the American Health Care Act: Five Key Considerations, March 15, 2017", "Urban Institute, State-by-State Coverage and Government Spending Implications of the American Health Care Act, June 2017", "Congressional Budget Office, American Health Care Act, March 13, 2017", "Kaiser Family Foundation, State-by-State Estimates of Changes in Federal Spending on Health Care Under the Graham-Cassidy Bill, Sept. 21, 2017", "Las Vegas Review Journal, Obamacare repeal and replace will hurt Nevada, Sandoval says, July 6, 2017", "Associated Press, Nevada governor still concerned by health bill, July 14, 2017", "Las Vegas Journal Review, Sandoval signs governors’ letter opposing Heller Obamacare repeal, Sept. 20, 2017", "Associated Press, Heller facing hot seat on GOP health care bill decision, July 15, 2017", "Las Vegas Review Journal, Pro-Trump PAC pulls ads pressuring Dean Heller on health care vote, June 28, 2017", "Las Vegas Review Journal, By a hair, Senate votes to debate GOP health care bill, July 26, 2017", "Las Vegas Review Journal, Trump says upcoming health vote is GOP’s chance \"to keep their promise\", July 25, 2017", "CBS News. Trump warns GOP: Time to \"keep your promise\" on health care, July 24, 2017", "Reno Gazette Journal, Sandoval urges against 'skinny repeal,' calls for bipartisan health care reform, July 26, 2017", "Georgetown University Health Policy Institute, ‘Skinny Repeal’ Bill Would Put Medicaid for Children and Families at Risk (Part 2), July 27, 2017", "Interview, Megan Taylor, spokeswoman, Office of Sen. Dean Heller, Oct. 19, 2018", "Interview, Timothy Jost, professor emeritus, Washington and Lee University School of Law, Oct. 19, 2018", "Email interview, Sara Rosenbaum, professor of health law and policy, George Washington School of Public Health, Oct. 16, 2018", "Email interview, Adam Wilk, assistant professor, Emory University Rollins School of Public Health, Oct. 17, 2018", "Email interview, Jamila Michener, assistant professor, Department of Government, Cornell University, Oct. 16, 2018", "Email interview, Stewart Boss, spokesman, Rosen for Senate, Oct. 17, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]