["By Robert Farley", "Posted on February 9, 2021", "House Republican Leader Kevin McCarthy misleadingly argues that federal aid to state and local governments is unnecessary because state and local tax receipts were “the highest… in American history” in the third quarter.", "State budget experts say the third quarter revenues were inflated, because almost all states moved the deadline for filing state taxes from April 15 to July 15 due to the pandemic, pushing more tax receipts to the third quarter. Many states also extended the deadline to submit sales tax receipts to the state, shifting revenue between quarters.", "“It is critical to look at the entire pandemic period, rather than individual quarters, as there has been too much shifting of revenues from one quarter to another, from one fiscal year to another,” said Lucy Dadayan, a senior research associate at the Urban Institute. Looking at the pandemic months, she said, state and local revenues are down overall.", "McCarthy and other Republicans also have pointed to a recent analysis from J.P. Morgan that found states have not seen the “apocalyptic declines” in tax revenue that some feared. Specifically, the analysis found that there was an average decline of 0.12% in state revenue in calendar year 2020, and that 21 states saw positive revenue growth compared with 2019.", "After citing the J.P. Morgan analysis, McCarthy said direct aid to state and local governments amounts to “blue-state slush funds that are not needed.” (Among the 21 states that J.P. Morgan identified as seeing positive revenue growth in the 2020 calendar year, there is a mix of red and blue states.)", "State budget experts warn, however, that the J.P. Morgan study presents an incomplete picture. For one, it includes the first three months of 2020 — before the pandemic began to come into focus — when revenues were strong. And it does not account for local governments, which have seen larger revenue and job losses than states.", "The Biden administration’s proposal for $350 billion in direct aid for state, local and territorial governments has been one of the sticking points in discussions with Republicans over a COVID-19 relief bill. By contrast, the roughly $618 billion Republican rescue plan does not include any flexible aid to state and local governments.", "In a Feb. 2 blog post, McCarthy took aim at the state and local government aid in President Joe Biden’s proposed coronavirus relief package, the American Rescue Plan.", "“Democrats say they need $350 billion for state and local government funding (aside from several other liberal wish-list items),” McCarthy wrote. “But do states and local governments really need it?", "“Here’s the truth about state and local funding that Democrats don’t want you to know about: State and local government tax receipts have never been higher. Ever.”", "McCarthy pointed to St. Louis Federal Reserve data that show state and local governments had the highest tax receipts “in American history” in the third quarter of 2020. Looking at a graph of the first three quarters of 2020, he said, “you can see that it only took two quarters in 2020 to rebound to a new high” in state and local tax receipts.", "But focusing on the third quarter revenue receipts is misleading, said Shelby Kerns, executive director of the National Association of State Budget Officers. “All states that collect an income tax delayed their tax filing deadlines in response to the COVID-19 crisis, and the vast majority set July 15 as the new filing deadline,” Kerns said. “That delay has artificially boosted Q3 state tax receipts.”", "Many tax filers, particularly high-income earners, tend to file in the last two weeks before the tax filing deadline, Dadayan said. To illustrate the shift from pushing back the filing deadline, Dadayan points to daily receipts from the federal Treasury that show non-withholding individual income tax receipts for July 2019 were about $3.9 billion, while in July 2020 they were nearly $125 billion. By contrast, non-withholding income tax receipts in April 2019 were $104 billion, compared with about $12 billion in April 2020.", "The extended tax filing date wasn’t the only factor driving up the third quarter numbers.", "“A lot of states had extended the deadlines for businesses to remit sales tax receipts to the state,” Dadayan said “That created some shifting of sales tax revenues between quarters as well.”", "And finally, consumers put off a lot of big-ticket purchases from the second quarter — when many retail stores were closed due to the pandemic — to the third quarter, after they had reopened. That pent-up demand also inflated the third quarter sales tax revenues, she said.", "In a press briefing on Feb. 1, White House Press Secretary Jen Psaki was asked about the J.P. Morgan analysis and whether it suggested state and local government relief isn’t needed in the latest rescue package.", "“I think our objective is to focus on not J.P. Morgan reports, but what state, local governments and others are telling us they need to ensure that the people in their districts, the resources in their districts, the people who are making government function in their districts have the funding and resources they need,” Psaki said.", "The J.P. Morgan analysis does show how some states have been harder hit by the pandemic than others.", "Tourism heavy states such as Hawaii (-13.6%), Nevada (-13%) and Florida (-7.9%) saw some of the largest declines in revenue compared with 2019, as did states “dependent on economically sensitive revenue streams such as oil and gas drilling, coal extraction,” such as North Dakota (-9.7%) , West Virginia (-6.8%) and Texas (-6.8%).", "On the flipside, 21 states saw revenue growth, led by Vermont at 12.8%.", "“We hypothesize the growth may be due to a mix of factors, including the composition of tax revenue with higher proportions of less volatile revenues such as property tax (Vermont gets 32% of state tax revenue from property taxes), state economies/industries, and possible COVID-19 related shifts in activity and driving patterns (driving to national parks out west),” the authors wrote.", "The J.P. Morgan report notes that the tax revenues don’t tell the whole story, that many states are seeing “budget gaps” due to COVID-19 expenditures and “greater social service needs.” Any federal aid to state and local governments would “be a credit positive” but even without such aid, the report states, “if states maintain expenditure and cost control, the budget impact should be manageable for most.”", "When a group of 10 Republican senators met with Biden on Feb. 1 to discuss their competing rescue plans, Sen. Mitt Romney cited the J.P. Morgan analysis to argue for a more targeted approach, saying later he hoped that “if there is funding in [Biden’s] plan for states and localities it is based on need, not a simple blanket of billions of dollars that would be a windfall” for states that saw tax revenue growth in 2020.", "“I go back to the need to have data,” Republican Sen. Bill Cassidy said on CNBC after the meeting with the president. “I’ve been a big advocate for state and local aid, but one of the data points was a recent report from J.P.Morgan using data from the states saying that most states have lost less than 2% of their revenue, year over year. A state like New York is down 1.5%. My state’s been hit hard, 4.6% decline in revenue. That’s the sort of data we need to make a wise decision, not just throw money out there and hope that it works.”", "In another interview the following day, Cassidy said it’s harder to be an advocate for state and local aid when people “look at the numbers and say, ‘Wait a second, you’re going to give California $15 billion but their revenue actually went up 3.5%?’”", "Dadayan agrees that aid should be targeted, though Biden’s proposal does not detail how the aid would be distributed.", "“Nobody is saying it shouldn’t be [targeted],” Dadayan said, adding that distributing solely by population ignores other factors such as unemployment rates, revenue shortfalls and relative spread of the pandemic in the state, all of which hit various states unevenly.", "“Whether a state is weathering better or not depends on the state’s revenue structure, industry dependence, and population density, among others,” Dadayan said in an email. “States with high reliance on sales tax and no income tax (like FL and TX) are in much worse shape. States with high reliance on tourism (like NV and HI) are suffering due to the impact of the pandemic on tourism industry. States with high reliance on oil industry and severance taxes (like AK, WY, etc.) are also suffering because of the impact of the steep declines in oil prices.”", "“States with progressive income tax structures (like CA) are seeing stronger growth in personal income tax revenues as the pandemic sadly has a much worse impact on lower income taxpayers whose income tax contributions are lower,” Dadayan said. “States with high dense cities (like NYC in NY or LA in CA) have seen higher COVID cases which led to stricter regulations, lower business activity, lower consumption, and therefore lower sales tax revenues.”", "James Nash, press secretary for the National Governors Association, told us via email, “Every state and territory has unique circumstances, but in the aggregate, they have suffered revenue declines and incurred additional expenses due to COVID-19.”", "While the J.P. Morgan analysis indicates the disparity in the revenue effects of the pandemic, it does not provide a compelling case that no state and local government aid is needed at all, Dadayan said.", "“JPMorgan’s analysis is not depicting the entire picture and shouldn’t serve a basis for aid to states and local governments,” Dadayan said.", "Dadayan noted that the J.P. Morgan analysis looked at the entire calendar year of 2020, and pre-pandemic revenues were strong in January and February, and even in March (when the impact of the pandemic reached states late in the month).", "“We usually analyze revenues during the pandemic period compared to the same period a year before,” Dadayan said. “State tax revenues are down by 1.7% during the pandemic period (between April 2020 and December 2020 compared to the same period in 2019).”", "And, she noted, “absent of the pandemic, state tax revenues would have been seeing around 5-6 % growth.”", "“So, while state tax revenues are not down as dramatically as they were during the Great Recession, they are still down,” Dadayan said. Meanwhile, she said, “state governments have to address increased cost of spending because of the pandemic.”", "The National Association of State Budget Officers’ Fall 2020 Fiscal Survey, released in December 2020, “shows that states saw general fund revenue decline year-over-year in fiscal year 2020 for the first time since the Great Recession in the aggregate, and that steeper declines are expected in fiscal year 2021 based on states’ enacted budgets,” said Kerns, NASBO’s executive director. “Specifically, states saw general fund revenues decline 1.6% in fiscal year 2020 compared to fiscal 2019, and revenues are projected to decline 4.4% year-over-year compared to already depressed fiscal 2020 levels, based on states’ most current revenue estimates at the time data were collected.”", "“Slow revenue growth and increased spending demands are leading to concerns about current and future budgets with many states still projecting sizeable budget gaps moving forward,” Kerns said. “State spending is likely to be constrained for the rest of this fiscal year, into fiscal 2022, and beyond, which would be a drag on the national economic recovery.”", "According to the Bureau of Labor Statistics, state governments lost 271,000 jobs between March and January.", "The job losses have been even greater at the local government level. Between March and January, local governments shed nearly 1 million jobs.", "In remarks about the rescue plan on Feb. 5, Biden cited government job losses to justify the need for state and local government aid.", "”It gets needed resources to state and local governments to prevent layoffs of essential personnel — firefighters, nurses, folks that are schoolteachers, sanitation workers,” Biden said.", "The National League of Cities projects — based on finance data from the U.S. Census Bureau and unemployment projections from the Congressional Budget Office — that cities will lose up to $134 billion in revenue this year, a 21.6% loss, and $360 billion over the next three years.", "According to an NLC blog post written by Christiana McFarland and Brenna Rivett, revenue shortfalls varied significantly by state. But they argue federal aid to local governments is critical.", "“If local governments are left in a position to go-it-alone, the economic implications will be disastrous,” they wrote. “With significant restrictions on raising new revenues, cities are turning to their options of last resort, which are to severely cut services at a time when communities need them most, to layoff and furlough employees, who comprise a large share of America’s middle class, and to pull back on capital projects, further impacting local employment, business contracts and overall investment in the economy. These cuts will also exacerbate infrastructure challenges, which will place future fiscal burden on local, state, and federal government.”", "“With states likely to cut aid to local governments to help alleviate their own budget pressures, federal support for cities, towns and villages is more critical than ever,” the authors of the NLC blog post stated.", "Without federal funding, Dadayan of the Urban Institute said, “state and local government revenue recovery will be slow and will cause a drag on the overall economy.”", "But whether states and local governments need more federal aid, and how much, is a matter of debate among economists.", "Dan White, director of public sector research at Moody’s Analytics, told us via email that recent data “support the argument for much smaller and more targeted aid to states and local governments than what has been proposed by the Biden Administration.”", "According to a recent analysis from White, federal fiscal aid enacted in December has improved the outlook for states. Federal aid to states already enacted last year has reduced a $331 billion state and local government shortfall to $165.5 billion, according to the Moody’s assessment. Assuming states were to deplete $79 billion in existing reserve funds, that would come to a net state and local government shortfall of $86.5 billion.", "Even if the direct aid to state and local governments were taken out, other parts of the package should make for “more manageable budget shortfalls heading into next fiscal year.”", "Still, he wrote, “The picture, though rosier, is not rosy in the least. What’s more, the picture is not uniform across all governments, with some still in significant distress.”", "We take no position on what the rescue bill should or should not include in direct aid to state and local governments. But when McCarthy cites third quarter state revenue receipts and an analysis of state government revenue for calendar year 2020 to argue that state and local government aid is not needed, he is presenting an incomplete picture.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]