["About this rating", "Warrick Dunnm who played 12 seasons in the NFL as a running back for the Tampa Bay Buccaneers and Atlanta Falcons, has been supporting single-parent families since his 1997 rookie season, when he started the Homes for the Holidays program to provide economically-disadvantaged single parents and their children with comprehensive programming for first-time homeownership.", "In September 2018, the former NFL player's charitable efforts, as well as a few facts about his upbringing and the death of his mother, were boiled down into a meme spread via social media:", "This meme, for the most part, provided accurate information about Warrick Dunn and his charitable efforts.", "Dunn's mother, Betty Dunn Smothers, was a police officer in Baton Rouge who was killed in 1993 while working a second job as a security guard:", "Corporal Betty Smothers was shot and killed in an ambush attack while moonlighting as a security guard.", "Corporal Smothers was in uniform and driving a marked patrol car when she and the store manager went to a bank to make a night deposit. As they sat in the patrol car, three suspects approached and opened fire. They fatally wounded Corporal Smothers and injured the manager.", "All three suspects were arrested after the incident and sentenced to death for Corporal Smothers' murder.", "Corporal Smothers had been employed with the Baton Rouge City Police Department for 14 years, and is survived by her two daughters and four sons.", "Smothers' passing came just a few days before Dunn's 18th birthday and a month before he committed to playing college football at Florida State University (FSU). He was the eldest of Smothers' children, and by most accounts he assumed a father-figure role in the life of his five younger siblings.", "Here's how the Los Angeles Times described Dunn and his siblings in a December 1994 article headlined \"Turning His Grief to Good: Florida State Running Back Warrick Dunn Sets an Example for All\":", "Derek is doing well at Catholic High. Travis is fast and Bryson small, but he's growing. Summer and Samantha are running track and doing well in school.", "You listen to Warrick Dunn and hear a proud father talking of his children. And then you realize that Dunn is only 19. Still, he's in charge of his brothers and sisters, ages 11-17, now that Betty is gone.", "She was his best friend, a mother who worked two jobs, 16 hours a day, to keep the family together and to provide a few of the things that make being a kid a little more fun.", "If there's anything harder than a teen-ager being asked to go to the hospital in a police car, identify his mother and then go home to tell his brothers and sisters what happened, he doesn't want to know about it.", "It was Dunn, handling things as he always had, the father figure, but now without a mother.", "\"I never really had a childhood,\" he says. \"I've never been able to go out and just go crazy, like most kids, because I grew up staying in the house a lot, baby-sitting.\"", "Dunn graduated from FSU and was selected in the first round of the 1997 NFL draft by the Tampa Bay Buccaneers. The rookie running back was challenged by head coach Tony Dungy to give back to the community during his time in Florida, and so Dunn decided to start the \"Homes for the Holidays\" program in order to help provide homes to single-parent families in honor of his late mother.", "The program managed to house three families during its first year. By 2018, that number had grown to 159:", "“My rookie year in the NFL, in Tampa, I was challenged by coach [Tony] Dungy,” Dunn said. He told us, ‘If you are going to live in this community, you want to be a part of this community and give back.’ From that challenge, I thought about my mom and her dream of home ownership, and that’s how it all started. We did three homes in 1997, and now we’re up to 159.", "“I grew up in a situation where we needed a lot of support. I lost my mom at 18. Single mom, six kids, and a Baton Rouge police officer. She was gunned down by armed robbers at a bank. When she lost her life, the city of Baton Rouge started a fund for us. And that’s how we were able to survive and pay bills. And when I saw that from the city, that really helped me understand what it means to care about your neighbor and to give back and support. I just think now I have been driven for so many years—this is part of who I am, to want to see people smile and help anyone that I can possibly help.”", "Our only quibble with this meme is the statement that Dunn \"built and paid for over 145 houses for single mothers.\" While the former NFL quarterback has certainly donated plenty of time, money, and effort into his charitable endeavors, he did not single-handedly build and pay for all these homes. Dunn's non-profit, Warrick Dunn Charities, partners with other non-profits such as Habitat for Humanity to build homes for disadvantaged families:", "Even in retirement, Dunn and his Warrick Dunn Charities are still partnering with Habitat for Humanity to build homes for disadvantaged families across the United States. In December, Dunn and Habitat combined to build homes number 158 (in Detroit) and 159 (in Atlanta) and place two families in them before the holidays. Furnished, as Dunn like to say, “all the way down to the toothbrushes in the bathroom.”", "Dunn's charity provides a down payment for the home, completely furnishes it, and provides other services such as financial literacy program in order to assist single parents as they become first time homeowners:", "Warrick Dunn Charities was created from the belief that a better future starts with hope. We are dedicated to strengthening and transforming communities by combating poverty, hunger and improving the quality of life for families and children. We help families thrive academically, socially, and economically.", "Warrick Dunn Charities, a 501(c)(3) recognized nonprofit, has helped single parents and children thrive academically, socially and economically.", "Warrick Dunn Charities has awarded millions in home furnishings, food and other donations to single-parent families and children across the nation to combat poverty, hunger and ensure families have comfortable surroundings and basic necessities to improve their quality of life.", "This meme's popularity in September 2018 was likely connected to a controversy surrounding another former NFL player: Colin Kaepernick. A number of social media users shared this meme along with messages stating that Nike should have used Dunn, not Kaepernick, in their latest commercial:", "This meme misleadingly suggests that Colin Kaepernick has not similarly sacrificed by using his own money for charitable endeavors.   However, in January 2018 Kaepernick completed his pledge to donate a total of $1 million to charity over eighteen months, with a list of all the organizations he donated to  viewable here.", "And Dunn himself praised Nike's latest advertising campaign for raising Kaepernick's profile as the latter drove the conversation about social justice:", "\"I think it’s a brilliant campaign,” Dunn said.", "\"They just raised his profile because Kaepernick the last couple of years has been the face of this movement of social justice.\"", "“To be the first guy to come out and really talk about the issues that black kids, black men are being shot and killed, I commend him,\" Dunn said in a CNN interview.", "When asked if he thought Nike's stance to create the campaign was a financial or moral decision, Dunn cited the latter.", "\"It’s a moral decision. It can’t be about finances,\" Dunn said.", "\"I think overall they (Nike) understand the issues. A lot of their star athlete spokesmen are African American. They have a lot of that demographic, so I think it's important they really go after the issues and not necessarily things that are financial.\"", "Fucillo, David.    \"Here is a List of Every Organization to Which Colin Kaepernick Donated Money.\"\r\n    Niners Nation.   31 January 2018.", "Henry, Jim.   \"FSU Great Warrick Dunn Commends Nike, Colin Kaepernick on Ad Campaign.\"\r\n    Tallahassee Democrat.   6 September 2018.", "Hodges, Jim.   \"Turning His Grief to Good.\"\r\n    Los Angeles Times.   31 December 1994.", "King, Peter.   \"For NFL Giving, Warrick Dunn Is a Model\r\n    Sports Illustrated.   19 January 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]