["“Hathras bhabhi has become a farmer today,” wrote National Vice President of BJYM, Santosh Ranjan Rai, claiming that a woman seen in red in a photograph with Sikh protestors is Jabalpur-based doctor Rajkumari Bansal who was seen at the residence of the Hathras victim’s family. Rai alleged that Dr Bansal took part in the ongoing farmers’ protest. Dr Bansal was accused of being a Naxalite and tutoring the Hathras victim’s family to give statements to the press. She had denied the allegations, claiming her visit was for humanitarian reasons and her sole motive was to help them.", "हाथरस वाली भौजी आज किसान बनी है…. 🤪😂 pic.twitter.com/RBNpgUu0tB", "— Santosh Ranjan Rai (@SantoshRanjan_) November 29, 2020", "BJYM Indore leader Gaurav Tiwari also alluded the same in his tweet.", "इन #इच्छाधारी मोहतरमा को पहचानने वाले और इनकी प्रसिद्धि में रीट्वीट कर चार चांद लगाने वालों को आज #फॉलो करूंगा… pic.twitter.com/U4zZ4CBYSA", "— Gaurav Tiwari (@gauravtiwarirau) November 29, 2020", "The picture was tweeted by BJP supporter Shefali Vaidya as well. (Archive link)", "Is this true? https://t.co/EJVqPyCOQs", "— Shefali Vaidya. (@ShefVaidya) November 29, 2020", "The claim is currently viral on Twitter and Facebook.", "A keyword search led us to the full image shared on a blog on September 25. This itself debunks the claim that the photograph is related to the ongoing farmers’ protest that began a month later.", "The full image shows several shops in the background which helped us geolocate the area where the photograph was taken.", "These are all located at Kalindi Kunj road in Delhi’s Shaheen Bagh.", "(Note: The Google Maps photo used in the montage below was uploaded in 2017 when the board of Panache Exhibitions used to be blue.)", "A makeshift green-coloured tent is also visible in the picture. Alt News contacted Manish Jain from Factory Price Shop located in the same lane. He informed, “There are no makeshifts tents in Shaheen bagh right now. After COVID-19, the police isn’t permitting anyone to protest at the site. The last protest was during CAA-NRC agitation in February.”", "Several Sikh farmers had gathered in Shaheen Bagh during protests against the Citizenship Amendment Act. They were mostly from the Bharatiya Kisan Union (Ekta Ugrahan). The yellow-green coloured flag seen in the picture is the BKU flag. The farmers’ rights organisation had uploaded the photograph on February 10.", "Posted by BKU-Bharti Kisan Union Ekta Ugrahan / ਭਾਰਤੀ ਕਿਸਾਂਨ ਯੁਨੀਅਨ ਏਕਤਾ ਉਗਰਾਹਾਂ on Monday, 10 February 2020", "An old tweet posted by activist Umar Khalid on February 5 shows BKU activists with the organisation’s flags at the same location in Shaheen Bagh where the viral image was shot.", "A photograph from anti-CAA protests in February was therefore misrepresented as ‘Hathras Naxal Bhabhi’ taking part in the farmers’ protest. It may be reiterated that Dr Rajkumari Bansal from Jabalpur was accused of posing as the Hathras victim’s family member, a claim that she had denied.", "Donate Now", "Co-founder, Alt News Co-Founder Alt News, I can be reached via Twitter at https://twitter.com/zoo_bear", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]