["About this rating", "As cases of COVID-19 caused by a new coronavirus grew in the U.S. amid a global outbreak, U.S. lawmakers attacked each other over the government's response to the illness in early 2020.", "One such example: A Republican Twitter account accused U.S. House Speaker Nancy Pelosi of delaying a vote on a coronavirus-funding package on the House floor so that a Democratic political organization could run ads against Republican lawmakers to make the latter look bad.\n\nWe reached out to McCarthy's office asking what he meant by his claim that Pelosi delayed the vote on a $8.3 billion funding package to fight the coronavirus but did not hear back. As of March 3, 2020, when McCarthy made the remark, both Republicans and Democrats were continuing to negotiate the funding package that the House passed the next day. Pelosi's chief of staff, Drew Hammill, took to Twitter to respond to McCarthy, pointing out as much. \"The bipartisan negotiations on the coronavirus funding supplemental are still underway. Your staff have been participating in those talks,\" Hammill wrote, calling McCarthy's comment \"a disgusting and false accusation.\"", "Pelosi's office also didn't respond to our emailed questions.", "The Capitol Hill-oriented news publication Roll Call reported the same day McCarthy made his remark that, \"Lawmakers late Tuesday were polishing up a roughly $8 billion emergency aid package to respond to the COVID-19 illness, with signs pointing to talks going on into the wee hours.\"", "Roll Call further reported on the content of what legislators were debating:", "By most accounts, there was bipartisan agreement on the broad contours of the measure. But a Democrat briefed on the negotiations said Tuesday night that outstanding issues included price limitations for drug treatments and eventually vaccines; reimbursements to hospitals for uncompensated care; and a Medicare waiver to allow payments to certain health care providers for telehealth services, such as in-home video visits.", "Trump soon signed the funding bill into law, on March 6.", "In terms of \"campaign ads,\" McCarthy appeared to be referencing a March 2, 2020, announcement made by the Democratic Congressional Campaign Committee (DCCC), the organization that recruits and raises money for Democratic candidates for the U.S. House of Representatives.", "The DCCC, which is currently chaired by U.S. Rep. Cheri Bustos, D-Illinois, announced that it would run ads targeting seven \"vulnerable\" Republicans that would urge citizens to \"stand up to President Trump to demand a vaccine that is affordable for all Americans, not just the wealthy.\"", "The ads are in response to statements by U.S. Secretary of Health and Human Services Alex Azar that he couldn't guarantee an eventual coronavirus vaccine would be affordable to the public.", "Because both Republicans and Democrats were still negotiating the coronavirus-response funding package at the time McCarthy made his comment — and there was no final bill yet for Pelosi to bring to the House floor — and because Pelosi doesn't chair the DCCC or run its ad campaigns, we rate the claim that Pelosi stalled virus funding for political purposes as \"False.\"", "Lerman, David and Jennifer Shutt. \"Coronavirus Deal in Flux Amid Vaccine, Other Disputes.\"\r\n  Roll Call. 3 March 2020.", "Cochrane, Emily. \"House Passes $8.3 Billion Emergency Coronavirus Response Bill.\"\r\n  The New York Times. 4 March 2020.", "Hirsch, Laura and Kevin Breuninger. \"Trump Signs $8.3 Billion Emergency Coronavirus Spending Package.\"\r\n  CNBC. 6 March 2020.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]