["“आस्था की बात करे तो फूल बरसाए जाते है और शिक्ष। की बात करे तो लाठीया बरसाई जाती है 👇👇👇👇👇👇👇👇👇👇👇👇👇👇यही असलियत है योगी और मोदी की उनका मतलब हैं कि कोई भी गरीब परिवार का छात्र शिक्षित न हो (When we talk about faith, flowers are showered and if we speak about education,👇👇👇👇👇👇👇👇👇👇👇👇👇👇. This is the reality of Yogi and Modi as they want that no one from a poor upbringing gets educated -translated)”", "The above message is being shared on social media with a photograph of a woman who is copiously bleeding from her wounds. One post by Facebook user Divyanshi Jatav has amassed over 1,500 shares so far. It is being shared in the wake of JNU students’ protest held in New Delhi against exponential hike in hostel fee. According to a report by Hindustan Times, at least 15 students were injured over the eight-hour protest on November 19, 2019.", "Several other users on Facebook shared the image with a similar claim. It was also shared on Twitter.", "Alt News had earlier debunked the image in September this year and found that image is not from India. According to an article published by a Shia News website called JafariyaNews.com in February 2005, these images depict the observation of Ashura on the tenth day of Muharram. Hence the suggestion that image was clicked during the recent students’ fee hike protest is false. It has existed on the Internet at least from last 14-years.", "The Shia Muslim sect mourns the sacrifice of Imam Hussein, the son of Hazrat Ali and the grandson of Prophet Muhammad on this day. The sect commonly practices chest-beating (Latyma), self-flagellation and cut their foreheads during the procession. In the article, the image was posted under the section whose title read, “Lebanon”, thus suggesting that the picture could possibly be from Lebanon. You can read our detailed fact-check here.", "In conclusion, an old image clicked during a Muharram procession is being shared with the claim that it depicted a student who was beaten up. This image has been shared with the subject of JNU students’ protest becoming a national issue and thus giving an impression that the image of the bloodied woman may be linked to the police action against the protests.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]