["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Criticism of U.S. trade deals has been a key theme in Donald Trump's campaign, and during the Sept. 26, 2016, debate against Hillary Clinton, he focused on two.", "First, he criticized Clinton's husband, former President Bill Clinton, for signing the North American Free Trade Agreement (NAFTA). Trump also accused Clinton of wanting to approve a newer proposal, the Trans-Pacific Partnership (TPP), the largest regional trade deal in history.", "NAFTA was bad, Trump said, \"And now you want to approve (the) Trans-Pacific Partnership. You were totally in favor of it. Then you heard what I was saying, how bad it is, and you said, 'I can't win that debate.' But you know that if you did win, you would approve that.\"", "Clinton said that \"is just not accurate\" and argued that she decided to oppose it once the terms of the deal were known.", "Trump said she had praised the deal \"and then you heard what I said about it, and all of a sudden you were against it.\"", "\"Well, Donald,\" Clinton responded, \"I know you live in your own reality, but that is not the facts.\"", "We wondered about the timing. Did Clinton change her mind in response to Trump's criticism of the TPP?", "We found no evidence to support Trump's claim.", "Even before he was a candidate, Trump was on record as opposing the TPP. As early as April 2015, he predicted it would hurt U.S. businesses and put people out of work.", "The terms of the deal were finalized on Oct. 5, 2015. Clinton announced her opposition on Oct. 7, two days later.", "At the time, she was under pressure to oppose the pact, but that pressure wasn't from Trump.", "On Oct. 7, Trump was only one of 15 Republicans still seeking the GOP nomination. The first presidential primary was five months away, Trump's poll numbers among Republicans were around 23 percent. Many people thought his lead in the polls was largely based on name recognition.", "Most Republicans supported the deal, CNN reported in a story about Clinton's decision to oppose the TPP. Trump is listed as a notable exception. However, the topic didn't even come up during the first two GOP debates.", "More urgently, if Clinton was under any immediate pressure to oppose the TPP it was from her two top opponents in the Democratic primary — Bernie Sanders and Martin O'Malley.", "Like many Democrats, particularly those with strong union ties, both men opposed the TPP. Sanders called it \"disastrous.\" O'Malley accused Clinton of switching on the eve of the first Democratic debate.", "At the time, Sanders was starting to gain momentum. His support in the polls had gone from 12 percent at the end of June to 25 percent in a Clinton-Sanders matchup, and support for Clinton had slipped nearly 20 points.", "There was also pressure from Sen. Elizabeth Warren, D-Mass. Her biggest concern, as she explained in a July 7, 2016 video, was that the TPP gave multinational companies special power \"to challenge a country's laws they just don't like,\" including laws on pollution, safety, health and food.", "We emailed a half dozen people in the Trump campaign seeking evidence that Trump's opposition caused Clinton to change her mind. We didn't hear back.", "Our ruling", "Trump told Clinton, \"You heard what I said about (the Trans-Pacific Partnership trade deal), and all of a sudden you were against it.\"", "There's no evidence for cause and effect here, and the Trump campaign hasn't provided any.", "Clinton says her opposition is based solely on the terms of the proposed pact and her announcement to oppose it came two days after the TPP was finalized.", "Even if political considerations drove her decision, most of the pressure on Clinton was within her own party, particularly from Bernie Sanders, as she saw her support among Democrats slipping.", "Based on the available evidence, we rate Trump's claim as False.", "The Washington Post, \"Annotated transcript: The Aug. 6 GOP debate,\" Aug. 6, 2015; \"Wednesday's GOP debate transcript, annotated,\" Sept. 16, 2015; and \"The first Trump-Clinton presidential debate transcript, annotated,\" Sept. 26, 2016", "The New York Times, \"Trans-Pacific Partnership Is Reached, but Faces Scrutiny in Congress,\" Oct. 5, 2015", "CNN, \"Donald Trump slams Pacific free trade deal,\" April 23, 2015 and \"Hillary Clinton comes out against TPP trade deal,\" Oct. 7, 2015", "FiveThirtyEight, \"How The Republican Field Dwindled From 17 to Donald Trump,\" May 5, 2016", "RealClear Politics, \"RCP Poll Average; 2016 Republican Presidential Nomination,\" and \"RCP Poll Average; 2016 Democratic Presidential Nomination,\" accessed Sept. 27, 2016", "YouTube, \"Sen. Elizabeth Warren on why we need to stop the TPP,\" July 7, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]