["The series of five images appeared in this post on a Facebook page called “Kirya Emmanuel Journalist”. The post has been shared more than 50 times since it was published on March 10, 2021.", "“Happening Now Images coming in from Masaka and Kamwokya peacefull demostrations (sic),” reads the caption.", "The page has more than 50,000 followers and is known for supporting Robert Kyagulanyi, popularly known as Bobi Wine, who was Uganda’s main opposition candidate in the 2021 presidential election.", "On January 16, 2021, Uganda’s Electoral Commission declared incumbent Yoweri Museveni the winner of the presidential poll held on January 14, with 59 percent of the vote.", "However, Wine decried the election as rigged, rejecting the outcome and claiming victory over Museveni, as AFP reported.", "Some of the photos were shared alongside a similar claim on Facebook here.", "The images, however, are not evidence of new demonstrations in the Ugandan cities of Masaka and Kamwokya, as the post claimed.", "On March 9, 2021, Wine called on Ugandans to “rise up peacefully and unarmed” to protest against Museveni, who has ruled the east African country for nearly four decades. Despite Wine’s call to action, new demonstrations have not yet occurred in Masaka and Kamwokya.", "“It’s fake news as usual,” Luke Owoyesigire, police spokesman for the Kampala Metropolitan, told AFP Fact Check. He added that there have not been any protests in the two cities, although there is a “heavy police presence”.", "AFP Fact Check ran a Google reverse image search and found two of the images in numerous older posts, including this tweet from November 18, 2020, when Ugandan police arrested Wine for allegedly violating Covid-19 safety protocols at his political rallies.", "PROTESTS ERUPT IN BUGEMBE pic.twitter.com/2kIWXDFz2R", "A second reverse image search led to a different tweet from a day later, also containing two of the images from the Facebook post and another reference to the demonstrations against Wine’s detention.", "“Current situation in Kawaala Rubaga North. #FreeBobiWine #WeAreRemovingAdictator  Day:2 Everyone Raise and we fight for our Freedom,” reads the tweet.", "AFP Fact Check was initially unable to trace the fifth image, which appears as a screenshot showing burning debris in the middle of a road lined by people.", "However, a 71-minute video discovered on Facebook a week after this fact check was published provided confirmation that the unrest depicted in the image happened in November 2020 in Kampala.", "The footage was published here on November 18, 2020, by MAP Mediya Tv, which describes itself as an online television channel focused on political affairs and promoting Wine. The post has been shared more than 21,000 times.", "The scene in question can be viewed 26’40” into the video. Some of the visible matching features include the buildings behind the fire to the left and right, the crowd lined up on top of the grass embankment, vehicles in the background, and various street signs and lights.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]