["About this rating", "Former U.S. President Donald Trump issued a slew of pardons to his allies and associates before leaving office on Jan. 20, 2021. None of those pardons included himself or his family members. However, some speculated that the beleaguered former commander-in-chief could take steps to protect himself, or those around him, by issuing secret pardons, where he would not reveal who he had pardoned until later on.", "It is possible for a president to issue secret pardons, but it has never been documented before, and legal experts frequently differ on how to interpret the validity of a secret pardon.", "The clause in the Constitution granting presidential clemency power does not explicitly restrict the president from issuing secret pardons. It simply says, “he shall have Power to Grant Reprieves and Pardons for Offences against the United States, except in Cases of Impeachment.”", "U.S. Rep. Raja Krishnamoorthi reintroduced the Presidential Pardon Transparency Act to Congress, ahead of Trump’s departure, which would require that all presidential pardons be disclosed to the public within three days of being issued. Krishnamoorthi said:", "We have seen President Trump use the pardon power to dole out favors to his personal associates rather than for its intended purpose and through its usual channels, and as a result, we realize just how important transparency is to this presidential activity. The Presidential Pardon Transparency Act ensures that every presidential pardon is disclosed to the public in a timely manner, so that the American people know exactly how their president is using his office.", "Given that a secret pardon is possible, there is some debate over whether it would actually work, particularly because many argue that the public nature of a pardon makes it valid. Former U.S. Pardon Attorney Margaret Colgate Love said, “We have never had secret pardons and the whole idea of a pardon is that it is a public document.” A secret pardon would require witnesses and a way to authenticate its timing as proof that it was issued, which is why the public nature of pardons is important.", "Jeffrey Crouch, assistant professor of American politics at American University, wrote in The Washington Post:", "The very concept of a pardon is that it is a public act, granting mercy to the recipient. An ordinary pardon would have no force or meaning if it were kept secret. Moreover, a pardon kept from public view would frustrate an essential element of the otherwise absolute pardon power: public accountability through political consequences. Without knowledge of a president’s pardoning decisions, neither Congress nor the public may effectively check their clemency actions.", "He added, “If a secret pardon were allowed, it could cause chaos in the courts. There would be no way to know when or if a secret pardon might emerge and wreak havoc with a long-running investigation. The result would be to undermine the predictability of the judicial process.”", "Given that the president is not explicitly prohibited from issuing secret pardons; that we cannot determine at the moment if Trump has done so himself; that such pardons could be found invalid in court; and that there is no precedent for addressing such an issue, we rate this claim as “Unproven.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]