["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Democratic presidential candidate former Vice President Joe Biden participates in a town hall with moderator ABC News anchor George Stephanopoulos at the National Constitution Center in Philadelphia, Thursday, Oct. 15, 2020. (AP)", "When asked to prove his support for fracking is genuine, Joe Biden said last week that he’d won the backing of the boilermakers, a union whose members depend on the natural gas industry and passionately support the controversial drilling technique.", "\"The boilermakers union has endorsed me because I sat down with them and went into great detail with leadership [about] exactly what I would do,\" Biden said Thursday in Philadelphia during a nationally televised ABC News town hall.", "That’s not true.", "Biden hasn’t been endorsed by the International Brotherhood of Boilermakers — which represents 50,000 people across the country who work in heavy industry, manufacturing, and related sectors — or Local 154, the Pittsburgh-area chapter mentioned at the event.", "The international union states clearly on its website that it hasn’t endorsed a candidate for president this cycle.", "\"The International Brotherhood of Boilermakers has not endorsed any U.S. Presidential candidate for the 2020 Election, and the information contained on this webpage in no way serves as an endorsement by the International Brotherhood of Boilermakers for any U.S. Presidential candidate.\"", "A note on the website continues:", "\"As a union boilermaker, your vote is a personal decision. You have the right to vote for candidates and issues as you so choose. Your vote can make a difference in electing the representatives and policymakers who support labor issues and advocate for the work boilermakers do.\"", "Local union lodges aren’t bound by what the larger umbrella group does, and in September, Local 154 endorsed President Donald Trump.", "\"The other day I'm watching the debate and I see Joe Biden tell everybody that the boilermakers endorsed him and that is not true,\" said John Hughes, Local 154’s business manager. \"He said he talked to somebody. I'd like to know who he talked to in the boilermakers because anybody I talk to did not endorse him.\"", "Asked for evidence that Biden spoke with members of the boilermakers union, Andrew Bates, the Biden campaign’s director of rapid response, provided none. Instead he listed several other Pennsylvania unions Biden met with and won endorsements from while campaigning, such as Teamsters Local 249, United Association of Plumbers Local 27, and Pennsylvania AFL-CIO.", "Bates added that the boilermakers \"endorsed Joe Biden twice.\"", "He’s talking about the 2008 and 2012 election cycles, when the union endorsed President Barack Obama, and Joe Biden was his running mate.", "But an Obama endorsement doesn’t automatically count as a Biden nod.", "The Democratic nominating contest was still in full swing in February 2008 when the boilermakers union threw its support behind Obama. Not only had Obama not yet named Biden as his running mate, but Biden was still seeking the nomination himself and had been passed over for the endorsement.", "The endorsement the boilermakers made in 2012 when Obama was running for reelection could more plausibly be described as support for an Obama-Biden ticket.", "The boilermakers union came up at the town hall when Pittsburgh resident Michele Ellison asked Biden to describe his vision for the energy sector in Southwestern Pennsylvania, where fracking has lifted the economy and employed plenty of boilermakers but also sickened some residents who live near the wells that extract natural gas from miles beneath the Earth’s surface.", "Before answering the question, Biden emphasized, as he has said repeatedly, that he does not want to ban fracking. He wants to block the federal government from issuing new permits for drilling on public land but would otherwise allow existing fracking operations to continue, with environmental safeguards in place. He went on to say that he wants to invest in renewable energy and the battery technology needed to store it.", "Biden said \"the boilermakers union has endorsed me.\" There are several things wrong with this statement.", "First, the International Brotherhood of Boilermakers hasn’t endorsed a candidate for president this cycle.", "Second, Local 154, the Pittsburgh area chapter mentioned during the town hall, endorsed Trump.", "Third, the boilermakers did not endorse Biden twice in the past as his campaign said.", "And fourth, the Biden campaign provided no evidence that he \"sat down\" with the union’s leaders as he said.", "Biden’s statement is not accurate. We rate it False.", "Our sources", "Rev, \"Joe Biden ABC Town Hall Transcript October 15,\" Oct. 15, 2020", "International Brotherhood of Boilermakers, \"You have a vote, use it,\" accessed Oct. 19, 2020", "International Brotherhood of Boilermakers, \"Boilermakers Executive Council endorses Senator Barack Obama,\" Feb 19, 2008", "International Brotherhood of Boilermakers, \"International Brotherhood of Boilermakers Endorses President Obama for Reelection,\" March 9, 2012", "The Philadelphia Inquirer, \"A fight over fracking at a Pennsylvania steel mill is forcing a reckoning among Democrats,\" March 17, 2020", "The Philadelphia Inquirer, \"Pennsylvania’s attorney general releases scathing grand jury report on fracking industry, state regulators,\" June 25, 2020", "Biden for President, \"Climate: Joe’s Plan for a Clean Energy Revolution and Environmental Justice\" accessed July 20, 2020", "The Houston Chronicle, \"Did Joe Biden just pledge to ban fracking in debate against Bernie Sanders?\" March 16, 2020", "The Washington Post, \"Fact-checking the Biden fracking fracas,\" March 19, 2020", "Axios, \"Clearing up the Biden-Bernie fracking tussle at the debate,\" March 16, 2020", "The Village Reporter, \"Pennsylvania’s Boilermakers Local 154 Union Endorses President Trump,\" Sept. 4, 2020", "Trump campaign email, \"Pennsylvania Boilermakers Call Out Joe Biden for Lying About Their Endorsement,\" Oct. 17, 2020", "Email interview, Biden for President Director of Rapid Response Andrew Bates,\" Oct. 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]