["About this rating", "Many a tale is told about the person who, required to pay a fine, a tax, or a debt he considers unjust, fulfills his obligation yet still manages to stage a protest (and make things as difficult as possible for the payee) by paying the fee entirely in pennies.", "Such events have played out in real life many times (although as we note on another page, businesses are not obligated to accept pennies as payment), but our interest here is in urban legends — and what establishes a tale as an urban legend is not its truth or falsity, but its repetition by multiple people, with varying details of time and place.", "In the specific case of a baseball player protesting a fine by paying in pennies, this story does indeed seem to have qualified for urban legend status, as a couple of examples from teammates will demonstrate.", "The first telling comes from Los Angeles Dodger pitcher Don Drysdale's 1990 autobiography, Once a Bum, Always a Dodger, describing (thirty years after the fact) a 1961 incident in which Drysdale was suspended and fined by the National League for hitting Cincinnati Reds outfielder Frank Robinson with a pitch immediately after having been warned by the home plate umpire to stop throwing at batters:", "I was suspended for five days by Warren Giles, the National League president, and fined $100. I wasn't too happy about it, and neither was Buzzi Bavasi, our general manager. But there was nothing we could do ...", "So I owed the National League $100 and the next time we went into Cincinnati I decided to pay my debt in person. I went to a bank and got $100 worth of pennies in those rolls, emptied them out, then put all the loose coins in a sack, and delivered them to Mr. Giles's office at the league headquarters in Carew Tower. I dumped the sack on his secretary's desk, she gave me this little smile, and I took off in a hurry. I was pretty proud of myself when I headed back to my hotel room, but I wasn't there long before the phone rang. It was Mr. Giles's secretary.", "\"Mr. Giles would like to see you,\" she said.", "I went back to the office and had a bit of a conversation with Mr. Giles. He told me to be careful about the way I was pitching, and I told him I wasn't about to change my philosophy of keeping batters off the plate. It was all very amiable.", "\"And by the way,\" Mr. Giles added, \"I want you to take those pennies of yours and roll them back up for me.\"", "Fortunately, I had the paper rolls back in my room. I took the sack back to the hotel, and sat there for hours, putting the damn pennies in their containers, cursing all the way. Thank God I saved those containers or I would still be back in that Cincinnati hotel, rolling up $100 worth of pennies.", "One year later, Dodgers shortstop Maury Wills was ejected from a game by the home plate umpire (an act which carried an automatic $50 fine) for repeatedly stepping out of the batter's box during a contest with the San Francisco Giants. (Wills claimed he was protesting the umpires' failure to stop the Giants' groundskeepers from excessively watering down the area around first base.)  In his 1994 book about the 1962 Dodgers-Giants pennant race, Chasing October, author David Plaut related (also thirty years after the fact) a familiar-sounding anecdote about how Wills chose to protest his fine:", "Wills maintained his ejection was unfair, given the circumstances. The unrepentant shortstop reluctantly paid his fine in person the next week when the Dodgers were in Cincinnati, site of the league headquarters. Maury went to a local bank and obtained $50 in pennies, then dragged the 80-pound sack to the office of N.L. president Warren Giles. \"I hoisted it onto his desk and turned it upside down. Pennies cascaded everywhere,\" Wills recalled. \"Mr. Giles, here's your fine,\" he said to the startled league boss. \"Could you count it for me, please? I'd like a receipt.\"", "Note how the details escalate between tellings: in the first case the disgruntled player simply plops a sack of pennies onto a secretary's desk and slips out, then returns when summoned and obediently takes the coins away to re-roll them; in the second case he brazenly dumps the entire bag onto the league president's desk and demands that the president count them and issue him a receipt.", "A couple of problems are evident with the latter account.  First off, anyone who has ever a handled a $50 bag of pennies should know that it doesn't weigh anywhere close to 80 pounds. (It actually weighs about a third as much and can easily be carried with one hand.)  Secondly, if Warren Giles didn't take any guff when 6-foot-6-inch Don Drysdale tried to leave a sack of loose pennies with his secretary, he likely didn't sit still while 5-foot-11-inch Maury Wills dumped five thousand coins all over his desk and demanded that he count them.", "A 1974 article by Baseball Digest columnist John Kuenster antedated both these accounts with a tale about Oakland A's pitcher Vida Blue claiming that he had paid a $250 fine imposed by his manager all in coins, also (just like the previous two accounts) dumping the loose change all over the boss's desk:", "[Oakland A's manager Alvin] Dark also fined pitcher Ken Holtzman and Vida Blue $250 for tossing the ball in the air in disgust when Dark came out to replace them with relievers.", "Blue was still angry about being lifted sooner than he thought he should have, but admitted he deserved the fine because he accidentally hit Dark when he tossed the ball toward him as the manager crossed the baseline on his way to the mound.", "\"I didn't mean to hit him,\" said Blue, \"so I paid my fine promptly the next day.\"", "Blue couldn't resist the opportunity to express his \"don't put me down\" attitude when he paid his fine.", "\"I dumped $250 in pennies, nickels, dimes and quarters on Dark's desk,\" he grinned. \"I wanted to make it all pennies, but they're hard to come by.\"", "Is there a true story here?  Or is this a case of a well-traveled anecdote being adopted by folks whose histories were replete with fines they judged unjust and therefore always felt deserved a measure of retaliation? People sometimes present fanciful tales they heard about from others as incidents in their own lives as a form of treppenwitz (in this case an instance of what they should have done, not what they should have said).  We revel in such inventive revenge tales because everyone has at one time been the object of a punishment he felt he hadn't earned.", "Drysdale, Don.    Once a Bum, Always a Dodger.\r\n    New York: St. Martin's Press, 1990.   ISBN 0-312-03902-6   (pp. 181-182).", "Kuenster, John.    At Home and Away: 33 Years of Baseball Essays.\r\n    Jefferson, NC: McFarland & Company, 2003.   ISBN 0-786415-5-92   (p. 45).", "Plaut, David.    Chasing October: The Dodgers-Giants Pennant Race of 1962.\r\n    South Bend, IN: Diamond Communications, 1994.   ISBN 0-912083-69-7   (pp. 147-148).", "Associated Press.   \"'Pitch' by Drysdale Brings Suspension.\"\r\n    The New York Times.   11 July 1961   (p. 34).", "Associated Press.   \"Giants' Pinch-Homer Tops Drysdale of Dodgers, 5-4.\"\r\n    The New York Times.   12 August 1962   (Sports; p. 1).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]