["A fake news story says that former First Lady Michelle Obama has been diagnosed by a doctor with having a habit of making disparaging remarks about America in order to save her husband’s presidential legacy.", "\"Michelle Obama just received life-shattering news from the doctor\" read the headline on March 4, 2018 on NY FOX News, a blog with no real affiliation to Fox News, a Fox News spokesperson confirmed.", "The post was flagged on Facebook as being potentially fabricated, as part of the social media website’s efforts to combat online hoaxes.", "We found many things wrong with this post.", "The story begins by accusing Obama of staying out of the public eye only to appear when slamming President Donald Trump. It goes on to say that she has been unofficially diagnosed by Dr. Lauren A. Wright, a public affairs professor at Princeton University and a board member of the White House Transition Project.", "The \"diagnosis\" referred to is the analysis of first ladies Wright gives in her book, On Behalf of the President. In the book, Wright describes the ways in which Obama helped shape her husband’s legacy from a personal place as a mother and wife, focusing on her use of social media.", "While Wright notes that Obama has made more speeches and major public appearances in her first six years in office than any first lady in recent history, she writes that they were in support of her husband’s policy agenda, not slams toward Trump and America.", "The NY FOX News post contradicts itself by claiming that Obama has remained out of the public eye yet tries to remain \"the center of everyone’s attention\" by making public remarks against America.", "The article notes that one of the biggest claims made by Obama was that America was a racist nation that needed her husband in office. Obama has spoken out about racially motivated remarks that were made against her appearance while she was in office, but she has never claimed that America is \"a racist nation.\"", "The other claim made is how Obama was never proud of America until her husband had been elected to the White House, a statement made in 2008 that was taken out of context and was debunked as False by PolitiFact in 2017.", "The motivations of NY FOX News are unclear. The website appears to have started publishing stories on Feb. 28, 2018, most of which appear to be false. The website includes no contact information, has no \"About us\" page that we could find, and does list any authors. It does not appear to display advertising. The website is registered in Panama.", "This claim about Michelle Obama’s diagnosis is a hoax.", "We rate it Pants on Fire.", "NY Fox News, Michelle Obama just received life shattering news from the doctor, March 4, 2018", "The Hill, Michelle Obama to frightened Americans: ‘All we have is hope,’ February 1, 2018", "E-mail interview with Fox News", "LinkedIn, Lauren A. Wright", "NBC News, Obama: The Historic Legacy of the Nation’s First Black First Lady, January 6, 2017", "Lauren A. Wright website", "The Independent, Michelle Obama opens up about racism and the ‘shards’ that ‘cut’ her ‘deepest’ as First Lady, July 27, 2017", "PolitiFact, David Clarke says Michelle Obama said she was proud of U.S. only after Barack Obama became president, February 23, 2017", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]