["About this rating", "Back in 2011, a teenager in China sold his kidney on the organ trafficking black market so he could get enough money to buy the latest Apple devices. The story — which has still circulated on the internet years later because of its shocking details — highlighted the ever-present problem of organ trafficking in China.", "The then-17-year-old, identified by the BBC as Xiao Zheng (Little Zheng), and by NPR with the surname Wang, told media that he had wanted to buy an iPad, but couldn’t afford the cost. He communicated with a kidney agent online, and voluntarily sold his right kidney in an illegal procedure that took place in China’s Hunan province. According to Xinhua News Agency, a Chinese media outlet, five people — including the surgeon who performed the procedure — were charged with intentional injury and organ trading. One of the defendants reportedly received 220,000 yuan (about US $33,000) for arranging the transplant, which he split with others involved in the transaction.", "The boy received only 22,000 yuan (about US $3,500) from the entire transaction, and used it to purchase an iPad and iPhone, expensive gadgets that made his mother suspicious when he bought them. He eventually admitted to his mother that he had sold a kidney.", "Soon afterwards, the boy and his family learned that he suffered from \"renal insufficiency,\" a decreased level of kidney function, and his condition was deteriorating. As of 2019, the 25-year-old was attached to a dialysis machine, and it was reported that he was likely to be bedridden for life.", "China banned the trade of human organs in 2007, but a shortage of donors has led to a booming black market for organs.", "Given the corroborating coverage of the story from the BBC, Reuters, and other news outlets, as well as the fact that individuals involved were charged by the government, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]