["About this rating", "In the aftermath of the Jan. 6, 2021, attack on the U.S. Capitol, attention turned to the role of President Donald Trump in inciting the mob that descended upon Congress as it certified President-elect Joe Biden's victory.", "The House of Representatives voted to impeach Trump on a charge of \"incitement of insurrection,\" but discussion also ensued on whether the outgoing president might, after he leaves office, face criminal penalties for his words and actions in the lead-up to the events of that day.", "Some commentators drew comparisons between Trump's role in the Jan. 6 Capitol attack and the Munich Putsch, a 1923 operation by Adolf Hitler and the Nazi Party to seize control of the city of Munich as part of a larger plot to overthrow the government of the Weimar Republic. As Ishaan Tharoor wrote in The Washington Post:", "The Beer Hall Putsch, as the episode would be remembered, was a failure. Hitler did not receive the local backing from politicians and security forces he expected. Sixteen Nazis were gunned down in the streets in clashes with police officers, four of whom were killed. Hitler slunk out of town and was later arrested and tried for treason. But his punishment ended up being lenient — he spent a few months in prison before being released with a pardon — and he emerged from the botched putsch as a more popular national figure. Within a decade, he would install the Third Reich.", "According to those who deployed the Trump-Hitler analogy, the incoming Biden administration should be wary of letting Trump's actions go insufficiently punished. One of those who sounded the alarm was Eric Feigl-Ding, an epidemiologist and health economist and a prominent online critic of Trump's.", "In a widely-shared tweet on Jan. 13, 2021, Feigl-Ding called for the outgoing president to face criminal charges as well as impeachment, and cited what he presented as a 1924 article from The New York Times, which claimed Hitler had been \"tamed by prison,\" was \"no longer to be feared,\" and would likely \"retire to private life\" — an assessment that was soon proven to be absurdly naive.", "Adding his own take on the historical warning, Feigl-Ding referred to a remark made by moderate Republican Sen. Susan Collins of Maine. In February 2020, Collins said she believed Trump's first impeachment, in 2019, had taught him \"a pretty big lesson.\" In explaining her vote to acquit Trump, Collins said she believed the mere experience of being impeached by the House meant Trump would be \"much more cautious in the future.\" Feigl-Ding's clear view, then, was that Collins had also displayed a degree of naivety, in light of Trump's subsequent role in the events of Jan. 6, 2021. He wrote:", "\"I’m sure Hitler 'learned a pretty big lesson' (as Collins would say) after Dec. 21, 1924, upon Hitler's release from prison. Impeaching Trump alone isn’t enough. He will not have learned his lesson. Bring on all the indictments after Jan 21st.\"", "The screenshot was authentic. On Dec. 21, 1924, the New York Times published the article, with the headline \"Hitler Tamed by Prison.\" It can be viewed in the broader context of page 16 of that day's paper, here, and on the Times' own website, here.", "The article reads, in full:", "BERLIN, Dec. 20 — Adolph Hitler, once the demi-god of the reactionary extremists, was released on parole from imprisonment at Fortress Landsberg, Bavaria, today and immediately left in an auto for Munich. He looked a much sadder and wiser man today than last Spring when he, with Ludendorff and other radical extremists, appeared before a Munich court charged with conspiracy to overthrow the Government.", "His behavior during imprisonment convinced the authorities that, like his political organization, know as the Völkischer, was no longer to be feared. It is believed he will retire to private life, and return to Austria, the country of his birth.", "Whatever one's view of the relevance or accuracy of the analogy between Trump in 2021 and Hitler in 1923, there's no doubt that the New York Times article cited by Feigl-Ding was fully authentic.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]