["The photo was shared on Facebook here on January 13, 2021. It features an image of Philippine presidential spokesperson Harry Roque.", "The photo’s text overlay states: \"I stand with my previous statement that poor people have no right to choose. THEY CAN'T EVEN BUY FOOD, WHAT MORE VACCINES. DON'T BE PICKY BECAUSE YOU ARE POOR AND A BURDEN FOR THE GOVERNMENT. It's your fault you're still poor, you rely on the government for all of your needs. IT'S NOT ALLOWED TO BE PICKY DURING THE TIME OF PANDEMIC / Pres. Spokesperson Harry Roque says Filipinos who avail of the government's free vaccinations cannot choose which vaccine will be used during the immunisation campaign.\"", "The post circulated online shortly after Roque faced criticism for remarks he allegedly made about the Philippines’ Covid-19 vaccination drive. This video from an official briefing on January 11 shows Roque saying Filipinos cannot be “picky” about which coronavirus vaccine they receive.", "Comments from some Facebook users on the post indicate it had misled them. One comment reads: “An insult to poor people. That we don’t have the human right to choose because we are poor.”", "Another said: \"Legit? he really said that? you have a link this might have been edited\".", "The image was also shared alongside a similar claim on Facebook here, here, here, here and here.", "The claim is false.", "Keyword searches on Google found the news graphic was originally published here by Philippine media organisation GMA News on January 11, 2021.", "The quote in the GMA News graphic reads: \"It's true, we have the right to good health but one cannot be picky because there are a lot of Filipinos who need to be vaccinated. One can't be choosy, but one can't also be forced inoculated.\"", "Below is a screenshot comparison of the photo in the misleading posts (L) and the GMA News graphic (R):", "The quote in the GMA News graphic corresponds to remarks made by Roque in this January 11 press briefing. An official transcript of the briefing contains no reference to Roque’s purported quote about poor Filipinos, as claimed in the misleading posts.", "Roque’s office also branded the misleading social media posts as “fake news” in this statement posted on Facebook on January 13, 2021.", "The statement placed the doctored news graphic side-by-side another Roque quote that sought to clarify his earlier remarks about vaccination. It states in part: “When the vaccine arrives in February until June, one can’t really be choosy because only one vaccine would be available, and that’s the one from China. If you do not want Sinovac, you won’t be forced to take it.”", "Roque made the clarification in this January 12 press briefing, which also does not contain the quote indicated in the doctored graphic.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]