["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Sean Hannity invited former Vice President Dick Cheney to discuss the nuclear deal with Iran on July 14, 2015. (Screenshot)", "Fox News host Sean Hannity found a partner in outrage over the Iran nuclear deal in former Vice President Dick Cheney.", "On July 14, the pair blasted the White House’s agreement (full text) as a betrayal of Israel, saying the agreement had loose restrictions on Iran that will endanger the world. At one point, Hannity asked Cheney if he thought the deal would incentivize other countries, such as Saudi Arabia, to move forward with their own nuclear programs.", "Cheney said he would be surprised if they didn’t because they will feel \"they have no choice.\" The United States under President Barack Obama is no longer an ally they can trust, he said.", "\"For one thing, we haven’t kept our word to them in the past,\" Cheney said. \"Secondly, we’re dramatically reducing our own capabilities. Obama keeps talking about getting rid of all nuclear weapons. He’s already significantly reduced our capabilities there. This last week, he announced a 40,000-man reduction in the United States Army. He’s not a man of his word.\"", "When we looked into Cheney’s characterization of the U.S. nuclear program under Obama, experts called it \"ridiculous\" and said that Cheney neglected important caveats Obama gave in talking about his dream for a world free of nuclear weapons. (PunditFact tried to reach Cheney through his speaker’s bureau, but he did not respond to our inquiry.)", "Here’s what’s missing from Cheney’s claim that Obama \"keeps talking about getting rid of all nuclear weapons\" and is \"significantly\" reducing the country’s nuclear capabilities.", "‘A world without nuclear weapons’", "Obama entered the White House in 2009 having made a slew of campaign promises about reducing the nuclear arsenal of the United States and the world. (Several of these promises have been monitored by PolitiFact.)", "The Norwegian Nobel Committee highlighted his \"vision of and work for a world without nuclear weapons\" in awarding Obama the 2009 Peace Prize.", "The award followed Obama’s major speech on how he would address nuclear weapons in Prague on April 5, 2009. The new president said the United States had a moral responsibility to act on reducing the threat of nuclear weapons in the 21st century as the only country to have used nuclear weapons. Obama said:", "\"So today, I state clearly and with conviction America's commitment to seek the peace and security of a world without nuclear weapons.\"", "Bingo for Cheney? Not necessarily. There was more.", "\"I'm not naive. This goal will not be reached quickly –- perhaps not in my lifetime. It will take patience and persistence. But now we, too, must ignore the voices who tell us that the world cannot change. We have to insist, ‘Yes, we can.’", "Now, let me describe to you the trajectory we need to be on. First, the United States will take concrete steps towards a world without nuclear weapons. To put an end to Cold War thinking, we will reduce the role of nuclear weapons in our national security strategy, and urge others to do the same. Make no mistake: As long as these weapons exist, the United States will maintain a safe, secure and effective arsenal to deter any adversary, and guarantee that defense to our allies –- including the Czech Republic. But we will begin the work of reducing our arsenal.\"", "Obama reinforced his dream in a 2012 speech in Seoul and a 2013 address in Berlin. In the latter speech, he told the crowd:", "\"Peace with justice means pursuing the security of a world without nuclear weapons — no matter how distant that dream may be. And so, as President, I’ve strengthened our efforts to stop the spread of nuclear weapons, and reduced the number and role of America’s nuclear weapons. Because of the New START Treaty, we’re on track to cut American and Russian deployed nuclear warheads to their lowest levels since the 1950s.\"", "So Obama had a dream, but it’s one that he couched with a significant caveat. Cheney has a point that a world without nukes is Obama’s end-goal, a position that some conservatives say isn’t realistic because the weapons cannot be uninvented. On the other hand, the United States will not be first to eliminate its arsenal, Obama pledged.", "Experts told PunditFact this is not a new vision among U.S. presidents.", "\"The goal of working for the elimination of nuclear weapons has been U.S. policy since the Kennedy administration,\" said Hans Kristensen, director of the Nuclear Information Project at the Federation of American Scientists. \"Obama didn’t invent it.\"", "At the 2009 United Nations Security Council Summit about nuclear disarmament, Obama quoted Ronald Reagan, who said, \"We must never stop at all until we see the day when nuclear arms have been banished from the face of the Earth.\"", "While Obama did not reiterate this vision in a White House address or press conference about the Iranian nuclear deal, he did bring it up again on page 11 of his national security strategy paper released February 2015.", "‘Significantly reduced’ nuclear capability?", "Cheney’s second point — that the country’s nuclear weapons arsenal has been \"significantly reduced\" under Obama — drew more scorn from the experts.", "\"It is clearly incorrect to say that President Obama has reduced the U.S. nuclear weapons capability,\" said Daryl Kimball, executive director of the Arms Control Association, which supports reducing American and Russian nuclear stockpiles. \"We’d like for him to be doing more, and we’re disappointed that he’s not.\"", "In fact, the United States will spend hundreds of billions in the next 10 years to modernize its aging strategic nuclear force, which consists of submarines that launch ballistic missiles, land-based intercontinental ballistic missiles, and long-range bombers. Nuclear warheads will also be refurbished, and new and improved facilities around the country will be constructed.", "In all, the United States will spend about $35 billion a year on these improvements, or $350 billion through 2025, according to the Congressional Budget Office. The current nuclear force is comprised of about 1,550 long-range warheads.", "As the upgrades began, many supporters of disarmament grew confused about Obama’s shift in nuclear priorities. The New York Times quoted Sam Nunn, a former senator who influenced Obama’s view on nuclear nonproliferation, in September 2014 as saying Obama’s \"vision was a significant change in direction. But the process has preserved the status quo.\"", "According to Kristensen’s 2014 analysis, Obama has cut the number of nuclear weapons by a smaller percentage than any American president since the end of the Cold War. Obama’s 10 percent reduction over six years trails even George W. Bush’s 50 percent, according to Kristensen.", "Under the New START Treaty with Russia -- an arms control agreement that was approved in bipartisan fashion by the then-Democratic-led Congress in December 2010 -- the Obama administration has reduced the number of deployed warheads and launchers slightly. Under the treaty, neither country is allowed to possess more than 1,550 nuclear warheads and 700 intercontinental ballistic missiles, submarine-launched ballistic missiles and deployed heavy bombers equipped for nuclear armaments.", "\"Those are modest reductions that in no way are ‘dramatically reducing our own capabilities,’ \" Kristensen said, adding that the policies Obama is pursuing on nuclear weapons have been approved by the United States Strategic Command and the Pentagon.", "Our ruling", "Cheney said, \"Obama keeps talking about getting rid of all nuclear weapons. He’s already significantly reduced our capabilities there.\"", "Since campaigning for office, Obama has frequently mentioned that, in an ideal world, there would be no nuclear weapons. However, Cheney ignores that Obama has consistently acknowledged that this dream may not be achievable in his lifetime, and that the United States won’t give up its nuclear weapon arsenal as long as its enemies possess them.", "Experts also said Cheney overstates the arms reductions occurring during Obama’s presidency. Reductions are happening under a 2010 treaty with Russia, but the United States is also spending billions on modernizing its arsenal, and it is taking fewer weapons out of service than under any previous president in the post-Cold War age.", "Cheney’s statement contains some element of truth but ignores critical facts that would give a different impression, so we rate the claim Mostly False.", "Interview with Hans Kristensen, director of the Nuclear Information Project at the Federation of American Scientists, July 15, 2015", "Interview with Daryl Kimball, Arms Control Association executive director, July 15, 2015", "Interview with Ned Price, White House spokesman, July 15, 2015", "Politico Magazine, \"Is Obama changing his mind about nuclear weapons?,\" July 20, 2014", "New York Times, \"Which president cut the most nukes?\" Nov. 2, 2014", "PolitiFact, \"Sen. Jon Kyl says Obama nuclear arms policy is a ‘march toward zero’,\" Nov. 30, 2010", "PolitiFact, \"Chuck Hagel has called for 'an end to our nuclear program,' says Americans for a Strong Defense,\" Jan. 30, 2013", "PolitiFact, \"Donald Trump: The nuclear arsenal doesn’t work,\" June 18, 2015", "New York Times, \"U.S. ramping up major renewal in nuclear arms,\" Sept. 21, 2014", "Federation of American Scientists, \"How presidents arm and disarm,\" Oct. 14, 2014", "White House press room, Remarks by President Obama at Hankuk University, Aug. 12, 2012", "White House press room, Remarks By President Barack Obama In Prague As Delivered, April 5, 2009", "Wall Street Journal, transcript of Obama’s speech in Berlin, June 19, 2013", "Nuclear deal text, July 14, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]