["About this rating", "In January 2017, photographs began to show up on social media along with the claim that they were images of Melania Trump's grandmother, purportedly a Soviet soldier named Olga Orlif:", "Старший лейтенант Советской Армии Ольга Орлиф - бабушка югославки Мелании Трамп :-)?", "Senior Lieutenant of the Soviet Army Olga Orlif - grandma of Melania Trump", "This photograph actually shows actress Janet Leigh as Lt. Anna Marladovna (later Lt. Anna Shannon) in the 1957 movie \"Jet Pilot,\" a film about a Russian pilot who may or may not be a spy.  (It remains unclear whether this particular image is a still from the film, or if it was an official promotional photograph.)", "The web site TheRedList.com featured another image of Leigh in her Soviet Army costume:", "While we don't know much about the First Lady's grandmother, a photograph of a Soviet soldier who looks a lot like Janet Leigh along with the claim that it shows Melania Trump's grandmother is actually Janet Leigh dressed as a Soviet soldier for a 1957 movie role.", "Smith, Alex.   \"Melania who? Trump's wife a forgotten memory in Slovenian home town.\"\r\n    The Guardian.   5 September 2016.", "Collins, Lauren.   \"The Model American.\"\r\n    The New Yorker.   9 May 2016.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]