["The video was published here on Facebook on February 7, 2020.", "It has been viewed more than 23,000 times and shared more than 1,000 times.", "The 15-second video, filmed from inside a supermarket, shows scores of people scrambling under the shop's shutters as it opens.", "Below is a screenshot of the misleading post:", "The post’s caption reads: “Seriously / Jokes aside, this will cause the virus to spread more easily, why why why?????”", "The virus referenced is the novel coronavirus, a new strain of coronavirus that emerged in the Chinese city of Wuhan in late December 2019. The epidemic has since killed at least 2,400 and infected about 80,000 globally. Here is an AFP report on the ongoing viral epidemic.", "The same video was also shared here, here, and here on Facebook and here on Twitter, alongside a similar claim.", "The video has been shared in a misleading context; the video has circulated in multiple media reports since at least October 2019, months before the novel coronavirus outbreak was first reported in late December 2019.", "A reverse image search found this October 8, 2019 article published by MailOnline, the website for British tabloid The Daily Mail, headlined “Bizarre moment 'zombie' shoppers force their way under a store's front shutter in rush for a promotion on eggs”.", "The report reads, in part: “Shoppers desperate to get their hands on promotional eggs look like 'zombies' as they crawl under a supermarket's shutters.", "“The bizarre footage from Sanjiang Supermarket in Qingdao, east China, shows the 'middle-aged' customers bend the metal gate as they rush to get into the store.”", "Below is a screenshot comparison of the misleading video on Facebook (L) and the video on The Daily Mail website (R):", "At the beginning of the video, a man can be heard speaking Mandarin. His comments translate to English as: \"My door! My door!\"", "Towards the end of the clip, his comments translate to English as: \"Ah terrifying, terrifying!\"", "The video was also published in this article by the UK-based news website ViralTab, dated October 4, 2019.", "The report, in part, states: “This footage shows a mob of middle-aged and elderly shoppers forcing their way into a supermarket “like zombies” during a mad rush for a promotion on eggs.", "“The footage was filmed from inside Sanjiang Supermarket in Qingdao, a coastal city in East China’s Shandong Province, on 4th October.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]