["Nigeria’s main opposition party, the People’s Democratic Party (PDP), tweeted a statement on November 23 concerning an attack by an IS-backed Boko Haram faction, Islamic State West Africa Province (ISWAP). ISWAP claimed to have killed 118 soldiers in Metele village, northeast Nigeria.", "An image of President Muhammadu Buhari and an image of several dead bodies lying on the ground in combat gear was posted with the statement.", "The post was retweeted more than 1,100 times on Twitter and shared more than 200 times on Facebook.", "Yet the image does not relate to Boko Haram or Nigeria.", "The image, published by the Associated Press on October 20, 2011, shows Al-Shabab militants displaying the bodies of of men they claimed were African Union peacekeepers killed in Somalia.", "It has since been wrongly attributed to other terrorist groups in several articles and posts. Following the PDP post, numerous Twitter accounts have now falsely attributed the image to the recent killings by Boko Haram.", "A number of Twitter users, including government officials and supporters, have criticised the use of the image by the PDP.", "Other images shared online also purport to show Nigerian soldiers in the aftermath of the killings in Metele village.", "An image posted by a Twitter user on November 23, 2018, claims to show a Nigerian soldier in anguish, kneeling at the dead body of a fellow soldier.", "Yet the image is not of a Nigerian soldier but is taken from a Kannywood film called “Abu Hassan” released on February 20, 2018. Kannywood is the film industry in northern Nigeria.", "The actor in the image, Zaharaddeen Sani, posted an image of himself and the other actor in the image, on his Instagram page, the day before the film was released.", "The Twitter post mis-characterising the image was retweeted more than 1,400 times.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]