["About this rating", "A viral piece of text ostensibly written by Canadian comedian Howie Mandel about Justin Trudeau's \"accomplishments\" was widely circulated on Facebook in the lead-up to Canada's federal election on Oct. 21, 2019.", "This list was often shared under titles such as \"Consider this before you vote\" and \"Trudeau 4 years of accomplishments.\" Many versions were also preceded by a brief paragraph claiming that the viral item was written by comedian Mandel.", "Here's how it was summarized on a public posting to the Ben Shapiro Facebook page:", "If you wanted some fodder against Justin Trudeau aka younger Bernie here you go. Conservatives out west in Canada, Alberta and Sask are seriously chatting about making a change ... If Trump ever wanted some of Canada now would be a good time!! LoL", "A long read ...But an eye opener!!\nOur own Howie Mandel lists Trudeau’s accomplishments.", "By Howie Mandel.", "Trudeau 4 years of accomplishments:", "This list (the full text can be viewed at the bottom of this article) was not written by Howie Mandel; his name was attached to the text in an apparent attempt to lend it more credibility. Such false attribution is a common tactic on social media among those hoping to spread items to  larger audiences. While this text may have received some attention on its own, attaching a famous name to it made it seem a bit more credible (and shareable) to some readers.", "The earliest version of this text we could uncover was shared to Facebook on Sept. 21 and made no mention of who authored it. The text continued to circulate without any attribution for nearly a month until mid-October, when Mandel's name started showing up at its head.", "While we have not been able to determine who authored the original text, it was not written by Howie Mandel.  This list was never posted to Mandel's official social media pages, nor was was it published by a credible news outlet under Howie Mandel's byline. Mandel's name was not attached to the text untl nearly a month after it began circulating:", "The full list of Justin Trudeau's \"accomplishments\" read as follows:", "Consider this before you vote:", "Your minister of finance engaged in insider trading. Also forgot about his villa in France.", "You blew the Asia Pacific deal.", "You blew the helicopter deal with the Philippines.", "You blew the deal with China.", "You blew the deal with Europe.", "You invited \"irregular\" immigration and the taxpayer foots the enormous bill for it.", "You alienated the United States – our largest trading partner.", "At the G7 you pledged $400 million to Education around the world along with another $180 million to the Global Partnership for Education in Europe. None of it is going to fix our messed up school systems here at home. Meanwhile education costs are skyrocketing for our youth making university a mountain too high for many to climb.", "You pledged $241 million to Family Planning around the world including a $20 million donation to the Bill and Hillary Clinton Foundation (because they have integrity!). This all happened while you told vets that they were asking too much.", "You pledged $2.65 billion to climate change at the Commonwealth Leaders Summit and now you’re trying to bully the provinces into new taxes to pay for this pledge.", "You pledged $300 million to the Rohingya Refugee crisis while we have a refugee crisis of our own flooding into Quebec that you won't address.", "You pledged $125 million to Caribbean Reconstruction while our own infrastructure in cities is falling apart.", "You pledged $650 million to Sexual and Reproductive health in Haiti and around the globe wanting safer abortions for woman while many women in our own country are left without a family doctor.", "You pledged $840 million to Syria for Humanitarian Assistance when half the native reserves in our country don't have clean drinking water.", "You gave $10.5 million to a convicted...CONVICTED terrorist in a backroom deal. You intentionally paid it out in a way that prevented the widow of the killed soldier from pursuing it.", "You spent $4.5 billion on a 65 year old pipeline, and now the courts have ruled it shut down. Now it's back on (at a delay cost of $250 million) - good investment for Canada you said? (And KM uses that money to build a pipeline in Texas)", "You pressured Jody Wilson Raybould repeatedly & INAPPROPRIATELY with several different high ranking officials to offer SNC Lavalin a DPA instead of prosecution for repeated & sustained corruption AFTER the former AG had determined they were ineligible for such a deal. You lied about the above having ever taken place. Then you obstructed the investigation into this obstruction of justice.", "You replaced Canada’s old F-18s with Australia’s old F-18s.", "Your bizarre love of all things Castro.", "You imposed tough regulations and taxes on oil from Alberta, Saskatchewan and Newfoundland but not oil from Saudi Arabia. Every new project has to undergo strict environmental assessments...except cement plants in Quebec.", "You said that a proposed pipeline must consider “the intersection of sex and gender with other identity factors” (what does that even mean???)", "You chase foreign companies (and their investment capital) out of the country like they have the plague.", "You chased our WW1 soldiers out of our national anthem... lest we forget.", "You called small business owners “tax cheats”.", "People voice concern over money spent on illegal immigration and you call them intolerant racists.", "We have an equalization program, but you give half of it to one province.", "You spent $8 million on a skating rink (vanity project) when Canada's largest skating rink is 500 meters away.", "You added tens of billions to the national debt while lying to Canada's face about it. Balance the budget in 2019? Now we’re looking at 2040.", "You groped a woman and when caught and said she experienced it differently.", "You elbowed a female MP while dragging another MP by the arm in a petulant fit.", "Peoplekind? (international embarrassment)", "You got India to invest $250 million in Canada but we have to invest $750 million in India first.", "You said returning terrorists will be an extraordinarily powerful voice for Canada.", "You fought to let terrorists keep their Canadian citizenship.", "You spent $212,234 on artwork for the cover of the 2017 budget report.", "You spent upwards to $348,000 on food and alcohol in five flights on our government’s plane. On your G20 trip to Argentina, you spent $103,000 on food and alcohol alone. How is that even possible?", "You gave Canadian taxpayers' money to Hamas.", "You voice outrage over fake racist attacks and say nothing about real terrorist attacks.", "You took 10 vacations in a single year. Who does this?", "You spent a little over $1.5 million on the trip to India that did nothing but worsen ties. Plus paid over $17,000 to bring an Indian chef to India to cook Indian cuisine. And to top it off, invited a convicted attempted murderer to diner and posed for pics with him.", "And you’re the only PM convicted of ethics violations. (multiple times in fact)", "You destroyed the career of one of Canada’s honest military leaders to cover up possible massive corruption in ship building contracts.", "You invited Joshua Boyle, an alleged perpetrator of sexual assault and unlawful confinement of his wife for a photoshoot in the Office of The Prime Minister.", "You threaten to sue the leader of the opposition then chicken out when you realized that your alleged crimes will be exposed in court.", "You offer over $600 million dollars in subsidies to failing mainstream media outlets if they can prove to be trustworthy. You put a union who vows to destroy your opposition in charge of selecting these new “trusted” sources to receive funding. You could school the Russians in election interference.", "You pay off your friends to engage in election ads for you and get Elections Canada to pay for it.", "$13 million to Loblaws for new refrigerators.\nYou made public statements of deep admiration for Chinese communism.", "You wore preposterous, inappropriate costumes during a state visit to India, paid for by Canadians.", "Almost $13 billion in promises right before calling the election.", "Blackface. 3 times. Wow.", "What moral, functioning Canadian human could possible justify voting for you?", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]