["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker took an early swipe at a likely Democratic opponent, by criticizing his predecessor’s record on jobs.", "On Aug. 30, 2013, Walker brought up jobs when discussing Democrat Mary Burke, who is considering a gubernatorial run in 2014. A former Trek bicycles executive, Burke served as state commerce secretary for two and a half years under former Gov. Jim Doyle.", "Walker,  who has not officially launched his re-election campaign, said in an interview with Wisconsin Eye that electing Burke would be a mistake and a return to the past. Burke, he said, \"implemented the policies of Jim Doyle. Those are the policies that, in his last term, saw the state lose more than 133,000 jobs.\"", "We’ve been tracking Walker’s promise to create 250,000 private sector jobs in his four-year term. The state has added 84,482 jobs in the two and a half years since Walker took office, according to our most recent monthly Walk-O-Meter update.", "But what about the governor’s claim that the policies of Doyle cost the state more than 133,000 jobs in the previous four years?", "Let’s start with the numbers.", "Doyle’s second term was from 2006 to 2010. At the start of that time frame, Wisconsin had 2,404,928 jobs, according to the state Department of Workforce Development. Four years later, when Doyle left office, the state had 133,943 fewer jobs.", "So Walker is on point on the raw number of jobs lost in Doyle’s final term.", "But Walker’s claim was about more than the numbers. In going after Burke -- Commerce Secretary from 2005 until the end of 2007 -- he attributed the loss to the policies of the Doyle administration.", "To support his claim, Walker’s office provided an email statement, links to news clippings and portions of an \"issue book\" produced by state Senate Republicans in for the 2009-’10 term.", "\"Governor Doyle’s vision for Wisconsin included bigger government, the use of one-time funds and budget gimmicks (raid of segregated funds), out-of-control spending, and tax increases,\" said the email from Walker spokesman Tom Evenson.  \"These policies led to an environment unfriendly to workers and job creators and contributed to the loss of over 133,000 jobs in his last term.\"", "The email also said that under Doyle, the state raised taxes by \"nearly $5 billion and used one-time stimulus money to fill a budget hole.\"", "\"These taxes fell on employers both directly and indirectly as well as on working families taking away more of their hard-earned income and sending it to Madison.  Also, employers and others knew that using one-time money would grow future deficits which could fall on them in the form of higher taxes.\"", "The email states: \"These actions contributed to Wisconsin’s job loss of more than 133,000 private sector jobs.\"", "Let’s pause right there.", "In the Wisconsin Eye interview, the governor said that Doyle administration policies were responsible for the job losses. The statement from Evenson says only the actions \"contributed\" to the job losses.", "The view from experts", "When we asked several experts for their view on the 2006-’10 employment situation in Wisconsin, all had the same general observation: In that period, the U.S. economy suffered the worst economic downturn in more than 75 years -- and Wisconsin was not immune.", "In fact, they said, Wisconsin fared somewhat better than the country as a whole.", "\"I'm pretty sure there is plenty of blame to be shared by a lot of people, but it might be unfair to pin it all on one person or administration,\" said Brian Jacobsen, an economist at Wells Fargo Bank and lecturer at Wisconsin Lutheran College.", "\"Considering employment in Wisconsin declined 5.3% during that time while U.S. employment declined 5.6%, blaming it on Doyle might not be all that fair.\"", "Jacobsen said the jobs decline \"probably wasn't exaggerated by Doyle's policies.  If his policies were to blame, we probably would have seen a larger percentage decline in employment in Wisconsin.  I do think it is fair to criticize previous policy decisions, especially related to tax policy, in making the bounce back tougher.\"", "In a previous PolitiFact item about the recession, Jacobsen noted that the National Bureau of Economic Research, which declares the start and end of recessions, says \"economic activity in the U.S. peaked in December 2007 and reached a trough in June 2009.\"", "Marquette University economics professor Abdur Chowdhury attributed the loss of jobs mainly to the Great Recession.", "\"If you think about it, Wisconsin fared much better than many other states -- the total U.S. job loss during the Great Recession was about 8 million and Wisconsin's share was less than 200,000,\" he said. \"I wouldn't blame the Doyle administration solely for this job loss. In the face of a national economic collapse, there wasn't much that the Doyle administration -- or, for that matter, any other administration -- could do.\"", "We also checked with Richard Freeman, a Harvard University professor and the director of the the National Bureau of Economic Research, the organization that determines, among other things, the official start and end of recessions. He also said the key to understanding the state’s performance during the recession was that Wisconsin’s job loss was smaller than the rest of the country.", "Freeman’s time frame differs slightly from the others but his conclusion was the same: \"Wisconsin had 2.132% of (the nation’s) private-sector jobs in 2007 and 2.149% of those jobs in 2010.  This means that Wisconsin had a smaller job loss than other states.\"", "Freeman added: \"I doubt that state government had much impact on private sector job loss.\"", "Our rating", "Walker said that the policies of Doyle, his predecessor, led to the loss of more than 133,000 jobs in Doyle’s last term.", "He’s correct about the number. But experts agree that Wisconsin’s economy was caught in the same economic crash that crippled the entire country -- the recession was deeper and more severe than any single state’s policies, including those of Doyle.", "They note that Wisconsin actually fared somewhat better than the rest of the country. This leaves us with a statement that’s numerically true, but with scant evidence at best when it comes to blame. That’s Mostly False on our meter.", "To comment on this item, visit this page.", "Gov. Scott Walker, Wisconsin Eye interview, Aug. 30, 2013", "Email, Brian Jacobsen, Wells Fargo, Sept. 5., 2013", "Email, Abdur Chowdhury, Marquette University, Sept. 5, 2013", "Emails, Tom Evenson, spokesman, Gov. Scott Walker, Sept. 6, 9, 2013", "Email, Richard Freeman, Harvard University, Sept. 6, 2013", "PolitiFact Wisconsin, \"Sen. Ron Johnson says economy was not in free fall when Obama took office,\" Nov. 26, 2012", "PolitiFact Wisconsin, Walk-o-Meter updates on jobs promise", "Emails, John Dipko, communications director, Wisconsin Department of Workforce Development, Sept. 5, 2013", "National Bureau of Economic Research", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]