["A picture of a public funeral where a huge crowd has gathered resurfaces on social media every few years. It circulates with the claim that the image depicts the last rites of Bhagat Singh, Sukhdev and Rajguru. The three freedom fighters were hanged by the British government on March 23, 1931 in Lahore which is now part of Pakistan.", "The caption in the post below reads, “This picture shows the last rites ceremony of Bhagat Singh, Sukhdev, and Rajguru. Try to share it with all of India… ”", "The screenshot below shows the virality of the image on Facebook.", "Below is another such post with the same claim. It is six years old.", "हो सके तो इस तस्वीर को हर देश वासी तक पहुँचाने की कोशिश कीजियेगा……. ये तस्वीर शहीद भगत सिंह , राजगुरु और सुखदेव जी…", "Posted by देश के गद्दारों की पोल खोल on Thursday, December 10, 2015", "Along with Facebook, the image has also been circulated widely on Twitter.", "On Martyr’s Day last year, Boldsky, a website affiliated with One India, shared the image claiming the same.", "We performed a reverse image search and found the original photograph on panthic.org. According to the site, the photo shows the cremation of 13 Sikhs who were killed on the day of Baisakhi in 1978.", "A few other websites carry further information about the image, including discoversikhism.com and babushahi.com.", "An article in The Print delves deeper into the incident and gives context behind the enmity between the Nirankaris and the Sikhs. The Sikh community considers Guru Granth Sahib as a living Guru, who cannot be replaced by any person. But Nirankari Satguru Avtar Singh declared himself a living Guru in the presence of Guru Granth Sahib. This led to discord between the Sikhs and the Nirankaris, with several bouts of skirmishes. One such conflict occurred on April 13, 1978, in which 13 Sikhs were killed.", "On April 15, 1978, these 13 Sikhs were cremated in front of Shri Ramsar Sahib Gurdwara in Amritsar. The viral image was taken at their cremation ceremony. We found a higher quality image taken from another angle on news.drgurbani.com.", "Satwinder Singh Jas’s book, ‘The Execution of Bhagat Singh: Legal Heresies of the Raj’, says that the three martyrs’ bodies were chopped into pieces after they were hanged. Following this, the bodies were cremated overnight on the banks of the Sutlej river near Firozpur. Out of fear of public outrage, their remains were thrown into the river before being completely burnt. However, locals reached the spot, retrieved the burnt remains and gave them a proper funeral with dignity.", "We reached out to Chaman Lal, who has authored several books on Bhagat Singh and is the Honorary Advisor at the Delhi Archive Center’s Bhagat Singh Archive and Resource Center. He also informed that the mortal remains of Bhagat Singh, Rajguru and Sukhdev were cremated twice.", "Social media users have been sharing a picture of the funeral ceremony of Sikhs who died in 1978 after a clash between the Sikhs and Nirankars in Punjab. The image does not show the last rites of Bhagat Singh, Sukhdev and Rajguru.", "It is noteworthy that while a website affiliated with One India published the picture with the erroneous claim, on March 25, a fact-check report by One India stated that it was not taken at Bhagat Singh’s funeral.", "Donate Now", "A journalist and a dilettante person who always strives to learn new skills and meeting new people. Either sketching or working.", "What’s in a name? Apparently, a lot, if social media trends and raging political discourses…", "As Karnataka is set to go to the polls in two months’ time, all parties…", "The Qutub Minar is a UNESCO world heritage site in South Delhi. The name literally…", "On February 21, external affairs minister S Jaishankar gave an interview to ANI journalist Smita…", "An image of an apparently ancient sculpture is viral with the claim that it was…"]