["Violent clashes took place between police and farmers on October 2 when security personnel sought to prevent farmers from several states from entering the national capital. The farmers who had been agitating under the aegis of the Bharatiya Kisan Union (BKU) were stopped at the Delhi-U.P border, with teargas shells and water cannons deployed to halt their march. In the midst of the uproar over this development, several prominent social media users shared a photograph which showed a policeman brandishing a hand gun in front of a peasant.", "Look at the farmer with a brick in his hand, facing a cop with a gun. If you don’t think the farmer is a terrorist – and I hope you don’t – if you empathise with his anger, I hope you’ll think again before you call a Kashmiri kid with a stone in his hand a terrorist. pic.twitter.com/7Omxax3sWj", "— Kavita Krishnan (@kavita_krishnan) October 2, 2018", "The above tweet by Kavita Krishnan, activist and politburo member of CPI (ML), drawing parallels between protesting farmers and Kashmiri stone-pelters was retweeted over 2400 times and ‘liked’ over 5400 times. Krishnan later issued a clarification. Among those who shared it was the Twitter account @zoo_bear.", "Yesterday I had retweeted a tweet by Kavita Krishnan. The pic was actually from 2013 during meerut clashes and not of recent #FarmersProtest I apologise for my mistake. 🙁 pic.twitter.com/eXmMh1Hfdc", "— Zoo Bear (@zoo_bear) October 3, 2018", "On Facebook too, this image has been shared widely with the claim that it was clicked during the farmers’ agitation.", "Posted by I am With Barkha Dutt on Tuesday, October 2, 2018", "Through a Google reverse image search, Alt News found that the photograph in question is NOT of the recent agitation. It was taken in 2013 and was clicked in Meerut, Uttar Pradesh. An article by The Pioneer dated September 30, 2013 had carried this photograph. The same photo was also published by Indian Express on the same day, credited to PTI and also by The Hindu.", "The context of this photograph was the defiance of imposition of section 144 of the CrPC (prohibition of unlawful assembly) after the National Security Act was slapped on BJP leader Sangeet Som, one of the accused in the Muzaffarnagar riots of 2013. The photograph was taken when police tried to prevent villagers from gathering for a mahapanchayat that had been banned by the administration fearing an upsurge in communal tension.", "An unrelated image from 2013 was used to portray administrative apathy and heavy-handedness in the wake of the recent farmers’ march. While there is little doubt of violent confrontation between police and agitating farmers, sharing an old image from another incident not only ended up misleading social media users but was representative of confirmation bias.", "Donate Now", "Arjun Sidharth is a writer with Alt News. He has previously worked in the television news industry, where he managed news bulletins and breaking news scenarios, apart from scripting numerous prime time television stories. He has also been actively involved with various freelance projects. Sidharth has studied economics, political science, international relations and journalism. He has a keen interest in books, movies, music, sports, politics, foreign policy, history and economics. His hobbies include reading, watching movies and indoor gaming.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]