["About this rating", "In April 2019, we started receiving queries about a viral piece of text entitled \"Thoughts from a hipster coffee shop ...\" supposedly written by a young woman named Alyssa Ahlgren. The post outlined some thoughts on poverty in the United States, millennials' alleged sense of entitlement, and the popularity of socialist policies among her generation.", "The article, which included a photograph of the author, was widely shared on Facebook. We also encountered a few chain-email versions sharing this text under titles such as \"One Millennialist point of view\" and \"College Student: My Generation Is Blind to the Prosperity Around Us\":", "Misattribution is a rampant problem on the internet. One common tactic of those who pass along political tracts is to change the author of the piece to someone who seems better suited to deliver the information, in order to lend credence to the expressed opinions. In March 2018, for example, the name of relatively unknown Mychal Massie was removed from an opinion piece that labeled U.S. President Donald Trump as a pragmatist (rather than a Democrat or Republican) and was replaced with that of well-known political commentator Charles Krauthammer.", "In Ahlgren's case, some readers apparently were skeptical that her opinions were actually expressed by a millennial and therefore questioned whether Ahlgren's name and image had been correctly attached to them.", "One email version of the piece we encountered was preceded by the following text:", "\"This is one of the most well written pieces that I have seen. And, by a millennial. Bravo!", "By Golly, finally one who gets it. So well said, maybe there is hope for our grandchildren's generation after all. This is one of the most well written pieces that I have seen, written by a young lady in a coffee shop to her fellow millennials.", "The \"Thoughts from a hipster coffee shop ...\" opinion piece was truly written by Ahlgren. The article was originally published on 6 April 2019 on the website Alphanewsmn, where Ahlgren is a regular contributor. Ahlgren has also been published by the Daily Caller and is an ambassador for the conservative organization Turning Point USA.", "Here's a video of Ahlgren discussing \"socialism on the rise\" during an April 2019 appearance on Tucker Carlson's Fox News television show:", "Ahlgren, Alyssa.   \"Thoughts from a Hipster Coffee Shop ...\"\r\n    Alpha News.   6 April 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]