["A video of schoolchildren ‘twerking’ has been shared on social media with the claim that this was in a school in India. “कॉन्वेंट स्कूल में क्या क्या सिखाया जा रहा… देखो तुम्हारे बच्चों को क्या बना दिया गया हे…! See what convent schools teach your kids. See what they have transformed your kids into,” was the caption used to share the video by Facebook page ‘ॐ हिन्दुजन ॐ‘. The clip has 29,000 views.", "कान्वेंट स्कूलों में आने वाली पीढ़ी को ऐसे संस्कार दिए जा रहे है…. ज्यादा से ज्यादा शेयर करे… और इन पर लगाम लगाये.", "Posted by ॐ हिन्दुजन ॐ on Sunday, 9 September 2018", "From another page ‘Yes Comedy’, the video has attracted 11,000 views.", "Another caption used to share the video says, “भारत में रह रहे किराये के काले अंग्रेज़ो…देखो तुम्हारे बच्चों को क्या बना दिया गया हे…Black Englishmen staying in India see what your kids have been turned into.”", "भारत में रह रहे किराये के काले अंग्रेज़ो…देखो तुम्हारे बच्चों को क्या बना दिया गया हे…", "Posted by Geetaanjali Nanda on Friday, 27 September 2019", "A Google search with keywords ‘school children twerking’ led us to news reports from 2016. The dance video was shot in the city of Camaguey in central Cuba, 300 miles east of Havana, reported Daily Mail. The video was uploaded by one of the fathers of the kids who wanted to share the clip of his son ‘showing off his moves.’ Daily Star had reported that the video was viewed 7.3 million times when it was uploaded on Facebook.", "The incident was also reported by Indian media outlet Deccan Chronicle.", "A video of children in Cuba performing a provocative dance has been shared on social media to target convent schools in India.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]