["By Eugene Kiely", "Posted on October 13, 2017 | Corrected on October 14, 2017", "In refusing to certify the Iran nuclear deal, President Donald Trump said Iran “has committed multiple violations of the agreement.” But that’s not the finding of the International Atomic Energy Agency.", "The IAEA has issued eight reports since the agreement was implemented in January 2016, and all eight have found Iran is implementing the agreement — most recently on Aug. 31.", "Trump himself has certified to Congress on two occasions that Iran has complied with the nuclear deal known as the Joint Comprehensive Plan of Action, or JCPOA. The president must issue a certification every 90 days.", "On Oct. 13, Trump announced that he would not once again certify Iran’s compliance with the JCPOA. His decision “gives Congress the option to introduce legislation reimposing U.S. sanctions waived or suspended under the JCPOA on an expedited schedule,” the Arms Control Association says.", "Trump said Iran committed “multiple violations” of the JCPOA, which was negotiated by the U.S., China, France, Germany, Russia and the United Kingdom, as well as representatives of the European Union and Iran.", "Trump, Oct. 13: Iranian regime has committed multiple violations of the agreement. For example, on two separate occasions, they have exceeded the limit of 130 metric tons of heavy water. Until recently, the Iranian regime has also failed to meet our expectations in its operation of advanced centrifuges.", "The Iranian regime has also intimidated international inspectors into not using the full inspection authorities that the agreement calls for. Iranian officials and military leaders have repeatedly claimed they will not allow inspectors onto military sites, even though the international community suspects some of those sites were part of Iran’s clandestine nuclear weapons program.", "Let’s take a look at each of the three issues Trump raised, beginning with the limits on heavy water.", "Under the agreement, Iran is limited to 130 metric tons of heavy water — which is a concern to nuclear arms inspectors, as the Associated Press explains, because it is “used to cool reactors that can produce substantial amounts of plutonium,” which “can be applied to making the fissile core of nuclear warheads.”", "On two occasions, Iran has slightly exceeded the limits. The first time was in February 2016, a month after the agreement was implemented, and again in November. So Trump is right, although he was aware of these violations when he agreed twice before to certify Iran’s compliance.", "Iran also is now in compliance with the heavy water limits, according to the eighth and most recent IAEA report. “Throughout the reporting period, Iran had no more than 130 metric tonnes of heavy water,” the report says.", "“Iran exceeded the heavy water limits briefly but is now in compliance,” Daryl G. Kimball, executive director of the Arms Control Association, told us in an email. “It is important to note that the heavy water is now useless for Iran given that its heavy water reactor at Arak has been reconfigured so that it cannot produce plutonium.”", "Iran filled the core of the heavy-water reactor at Arak with concrete in January 2016.", "Kelsey Davenport, director for nonproliferation policy at the Arms Control Association, told us that there was a misunderstanding about the 130 metric tons.", "Iran “interpreted language in the deal setting the cap differently than” the other countries, believing that the “130 ton limit was an estimate, not a hard cap.” But that difference has been resolved, and there have been no violations since.", "As for Trump’s concern about advanced centrifuges, David Albright, an IAEA weapons inspector in Iraq during the 1990s and founder of the Institute for Science and International Security, said that issue has been resolved.", "“The issue is the number of advanced centrifuges Iran had,” said Albright. “I would call it a violation that has been corrected, inadvertently I would add. The extra ones broke.”", "Trump’s reference to inspections at military sites refers to Section T of the JCPOA that covers the development of dual-use equipment that has civilian and military applications, according to Albright, an adviser to the Trump administration. Albright said the IAEA needs access to military sites in order to verify Iran’s compliance with Section T of the agreement.", "Under the JCPOA, the IAEA has daily access to declared nuclear sites for 15 years and continuous electronic monitoring of those sites for at least 15 years, as explained in a 67-page guidebook published by the Belfer Center for Science and International Affairs at Harvard University. There is a separate confidential agreement covering the Parchin military site, which has been the site of past activity that the IAEA has suspected was connected to nuclear weapons development. Critics have claimed that that agreement amounts to self-inspections, a claim that the IAEA has denied, as we have written before.", "“This is the most egregious of Trump’s claims,” Davenport, of the Arms Control Association, told us. “The IAEA clearly stated that Iran has granted inspectors all of the access the agency has requested. If Iran had blocked access, the P5+1, including the United States, would not have been able to say that Iran is complying with the accord.”", "In a statement issued in response to Trump’s speech, IAEA Director General Yukiya Amano said that “the IAEA has had access to all locations it needed to visit.”", "“As I have reported to the Board of Governors, the nuclear-related commitments undertaken by Iran under the JCPOA are being implemented,” Amano said in his statement.", "Albright, who agrees with the president that Iran is “not in full compliance,” says the IAEA has not asked for access to the military sites for fear it would “bring down the entire deal.”", "“The IAEA can ask to go and if Iran refuses, the JCPOA contains a mechanism to allow one party to snapback all sanctions,” Albright said. “But the IAEA is not likely to want to bring down the entire deal by asking to go to a military site.”", "He said the issue of access to military sites “will be a centerpiece of fixing the JCPOA.”", "We take no position on Trump’s desire to renegotiate aspects of the Iran deal that he does not like. The issue, though, is whether Iran has complied with the existing agreement, and even those within his own administration have said that Iran is in compliance.", "In September, Secretary of State Rex Tillerson said Iran is in “technical compliance” with the deal, and Gen. Joseph Dunford, chairman of the Joint Chiefs of Staff, told Congress that “Iran is adhering to its JCPOA obligations,” and the agreement is working as intended.", "“The JCPOA,” Dunford said, “has delayed Iran’s development of nuclear weapons.”", "Correction, Oct. 14: We originally wrote that Trump was referring to the Parchin military site when he criticized Iran for not allowing IAEA inspections of military sites. Albright, an adviser to the president, told us that Trump was referring to inspections at all military sites, not just Parchin, to ensure that Iran is in compliance with Section T of the JCPOA. That section covers the development of dual-use equipment that can be used for civilian and military purposes. The revised version of this story reflects that change.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]