["About this rating", "Do you run a website? Do you need people to click through to it so you can generate advertising revenue? Are context and accuracy not a primary concern? If the answer to all of those questions is \"yes,\" a tried and true method for generating fear-mongering clickbait is to reference the ever-present online claim that a new study or development has indicated an increased likelihood of a humanity-ending supereruption bursting forth from the bowels of the Yellowstone caldera.", "As we have repeatedly stated, however, the current geometry of the magma chamber and distribution of magma within that chamber make the chances astronomically unlikely that such an eruption will occur in Yellowstone during the next couple of thousand years.", "Not to be dissuaded by this truth, the reality-adjacent website Disclose.tv opted to misconstrue the point of a U.S. Geological Survey (USGS) National Volcanic Threat Assessment report to make the false claim that the likelihood of disaster had increased at the caldera. In a report headlined “Yellowstone Super Volcano Threat Level Just Increased to 'High' By USGS” and filed to the section “preppers,” Disclose alleged that the USGS now considers the risk of the Yellowstone caldera erupting to be greater than previously assumed or calculated:", "A new report has revealed that the U.S. Geological Survey is classifying eighteen volcanoes located in the United States as having a very high threat. This report includes the classification of the Yellowstone volcano in Wyoming as high in terms of threat. Volcano threat assessments have not been updated since 2006.", "Such reporting is misleading in two ways. First, it states that the USGS has “increased” the “threat level” of the Yellowstone Caldera in their latest report, which is not true. Second, by not fully explicating what the USGS' “threat assessment” ratings mean, it suggests that the rating relates (solely) to the likelihood of an eruptive event, which is also not true.", "In 2005, the USGS released a report titled “An Assessment of Volcanic Threat and Monitoring Capabilities in the United States: Framework for a National Volcano Early Warning System” which aimed at to ensure that “the most threatening volcanoes in the United States are properly monitored in advance of the onset of unrest and at levels commensurate with the threats posed.” Work published in 2007 also contributed to this ranking system. Volcanic threat, as defined by the USGS, was quantified by calculating both the nature of the potential eruptive hazards as well as the potential size or extent of the human exposure to those hazards.", "In 2005 and 2007, the Yellowstone Caldera was listed by the USGS as being a part of the “high threat” category, a fact owed partially to “high visitor density” of the national park that sits above it. In 2018, the Yellowstone caldera also fell into the “high risk” category, so it is unclear where viral reports have gotten the notion that the threat level “increased” in the latest report, because from a factual standpoint the category level has not moved.", "Disclose and other viral stories typically do not adequately define what the threat assessment means, leading several clickbait factories or social media shares to present the claim as if it were somehow a forecast for the likelihood of an eruption. The authors of the 2018 study attempted to make clear that this was not in any way the intent or nature of their report:", "The updated national volcanic threat assessment presented here is not a forecast or indication of which volcanoes are most likely to erupt next. Rather, it is an indicator of the potential severity of impacts that may result from future eruptions at any given volcano.", "The USGS considers the likelihood of a caldera-forming apocalypse at Yellowstone in the next couple of thousand years to be “exceedingly low.” The 2018 update listed eight fewer volcanoes than the 2005 version, and the 18 that were ranked “very high threat” in 2005 are the same 18 that were ranked in that group in 2018.", "Quigley.   \"Yellowstone Super Volcano Threat Level Just Increased to 'High' by USGS.\"\r\n    Disclose.tv.   29 October 2018.", "U.S. Geological Survey.   \"An Assessment of Volcanic Threat and Monitoring Capabilities in the United States: Framework for a National Volcano Early Warning System.\"\r\n    April 2005.", "Ewert, J.W.   \"System for Ranking Relative Threats of U.S. Volcanoes.\"\r\n    Natural Hazards Review.   1 November 2007.", "U.S. Geological Survey.   \"2018 Update to the U.S. Geological Survey National Volcanic Threat Assessment.\"\r\n    22 October 2018.", "U.S. Geological Survey.   \"Steam Explosions, Earthquakes, and Volcanic Eruptions -- What’s in Yellowstone’s Future?\"\r\n    2005.", "Alex Kasprak is an investigative journalist and science writer reporting on scientific misinformation, online fraud, and financial crime.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]