["By Katie Busch", "Posted on October 14, 2020", "Former Vice President Joe Biden knelt for a photo with a group of dancers in Miami, but the national anthem was not playing, as social media posts falsely claim.", "Kneeling during the national anthem became controversial four years ago when Colin Kaepernick, then an NFL quarterback, began taking a knee to protest racial injustice during the playing of the anthem prior to kickoff. Others followed Kaepernick’s lead, and the action quickly became a politically charged topic.", "Recent Facebook posts criticize Democratic presidential candidate Joe Biden for a photo of him kneeling at a campaign event in Miami’s Little Haiti. The posts, including one version that received more than 2,000 shares, falsely accuse the former vice president of kneeling during the national anthem.", "“Taking a knee during the National Anthem!!” the post reads. “Let that sink in…A PRESIDENTIAL candidate taking a KNEE during our NATIONAL ANTHEM!!! Taking a KNEE for the very freedoms you claim you are going to protect and defend!! NO THANKS!!”", "But the anthem was not playing when the photo in the post was taken. Biden was kneeling to let people behind him be seen in the photo, according to the journalist who took the picture.", "“I took a photo of the vice president at his event in Miami’s Little Haiti community,” Jacqueline Charles, the Miami Herald correspondent, said in an Oct. 11 Herald story. “He had just finished addressing the group when at the end of the event someone asked for a photo. There was no national anthem playing in the background.”", "“It’s a socially distanced photo, and most people kneel so that everyone can be seen in the photo. Before COVID, everyone would have just stood in a tight space. But that couldn’t be done, so he kneeled as the dancers stood in the back,” Charles added.", "This is not the first time that a photo of Biden kneeling has been taken out of context. In August, a Facebook post claimed that Biden had taken a knee in front of an American flag in Pennsylvania. In the photo cited by the post, Biden was actually kneeling to speak to a small child.", "Biden has knelt in solidarity with activists and demonstrators protesting racial injustice following the death of George Floyd in May. Floyd’s death, as well as the widespread protests which followed, were the subject of numerous false and misleading online posts, as we have reported on extensively.", "But we haven’t found any instance of Biden kneeling during the national anthem, and that wasn’t the case in Miami.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "This fact check is available at IFCN’s 2020 US Elections FactChat #Chatbot on WhatsApp. Click here for more.", "Britannica. “Kneeling during the National Anthem: Top 3 Pros and Cons.” ProCon.org. 12 Jun 2020.", "Chalasani, Radhika. “George Floyd protests aren’t just happening in big cities.” ABC News. 20 Jun 2020.", "“Fact check: Biden kneeling to speak to a child not because of American flag.” Reuters. 5 Aug 2020.", "“Falsehoods Follow George Floyd’s Death.” FactCheck.Org. 19 Jun 2020.", "Fichera, Angelo. “Baseless Conspiracy Theory Claims Floyd Case Was ‘Staged’.” FactCheck.Org. 29 May 2020.", "“George Floyd: What happened in the final moment of his life.” BBC. 16 July 2020.", "Haislod, Tadd. “Colin Kaepernick kneeling timeline: How protests during the national anthem started a movement in the NFL.” SportingNews.Com. 13 Sep 2020.", "Jenkins, Jack. “Trump campaign ad shows Biden kneeling in Black church to argue Americans ‘won’t be safe’.” Religion News Service. 10 Sep 2020.", "“Joe Biden shares picture of himself kneeling with demonstrator at George Floyd protest.” NewsBreak.com. 31 May 2020.", "Madan, Monique. “Fact check: Yes, Joe Biden took a knee in Miami. No, it wasn’t during the national anthem.” Miami Herald. 11 Oct 2020.", "Spencer, Saranac Hale. “Bogus Claims of ‘Crisis Actors’ in Death of George Floyd.” FactCheck.Org. 12 Jun 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]