["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "On July 23, 2020, Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases (NIAID), threw out the first pitch before the Washington Nationals and the New York Yankees faced off during the long-delayed opening day of the Major League Baseball (MLB) season.", "Although Fauci's honorary attendance at the game (as well as his wild pitch) were at the center of most news reports, much of the chatter on social media concerned a photograph that supposedly showed Fauci sitting in the stands with his mask lowered below his mouth:", "This is a genuine photograph of Fauci sitting in the stands during opening day of the 2020 MLB season. This photograph was taken by Alex Brandon and is available via The Associated Press with the following caption:", "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, center, smiles as he watches an opening day baseball game between the Washington Nationals and the New York Yankees at Nationals Park, Thursday, July 23, 2020, in Washington. (AP Photo/Alex Brandon)", "The above-displayed image was widely circulated on social media along with comments about how Fauci was setting a bad example or acting hypocritical by wearing a mask below his mouth and not social distancing, but the above-displayed picture may not be as \"damning\" as some are presenting it.", "The woman on Fauci's left is his wife, Christine Grady, and the man on Fauci's right is a \"close friend\" of the NIAID director. This man was also described in a photograph from USA Today as one of Fauci's \"guests\" at the event. In other words, the two other people in this photograph appear to be part of Fauci's inner circle, which may reduce the need for social distancing in this instance.", "It should also be noted that a water bottle can be seen directly in front of Fauci, and that the NIAID director and his guests are sitting outside. In many cities where restaurants and other businesses have reopened, people are allowed to remove their masks when they are eating or drinking. The Centers for Disease Control and Prevention (CDC) also notes that outdoor activities, such as attending a baseball game in an open-air stadium, is safer than indoor activities.", "The above-displayed photograph shows Fauci outdoors with his wife and a close friend while he was presumably drinking a bottle of water. Although wearing a mask at all times is certainly the safest option, it doesn't appear that Fauci was acting contradictory to the recommendations offered by himself, the NIAID, or the CDC.", "On July 24, Fauci was asked about this photograph during an interview on Fox News. Fauci said:", "The other person is a very close friend of mine. John, I think this is sort of mischievous with this thing going around. I had my mask around my chin, I had taken it down. I was totally dehydrated and I was drinking water trying to rehydrate myself. And by the way, I was negative Covid literally the day before.", "So I guess if people want to make a thing of that, I wear a mask all the time when I'm outside. To pull it down, to take some sips of water, and put it back up again, I guess if people want to make something about that, they can. But to me, I think that’s just mischievous.", "Yahoo News.   \"Does Fauci Wear a Mask When He Goes Running?\"\r\n    12 June 2020.", "Lacques, Gabe.   \"Dr. Anthony Fauci Throws First Pitch at Nationals-Yankees MLB Opener.\"\r\n    USA Today.   23 July 2020.", "Edelman, KJ.   \"Fauci Slams Critics Attacking Him for Not Wearing Mask at Nationals Game: ‘Just Mischievous’ for People to Make This an Issue.\"\r\n    Mediate.   24 June 2020.", "Wagner, James.   \"Baseball’s New Rules: No Spitting, No Arguing, And Lots of Testing.\"\r\n    The New York Times. &bsp; 24 June 2020.", "Fottrell, Quentin.   \"Fauci Tells MarketWatch: I Would Not Get on a Plane or Eat Inside a Restaurant.\"\r\n    MarketWatch.   24 July 2020.", "Centers for Disease Control and Prevention.   \"Personal and Social Activities.\"\r\n    23 July 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]