["The 45-second clip was shared here on Facebook on February 3, 2020.", "It has been viewed more than 7,500 times.", "Below is a screenshot of the misleading Facebook post:", "The logo for US news agency the Associated Press can be seen in the top-right corner of the video.", "The post’s caption reads: “China PM who told we'll translate the Quran as our own realised that the only one way to protect from the korona virus is doing 'sajtha' to Allah and went to mosque to pray, Masha llah.”", "“Quran”, or Koran, is the holy book of Islam.", "“Sajtha”, or Sajdah/Sujud, in Islam means prostration to God.", "“Mashallah” is an Arabic word which means “God willing”, which is used for praising or expressing appreciation.", "“Korona virus” refers to the novel coronavirus, believed to have originated from a wildlife market in the central Chinese city of Wuhan. The viral epidemic has killed at least 490 people and infected 24,000 others in China since its emergence in December 2019, as reported here by AFP on February 5, 2020.", "The video was also shared here on the official Facebook page belonging to an Indian politician from a regional political party All India Majlis-e-Ittehadul Muslimeen.", "The video was also shared here, here, here on Facebook; here and here on Twitter; and here on YouTube, alongside a similar claim.", "The claim is false; a reverse image search using keyframes from the video found that it actually shows a former Malaysian prime minister, Abdullah Ahmad Badawi, praying in a mosque in Beijing when he visited China in May 2004.", "The original clip was published here on May 28, 2004, on the official archive website of US news agency the Associated Press.", "The 45-second video’s title reads: “PM visits mosque in capital.”", "The first paragraph of the video’s description reads: “On the second day of his five-day trip to China, Malaysian Prime Minister Abdullah Ahmad Badawi visited Beijing's Nan Xia Po Mosque and took part in Friday prayers.”", "The same 45-second video was also published here on the official YouTube channel of Associated Press archives on July 21, 2015, with an identical title and description.", "Nanxiaopo Mosque is a mosque located in Beijing’s Chaoyang district.", "Below are screenshot comparisons of the misleading video (L) and the Associated Press footage from YouTube (R):", "AFP published a photograph here of the former Malaysian prime minister praying in Nanxiapo Mosque in Beijing on May 28, 2004.", "Below is a screenshot of the AFP photo:", "The AFP photo's caption reads: “Malaysian Prime Minister Abdullah Ahmad Badawi (2R) together with his minister Muhyiddin Yassin (3R), join the imams (religious teachers) of the Nanxiapo Mosque in Beijing 28 May 2004 for Friday prayers. Abdullah marked 30 years of diplomatic relations with China Friday by drumming up greater economic and trade ties while praising cultural links. AFP PHOTO/GOH CHAI HIN.”", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]