["The video was notably shared by Nigerian former presidential candidate Dele Momodu. His Instagram post has been viewed more than 69,000 times since it was published on May 21, 2020, along with the caption: “I don't know who or what to believe again. Too much confusion…”", "The same video was shared thousands of times on Facebook and viewed by tens of thousands of people across the world. It was also posted on Reddit, where it garnered more than 50,000 views, and shared via WhatsApp.", "At the start of the video, the woman is seen taking photos of signs outside the US store and addressing a man who appears to be an employee. She then tells another person who is off-camera that the store's policy requiring people to wear face masks violated the Americans with Disabilities Act (ADA).", "“it is against the law to make you wear a mask -- the ADA tells them that you cannot make people wear masks, it's not in our laws at all.”", "The ADA prohibits discrimination against people with disabilities in several areas of public life. However, it does not dictate whether businesses can impose safety measures like wearing masks due to the health risk brought on by the pandemic.", "Portions of at least 39 US states, according to a CNET count in late May, have made wearing face masks in public places mandatory, empowering stores to turn back patrons not willing to adhere. New York governor Andrew Cuomo signed an executive order that allows stores to turn back people who do not wear masks, arguing they can jeopardise their own health but not that of others.", "People have a right to jeopardize their own health (I don’t recommend it).\n\n\t\tPeople don’t have a right to jeopardize other people’s health. https://t.co/kBBAex72W3", "Meanwhile, the US Equal Employment Opportunity Commission, one of the agencies tasked with providing guidance about the ADA, stated in its pandemic guidance that the act does \"not interfere with employers following advice from the CDC (Center for Disease Control and Prevention) and other public health authorities on appropriate steps to take relating to the workplace\".", "The CDC recommends that people “wear a face covering to help protect others in case you’re infected but don’t have symptoms”. It adds that the mask should be kept “on your face the entire time you’re in public”.", "The woman in the video claims that wearing a mask makes you breathe in toxic air and carbon monoxide, thereby making yourself sick. “Seriously, think about it, you are breathing out your toxic air, and you are breathing in the same air. You are getting sick, you are making yourself sick,” she said.", "AFP Fact Check has debunked similar claims made about the topic, including here, here and here.", "Vinita Dubey, associate medical officer of Health at Toronto Public Health, told AFP Fact Check on June 3, 2020 that the “prolonged use of a face mask... has not been shown to cause carbon dioxide toxicity in healthy people. If CO2 slowly builds up in the mask over time, the levels are low and mostly tolerable.”", "Claim: Wearing masks hurts immune system", "This claim was also made in the viral \"Plandemic\" video, which AFP Fact Check debunked here.", "Dr Shelley Payne, who runs the LaMontagne Center for Infectious Disease at the University of Texas at Austin, told AFP “there is no evidence that masks or gloves reduce the normal microbiota or predispose people to opportunistic infections.”", "While the presence of the microbiota is important to development of the immune system early in life, and does indeed provide protection against some opportunistic pathogens, “the microbiota does not disappear when gloves or a mask is worn, and it is not necessary to be exposed to additional microbes in the environment to maintain the microbiota.”", "The woman in the video also says that masks “would not protect you from COVID-19”. But multiple studies have shown that the use of masks can protect populations from COVID-19, including a recent publication by the UK's Royal Society, which indicated that masks reduce droplets dispersal.", "The CDC also advises that while the use of cloth face masks may not protect the wearer, it may slow the spread of the virus and help asymptomatic carriers from transmitting it to others.", "The World Health Organization (WHO) says masks “are effective only when used in combination with frequent hand-cleaning with alcohol-based hand rub or soap and water”.", "Experts have also told AFP Fact Check that it is better if everyone wears a mask in order to limit onward spread.", "AFP Fact Check has addressed several other misleading claims about the use of face masks, available here, here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]