["The 11-second video clip was posted in this Facebook post on November 23, 2020.", "It has been viewed more than 58,000 times and shared some 2,220 times.", "The clip shows a group of people waving BJP flags from the roof of a bus while chanting.", "The post’s caption reads: “Bjp flag in pakistan occupied kashmir.”", "Kashmir has been divided between India and Pakistan since their angry separation in 1947. It has been a cause of two of their three wars since then. Both countries claim the whole of the Himalayan region, where India is also fighting an insurgency that has left tens of thousands dead since 1989.", "On November 13, Indian and Pakistani forces waged their biggest artillery battle of the past year, leaving more than 13 dead and dozens wounded on both sides of their disputed Kashmir frontier, officials said. This AFP report gives details of the developments.", "The same video was also shared here and here on Facebook alongside a similar claim.", "However, the claim is false.", "A keyword search found a longer version of the video published on the Jammu and Kashmir chapter of India’s Bharatiya Janata Party (BJP) here. The caption states the video was filmed in Jammu and Kashmir.", "The post’s caption reads: “#DDCElections #JKWithBJP Visuals from #JammuKashmir clearly indicates the love and affection of the people as well as their rock-hard faith on the leadership of PM Narendra Modi Ji.”", "Below is a screenshot comparison of the misleading Facebook post (L) and the original post (R ):", "A closer analysis of the video also found that Karan Travels is a bus service which operates in India.", "Below is a screenshot comparison of the misleading Facebook post (L) and the bus service webpage (R ) pointing out the name of the bus company which operates in India.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]