["An image of a man escorted by the police has been shared on Twitter and Facebook with the claim that he is the juvenile convict in the 2012 Nirbhaya rape case. Twitter handle @Tiwari_Sintu999 shared this image. (archive link)", "2012 निर्भया रेप का अपराधी मोहम्मद अफरोज अब बालिग हो गया है क्या अब उसको फांसी होनी चाहिए❓ Yes से आवाज़ उठाए 😡🚩 pic.twitter.com/0V47c09H5p", "— Sintu Tiwari🇮🇳 💯🚩% FB (@Tiwari_Sintu999) October 7, 2020", "The same image was posted on Facebook group Love Jihad on October 12.", "Another Twitter user shared a graphic featuring SP leader Akhilesh Yadav along with the same claim. The text ascribed to Yadav says, “Most Muslims are less educated. Due to their imprudence, they commit mistakes like rape. They are not criminals.” (archive link)", "2012 निर्भया रेप का अपराधी मोहम्मद अफरोज अब बालिग हो गया है अब उसको फांसी होनी चाहिए ? yes से आवाज़ उठाए 😡😡😡", "टोटी चोर 🙄 रिश्तेदार का बचाव कर रहा !!!", "ये लोग क्या बहन बेटी या देश की रक्षा करेगे🙄😏😡😡👇👇 pic.twitter.com/HpdmIt8aV0", "— 🅰️ru राजgor T.A.B 🇮🇳🧡 (@GorAruna) October 7, 2020", "The man wearing a white T-shirt in the viral image is indeed one of the convicts in the December 2012 Delhi gang-rape case. However, he is not the juvenile convict. The man in the image is Vinay Sharma. In December 2019, another image of Vinay Sharma was circulated on social media as the juvenile convict. A report published by The New Indian Express on February 2020 carried the image of Sharma now viral. According to this article, Sharma’s plea seeking treatment for ‘insanity’ was dismissed by a Delhi court.", "“Four men convicted of the notorious gang rape and murder of a student in the Indian capital Delhi in 2012 have been executed. Mukesh Singh, Vinay Sharma, Akshay Thakur and Pawan Gupta were hanged on the premises of the Tihar jail. Courts convicted six people for the rape and murder of a 23-year-old physiotherapy student in a moving bus.” stated a report by BBC published on March 20. The report also informed that one who was a juvenile at the time of committing rape was released in 2015 after serving three years in a reform facility. The sixth convict died in jail.", "False statement ascribed to Akhilesh Yadav", "A Google search with the verbatim text attributed to the former Uttar Pradesh Chief Minister yielded no results. Lack of media reports on a remark this controversial points to its falseness.", "Donate Now", "Kinjal Parmar holds a Bachelor of Science in Microbiology. However, her keen interest in journalism, drove her to pursue journalism from the Indian Institute of Mass Communication. At Alt News since 2019, she focuses on authentication of information which includes visual verification, media misreports, examining mis/disinformation across social media. She is the lead video producer at Alt News and manages social media accounts for the organization.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]