["The post from February 4 compares the image of a derogatory Sambo-like character dressed in Mickey Mouse clothing with another showing the popular Disney cartoon mouse, and is captioned: “RACISM..Mickey mouse was a remake of a character named jigaboo who was made to mock black people..And I use to like Mickey Mouse smh (shaking my head)”.", "The post elicited a string of comments referencing widespread allegations that Disney, who died in 1966, was a racist and anti-Semite.", "But a reverse image search of the caricature used in the Facebook post leads to a 1994 painting by African-American artist Michael Ray Charles titled \"(Forever Free)\".", "Charles’ work unpacks racial stereotypes drawn from American history and the advertising industry, as shown in his other artworks, which could explain the likeness to Mickey Mouse.", "In “(Forever Free)”, Charles appears to draw from children’s book Little Black Sambo and its lead character Sambo.", "Sambo is used as an offensive reference to black people and “jigaboo” is also an old racial slur once used to refer to African-Americans. The word resurfaced in 2015 when Fox 8 news anchor Kristi Capel had to apologise for using the word to describe a performance by the pop star Lady Gaga.", "@John_Ferguson_ @fox8news I apologize if I offended you, I had no idea it was a word or what it meant. Thank you for watching.", "A blog entry on the Walt Disney Family Museum website says that in 1948, Walt Disney wrote an essay in which he described how the famous mouse came to be:", "“He popped out of my mind onto a drawing pad 20 years ago on a train ride from Manhattan to Hollywood at a time when the business fortunes of my brother Roy and myself were at lowest ebb, and disaster seemed right around the corner,” wrote Disney.", "His daughter and founder of the museum, Diane Disney Miller, is also quoted in the blog post: “It was on that long train ride that dad conceived of a new cartoon subject, a mouse who was then refined and further developed by Ub Iwerks, and given his name by my mother.”", "While it’s wrong to say that Mickey was inspired by a racist character called Jigaboo, numerous film historians have suggested that Mickey Mouse and other early American cartoon characters were influenced by 19th century minstrel performers. The minstrels, who painted their faces black and lips red in mockery of people of African descent, wore white gloves, like Mickey.", "Film-lovers have long debated whether or not Walt Disney was racist or anti-Semitic. Critics have long argued that some of his company’s early cartoons perpetuated racist stereotypes, including \"Song of the South\", a 1946 film considered so controversial that Disney has never released it for home purchase in the US. Other critics have complained that the 1933 film \"Three Little Pigs\" perpetuated anti-Semitic stereotypes.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]