["Social media posts claim the US Centers for Disease Control and Prevention was adding Florida flu and pneumonia cases to COVID-19 figures, but slashed the state’s case count following an order that bypassed the CDC and sent coronavirus patient data to the White House. This is false; the CDC said there have been no major revisions to Florida case numbers, and that the information rerouted to a central database by President Donald Trump’s administration is unrelated to case surveillance or death counts.", "A July 21 tweet from unsuccessful Republican congressional candidate DeAnna Lorraine is featured in several of the posts: “So, now that Trump has said hospitals need to report numbers to WH instead of the CDC, the CDC just came out & said they made another ‘mistake’ in FL; And they've also been counting Pneumonia and Flu as Covid-- dropping their # from approx 90,000 to 11,000. So many ‘mistakes,’ huh?”", "Similar posts are available on Facebook here, here and here and on Instagram here and here.", "In a follow-up tweet, Lorraine offers as evidence anecdotes about three misclassified deaths, and two additional false or misleading claims, which AFP has debunked here and here.", "Chief of Mortality Statistics Bob Anderson, of CDC’s National Center for Health Statistics, told AFP by phone that there have been no systematic COVID-19 case or death reporting errors or revisions in Florida that he is aware of.", "The Florida Department of Health office of communications told AFP by email that Florida cases are reported when “COVID-19 is listed as the immediate or underlying causes of death or listed as one of the significant conditions contributing to death.”", "They are also reported if a Florida resident had a confirmed COVID-19 infection within 30 days of their death and cause of death is not explained by alternative events like “trauma, suicide, homicide, overdose, motor-vehicle accident,” for example.", "“We’re not combining pneumonia deaths with COVID-19 deaths,” Anderson said. He clarified that while people can die of pneumonia they developed because of COVID-19, and both illnesses would be noted on their death certificate, their deaths are only counted once, as COVID-19.", "On July 17, Florida did report 11,000 new COVID-19 cases -- a figure mentioned in Lorraine’s tweet -- as the United States' virus caseload continues to grow at an explosive rate.", "USAFacts, a civic data organization partnered with the CDC to help provide COVID-19 information, does not indicate any major reduction in Florida’s cumulative case counts. In fact, cases are soaring along with deaths.", "Concerning the Trump administration order that hospitals report patient data directly to a central database, Anderson said it is a different data set and doesn’t affect the CDC’s case surveillance or death count.", "“They’re collecting information on ICU bed occupancy, ventilator use, hospital capacity, hospital staffing and supplies, and things like that,” Anderson said. The White House decided they could collect this data more efficiently through a new platform, he added.", "“They weren’t happy for whatever reason. I still don’t clearly understand why,” Anderson said.", "The process for reporting COVID-19 cases and deaths remains the same, since the CDC gets the information from state health departments, not the hospitals themselves, he said.", "The CDC notes that “death counts for earlier weeks are continually revised and may increase or decrease as new and updated death certificate data are received from the states by NCHS.” Anderson emphasized that it takes time for states to process death certificates, send them to NCHS, and for the agency to code them, so the listed totals lag behind the true count.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]