["About this rating", "In June 2020, an old episode of the reality courtroom show \"Judge Judy\" started to circulate online along with the claim that the plaintiff in the case was George Floyd, a Black man whose death while in policy custody in May 2020 sparked nationwide protests against police brutality and racial injustice:", "Postings of this video were frequently followed by derogatory comments about Floyd and the insinuation that his past deeds, such as (allegedly) the carjacking discussed in the video above, either justified his untimely death at the hands of a police officer or made him unworthy to be the centerpiece of nationwide protests.", "But the man named George Floyd in the above-displayed video is not the George Floyd who died in police custody in Minneapolis, Minnesota.", "For starters, the person in the \"Judge Judy\" video is identified as \"George Floyd IV,\" while the full name of the man who died in May 2020 was \"George Perry Floyd Jr.\"", "Second, the above-displayed episode of \"Judge Judy\" aired in 2010 and shows a 17-year-old who had been arrested in Chicago. That would make the \"Judge Judy\" George Floyd about 27 years old at the time of this writing. The George Floyd who sparked police brutality protests died on May 25, 2020, at the age of 46.", "We confirmed with CBS that this episode aired in 2010. Furthermore, we found a December 2009 news article that appears to be about the same carjacking incident, and a 2010 law blog post about Judge Judy that also mentioned this carjacking episode.", "In December 2009, NBC Chicago reported that a 17-year-old was arrested after he crashed a hijacked car. The Floyd in this article appears to be the same Floyd in the \"Judge Judy\" video. For example, in both instances, this person said that they stole the car because they were cold while walking home:", "A teen was ordered held on $250,000 bond Monday for allegedly carjacking and punching an off-duty Chicago Police officer Sunday night in the South Chicago neighborhood on the Southeast Side. He reportedly told police he did it because he was cold.", "George Floyd, 17, of the 8200 block of South Marquette Avenue, is charged with vehicular hijacking, aggravated battery to a peace officer and aggravated fleeing, according to police. All the charges are felonies.", "[...]", "Floyd allegedly told police, “I was walking home and I was very cold. I didn’t want to walk home,’’ the officer said.", "The website Legal As She Is Spoke also wrote about this episode in September 2010:", "Even those unfamiliar with her show got to witness Her Honor in action when, in a clip shown to the audience, Judge Judy issued a ruling in a carjacking case in which a 16-year-old defendant threw a woman from her car and drove off. His excuse? He “was cold,” he said, expressing little remorse for his actions, Judge Judy spoke directly to the teen’s father who looked as if he’d given up on taking responsibility for his son. She also addressed the defendant’s previous infractions and sentenced the minor to additional hours working for his father, thereby preventing him from concentrating on his “personal life” to which he attributed his poor work ethic.", "The above-displayed video shows a person named \"George Floyd IV\" on an episode of \"Judge Judy.\" But this is not the same George Floyd who died while in police custody in May 2020. You can read our in-depth analysis of George Floyd's actual criminal history here.", "Rindenau, Jason.   \"An Afternoon with Judge Judy.\"\r\n    Legal As She Is Spoke.   30 September 2010.", "NBC Chicago.   \"Cop Carjacker: “I Didn't Want to Walk Home.\"\r\n    7 December 2009.", "Ussanews.   \"MUST WATCH VIDEO: George Floyd Getting Schooled at Age 16 by Judge Judy for Carjacking and Assaulting a Woman! (Dumb as a Brick)!.\"\r\n    15 July 2020.", "Updated [15 July 2020]: Updated with confirmation from CBS.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]