["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Last week marked the anniversary of Gov. Rick Perry’s oft-quoted Texas-can-secede comments after a tea-party rally outside Austin’s city hall. Coincidentally, the Texas Tribune and Newsweek interviewed Perry in his Capitol office on April 15 and the opening back and forth between editor Evan Smith and Perry touched on what the governor said about secession the year before.", "\"I always like to try to clear that up,\" Perry tells Smith. \"It was asked as a, you know, what do you think about the people who shout out the word 'secede.' And I say that we live in an incredibly wonderful country and I see absolutely no reason for that to ever happen…\"", "We wondered if Perry accurately recaptured his 2009 remarks.", "Perry's office didn't respond to our inquiry. Next, we turned to the original exchange as recorded by Kelley Shannon, Austin correspondent for the Associated Press. She spoke to him shortly after Perry spoke at the rally. (The audio and a transcript are fetchable from the \"About this statement\" section of this article, to the right.)", "According to the recording, Shannon initially asked if he thought the gathering reflected a national movement. Perry answered that it could be and that people feel strangled by spending and taxation; they want help.", "Shannon then asked Perry about some associating him with the idea of secession or sovereignty for Texas. Perry gave a 40-second reply, which we transcribed and provide here.\n\n\"Oh, I think there’s a lot of different scenarios,\" Perry said. \"Texas is a unique place. When we came in the union in 1845, one of the issues was that we would be able to leave if we decided to do that.", "\"You know, my hope is that America and Washington in particular pays attention. We’ve got a great union. There is absolutely no reason to dissolve it. But if Washington continues to thumb their nose at the American people, you know, who knows what may come out of that? So. But Texas is a very unique place and we’re a pretty independent lot to boot.\"", "Perry next fielded a question from someone else about whether Texas might now be considered a natural terorrist state — no, Perry said — and the less than three-minute question-and-answer period ended.", "At the time, Perry’s comments were widely interpreted as indicating the Republican governor believed secession could legally occur; he subsequently did not back down from that conclusion.", "However, a constitutional expert advised at the time that the Civil War long ago vanquished secession as a legal option.", "Sanford Levinson, a professor at the University of Texas School of Law, said within the Texas Constitution, the U.S. Constitution and the Joint Resolution Annexing Texas to the United States of 1845, there is no explicit right for the state to return to its days as a Republic. Levinson said there is \"no possibility whatsoever that the United States or any court would recognize a 'right' to secede.\"", "Levinson noted that the 1845 resolution allows for Texas to break into five new states, and it doesn’t specify whether that would require congressional approval. But, he said, that's distinct from secession.", "In looking back at his 2009 comments, Perry told Smith that at the time he was focusing on economics -- \"people’s concern and anger about what this administration is doing from an economic standpoint in particular and the long-term debt that was being created for not only them but for future generations.\"", "All in all, does Perry accurately revisit his original comments on secession that day?", "For the most part, yes. However Perry doesn't get to his assertion that Texas has the right to secede or his speculation about \"who knows what may come\" from people angry about actions in Washington.", "We rate Perry’s statement as Mostly True.", "The Associated Press, audio file, Gov. Rick Perry answering reporter Kelley Shannon's question about secession, April 15, 2009, prepared for posting by Jennifer Jones, Austin American-Statesman, and transcript by W. Gardner Selby of PolitiFact Texas, created April 20, 2010", "Austin American-Statesman, Postcards, Texas government and politics blog, \"Could Texas secede? Scholar says no,\" April 16, 2009, accessed April 22, 2010", "The Texas Tribune, \"A Conversation With Rick Perry,\" April 15, 2010 (posted April 18, 2010)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]