["By Robert Farley", "Posted on January 30, 2020", "Democratic presidential candidate Pete Buttigieg blamed tax cuts backed by President Donald Trump for creating the nation’s debt problem. But while the Congressional Budget Office says those tax cuts are worsening the nation’s debt, spiraling deficits and debt over the next decade were projected even before those tax cuts were enacted.", "Buttigieg’s comments came during a Jan. 28 town hall event in Ottumwa, Iowa, in response to an audience question about what he would do to protect Medicaid and Social Security.", "Buttigieg argued that in the face of soaring debt, Trump “would have us believe we’ve got no choice but to stop investing in education, infrastructure, health care, you name it, and even to cut Medicaid or Medicare or Social Security.”", "(Trump’s proposed budgets have regularly called for spending cuts to domestic programs, including education and infrastructure, though Congress largely has ignored those requests. As for potential cuts to Social Security and Medicare, Democrats criticized Trump for recently saying he would “take a look at” spending on “entitlements” such as Social Security and Medicare. Trump later tweeted that he would “save” Social Security, although he has offered no plan to do so.)", "“But how did we get into this debt?” Buttigieg said at the Iowa town hall. “It’s not the result of some mysterious, cosmic force that nobody could have prevented. It’s the result of giant tax cuts on corporations and the wealthy. I think it’s time for my party to get back on top of owning the issue of the debt, because it seems like we’re the only ones prepared to actually do something about it.”", "Asked for backup, the Buttigieg campaign pointed to two articles that noted Trump’s corporate tax cuts have added to the nation’s budget deficits and rising debt. That’s true.", "As we have written, the Congressional Budget Office says the Tax Cuts and Jobs Act, a Republican-crafted tax bill that Trump signed into law on Dec. 22, 2017, is adding to rising deficits. As Buttigieg said, the law slashed the top corporate tax rate from 35% to 21%. It also included a number of individual income tax cuts, and while most Americans at all income levels got a tax break, if those cuts are allowed to expire by 2027, it’s true that most of the benefits in later years would disproportionately go to the wealthiest Americans.", "Some Republicans argued that the tax cuts would pay for themselves — that lost revenue from tax cuts would be offset by a boost to the economy — but that hasn’t happened.", "According to a Congressional Budget Office analysis in April 2018, the budget deficit for fiscal year 2018 was about $242 billion higher than CBO had projected the year before. About $163 billion of that additional deficit came as a result of the TCJA, CBO said. Over 10 years, the tax cuts were expected to add a cumulative $1.7 trillion to yearly deficits.", "Still, the tax cuts aren’t entirely to blame for the higher-than-projected deficits under Trump.", "As the CBO analysis indicates, while about two-thirds of the additional deficit in FY2018 was tied to the tax cuts, additional spending —  particularly on defense — also played a role. According to an analysis by the Committee for a Responsible Federal Budget published on Dec. 31, the 2017 tax cuts combined with increased spending will more than double deficits in the next two years.", "But it’s also important to note that deficits were expected to rise dramatically over the next decade even before the tax cuts were proposed.", "After the deficit hit a record-high $1.4 trillion in fiscal year 2009 during the Great Recession, yearly deficits under President Barack Obama declined markedly for several years. In fiscal year 2015, the deficit was $438 billion, a drop of 69% from fiscal 2009.", "But, as we wrote in our final installment of Obama’s Numbers, deficits were again on the rise as Obama left office.", "At around the time Trump took office in January 2017, CBO estimated that the deficit for fiscal 2017 would increase to $559 billion. At the time, the CBO also projected that under then current law — nearly a year before Trump signed the tax cut legislation — annual deficits would again exceed $1 trillion in 2023 and beyond. At that time, the CBO projected that federal debt owed to the public would reach nearly 79% of gross domestic product in 2020, and 90% in 2027.", "By July 2017, CBO had revised its deficit projection for fiscal year 2017 upward to $693 billion without the tax cut law, which was months away from becoming law.", "As we said, the Trump tax cuts have added to those projected deficits. The most recent budget projection from CBO, published on Jan. 28, presents an even more dire picture of rising deficits and public debt than the projection did last year.", "CBO, Jan. 28: In CBO’s baseline, after accounting for all of the government’s borrowing needs, debt held by the public rises from $17.9 trillion at the end of 2020 to $31.4 trillion at the end of 2030 (see Table 1-2). As a percentage of GDP, that debt would increase from 81 percent at the end of 2020 to 98 percent by the end of the projection period. At that point, such debt would be the largest since 1946 and more than twice the average over the past 50 years.", "The outlook beyond the next 10 years “is daunting,” CBO said. “By 2050, debt is projected to reach 180 percent of gross domestic product (GDP), far higher than any percentage previously recorded in the United States and on track to grow even larger.”", "The tax cuts enacted by Trump are contributing to that debt, but less and less as a percentage over time. As the Committee for a Responsible Federal Budget explains, that’s because “a large portion of the tax cuts are scheduled to expire and spending on health and retirement programs will continue to outpace revenue.”", "“Near-term deficits are driven in large part by legislation enacted since 2015 and especially since 2017 [including the TCJA but also higher spending bills]” Marc Goldwein, senior vice president and senior policy director at the Committee for a Responsible Federal Budget, told us via email. “But long-term debt will continue to rise regardless due to the growing costs of health and retirement costs and the lack of revenue to finance those costs. Even if we reverse all the tax cuts and spending increases enacted since 2015, we’ll still have to do more to put the debt on a sustainable long-term trajectory.”", "To that end, we should note that Buttigieg has suggested raising the cap on earnings that are subject to the Social Security payroll tax. Currently, the Social Security tax is imposed on earnings up to $132,900.", "At an AARP candidate forum this past July, Buttigieg said Social Security isn’t sustainable “without some adjustments” to the program. “For example, if we just elevated the cap on the level of income eligible for payroll taxes from $135,000 to the $250,000 neighborhood that would go a long way toward sustainability,” he said.", "The Buttigieg campaign describes the candidate’s plan to increase Social Security payroll tax revenue this way: “Individual wage earnings above $250,000 (which means family wage earnings above $500,000 for equal-earning couples) will face additional Social Security taxes and earn modest Social Security benefits for their extra contributions. Individuals earning less than $250,000 will not be affected.”", "We take no position on Buttigieg’s Social Security plan, and he has a point that the tax cuts signed into law has added to federal deficits. However, he goes too far when he says the debt is “the result” of Republican tax cuts.", "Updated, Jan. 30: We added some details on Buttigieg’s plan to increase Social Security payroll tax revenue.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]