["Rep. Dennis Kucinich often decries the pay gap between America’s top earners and the growing poverty class.\n\nHe recently took to the stump after the U.S. Census Bureau released a new report on poverty, using it as a chance to promote safety net programs and his National Emergency Defense Act, which calls for investing in infrastructure and folding the Federal Reserve into the U.S. Treasury.\n\n\"The top 10 most well-paid CEOs in America received a combined $770 million in 2010, while the average American worker’s wage rose just 2 percent,\" he said in a news release.\n\nPolitiFact Ohio was intrigued. To think, these 10 CEOs are so gifted that they command compensation  — in a single year — that is the rough equivalent of the gross domestic product of Grenada.\n\nPut another way, if they pooled their annual pay for 2010 it would have exceeded:", "Heck, the CEOs’ collective booty totaled nearly one one-thousandth of the economic stimulus called for in President Obama’s $787 billion American Recovery and Reinvestment Act of 2009.\n\nSo PolitiFact Ohio decided to check it out.\n\nKucinich based his claim about the 10 highest paid CEOs on a survey produced annually by a group called GMI, which tracks corporate governance. We looked at a summary of the report and found it to be on the level. The total for the combined compensation of the 10 highest paid CEOs on its list was $770,046,373.\n\nJust to be clear, we note that the compensation these CEOs received was not all in the form of salary. Much of it came in the form of exercised stock options, deferred compensation and other benefits.\n\nBut to that, we say, so what? It is still compensation.\n\nAccording to the survey, the highest paid CEO on the list is John Hammergren of health care giant McKesson Corp. of San Francisco. He exercised $112 million in stock options while getting a boost of $13.5 million in retirement benefits. His salary was but a measly $1.6 million.\n\nAnd if he gets bounced from the company, he won’t be left wanting. If that were to happen, he stands to collect $469 million in severance pay.\n\nThe pay package didn’t sit well with GMI.\n\n\"Shareholders understand and expect that extraordinary compensation must be linked sufficiently to extraordinary performance,\" said GMI’s chief communications officer Paul Hodgson in a written statement. \"For that reason, they are increasingly frustrated about these clear failures of compensation governance.\"\n\nGMI also pointed out that in 2010, the total realized compensation for CEOs in the Standard & Poor’s 500 rose by a median of 36.5 percent.\n\n\"The 36.5 percent increase in realized compensation is particularly notable when it’s put in context of the modest growth of the economy in 2010 and general public company performance last year,\" Hodgson stated.\n\nKucinich’s staff provided a table from the Census Bureau to support the part of his claim about wage growth for average American workers.\n\nIt states that total compensation for civilian workers rose 2 percent in 2010. If just wages and salaries are included, the percentage drops to 1.6 percent.\n\nSo, on this point, Kucinich’s statement is pretty close. We note, though, that his statement used the word \"wage\" to describe the 2 percent increase. The 2 percent figure from the Census Bureau includes total compensation. But the real figure -- 1.6 percent -- would only strengthen his point.\n\nPolitifact Ohio is not trying to stoke the fire of class warfare by pointing out how much certain CEOs made in a year compared with the average worker. We’ll let Kucinich take the hit for that.\n\nBut as to his claim about the vast difference between the haves and the have-nots, he is pretty much on target.\n\nOn the Truth-O-Meter, we rate Kucinich’s claim True.", "Office of Rep. Dennis Kucinich, news release \"Kucinich: Poverty Numbers ‘a State of Emergency’,\" Dec. 15, 2011\n\nGMI, 2011 CEO pay survey\n\nGMI, news release \"GMI Pay Survey Reveals Real CEO Compensation at Big Firms Rose 36% in 2010,\" Dec. 15, 2011\n\nU.S. Census Bureau, supplemental poverty report\n\nBureau of Labor Statistics, \"Private industry compensation costs increase 2.1 percent in 2010,\" Feb. 1, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]