["In the morning of February 27, reports emerged from Pakistan that their air force had shot down two Indian Air Force aircraft on the Pakistani side of the LoC. “PAF shoots down two Indian aircraft inside Pakistani airspace; one pilot arrested”, read the headline of an article published by the leading Pakistani daily, Dawn. A photo of crashed aircraft surrounded by people was also provided with the article.", "Iran’s Press TV also published the same report with an identical photo. The tweet by Press TV now stands deleted.", "ARY News has also reported the ‘news’ using the same image.", "India Today’s Aaj Tak published a report titled – “Pak claims – two Indian aircraft shot down, 1 pilot arrested alive” – using the same image. The caption below the photograph claims ‘MiG plane crash’. Aaj Tak has now changed the image, but an archived version of the article can be seen here.", "Alt News found that the image of the aircraft which is claimed to have crashed near the LoC in Pakistan is three years old. A simple Google search of the image shows that it pertains to an Indian Air Force fighter trainer aircraft that had crashed in Mayurbhanj district of Odisha in 2015.", "“Since the Hawk A-3492 crashed in a paddy field about 200 metres from human habitation around noon, there were no reports of any civilian casualties or loss of property. The incident took place at Kudarsahi village under the Bisoi police station limit in Mayurbhanj district.”, stated an article published by The Hindu on June 3, 2015. Moreover, it was also reported that the pilots had ejected out of the plane safely.", "An old picture of a trainer aircraft which crashed in 2015 was shared by Pakistani media as IAF aircraft shot down by PAF.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]