["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "As fires continue to blaze in Australia, images of animals caught in the devastation are being shared on Facebook.", "But many of these photos, like this one of a badly-burned house cat that was shared on Jan. 4, are not from this season’s fires in Australia at all.", "On its own, the cat image is uncaptioned. But it was included in a viral post that displayed a collection of photographs supposedly from Australia’s bushfires. We rated that post Mostly False after finding that many of the images are several years old and weren’t even taken in Australia.", "The image was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "A reverse-image search reveals the photo isn’t from Australia, nor was it taken during the most recent fire season.", "The photo was taken by photojournalist Jane Tyska on Nov. 11, 2018, in Paradise, Calif., following destruction from the Camp Fire. The Camp Fire started in Northern California in early November 2018, and burned over 150,000 acres, destroyed thousands of residences and killed more than 85 people.", "Tyska’s caption on the burned cat image reads, \"A burned cat waits for animal control to arrive after they were called by responders who discovered it near Bille Road in Paradise, Calif., on Sunday, Nov. 11, 2018.\"", "This is a real image, but it was taken in 2018 and is not from Australia. For that reason, we rate it Mostly False.", "Facebook post, Jan. 4, 2020", "PolitiFact, Several photos of animals in viral post not from Australia fires, or this year, Jan. 7, 2020", "Tin Eye, reverse-image search, Jan. 7, 2020", "Enterprise-Record, Photos: Fire-singed animals suffer in Paradise Camp Fire, Nov. 11, 2018", "The Sacramento Bee, Camp Fire death toll reaches 86 after man dies in hospital; 3 remain missing, Dec. 11, 2018", "Washington Post, The deadliest, most destructive wildfire in California’s history has finally been contained, Nov. 26, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]