["On June 9, The Times on India shared a one-minute video that shows a police officer pinning down a woman, carrying a child, with brute force in broad daylight. Without mentioning when the incident took place, the news outlet claimed that the video is from China (archive).", "Several Facebook and Twitter users have also shared the video with the same claim. Twitter user @Ethirajans tweeted the video along with the text, “Meanwhile, This brutality in China is ignored by liberals, because, China has a guilt free pass.” Since then it has been retweeted over 9,000 times. (archive link)", "Meanwhile, This brutality in China is ignored by liberals, because, China has a guilt free pass. pic.twitter.com/AzKY309X9N", "— Ethirajan Srinivasan (@Ethirajans) June 7, 2020", "Alt News has received several requests to fact-check the video on WhatsApp (+917600011160) and on our official Android application.", "Using InVid, a video verification tool, Alt News performed a reverse image search of one of the keyframes of the video and found multiple media reports dating back to 2017.", "The video was uploaded by Chinese broadcaster CGTN on YouTube on September 1, 2017.", "“A disturbing video involving a police officer and a woman has been circulating over the Internet. In the video, which was filmed in Shanghai on Friday, a woman was holding a toddler as she argues with the officer. She pushes the policeman who in return throws her to the ground. She falls and the child hits the pavement hard. A police statement said the argument started because of a parking violation. The police officer has been suspended from all duties. The child and woman were sent to [the] hospital and did not suffer any serious injury,” read the video’s YouTube description.", "Arab News reported that the incident took place on September 1, 2017, when a Shanghai police officer Zhu issued a ticket for illegal parking to Zhang. The report added that Zhu was let off with a warning about his conduct which meant his promotion and salary were stalled for 18 months. The same was reported by Shine.", "Thus the social media claim that the incident occurred in China is true. However, this incident occurred in 2017. Mainstream media outlet also reported on the incident, giving the impression that it is recent.", "[Update: The report by The Times of India was added to this fact-check on June 10, 2020. The article and it title have been accordingly altered.]", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]