["About this rating", "On 7 December 2016, the Facebook page \"American President Donald J. Trump\" shared a video claiming that it shows a Muslim man slapping a Christian woman\"", "Muslim man slaps a Christian female teacher at school when his girl says there's blasphemy in classroom. Other men just watch.", "The incident shown in this video (a higher quality version is included below) is real, but this footage has nothing to do with Islam and little to do with Christianity.", "This video has been online since at least 2014, when it was posted to the web site LiveLeak.  It shows Alexander Shevtsov, the leader of what is apparently a Russian cult. There are several videos of Shevtsov leading his \"classes\" in which he hits his students on a regular basis:", "While the exact context of this footage is still unclear, it appears that the incident took place during one of Shevtsov’s lectures at his \"Academy of Self-Knowledge.\" The program, according to aplinkkeliai.lt, is a mixture of magic, martial arts, psychology, and includes a \"cleansing of the soul\" (similar to an exorcism) which may be what is depicted above:", "In many cases it borders on the folk magic rites. A special role is assigned to boasting as a means to set an ideal goal and stimulate spiritual concentration need for achieving it.", "Kresenie is essentially “burning out” (dulit, дулить) of evil influences which infected the soul from outside, or, simply speaking, possession (oderzhanie, одержание). These influences, or porcha, as well as various auto-generated obstacles (gamukha, гамуха) must be “burnt” just like the litter in Russian peasant’s house had to be burnt in the oven. There exist malicious fixations that can, so to say, mentally imprison a person (so called zapadki, западки which were imagined as a bulb in the steam – para, пара), or some malicious being which dwells in our memory (larva), or deeply rooted resentments having big extensions in the external world, spaces of hard feelings (kosmy, космы) etc.", "Shevtsov, who came to be called the \"Slapping Preacher,\" was arrested in 2015 for creating an organization associated with violence against women and children:", "While the full context of the video is not available, it is clear given the video's history and context that claims that it shows a \"Muslim man\" slapping a \"Christian woman\" was made up from whole cloth.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]