["About this rating", "A photograph purportedly showing Pope Francis' dour mood during a visit with President Trump went viral on 24 May 2017 after social media users compared it to a second image of the Pope smiling during a previous visit with President Obama:", "The image of Trump and the Pope was also compared to images of Pope Francis with other world leaders:", "Pope Francis with different heads of state during their visits at the Vatican.", "Something seems...different ? pic.twitter.com/JiyVTs014G", "— Cassie Dagostino (@casatino) May 24, 2017", "These photographs are all genuine. However, the idea that the images prove that the Pope enjoyed visiting Obama and other world leaders more than Trump doesn't hold water. The images shown above were chosen to paint Trump in a negative light. One could select other images, however, to illustrate the exact opposite. For example, here's an image showing the Pope smiling with President Trump next to an image of the Pope frowning with President Obama:", "Furthermore, Evan Vucci, the Associated Press photographer who took the viral photograph of Trump with a frowning Pope Francis, told TIME that although this particular image doesn't show the Pope smiling, he wasn't in an unusually bad mood during the photo-op:", "Evan Vucci, the Associated Press photographer who made this picture, recalled the rapidly unfolding scene in a phone call on Wednesday. \"It happens so fast, like a pool spray at the White House,\" he tells TIME.", "Vucci was among six photographers who got into the room. The group was first ushered in to photograph Trump and Francis as they sat across from one another at a desk, then back out so the pair could meet. About a half hour later, they returned for more pictures. \"We were instructed to stay behind the gift table. It's packed and everyone is jostling for position,\" Vucci says. \"They're shaking hands, [Trump's] introducing the delegation. Then they do this big group photo.\"", "[...]", "This is just one image, from one click of the shutter, during a moment when hundreds of pictures were made. For Vucci, a veteran political photojournalist, his work is all about honesty. \"I'm trying to be as fair as possible, that's my job,\" he says. \"And where people take it, it's up to them.\"", "It's possible that Pope Francis truly did enjoy meeting President Obama more than President Trump (or vice versa). However, this viral comparison does not offer proof of any kind.", "Katz, Andrew.   \"The Story Behind the Viral Photo of Pope Francis and Donald Trump.\"\r\nTime.   24 May 2017.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]