["President Donald Trump sits for an interview with Fox News' Chris Wallace. The interview aired on July 19, 2020. (Screenshot)", "• The United States doesn’t have one of the world’s lowest mortality rates from the coronavirus. No fewer than 15 advanced, industrialized nations currently have a lower mortality rate, as do a host of other countries, including Brazil, Mexico, South Africa, Russia, Turkey, Argentina, and India.", "• Another measurement called the case-fatality rate, which Trump incorrectly referred to as the “mortality rate,” also doesn’t place the United States at or near the bottom internationally.", "President Donald Trump defended his performance in fighting the coronavirus during an interview with Fox News’ Chris Wallace, insisting that the mortality rate from COVID-19 in the United States is among the world’s lowest.", "In the interview that aired July 19, Wallace and Trump were in the middle of a discussion about the coronavirus’ impact. Wallace said that \"we have the seventh-highest mortality rate in the world. Our mortality rate is higher than Brazil, it's higher than Russia and the European Union has us on a travel ban.\"", "Trump responded that \"when you talk about mortality rates, I think it's the opposite. I think we have one of the lowest mortality rates in the world.\"", "When Wallace fact-checked that characterization, Trump doubled down: \"I heard we had the best mortality rate. Number one low mortality rate.\"", "Trump is wrong.", "Neither the White House nor the Trump campaign responded to an inquiry for this article.", "Scientists define \"mortality rate\" as a measure of how frequently death occurs within a defined population. Data on this question is imperfect because of reporting inconsistencies between and even within countries. We turned to widely cited coronavirus data compiled by Johns Hopkins University to analyze Trump’s assertion.", "Specifically, we looked at the university’s calculations of COVID-19 deaths per 100,000 in population, which is a standard measurement of mortality rate.", "First, we compared the United States with other nations that have been hard-hit by the coronavirus. To do this, we looked at all nations that have recorded at least 100,000 confirmed cases.", "The United States has the sixth-highest mortality rate using this metric, behind the United Kingdom, Spain, Italy, Chile and France.", "But 16 hard-hit nations had a lower mortality rate: Peru, Brazil, Mexico, Canada, Iran, Colombia, Germany, South Africa, Russia, Saudi Arabia, Turkey, Qatar, Argentina, Pakistan, India and Bangladesh.", "We also looked at how the United States compared with its peers among advanced industrialized nations.", "In this comparison, six countries had higher mortality rates than the United States: Belgium, the United Kingdom, Spain, Italy, Sweden, and France.", "But 15 countries had lower mortality rates than the United States: Ireland, the Netherlands, Canada, Switzerland, Luxembourg, Portugal, Germany, Denmark, Austria, Finland, Norway, Japan, South Korea, Australia and New Zealand.", "By neither comparison is Trump close to correct.", "Mortality rate is strongly related to the age distribution in a country, said Brooke Nichols, a health economist and infectious disease mathematical modeler at the Boston University School of Public Health.", "\"The countries with the lowest mortality rates will probably end up being the ones with the younger population age structures,\" she said.", "When \"Fox News Sunday\" aired the interview, Wallace said the White House had been referring to the \"case-fatality rate\" rather than the mortality rate. (White House Press Secretary Kayleigh McEnany handed Trump a paper chart citing \"case-fatality rate\" during the interview.)", "The case-fatality rate is not the same as the mortality rate. The case-fatality rate shows how likely you are to die from the coronavirus if you are infected with it. The mortality rate shows how common it is to die of coronavirus in a particular population, such as a country.", "Trump’s point about the U.S. is not more accurate when looking at the case-fatality rate compared with other countries.", "Nine countries have a higher case-fatality rate than the United States. One country, Peru, has an equal rate and 11 have a lower rate: Colombia, Chile, Turkey, India, Pakistan, Argentina, Russia, South Africa, Bangladesh, Saudi Arabia and Qatar.", "Nichols said that the younger populations of many developing countries helps explain why their case-fatality rates are lower than that of the United States. (Infected patients who are younger and, often, healthier tend to die at lower rates from the coronavirus.)", "And when you compare the United States with its industrialized peers, seven countries have a lower case-fatality rate: Austria, Portugal, Norway, South Korea, Luxembourg, New Zealand and Australia.", "Nichols said that the U.S ranks relatively low on this measure because, despite its problems rolling out testing, it still handles more tests per capita than most other comparable countries.", "Trump said, \"We have one of the lowest mortality rates in the world\" from coronavirus.", "The United States doesn’t have one of the world’s lowest mortality rates from the coronavirus: No fewer than 15 advanced, industrialized nations currently have a lower mortality rate, as do a host of other countries, including Brazil, Mexico, South Africa, Russia, Turkey, Argentina, and India.", "Another measurement called the case-fatality rate, which Trump incorrectly referred to as the \"mortality rate,\" doesn’t place the United States at or near the bottom internationally.", "We rate the statement False.", "Donald Trump, interview with Fox News’ Chris Wallace, July 19, 2020", "Johns Hopkins University, \"Mortality Analyses,\" accessed July 20, 2020", "Johns Hopkins University, \"How Does Testing in the U.S. Compare to Other Countries?\" accessed July 20, 2020", "Centers for Disease Control and Prevention, \"Principles of Epidemiology in Public Health Practice, Third Edition: An Introduction to Applied Epidemiology and Biostatistics,\" accessed July 20, 2020", "Email interview with Brooke Nichols, health economist and infectious disease mathematical modeler at the Boston University School of Public Health, July 20, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]