["By Eugene Kiely and Robert Farley", "Posted on September 10, 2018", "In a pair of tweets, President Donald Trump pushed back at former President Barack Obama for taking partial credit for the post-recession economic recovery. But, in doing so, Trump got the facts wrong:", "The president and former president have exchanged some words lately about who is responsible for the post-recession economic recovery. It started when Obama, in remarks on Sept. 7 in Illinois, said, “let’s just remember when this recovery started.”", "“I mean I’m glad it’s continued, but when you hear about this economic miracle that’s been going on, when the job numbers come out, monthly job numbers, and suddenly Republicans are saying it’s a miracle,” Obama said. “I have to kind of remind them, actually, those job numbers are the same as they were in 2015 and 2016.”", "Three days later, Trump tweeted a quote that he claimed a skeptical Obama made about the growth in the gross domestic product.", "“President Trump would need a magic wand to get to 4% GDP,” stated President Obama. I guess I have a magic wand, 4.2%, and we will do MUCH better than this! We have just begun.", "— Donald J. Trump (@realDonaldTrump) September 10, 2018", "We could not find that quote or any quote of Obama using the term “magic wand” to describe Trump’s ability to grow the economy by 4 percent.", "We did find that Obama used the term “magic wand” at a June 1, 2016, “PBS NewsHour” town hall meeting in Indiana. But Obama was referring to Trump’s promise to bring back “some of those jobs of the past.” Instead, Obama said, the next president needed to focus on job training for “jobs that are coming in now.”", "Obama, June 1, 2016: Now, the good news is that there are entire new industries that are starting to pop up and you’re actually seeing some manufacturers coming back to the United States because they’re starting to realize, “You know what? Energy prices are lower here, workers are better here, this is our biggest market. And so even though we off-shored and went someplace else before, now it turns out we’re better off going ahead and manufacturing here.”", "But for those folks who have lost their job right now because a plant went down the Mexico, that isn’t going to make you feel better. And so what we have to do is to make sure that folks are trained for the jobs that are coming in now because some of those jobs of the past are just not going to come back, and when somebody says, like the person you just mentioned who I’m not going to advertise for, that he’s going to bring all these jobs back, well how exactly are you going to do that? What are you going to do?", "There’s — there’s no answer to it. He just says, “Well, I’m going to negotiate a better deal.” Well, how — what — how exactly are you going to negotiate that? What magic wand do you have? And usually, the answer is he doesn’t have an answer.", "During the previous administration, Obama, in 2013, and his vice president, Joe Biden, in 2012, touted a rise in manufacturing jobs during the post-recession period.", "In his 2013 State of the Union address, Obama said that U.S. “manufacturers have added about 500,000 jobs over the past three” years since bottoming out in 2010. That was true, but as we pointed out at the time, there was still a net loss in manufacturing jobs under Obama.", "Since Trump took office, the economy has continued to add manufacturing jobs. The U.S. has added 348,000 manufacturing jobs from January 2017 to August 2018.", "But the U.S. still has a little more than 1 million fewer manufacturing jobs now than it did when the Great Recession took hold in December 2007.", "As for the GDP, Trump’s tweet was referring to the recent Bureau of Economic Analysis estimate that the real GDP increased at an annualized rate of 4.2 percent in the second quarter of 2018. That was the largest increase since the third quarter of 2014, when it grew at an annualized rate of 4.9 percent.", "In a press briefing later in the day, Kevin Hassett, chair of the White House Council of Economic Advisers, said he did not know if Obama ever said the quote that Trump attributed to the former president on Twitter. “I’m not the chairman of the Council of Twitter Advisers,” Hassett said.", "In a separate tweet the same day, Trump also wrongly claimed, “The GDP Rate (4.2%) is higher than the Unemployment Rate (3.9%) for the first time in over 100 years!” The White House later acknowledged the error, and said the president should have said it hasn’t happened in 10 years. (Actually, it last happened 12 years ago.)", "The GDP Rate (4.2%) is higher than the Unemployment Rate (3.9%) for the first time in over 100 years!", "— Donald J. Trump (@realDonaldTrump) September 10, 2018", "The president’s tweet caught the attention of Justin Wolfers, a professor of economics and public policy at the University of Michigan, who did an analysis and found that while the president’s figures for the GDP and unemployment rate were accurate, the president was way off in claiming that it was the first time in a century that the quarterly GDP rate was higher than the unemployment rate.", "In two tweets, Wolfers listed the 62 times that has happened going back to 1948, most recently in the first quarter of 2006. For good measure, Wolfers included a graph superimposing the unemployment rate on the quarterly GDP.", "Source: https://t.co/nOwTjJyxD1 pic.twitter.com/D82IDP0rCx", "— Justin Wolfers (@JustinWolfers) September 10, 2018", "Hassett, chair of the White House Council of Economic Advisers, acknowledged the error and said that “what is true is that it’s the highest in 10 years, and at some point somebody probably conveyed it to [Trump] adding a zero to that, and they shouldn’t have done that.”", "“The history of thought of how errors happen is not something that I can engage in, because, like, from the initial fact to what the president said, I don’t know the whole chain of command,” Hassett said.", "“You’d have to talk to the president about where the number came from,” Hassett said. “But the correct number is 10 years.”", "(The tweet still had not been corrected on the president’s Twitter feed as of our publication.)", "Regardless of the number, Wolfers tweeted, the whole exercise of comparing levels of unemployment with growth rates of GDP is inane.", "“The problem is that he’s comparing two things that are different,” Wolfers told us via email. “The temperature in Fahrenheit is larger today than my shoe size, but that doesn’t make it warm.”", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]