["By Robert Farley", "Posted on October 27, 2016", "A Democratic ad falsely accused Pennsylvania Republican Sen. Pat Toomey’s bank of using a “controversial” loan tactic that forced 21 people out of their homes. In fact, only two of them lost houses, and there is no evidence that either home was a primary residence.", "The ad from the Democratic Senatorial Campaign Committee was later revised after the Toomey campaign protested, but we find the revised ad, while tilting closer to the facts, is still misleading.", "As images of stressed people are shown in their homes, the revised ad claims a bank co-founded by Toomey “forc[ed] small-business owners out of their homes.” There is no evidence that any business owner was forced out of a primary residence.", "By way of background, Toomey co-founded Team Capital Bank along with a Lehigh Valley attorney in 2005, after Toomey had left Congress. The bank grew to a dozen branches in Pennsylvania and New Jersey before merging with another bank in 2013. Toomey’s disclosure forms indicate that at the time of the transactions, he owned bank stock worth between $500,001 and $1 million.", "The ad alleges that the bank engaged in “a lending practice so outrageous most states banned it.”", "The practice in question is what is called a “confession of judgment.” It is designed to expedite the foreclosure process for lenders when a borrower fails to make loan payments. Without it, if a borrower defaulted on a loan, the bank would have to file a lawsuit demanding payment. It is a process that can get tied up in courts for years. By signing a confession of judgment, borrowers agree to waive due process and allow the bank to obtain a judgment against them without a hearing.", "It is, in fact, prohibited in many states. It is permitted in Pennsylvania, but only for commercial loans.", "We won’t go too much further into the weeds on this, but suffice it to say that those who represent commercial borrowers find the practice heavy-handed in favor of lenders, while those who represent lenders argue that it is a reasonable tool to ensure lenders will get paid in a timely manner.", "“It certainly is a very quick process,” David Schwager, an attorney who specializes in real estate, mortgage foreclosure and creditors’ rights, business formation and governance, and business litigation, told us in a phone interview. But there are some legal options for someone to fight the execution of a foreclosure on a home.", "Erica Crohn Minchella, an attorney in Illinois — which similarly allows confessions of judgment for commercial loans — said that as a consumer attorney she finds the tactic “heavy-handed.”", "“But were I on the other side, there absolutely are instances where it would be appropriate to use, because you may not get paid otherwise,” she said.", "Regardless of which side of that argument one falls on, it is a legal practice in Pennsylvania. We spoke to several Pennsylvania lawyers who represent borrowers and lenders in commercial mortgages, and they all told us that “confession of judgment” clauses are included in almost all commercial loans in the state.", "“It’s certainly not unusual in Pennsylvania,” Schwager said. “It’s standard.”", "Let’s compare the two versions of the ad. The original begins with the narrator saying, “Imagine: the bank forces you out. No warning, no hearing. It’s a lending practice so outrageous most states banned it.”", "The revised version states, “Imagine, the bank starts forcing you out. No warning, no hearing.”", "The emphasis on the word “starts” is ours, because it signals a subtle but important shift in the ad’s claim. Lawyers told us that even after a confession of judgment is filed, the borrower could still contest it, as well as the foreclosure of a personal residence. And the borrower could very well end up with a hearing.", "Lauren Passalacqua, a spokeswoman for the DSCC, said the point of the ad isn’t that there are no legal options in “confession of judgment” cases, “it’s that you don’t have as many.”", "The original ad then went on to say, “But at the bank owned by Pat Toomey, it was business as usual. Forcing 21 small-business owners out of their homes.”", "The revised version says, “But at the bank founded by Pat Toomey it was business as usual, forcing small-business owners out of their homes.” Notice the number of small businesses — 21 — has been dropped.", "The original claim was based on a Politico Pro story on Oct. 7 that stated, “The bank also used a controversial foreclosure method called a ‘confession of judgment’ to foreclose on at least 21 homes in the state that were used as collateral by small business owners.” (Politico Pro is available only to paid subscribers.)", "But that turned out to be wrong. The Toomey campaign provided documentation showing there were 21 “confession of judgment” actions filed by the bank in 12 cases (in other words, many were repeats), and that just three ultimately resulted in a foreclosure. One of the properties was a warehouse, and the other two were residential properties.", "The Politico Pro story now carries a clarification that states, “This story has been updated to better reflect the confessions of judgment’s role in starting the foreclosure process, which in the instances cited did not result in anyone losing a primary residence.”", "The DSCC points to the two cases of residential properties being foreclosed to back up the revised ad’s claim that the bank was responsible for “forcing small-business owners out of their homes.”", "But the DSCC provided no evidence that the two foreclosed houses were the primary residences of the borrowers. The Toomey campaign provided us with loan documents that show that one property was listed as vacant when the loan was executed, and in the other, the address of the property used as collateral was not the same as the addresses of any of the co-signers of the loan. In other words, there isn’t any evidence that anyone was kicked out of their primary home.", "Passalacqua, of the DSCC, said the Toomey campaign’s documents essentially admit that “Team Capital bank foreclosed on properties using confessions of judgment – including residential properties.”", "“Their letter references at least two examples of residential properties that were foreclosed on,” Passalacqua told us via email. “We never stated these properties were primary residences, and it is clear that these people did lose their residential properties – or their homes – whether they lived in them or not.”", "We think the wording of the ad — that Toomey’s bank was responsible for “forcing small-business owners out of their homes” — leaves the clear impression that people were forced out of their primary residences, not that they may have lost secondary homes used as collateral for a commercial loan.", "The Toomey campaign sent station managers airing the ad a letter demanding that it be pulled because the ad was false. The attorneys argued the claim about the bank forcing “21 small-business owners out of their home” was “categorically false and defamatory.”", "The DSCC then made the revised ad. Passalacqua told us it would not be fair to characterize the original ad as “being pulled.”", "“We produced a near-identical replacement at the request of one station and also made available to others,” she said, noting that some stations continued to air the original ad.", "The Toomey campaign has sent another letter to stations about the revised ad, claiming it “continues to make the same unsupported, defamatory representations.” Specifically, the campaign argues that the foreclosed properties in question could not credibly be called someone’s “home.” The DSCC says the revised ad will continue to air across the state.", "Toomey is facing a challenge to his senatorial seat from Democrat Katie McGinty in a race that has been rated as a “toss-up” by The Cook Political Report.", "https://www.sharethefacts.co/share/ce71e252-8128-4c05-bec6-f0f7b7b59f73", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]