["About this rating", "After torrential flooding hit parts of Texas in the wake of Hurricane Harvey in August 2017, Joel Osteen, the celebrity pastor of Lakewood Church in Houston, was assailed by claims that he had refused to open his megachurch facility to those seeking refuge from floodwaters that had engulfed the city.", "On 30 August 2017, the Action News 3 web site published an article reporting that Osteen had finally opened his church to flood victims, but that he was checking tithing records and only taking in (or giving priority to) church members who had made the greatest financial contributions:", "Lakewood Church was under fire after apparently not opening up the church to flood victims. The church disputed online criticism, stating “We are prepared to shelter people once the cities and county shelters reach capacity.”", "“Victoria and I care deeply about our fellow Houstonians. Lakewood’s doors are open and we are receiving anyone who needs shelter,” Osteen tweeted Tuesday, referencing his wife who is also Lakewood’s co-pastor.", "However, on Wednesday, reports from flood victims say the church is following a strict “members only” guideline, taking top church contributors ahead of people on the lower giving scale.", "Single mother Tiana Williams said she waited in line for 3 hours, just to be given a numbered ticket and told to check back in a few hours. “When I got to the entrance with my two little boys, they asked for my name and entered it into the computer,” said Williams. “Then, I was told that there were over 2,000 people ahead of me that have reserved beds! When I kept pressuring the guy to tell me why I had to wait, he said they were under strict guidelines to check tithing records of members and number their bed reservations based on their 2016 giving. I just can’t believe this. I just can’t.”", "This claim was false, a fabrication that originated with -- and was reported only by -- the ActionsNews3.com fake news web site.  The only element of the article that was true was that Osteen had issued a tweet the previous day stating that Lakewood Church's doors were open to those seeking shelter from the storm:", "Victoria and I care deeply about our fellow Houstonians. Lakewood’s doors are open and we are receiving anyone who needs shelter.", "— Joel Osteen (@JoelOsteen) August 29, 2017", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]