["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "David Perdue and Michelle Nunn debate during the U.S, Senate debate Oct. 7 at the Georgia National Fair Perry. Photo by AJC photographer Curtis Compton/ [email protected].", "Candidate references to the family farm and toting watermelons are far more than folksy. Agriculture is Georgia’s top industry, pumping more than $71 billion a year into the state economy.", "In that context, talking farms is political calculus, especially in farm heavy Middle Georgia.", "That math was on display in its full glory at the state fair this week in Perry, where U.S. Senate hopefuls Michelle Nunn and David Perdue debated for the first time.", "\"How do you justify to the farmers that in your list of priorities there are 17 items more important than the farmers in this state?\" Perdue, the Republican asked his Democratic opponent.", "Nunn appeared confused by the question and called the claim untrue.", "\"There is no plan that has that listed,\" Nunn said.", "Considering that the winner of the race will replace retiring U.S. Sen. Saxby Chambliss, a former agriculture lawyer who spent his Congressional career on agriculture committees, PolitiFact Georgia decided to look into the facts behind the political theater.", "First, some background. Nunn and Perdue are both political novices who lay some claim to rural Georgia.", "Nunn spent the first six years of her life in Perry, before her father was elected to the U.S. Senate. The family still owns a farm in the area.", "Perdue also is a Middle Georgia native. An ad featuring his cousin, ex-Gov. Sonny Perdue, talks up that background and youth spent \"pickin’ watermelons.\"", "Both candidates have met with the clout-wielding Georgia Farm Bureau, which does not endorse candidates. Both have said they will seek seats on the Senate agriculture committee if elected.", "Perdue’s television ads have long featured him wearing a jean jacket, walking in a rural field. His platform includes reducing regulations facing farmers, to help boost production.", "\"I hope to bring fresh ideas that will help relieve burdensome regulations and ensure our local farmers succeed in growing a strong Georgia,\" Perdue said in an August press release.", "Perdue’s criticism against Nunn’s agriculture credentials is based on two pages out of 144 pages of Nunn campaign memos that were produced in December 2013 and leaked this summer.", "Starting on page 61 are several policy issues that call for background memos for the candidate and her staff to review.", "Listed in order of need for completion, agriculture ranks 18, after issues as varied as the budget and the Guantánamo Bay detention camp.", "\"It is absolutely clear that’s how she ranks agriculture on her list of priorities on what to discuss,\" Perdue spokesman Derrick Dickey said.", "The memo appears to contradict that interpretation, however.  The document bolds the word \"agriculture,\" a sign from the authors that the policy paper on the issue is either done or near completion.", "Policy papers on issues that are ranked higher in the memo, such as the budget, are not bolded and therefore still in process.", "Nunn spokesman Nathan Click said that’s because the issues were not listed in order of importance but as \"topics the consultants want addressed.\"", "Click said Nunn made her commitment to agriculture clear when, within a week of announcing her candidacy in July 2013, she told reporters her goal was to serve on the Senate Agriculture and Armed Services committees.", "Her father, Sam Nunn, was chair of the armed service committee during his 24-year tenure in the Senate.", "Nunn’s seven-page jobs plan includes a call to expand partnerships between state universities and farmers among other priorities such as tax reform.", "\"My family has a third generation farm in Perry, and we have grown and raised everything from pecans to peppers to pigs – if you count our farm pig, Maybeline,\" Nunn said during a visit to the Georgia Farm Bureau in February. \"I understand how important our agriculture community is to our economy and our heritage as Georgians.\"", "So where does that leave us?", "It is accurate that agriculture is listed as 18 out of 22 policy memos that need completing, according to leaked internal campaign documents.", "But there is no evidence to support the idea that the list is a ranking of Nunn’s priorities.", "Perdue’s statement ignores critical facts and is misleading on its face.", "We rate it Mostly False.", "WMAZ Television, Senate candidates meet in debates, Pt. 3, Oct. 7, 2014", "David Perdue ad, Helping Georgia Grow, Sept. 16, 2014", "David Perdue, press release, Aug. 16, 2014", "Michelle Nunn leaked campaign memos", "Michelle Nunn, press release, Feb. 18, 2014", "Michelle Nunn jobs plan", "Interview with Derrick Dickey, spokesman for Republican U.S. Senate Candidate David Perdue, Oct. 8, 2014", "Email and phone interview with Nathan Click, spokesman for Democratic U.S. Senate Candidate Michelle Nunn, Oct. 8, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]