["About this rating", "McDonald's continually adjusts its value offerings based on sales and demand.", "McDonald's has discontinued its \"Dollar Menu\" for 2016.", "In late December 2015, many web sites and social media pages declared McDonald's was \"getting rid of\" its \"Dollar Menu\" in 2016. (The offerings in question are actually listed under \"Dollar Menu & More.\")", "The rumor spread quickly on Facebook and Twitter, with many users aggrieved about the purported changes. But the proclamation was not novel in 2015 (or 2016.) A 24 October 2013 CNNMoney article titled \"The end of McDonald's Dollar Menu as we know it\" similarly heralded such a change:", "McDonald's is tweaking its fabled Dollar Menu to try and rise out of its sales slump.", "McDonald's (MCD) renamed the menu Dollar Menu & More. Some of the items will still cost a dollar, but other items will cost more.", "It sent this tweet from its official account on Wednesday: \"Dollar Menu fans, don't worry...our new", "Dollar Menu & More will offer many options that are still $1 and some new choices too!\"", "The new menu will officially roll out on Nov. 4, according to a McDonald's spokeswoman, who said it will include some new items, which she declined to identify.", "A 4 September 2013 USA Today piece, titled \"McDonald's tests $1 menu with higher price points,\" reported:", "The McDonald's Dollar Menu may be outgrowing its name — and its $1 price point.", "The fast-food giant, struggling to keep sales up in an ultracompetitive environment, says it is testing a seriously different version of the Dollar Menu — dubbed Dollar Menu & More — that sells an array of items at $1, $2 and even $5 so-called shareable items such as 20-piece boxes of McNuggets.", "A national relaunch of a revised Dollar Menu could come \"later this year,\" says Neil Golden, chief marketing officer at McDonald's.", "\"While no official changes have been made to our current Dollar Menu, we continue to evaluate and test the best value options,\" says Golden.", "On 22 October 2013, The Atlantic published \"Why McDonald's Killed the Dollar Menu—in 1 Chart\"; the piece mourned the loss of the cheap eats options due to supply chain cost fluctuations:", "The sad news that McDonald's is ending its Dollar Menu after eleven years reflects a simple truth: You can't make any money selling burgers for $1, any more.", "Accounting for about one-seventh of the chain's total sales, the Dollar Menu, once a brilliant marketing gimmick, is now an anchor—both economically and metaphorically, speaking—enraging franchisees who can't make any money selling 2013 processed cow meat at 2002 prices. McDonald's has experimented with raising prices and tweaking its offerings to appease owners, but by November, the Dollar Menu will be gone, essentially.", "Those dire predictions weren't the first to warn about the future of the Dollar Menu. A KSL article dated 9 November 2012 reported that contemporaneous tweaks to it were unpopular, suggesting McDonald's had already rearranged the offerings in 2012 or earlier:", "McDonald's has not helped itself by moving from promoting a Dollar Menu to focusing on a slightly more expensive Extra Value Menu as customers have pulled back from ordering more expensive menu items like Angus beef burgers or extras like drinks and desserts.", "Now, in an effort to remain competitive in the global marketplace as its competitors are making big changes to promote growth, the fast-food chain is refocusing its efforts on promoting its Dollar Menu.", "CEO Don Thompson told the Wall Street Journal customers have not responded well to the Extra Value Menu. \"We're going back to talk of the Dollar Menu,\" he said.", "Changes referenced in late 2012 were detailed in an earlier Huffington Post article titled \"McDonald's Dollar Menu Changes Will Eliminate Fries & Soda, Add Desserts,\" dated 8 March 2012. It held:", "McDonald's will change national advertising for its Dollar Menu, removing small drinks and small french fries and replacing those items with fresh baked cookies and ice cream cones, Neil Golden, chief marketing officer for McDonald's USA, told Reuters in an interview.", "On March 26, McDonald's also will debut an \"Extra Value Menu\".", "That menu will include 20-piece chicken McNuggets, double cheeseburgers, chicken snack wraps, Angus snack wraps, medium iced coffees and snack-sized McFlurries, plus up to four regional options, that were previously listed elsewhere on its menu.", "\"The choices have been available for quite some time, we're just making it easier for customers to find them and enjoy them,\" Golden said, adding that the prices on those items will not change. All Extra Value Menu items will be priced above $1 and many will be below $2.", "The 2015-2016 version of the rumor claiming McDonald's was killing off its Dollar Menu again began in October 2015, in a MarketWatch article called \"McDonald’s all-day breakfast may be cheaper than the ‘Dollar Menu & More.'\" The report (based on a then-recent earnings call) explained that the latest changes were part of a years-long series of adjustments to what was once the Dollar Menu:", "The fast food chain has been moving away from its value-focused Dollar Menu since it rebranded the offerings in 2013 as “Dollar Menu & More,” adding more items and raising prices. Since the transition, staples that used to sell for $1, like the Cheeseburger and McDouble sandwiches, sell for $2.48 and $1.82, respectively, according to current estimates of prices at New York locations by data collection company Fast Food Menu Prices.", "In November 2015 Entrepreneur published an article titled \"McDonald's to Debut Its New Value Menu 'McPick' in 2016,\" maintaining:", "McDonald's Corp said it would debut a \"McPick\" U.S. value menu in January as turnaround efforts continue at the world's largest restaurant chain by revenue.", "The first promotion will be \"McPick 2 for $2,\" and will run from Jan. 4 through Feb. 8, McDonald's spokeswoman Lisa McComb said on Tuesday, adding that the menu would offer choice and flexibility.", "McDonald's will still offer its Dollar Menu & More value menu, which will share some items with the McPick menu, McComb said.", "McDonald's introduced the Dollar Menu & More to wean customers off its $1 value menu. The goal with McPick is to convince them to spend more money and to shake the chain's reputation for serving cheap food.", "It wasn't true that McDonald's was \"getting rid of its Dollar Menu\" for 2016; changes to the original Dollar Menu dated back to at least 2012. Additionally, the subsequent \"Dollar Menu & More\" incarnation was not being retired: the chain simply introduced several new two for $2 options to its offerings.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]