["The photo was shared here in a Facebook post on January 15, 2021.", "“Modi devotees, World Label Company Coca Cola also came in favor of farmers,” the post’s Hindi-language caption says. “Now don't say that those who make Coca Cola are also terrorists.”", "The image shows two Coca-Cola bottles with a design saying: ‘Share a Coke with Kisan Ekta” and “Share a Coke with Support Farmer”.", "Kisan Ekta is a Hindi phrase meaning “unity with farmers”.", "The misleading post was shared as farmers from the northern Indian states of Punjab and Haryana demonstrated against agriculture laws introduced by Prime Minister Narendra Modi’s administration. The demonstrations began on November 26, 2020, AFP reported here.", "The photo was shared alongside the same claim here and here on Facebook, here and here on Twitter and here on Instagram.", "The claim, however, is false.", "Contacted by AFP, Coca-Cola India said the image was ‘fake.’", "“Coca-Cola India confirms that this is a fake image and denies the launch of any such brand campaign around the stated issues indicated in the image,” the company said in a statement to AFP on January 19, 2021.", "The company did launch its ‘Share a Coke’ campaign in 2018, adding relationships as a theme on the bottle, for example, ‘Share a Coke With Friend’.", "None of the original bottles in that campaign mentioned farmers.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]