["Joe Biden has responded to criticism of immigration policies enacted during his time as vice president by attacking President Donald Trump’s record, claiming that Trump’s polarizing strategies did not happen when Biden was second-in-command.", "During the Sept. 12 Democratic presidential debate, Biden said the Obama administration \"didn't lock people up in cages.\" We rated that False.", "Biden that night also tweeted: \"The Obama-Biden Administration did not conduct workplace raids — in fact, it ended them.\" (Immigration agents last month detained nearly 700 immigrants at seven chicken processing plants in Mississippi.)", "The Obama-Biden Administration did not conduct workplace raids—in fact, it ended them. #DemDebate", "Is it true that Barack Obama’s administration did not carry out workplace raids, but rather ended them? Biden is partially correct.", "Obama ended the large-scale arrests of immigrants at their workplaces, prioritizing instead the prosecutions of employers who hired unauthorized workers. But some immigrants were still arrested when agents showed up to workplaces to execute search warrant against employers.", "Immigration law prohibits employers from knowingly hiring people who are not legally authorized to work. Employers are required to verify employees’ identities and work eligibility, and to complete and retain related verification forms known as I-9.", "U.S. Immigration and Customs Enforcement, or ICE, enforces provisions of the law through \"worksite enforcement\" operations. \"Raid\" is the colloquial word used when ICE arrests a large number of people at a workplace or elsewhere.", "During President George W. Bush’s second term in office, ICE agents arrested hundreds of immigrants at a time, often in factories and meat processing plants. One of the most high-profile raids happened in 2008 at a meatpacking plant in Iowa, when agents descended in helicopters and arrested nearly 400 workers.", "In April 2009, about three months into Obama’s first term, ICE announced a new focus on the criminal prosecution of employers who knowingly hired workers illegally in the country. Arresting and removing workers alone was insufficient, an ICE memo said, and focusing on employers would target the root causes of illegal immigration. The agency also said it would continue to arrest and deport unauthorized workers encountered during operations.", "Instead of conducting massive raids at worksites, ICE under Obama focused on audits of employers’ I-9 forms to determine if they complied with immigration law. ICE followed-up some cases with onsite law enforcement.", "Media reports in 2010 and 2011 said the ICE audits became known as \"silent raids,\" often leading to employees being fired once their employers were notified by ICE of irregularities on the I-9 forms. (ICE gives employers time to correct any errors on the forms.)", "Government data on worksite enforcement operations shows that the number of individuals arrested on immigration law violation charges declined after Obama took office.", "ICE spokesman Paul Prince told PolitiFact that the arrest data didn’t exclusively mean that that many people were arrested on site, though it could be the case in some instances. (For instance, someone might have been arrested elsewhere, but stemming from the findings of the workplace investigation.)", "A June 2015 report from the Congressional Research Service said that it was unclear why there was an overall decrease from 2008 to 2014 in worksite arrests for immigration charges and criminal charges, \"but they may reflect, to some degree, ICE’s stated renewed focus on employers.\"", "Given the data on immigrants arrested in worksite enforcement operations, Biden is wrong to claim that there were zero \"workplace raids,\" said Rey Koslowski, an expert on immigration and associate professor at the University at Albany, State University of New York.", "But Biden is correct in that the Obama administration ended the Bush administration’s practice of maximizing the number of employees arrested during workplace raids, often in the hundreds at a time, while failing to prosecute many of their employers, Koslowski said. The Obama administration shifted to targeting employers (though unauthorized workers present during operations were also arrested), he said.", "After the August arrests of nearly 700 people in Mississippi, John Sandweg, a former ICE acting director during the Obama administration, told NPR that during their \"employer-centric focus,\" they \"were not going to waste resources apprehending people who are showing up for work unless those individuals had ... some indication that they posed a public safety threat.\"", "Prince, the ICE spokesman, said that ICE’s strategy \"continues to focus on the criminal prosecution of employers who knowingly break the law and on the use of I-9 audits and civil fines to encourage compliance with the law.\"", "Biden said, \"The Obama-Biden Administration did not conduct workplace raids—in fact, it ended them.\"", "The Obama administration ended the practice of large-scale raids in which hundreds of immigrants were arrested at a time. Obama prioritized the prosecution of employers who knowingly hired unauthorized workers. This was done through increased audits of I-9 forms. But that doesn’t mean there were no onsite operations. In some cases, workers were arrested when ICE agents executed search warrants.", "Biden’s claim is partially accurate. We rate it Half True.", "PolitiFact, Fact-checking Biden on use of cages for immigrants during Obama administration, Sept. 13, 2019", "Phone and email interview, Rey Koslowski, an expert on immigration and associate professor at the University at Albany, State University of New York, Sept. 16, 2019", "Email interview, William Lopez, a clinical assistant professor at the University of Michigan School of Public Health, Sept. 17, 2019", "Email interview, ICE spokesman Paul Prince, Sept. 17, 2019", "ICE.gov, ICE executes federal search warrants at multiple Mississippi locations, Aug. 7, 2019", "AP, Largest US immigration raids in a decade net 680 arrests, Aug. 7, 2019", "DesMoinesRegister.com, A decade after a massive raid nabbed 400 undocumented workers, this tiny town fights to reclaim its identity., Published 7:54 p.m. CT May 10, 2018 | Updated 7:38 a.m. CT May 17, 2018", "Migration Policy Institute, Shifting Gears, Trump Administration Launches High-Profile Worksite Enforcement Operations, Jan. 24, 2018", "DHS.gov, Testimony of Secretary Napolitano before the Senate Committee on the Judiciary, \"Oversight of the Department of Homeland Security\", May 6, 2009; Testimony of Deputy Director Kumar C. Kibble, Immigration and Customs Enforcement, Before the United States House Committee on the Judiciary, Subcommittee on Immigration and Policy Enforcement, \"Immigration and Customs Enforcement Worksite Enforcement - Up to the Job?\", March 10, 2011", "NPR, Former Acting ICE Director John Sandweg Discusses Mississippi Raids, Aug. 8, 2019", "Buffalonews.com, 25 arrested - including owner - in raids on four Mexican restaurants, Oct. 18, 2016", "ICE.gov, Owner of 4 Buffalo restaurants charged in conspiracy to harbor illegal aliens, Oct. 18, 2016", "PolitiFact Florida, Obama holds record for cracking down on employers who hire undocumented workers, says Wasserman Schultz, July 3, 2013", "ICE, Worksite Enforcement FY 2014 Annual Report, March 3, 2015", "ICE.gov, Form I-9 Inspection Overview, Aug. 19, 2019", "The New York Times, Illegal Workers Swept From Jobs in ‘Silent Raids’, July 9, 2010", "The Wall Street Journal, 'Silent Raids' Squeeze Illegal Workers, March 29, 2011", "The Hill, Educators: The unsung heroes supporting immigrant families in wake of ICE raids, Aug. 12, 2019", "Reuters, Chipotle workers quit ahead of immigration audits, March 8, 2011", "PolitiFact, The Obameter: Obama has mixed record on immigration worksite enforcement, Jan. 6, 2016", "The New York Times, Secretary Seeks Review of Immigration Raid, Feb. 26, 2009", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]