["Greg Abbott, the Republican nominee for governor, accused lawyers representing the City of Houston of infringing on First Amendment protections of religious speech by demanding Houston church sermons.", "In his capacity as the state’s attorney general, Abbott said in an Oct. 15, 2014, letter to David Feldman, Houston’s city attorney, that Feldman’s \"office has demanded several Houston pastors hand over to the city government many of their private papers, including their sermons.\"", "Abbott, who posted his letter on his office’s website, was speaking to the city’s legal defense efforts against a lawsuit brought by local voters striving to repeal a city ordinance.", "Houston’s City Council, led by Mayor Annise Parker, approved the Houston Equal RIghts Ordinance (HERO) in 2014 in a move described by proponents as protecting the rights of transgendered people by permitting Houstonians to use bathrooms in businesses and public facilities of the gender with which they personally identify.", "Sermons were reportedly sought after a push to put a repeal proposal before voters in November 2014 didn’t succeed.", "On Aug. 4, 2014, according to a Houston Chronicle news story, Parker and Feldman announced that over half of 50,000 signatures on a petition to put HERO’s repeal on the ballot were invalid. According to the Chronicle, Houston attorneys threw out more than 2,000 pages with about 11,300 signatures because the people who collected the signatures were either not registered voters in Houston or did not sign the petition themselves.", "In reaction the next day, several residents filed a lawsuit charging the city with wrongfully invalidating the repeal petition.", "The city issued the subpoenas, as allowed by Texas law, as part of its defense in the lawsuit, in which it had said it will argue against the validity of many signatures on the repeal petition. Feldman told the Chronicle the city included its request for sermons in the subpoenas because pastors who led the petition effort gave instructions on gathering signatures during church service.", "We sought elaboration from the city -- does Houston’s government suspect preachers of coaxing congregants to fake signatures? -- without success.", "The city also didn’t respond to our inquiries about the described subpoenas, copies of which came from Abbott’s state office.", "Legal Documents", "To our inquiry, Abbott’s state spokesman, Jerry Strickland, emailed copies of five subpoenas, issued Sept. 10, 2014 via a city attorney, Kristen Schlemmer, addressed to Houston pastors Steve Riggle, Hernan Castano, Khan Huynh and Dave Welch and church leader Magda Hermida.", "Each subpoena lists 17 categories of documents and communications which the church leaders were told they had to submit by Oct. 10, 2014, including:", "--\"All speeches, presentations or sermons related to HERO, the petition, Mayor Annise Parker, homosexuality, or gender identity prepared by, delivered by, revised by or approved by you or in your possession.\"", "--\"All communications with members of your congregation regarding HERO or the petition.\"", "According to the subpoena, documents and communications include writings, notes, diaries, electronic or videotape recordings, emails, instant messages, text messages, emails or relevant \"electronically-stored matter.\"", "Meanwhile, two days after Abbott wrote his letter, the city revised the subpoenas to remove mention of \"sermons.\" Parker said opponents deliberately misinterpreted the subpoenas’ original language, which sought speech about the signature-gathering process; then again, she also maintained the changes didn’t preclude sermons from being produced, according to a Chronicle news story.", "Our Ruling", "Greg Abbott said a city lawyer \"demanded that several Houston pastors hand over to the city government many of their private papers, including their sermons.\"", "Five subpoenas, submitted by the City of Houston, required pastors to furnish sermons and personal communications with members of their congregation.", "We rate this statement True.", "TRUE – The statement is accurate and there’s nothing significant missing.", "Click here for more on the six PolitiFact ratings and how we select facts to check.", "Document, letter from Texas Attorney General Greg Abbott to  David Feldman, City of Houston Attorney, Oct. 15, 2014", "News story, \"City subpoenas sermons in equal rights case\", Katherine Driessen, Houston Chronicle, Oct. 14, 2014", "News story, \"Foes plan to take city to court over rejected ERO petitions\", Matherine Driessen and Mike Morris, Houston Chronicle, Aug. 4, 2014", "News story, \"Equal rights ordinance opponents sue city\", Mike Morris and Katherine Driessen, Houston Chronicle, Aug. 5, 2014", "News story, \"Equal rights law opponents deliver signatures seeking repeal\", Mike Morris, Houston Chronicle, July 3, 2014", "Document, Rule §159.103 Subpoenas, Texas Administrative Code", "Documents, \"Notice of intention to subpoena pastor Steve Riggle to produce documents or tangible evidence\", City of Houston Legal Department, Sept. 10, 2014 (received by email from Jerry Strickland, press secretary, Office of the Attorney General of Texas, Oct. 17, 2014)", "Documents, \"Notice of intention to subpoena pastor Hernan Castano to produce documents or tangible evidence\", City of Houston Legal Department, Sept. 10, 2014 (received by email from Jerry Strickland, Oct. 17, 2014)", "Documents, \"Notice of intention to subpoena pastor Khan Huynh to produce documents or tangible evidence\", City of Houston Legal Department, Sept. 10, 2014 (received by email from Jerry Strickland, Oct. 17, 2014)", "Documents, \"Notice of intention to subpoena pastor Dave Welch to produce documents or tangible evidence\", City of Houston Legal Department, Sept. 10, 2014 (received by email from Jerry Strickland, Oct. 17, 2014)", "Documents, \"Notice of intention to subpoena Magda Hermida to produce documents or tangible evidence\", City of Houston Legal Department, Sept. 10, 2014 (received by email from Jerry Strickland, Oct. 17, 2014)", "News story, \"Mayor Parker revises, narrows sermon subpoena request\", Mike Morris, Houston Chronicle, Oct. 17, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]