["About this rating", "Two Black teenagers in Georgia fatally shot their white victim's 13-month-old baby during a robbery attempt.", "No evidence suggests the perpetrators selected their victim due to her race, or killed her child merely 'for the fun of it.'", "The political unrest following the death of George Floyd in Minneapolis, a black man killed by a white police officer in May 2020, prompted social media to resurface an older article from The Daily Archives website, headlined \"Racist Black Thugs Shoot White Baby in the Face for the Fun of It\":", "Racist Black Thugs Shoot White Baby in the Face for the Fun of It", "Brunswick, Georgia has been rocked by the unprovoked hate crime murder of a 13 month old white baby boy.", "The baby was shot right in front of it’s mother by two black teenage thugs. Two suspects have been arrested. They are ages 17 and 14. The mother was also shot in the leg.", "Brunswick, GA is about 60% black. The area where the murder took place is overwhelmingly black. The 2010 census shows the area to be 13% white and 73% black.", "The media absolutely refuses to call it a “hate crime.”", "The bare facts of the case were reasonably accurate as presented above. On March 22, 2013, news accounts reported the arrest of two teenagers in the shooting death of a 13-month-old baby in Georgia during a robbery attempt:", "BRUNSWICK, Ga. (AP) — A pair of teenagers was arrested and accused of fatally shooting a 13-month-old baby in the face and wounding his mother during their morning stroll through a leafy, historic neighborhood in southeast Georgia.", "Sherry West had just been to the post office a few blocks from her apartment [the previous] morning and was pushing her son, Antonio, in his stroller as they walked past gnarled oak trees and blooming azaleas in the coastal city of Brunswick.", "West said a tall, skinny teenager, accompanied by a smaller boy, asked her for money.", "“He asked me for money and I said I didn’t have it,” she told The Associated Press from her apartment, which was scattered with her son’s toys and movies.", "“When you have a baby, you spend all your money on babies. They’re expensive. And he kept asking and I just said ‘I don’t have it.’ And he said, ‘Do you want me to kill your baby?’ And I said, ‘No, don’t kill my baby!’”", "Authorities said one of the teens fired four shots, grazing West’s ear and striking her in the leg, before he walked around to the stroller and shot the baby in the face.", "Seventeen-year-old De’Marquis Elkins is charged as an adult with first-degree murder, along with a 14-year-old who was not identified because he is a juvenile, Police Chief Tobe Green said. It wasn’t immediately clear whether the boys had attorneys.", "The older of the two teenagers was eventually convicted on felony murder charges. But nothing in the reporting on the case supported The Daily Archives' headline, which claimed that the suspects were \"racists\" who perpetrated a \"hate crime\" by deliberately targeting white victims and shot a baby \"for the fun of it.\"", "Rather, according to police, the victim was selected randomly, and her child was shot because West \"did not produce cash immediately when she was held up\":", "Glynn County Police Chief Matt Doering told reporters before the indictment was returned that investigators believe the crime was random.", "\"We're comfortable now, six days into it, to say the location of the incident and the victim were random,\" Doering said. \"I don't have any information that shows otherwise.\"", "The details contained in the indictment seem to back up the story the slain baby's mother, Sherry West, has repeated to numerous reporters: She was pushing her baby in a stroller as she walked home from the post office when two youths approached asking for money. West says when she refused, the older teen drew a gun and shot her in the leg before shooting her son in the head.", "Tragically, this incident proved to be the second time West lost a child to violence:", "The fatal shooting of a 13-month-old boy in his stroller marked the second time mother Sherry West lost a son to violence, she said.", "Her 18-year-old son was stabbed to death in 2008 in New Jersey, she told CNN.", "\"This is the second child that people have taken from me in a tragic way,\" West said. \"I'm so afraid to have any more babies now. I tried to raise really good kids in a wicked world.\"", "The day after two teenage boys were arrested and charged in the fatal shooting of her baby, West said she was planning to leave Brunswick and return to New Jersey. The boy's father has also been emotionally distraught, West said.", "Asked about the person who shot her son, Antonio, West stated: \"I hate you and I don't forgive you.", "\"You killed an innocent human life,\" she said. \"I hope you die for it.\"", "Martinez, Michael et al.   \"Baby's Death Marks 2nd Time Georgia Mom Loses a Son to Violence.\"\r\n    CNN.   25 March 2013.", "Bynum, Russ.   \"Police Arrest 2 Teens in Georgia Baby’s Killing.\"\r\n    Associated Press.   22 March 2013.", "Atlanta Daily World.   \"De’Marquise Elkins, Mother Found Guilty in Shooting Death of Baby in Brunswick.\"\r\n    30 August 2013.", "Bynum, Russ.   \"Teen Indicted in Ga. Baby Slaying and 2nd Shooting.\"\r\n    Associated Press.   27 March 2013.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]