["About this rating", "On Oct. 21, 2020, social media users began circulating an image said to show the hands of U.S. Senate Majority Leader Mitch McConnell, with those appendages looking unusually -- and alarmingly -- dark and mottled:", "This image is indeed an Associated Press-distributed photograph of the 78-year-old U.S. senator from Kentucky, taken on Oct. 20 and captioned as follows:", "\"Hands of U.S. Senate Majority Leader Mitch McConnell are seen as he talks to the media after the Republican policy luncheon on Capitol Hill in Washington on October 20, 2020. Photo by Yuri Gripas/Abaca/Sipa USA\"", "Why McConnell's hands exhibited purplish bruises and bandages -- a conspicuous change from just a week earlier, when his hands appeared fine -- has prompted much speculation, with guesses ranging from claims that the senator has contracted COVID-19 to the possibility that he has a vascular disease and/or is undergoing dialysis and is taking blood thinners. As neither McConnell nor any of his representatives have publicly commented on his condition, a definitive answer is not yet available.", "When reporters queried McConnell about his health after pictures of his hands went viral, the senator's answers were mostly non-responsive:", "In light of all the rampant conjecture on the internet, a few reporters in Washington, D.C., asked McConnell about it Thursday, according to dispatches from the Capitol Hill press pool.", "Politico reporter John Bresnahan asked if he had some kind of health issue. McConnell countered by saying he has been worried about Bresnahan's health and asking how he was feeling.", "Bresnahan said he was feeling OK. \"Good for you,\" McConnell replied.", "\"But I'm serious, is there anything going on we should know about?\" Bresnahan followed up.", "\"Of course not,\" McConnell said.", "Another journalist asked about the bruising, too, and McConnell said there were no concerns. He did not respond when asked if he was being treated by a doctor.", "Watkins, Morgan.   \"Mitch McConnell Mostly Mum About Discolored Hands, Says No Concerns.\"\r\n    Louisville Courier Journal.   22 October 2020.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]