["About this rating", "In January 2021, many social media users started posting messages claiming that U.S. Rep. Lauren Boebert (R-Colo.) had received a GED diploma (the equivalent of a high school diploma, earned by passing General Educational Development tests) months before she was elected to congress.", "The claims made in this meme are largely accurate.", "Boebert has supported the QAnon conspiracy theory. A spokesperson for Boebert also confirmed that the 34-year-old congresswoman earned her GED diploma in 2020.", "Boebert talked about her education with Colorado's Durango Herald in September 2020. The then-congressional candidate said that she was a \"good student\" when she attended Rifle High School but that she was a new mom at the time and prioritized raising her family over her education.", "Boebert said:", "On her educational background, she said she never claimed to have graduated from Rifle High School. \"I went to my high school,\" she said.", "\"I was a brand-new mom, and I had to make hard decisions on successfully raising my child, or getting to high school biology class. And I chose to take care of my child,\" she said.", "Boebert said she received her GED after completing a four-course review.", "\"I didn't go through the typical education course,\" she said. \"I was a great student. I had great grades. I loved being there, but I was starting my family and had different priorities.\"", "It should also be noted that although many people have spread this bit of trivia as a way of denigrating Boebert, the Colorado congresswoman is not the first person elected to office without a college education. According to a December 2020 report from the Congressional Research Service, \"17 Members of the House have no educational degree beyond a high school diploma.\"", "While the vast majority of politicians in 2020 have a college degree, that hasn't always been the case. According to The Washington Post, the percentage of politicians with college degrees has been steadily climbing for decades. In 1947, though, just over 50% of House members had a college degree.", "Boebert responded to the online criticisms of her education in a January 2021 tweet, writing that \"you don't need an Ivy League degree to achieve the American Dream.\"", "It's worth mentioning that while Congresswoman Alexandria Ocasio-Cortez has truly been criticized for being a bartender, as noted in the above-displayed tweet, she also graduated cum laude from Boston University in 2011.", "To sum up: It's true that Boebert, along with 16 other members of the House of Representatives, does not have a college education. Boebert received her GED diploma before she was elected to Congress in 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]