["The claim was published in an image in this Facebook post on June 6 alongside the caption: “Congrats Androids. You are now being tracked without your consent.”", "The text overlaid in the image reads: “Android users BEWARE, google automatically signed you up to COVID-19 tracing app", "\"If you use an Android phone, and have not installed the COVIDSafe app, then you may have COVID-19 Exposure Notification already on your phone. To check:", "\"1. Go to Settings\n\t\"2. Scroll down to Google Services and launch\n\t\"3. If COVID-19 Exposure Notifications is on top of the list, then tap on the three dots on the top right hand corner of your screen\n\t\"4. Tap Usage & Diagnostics\n\t\"5. Turn off\n\t\"Check regularly in case the Android system turns this on automatically.\"", "The COVIDSafe contact tracing app was launched in April 2020 as part of the Australian government’s plan to ease social distancing restrictions imposed to curb the spread of the novel coronavirus. The download and use of the app, which is designed to help public health officials find close contacts of COVID-19 cases, is voluntary.", "Similar virus tracing apps have also been introduced in other countries including France, Germany, India and the UK.", "A similar claim was published on Facebook here, here, and here.", "The claim is false. The Exposure Notifications API developed by Google and Apple is not an app and does not function in the same way, according to cybersecurity experts.", "In an email to AFP on June 16, Vanessa Teague, CEO of Thinking Cybersecurity and an associate professor at the Australian National University, further explained the differences between a contact tracing app and the new Exposure Notification API.", "“First of all, an API is not an app -- it's a set of functions that health authorities in each country can use to build an app on, if they want,” Teague wrote. “If you were living in a country that based its COVID-19 notifications on the Google-Apple Exposure Notification API, you would need to turn on exposure notifications (using the helpful instructions above, but 'on' instead of off) and also install your country's app.", "“Second, the Exposure Notification API is for exposure notification, not tracing. The difference is important: centralised tracing apps like COVIDSafe upload a list of your contacts to a health authority if you've tested positive for COVID-19 -- this allows those exposed people to be traced. Exposure notification notifies the people directly without a central authority doing the tracing.”", "In a joint statement released on May 20, Google and Apple announced the launch of the Exposure Notifications API, a technology designed to “support public health agencies”.", "API, or application programming interface, consists of sets of standardised requests that allow different computer programmes to communicate with each other. API provides building blocks for programmers to build mobile apps, which are oriented to users.", "Google and Apple clarified in their joint statement: “What we’ve built is not an app -- rather public health agencies will incorporate the API into their own apps that people install.", "“Our technology is designed to make these apps work better. Each user gets to decide whether or not to opt-in to Exposure Notifications; the system does not collect or use location from the device; and if a person is diagnosed with COVID-19, it is up to them whether or not to report that in the public health app.”", "While Google and Apple have included the Exposure Notifications API in the latest updates for their respective operating systems, iOS and Android, smartphone users need to manually turn on the exposure logging function. Also, that function only works if an authorised, compatible public health app is installed.", "An Australian Department of Health spokesperson told AFP by email on June 17, 2020 that the COVIDSafe app “does not currently use the exposure notification framework.”", "“The [Digital Transformation Agency] are working in partnership with Apple and Google to understand the native contact tracing functionality and whether it can and should be used within the COVIDSafe app in the future,” the spokesperson added.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]