["About this rating", "Amid tense talks between Congressional Republicans and Democrats over the 2018 federal budget, the attention of many observers turned to each side's record on government spending, benefits and entitlements, and fiscal priorities.", "In that vein, a widely-shared Facebook meme took aim at Republican Senator Tom Cotton of Arkansas, accusing him of supporting a modified version of a long-standing liberal bête noire — drug-testing for welfare recipients.", "On 21 January 2018, Facebook user Ken Stanley wrote:", "Tom Cotton calls for every person who receives Social Security to be drug tested those who test positive will lose benefits.", "This claim is false. We searched Cotton's speeches, op-eds, and press releases, as well as the Congressional Record and news archives, and found no evidence of the Senator ever having advocated such a policy.", "In an e-mail, a spokesperson for Cotton told us the meme was \"completely false\":", "Senator Cotton does not support (nor has he ever supported) drug testing for Social Security recipients.", "Indeed, even those who call for drug-testing for welfare recipients do not typically propose the same policy for Social Security.", "This is because Social Security is more widely regarded as an earned benefit (workers contribute to it through payroll taxes), while programs such as housing assistance or the Supplemental Nutrition Assistance Program (formerly known as food stamps) are regarded as welfare.", "Senator Cotton does, however, have a record of making statements and advocating policies around welfare assistance which have raised eyebrows.", "In 2015, Salon and Raw Story headlines accused Cotton of \"blaming\" drug addiction on Social Security benefits, and claiming that receiving Social Security disability benefits causes individuals to \"spiral\" into drug addiction. The articles, as well as Cotton's actually comments were more nuanced.", "In a speech at the Heritage Foundation, a conservative think thank, Cotton advocated for reform of the Social Security disability system, and drew a link between population decline and social ills (including drug addiction) in certain counties and regions, and rates of Social Security disability insurance uptake:", "It's hard to say what came first or caused the other: population decline or increased disability usage. Or maybe economic stagnation caused both. Regardless, there seems to be — at least at the county and regional level — something like a disability tipping point.", "When a county hits a certain level of disability usage, disability becomes a norm. It becomes an acceptable way of life and an alternative source of income to a good-paying, full-time job...After a certain point, when disability keeps climbing and becomes endemic, employers will struggle to find employees, or begin — or continue — to move out of the area.", "Population continues to fall, and a downward spiral kicks in, driving once-thriving communities into further decline. Not only that, but once this kind of spiral begins, communities could begin to suffer other social plagues as well, such as heroin or meth addiction and associated crime.", "In 2014, while running for the Senate, a Huffington Post writer accused Cotton of \"calling food stamp recipients addicts.\" Again, his comments were much more nuanced than that description.", "According to a Huffington Post transcript of a virtual town hall hosted by Cotton in July 2014, the then-Congressman defended voting down a Democratic bill relating to agricultural payments and federal food aid, on the basis that it did not sufficiently reform the food stamps program, including by requiring drug testing for applicants:", "I don’t think that we should be using farmers as a way to pack more welfare spending into Barack Obama’s government,” Cotton said. “Nor should we have a food stamp program that isn’t reformed, that doesn’t have job training and work requirements, that doesn’t have drug testing requirements, so we can get people who are addicted the help they need. Or make sure that long-term addicts or recidivists are not abusing taxpayer dollars.”", "In March 2017, Cotton joined with Republican Senate colleagues in voting to nullify an Obama-era Department of Labor rule which limited the circumstances under which states could conduct drug-testing for individuals applying for unemployment insurance.", "President Donald Trump later formally reversed the guideline, effectively giving states greater powers in conducting drug screening for jobless benefits. So Senator Cotton has certainly supported drug testing for welfare programs — but never for Social Security.", "Gauthier, Brendan.  \"Tom Cotton Blames Social Security for 'Heroin and Meth Addiction' Because Reasons.\"\r\n  Salon.  10 November 2015.", "Edwards, David.  \"Sen. Tom Cotton: Social Security Benefits Cause People to 'Spiral Downward' Into Heroin Addiction.\"\r\n  Raw Story.  9 November 2015.", "Lachman, Samantha.  \"GOP Senate Candidate Tom Cotton Calls Food Stamp Recipients 'Addicts.'\"\r\n  Huffington Post.  17 July 2014.", "Brady, Rep. Kevin.  \"House Joint Resolution 42 -- Disapproving the Rule Submitted by the Department of Labor Relating to Drug Testing of Unemployment Compensation Applicants.\"\r\n  Congressional Record.  31 March 2017.", "U.S. Department of Labor.  \"Final Rule -- Federal-State Unemployment Compensation Program; Middle Class Tax Relief and Job Creation Act of 2012 Provision on Establishing Appropriate Occupations for Drug Testing of Unemployment Compensation Applicants.\"\r\n  Federal Register.  1 August 2016.", "U.S. Department of Labor.  \"President Trump Nullifies Drug Testing Rule.\"\r\n  U.S. Department of Labor.  31 March 2017.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]