["About this rating", "In early October 2019, readers searched the Snopes.com website for a story that, were it not for the internet, might otherwise have been long forgotten. \"Guatemala Sinkhole Created by Humans, Not Nature,\" the supposed headline of interest read:", "The article underlying that headline, as published by National Geographic, was true -- but the event took place in 2010, shortly before that article was written. Accompanied by a dramatic photograph of a massive chasm in an urban center, the Geographic article reported:", "Human activity, not nature, was the likely cause of the gaping sinkhole that opened up in the streets of Guatemala City on Sunday, a geologist says.", "A burst sewer pipe or storm drain probably hollowed out the underground cavity that allowed the chasm to form, according to Sam Bonis, a geologist at Dartmouth College in New Hampshire, who is currently living in Guatemala City (map).", "The Guatemala City sinkhole, estimated to be 60 feet (18 meters) wide and 300 feet (100 meters) deep, appears to have been triggered by the deluge from tropical storm Agatha.", "But the cavity formed in the first place because the city—and its underground infrastructure—were built in a region where the first few hundred meters of ground are mostly made up of a material called pumice fill, deposited during past volcanic eruptions.", "The crater formed in the center of an intersection, and perhaps because aerial photographs are so visually striking, they have been shared throughout the years since the event occurred:", "This 30-story sinkhole appeared smack in the middle of Guatemala City. https://t.co/QlIPV4EVZi pic.twitter.com/hglMjoKJYT", "— David Plotz (@davidplotz) May 26, 2017", "That wasn't the first time a massive sinkhole opened up in Guatemala City. A similar, deadly event took place in 2007, resulting from a combination of geography, nature, and poor regulation according to National Geographic.", "Guatemala City is situated on volcanic material that is relatively loosely-composed. That placement, combined with swift-running water from unfixed underground leaks, contributed to formation of the craters", "\"In Guatemala City [the pumice is] unconsolidated, it's loose,\" Dartmouth geologist Sam Bonis told the Geographic in 2010. \"It hasn't been hardened into a rock yet, so it's easily eroded, especially by swift running water.\" Tropical storm Agatha, coupled with leaking sewage pipes, likely triggered the collapse in 2010.", "Bonis added that because the event wasn't driven by natural forces, it technically shouldn't be called a \"sinkhole.\" There was no scientific term, he said, to describe this type of collapse.", "Than, Ker.   \"Guatemala Sinkhole Created by Humans, Not Nature.\"\r\n    National Geographic.   5 June 2010.", "Associated Press.   \"Third Body Pulled from Giant Sinkhole.\"\r\n    NBC News.   24 February 2007.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]