["The photo was published here on Facebook on February 29, 2020. It has been shared more than 80 times.", "The post’s traditional Chinese-language caption translates to English as: “Eight high officials in Iran visited the vice president who has been diagnosed with novel coronavirus, all not wearing masks, does that mean all of them will be infected?”", "Below is a screenshot of the misleading Facebook post:", "Iran has reported a surge in the number of confirmed cases of the novel coronavirus in the country, as reported here by AFP on February 29, 2020.", "Several senior officials including Masoumeh Ebtekar, one of Iran's twelve vice presidents, was reported to have been infected.", "The photo was also shared here on Facebook, here, here and here on Twitter, and here and here on Weibo, with a similar claim.", "The claim is false; this photo has circulated online since at least 2014, more than five years before the COVID-19 outbreak.", "A reverse image search on Google found this April 10, 2014 article published by the Iranian newspaper Bahar.", "The first paragraph of the article reads: “Fatemeh Hashemi, on behalf of Akbar Hashemi Rafsanjani, today visited vice-president and head of the Department of Environment Masoumeh Ebtekar following her hospitalization over a car crash. During the visit, Fatemeh Hashemi brought the salutations of the head of the expediency council and wished Ebtekar good health after asking about her treatment. Ebtekar, in turn, thanked Hashemi Rafsanjani for the visit and asking about her health. Also, other vice-presidents and ministers visited the head of the Department of Environment. The Islamic City of Council of Tehran's speaker, Akbar Masjed Jamei also visited Ebtekar today afternoon (Thursday).”", "The article shows the same photo as the one contained in the misleading posts. It also contains other photos of the same hospital scene.", "Below is a screenshot of the article:", "Iran’s embassy in China published a statement on its official Weibo account here on February 29, 2020, also confirming that the photo was captured in 2014.", "The Weibo post’s simplified Chinese-language caption translates to English as: “At this difficult time when Iranian people are fighting against the virus, we are sorry to see some rumours about Iran circulating on the internet. For example, someone posted a photo of Iran officials \"visiting their vice president diagnosed with the novel coronavirus without wearing masks\", while in fact the photo was taken in 2014 when the vice president was hospitalised for a traffic accident. To fight against the novel coronavirus, a virus unknown to human beings, we need facts rather than rumours; unity rather than imputation.”", "Below is a screenshot of part of the Weibo post:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]