["About this rating", "Dining at a the Chick-fil-A is fast food chain is frowned upon in certain circles, due to chief executive officer Dan Cathy's open opposition to same-sex marriage. So much so, in fact, that Twitter CEO Jack Dorsey touched off a social media controversy after he tweeted about using an app to purchase food from Chick-fil-A:", "Boost ⁦@ChickfilA⁩ pic.twitter.com/W03oKeGgGT", "— jack (@jack) June 10, 2018", "Controversy and criticism over Dorsey's support of the restaurant chain during LGBTQ Pride Month quickly followed. He eventually suggested that he had made a mistake:", "You’re right. Completely forgot about their background", "— jack (@jack) June 10, 2018", "Just as Dorsey's tweet referencing Chick-fil-A stirred up outrage, so did his follow-up message. Pundits and politicians claimed that Dorsey had been \"bullied\" (although Dorsey did not actually issue an apology, nor did he delete his original tweet):", "This lunacy has gone too far. The CEO of @Twitter bullied into apology for patronizing @ChickfilA because owners support “biblical definition of marriage”. Holding a personal view taught by mainstream Christianity is now boycott worthy. https://t.co/EnChlPBStc via @cbsmoneywatch", "— Marco Rubio (@marcorubio) June 11, 2018", "The rumor that legislation was being drafted which would make eating at the chain a hate crime came soon after that, originating with a satirical article from the Babylon Bee:", "Under intense pressure from their left-leaning constituents to do something about the dangerous, Christian-founded restaurant chain, Democrats in the House of Representatives unveiled legislation Tuesday that would make it a hate crime to eat at Chick-fil-A.", "The CFAHATE Act Of 2018 would make it a hate crime punishable by federal law to dine at the restaurant or use its drive-thru, with extra punishments for people who post that they’re eating at the restaurant on their social media accounts. The legislation would also impose heftier penalties for anyone who patronizes the extremist hate group’s chicken sandwich establishments during Pride Month.", "The site carries a clear disclaimer that says, \"The Babylon Bee is Your Trusted Source For Christian News Satire\":", "Michelson, Noah.   \"If You Really Love LGBTQ People, You Just Can’t Keep Eating Chick-fil-A.\"\r\n    Huffington Post.   11 June 2018.", "Babylon Bee.   \"House Democrats Draft Legislation That Would Make It A Hate Crime To Eat At Chick-Fil-A.\"\r\n    11 June 2018.", "McGregor, Jena.   \"Square CEO Jack Dorsey Gets Blasted From Both Sides After a Tweet About Chick-Fil-A.\"\r\n    Washington Post.   11 June 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]