["About this rating", "On 20 July 2016 GOP presidential candidate Donald Trump's running mate, Indiana governor Mike Pence, spoke at the Republican National Convention (RNC). As is increasingly common, many citizens got their convention news primarily from social media platforms such as Facebook and Twitter.", "Among the social media items that circulated the night of Pence's speech and the following day was the a tweet, purportedly sent by Trump during the speech and describing his prospective vice-president as \"boring Mike Pence\":", "Reacting reflexively to the Indiana governor’s speech while watching a live feed backstage at the Republican National Convention, GOP presidential nominee Donald Trump accidentally shot off a “Boring Mike Pence” tweet Wednesday night before he could stop himself. “Boring Mike Pence lacks any charisma or charm,” Trump’s tweet about his running mate read in part, adding that the Tea Party–aligned conservative was a “total disaster” and “very hard to watch.” “Doing a lousy job. Knows nothing about winning. Pathetic.” Trump, who reportedly noticed that the social media post had quickly received over 10,000 retweets, instinctively fired off three more tweets questioning Pence’s fitness for vice president.", "As is also often the case, the tweet quickly was decoupled from its original source: The Onion, a well-known purveyor of satirical content. While most social media users are familiar with The Onion (and its basis as a humor publication), multiple e-mails and social media posts evidenced that not everyone got this particular joke.", "Social media is awash in web sites that exist solely to spread outlandish fabricated fake news stories, but The Onion started out as a printed humor publication and evolved to become the well-known satirical web site (i.e., a site that aims to make readers laugh, not trick them) it remains today. Despite its relatively large name recognition, The Onion is still confused for a real news outlet upon occasion. Before the advent of fake news sites and their ubiquitous nonsense, users mistaking The Onion for actual news inspired a popular blog that captured such instances.", "While The Onion publishes content quite frequently, a relatively small portion of its content is ever mistaken for authentic news as the \"boring Mike Pence\" tweet was. An item about Cuban refugees clinging to Air Force One consisted of a photograph and headline with no content, as did a previous (and similarly confusing) effort from the site holding that SeaWorld stored orcas in large plastic bags while cleaning their tanks. A prior Onion article about a SeaWorld show that was \"Just Elephant Drowning in Large Tank of Water with No Explanation\" caused social media users to become incensed about the imaginary described practice, as did another piece about a teen whose parents decided to euthanize her because she was only \"capable of texting and rolling her eyes\".", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]