["About this rating", "The above-displayed photographs have been circulating on the Internet since at least 2004, usually in e-mail forwards that set them in one of several Arab/Muslim areas (e.g., Iraq, Iran, Afghanistan, Palestinian territories) and claim that the boy pictured is being punished under a harsh Sharia  law system that imposes a penalty grossly out of proportion to the nature of the crime (i.e., having his arm crushed under a vehicle because he stole a loaf of bread).", "These pictures originated with the Iranian news site PeykeIran, who (along with persons who have witnessed similar scenes in other countries) confirmed that what the photographs actually depict is performers hustling money from onlookers by staging a common street act, one in which a subject seemingly allows himself to be run over by a heavy vehicle and then emerges unscathed.  This a common act, variations of which are performed by many magicians and accomplished through a variety of means, with no lasting harm done. That the subject is a small boy who grimaces his way through the stunt is all part of the act, intended to elicit sympathy and extra cash from onlookers.  (Despite his contorted facial expressions, the boy is not seriously or permanently injured by the process.)", "It's difficult to make any definitive statement about Sharia/Islamic law since customs and enforcement can vary from region to region, but although the cutting off  hands may sometimes be the prescribed maximum penalty for cases of theft under the strictest interpretations of Sharia, Islamic law resources consistently note that such punishments shall not be applied to children who have not yet reached puberty (which is defined as the age of 15 for boys), nor for the theft of small-value items or food by the hungry:", "The maximum sentence of any violation of law is not applied in every case. In the robbery and theft cases for example, the maximum penalty of hand-cutting applies after the consideration of many factors such as track record and whether the theft was made for profit. In some cases, such as stealing food because of severe hunger or to prevent death, there may not be a penalty.", "A person's hand is not amputated when he steals less than the equivalent of 4.374 grams of gold [or] something that is useless.  The penalty for the one who steals (when the above conditions are met) is that his/her right arm is amputated.", "The above photographs do not depict any form of amputation, and it is the child's left arm which goes under the wheels.  Moreover, there are no police, judges, religious authorities, or other officials evident in any of the pictures, just a huckster with a hand-held microphone who drums up business and describes the action for the onlookers visible in the background of the first photo. (Also note the blanket placed under the boy's arm: something that is useful for a staged stunt but is unlikely to be provided or allowed by those intent on severely punishing a lawbreaker.)", "The versions of these photographs circulated via e-mail generally leave out the last pictures of the original series, which show the same boy after the conclusion of the stunt:", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]