["Former New York Attorney General Eric Schneiderman leaves his apartment building, Wednesday, May 9, 2018, in New York. Schneiderman resigned Monday, just hours after accounts of abuse by four women. (AP)", "After New York Attorney General Eric Schneiderman stepped down amid allegations that he abused women, a story without any evidence circulated on Facebook that he covered up a sex cult.", "\"Eric Schneiderman helped NXIVM sell child sex slaves to the Clintons,\" said a May 9 headline by the NY Evening News, a website that has sections on conspiracies and UFOs. The story attributed the information to Your News Wire, which frequently posts fake news.", "Facebook flagged this story as part of its efforts to combat false news and misinformation on Facebook's News Feed. (Read more about our partnership with Facebook.) The story smashes together an actual federal criminal case against organizers of a sex cult to falsely allege that it involves Schneiderman selling children to the Clintons.", "You may not realize this, but as a nonprofit news organization, we depend on — and answer to — you. Your support directly impacts our abilility to provide objective reporting on issues that matter.\n\nDonate to our Spring Campaign. Go on the record as saying facts matter!", "Schneiderman resigned May 7 following a report by The New Yorker that four women accused him of physical assault. He denied the allegations.", "The NY Evening News story said, \"Schneiderman used his position as Attorney General to cover-up the crimes of NXIVM – a cult recently exposed as selling child sex slaves to the Clintons.\"", "The criminal case about the sex cult NXIVM (pronounced Nex-e-um) is real, although the NY Evening News story makes up details. We previously rated a claim that defendant Allison Mack, an actress on the TV show Smallville, sold sex slaves to the Clintons as Pants on Fire.", "Mack and co-defendant Keith Raniere face real federal charges for sex trafficking, sex trafficking conspiracy and forced labor conspiracy. Both have pleaded not guilty.", "Prosecutors said that Mack recruited women to join what was portrayed as a female mentorship group that was led by Raniere. The victims were then exploited, including sexually.", "We searched news accounts for connections between Schneiderman’s office and the case.", "In March, Schneiderman’s office filed a court case asking a judge to order Brandon B. Porter, a medical doctor who conducted controversial research on behalf of NXIVM, to turn over records related to studies. The case also asked Clare F. Bronfman, heiress to Seagram and NXIVM operations director, to turn over records. But Schneiderman’s office suspended the state investigation after the March 25 arrest of Raniere on federal charges.", "A 2017 story by the Albany Times-Union said that law enforcement had fielded complaints about NXIVM for years and that Schneiderman’s office had begun to examine dealings.", "\"The new interest comes after multiple law enforcement agencies, including Schneiderman's office, had for years brushed aside the concerns from Raniere's critics and others about the murky inner workings of NXIVM, which one expert has characterized as an 'extreme cult,' \" the Times-Union wrote.", "We read federal court records and news articles about the case and found no evidence that Schneiderman helped \"NXIVM sell child sex slaves to the Clintons.\" This mash-up of headlines in the news has no basis in fact. We rate this headline Pants on Fire.", "NY Evenings News, \"Eric Schneiderman helped NXIVM sell child sex slaves to the Clintons,\" May 9, 2018", "Your News Wire, \"Eric Schneiderman Helped NXIVM Sell Child Sex Slaves To The Clintons,\" May 9, 2018", "The Times-Union, \"NXIVM leader Keith Raniere charged with sex trafficking,\" March 26, 2018", "The Times-Union, \"Doctor facing state charges,\" May 6, 2018", "The Times-Union, \"Inquiry into Nxivm affiliate put on hold,\" April 10, 2018", "The Times Union, \"Ample evidence to justify Nxivm investigation,\" Feb. 20, 2012", "AP, \"More arrests expected in case against 'Smallville' actress,\" May 4, 2018", "U.S. Attorney’s Office Eastern District of New York, \"Founder of \"NXIVM,\" a Purported Self-Help Organization, and Actor Indicted for Sex Trafficking and Forced Labor Conspiracy,\" April 20, 2018", "U.S. Attorney’s Office Eastern District of New York, Letter to Judge Gold, March 26, 2018", "New York Times, \"Allison Mack of ‘Smallville’ Is Charged With Sex Trafficking,\" April 20, 2018", "PolitiFact, \"Smallville actress didn't confess to selling children to Clintons,\" May 1, 2018", "Interview, Amy Spitalnick, New York Attorney General spokeswoman, May 9, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]