["About this rating", "Disney theme park history is full of rumors and hoaxes. We've previously covered false claims about Disney princes, Disney princesses, Disney VHS tapes, Disneyland moving to Texas, whether or not the spires on Cinderella's castle at Walt Disney World Resort can be removed for hurricanes, and a rumor that alleged turkey legs sold at the parks are made from emu meat.", "We've covered some true claims as well, including that Eeyore is hiding in Disneyland's Indiana Jones Adventure, and that Snow White Grotto employs forced perspective.", "Since at least December 2019, a 66-page slideshow story had been available for reading on BleacherBreaker.com. Its headline read: \"What The Mouse Doesn’t Want You To Know: Backstage Secrets About Working At Disney.\" However, the story had been advertised as: \"Former Disney World Princess Reveals The Truth\":", "But this advertisement was misleading and false.", "None of the story's 66 pages mentioned a \"former Disney World Princess\" revealing \"the truth.\" The story appeared to be more than 60 somewhat interesting tidbits about Disney theme parks that had been published before. For example, the story mentioned that people employed in Disney parks are known as cast members, not employees. It also mentioned that Disney cast members can't break character. There was no grand \"truth\" revealed by a former Disney princess. Further, Disney fanatics likely had been well aware of the 66 factoids for quite a long time.", "The image used in the advertisement was a stock photograph of a Disney cast member portraying Snow White, from the website Alamy.com. According to Getty Images, the Snow White picture appeared to be captured on the red carpet for the 2001 premiere of \"The Princess Diaries,\" a Walt Disney Pictures production.", "Walt Disney characters Cinderella, Belle, Snow White and Sleeping Beauty perform at the premiere of \"The Princess Diaries.\" (Photo by Frank Trapper/Corbis via Getty Images)", "On Oct. 2, 2018, BuzzFeed published a YouTube video with the title: \"Disney Princesses Reveal Secrets About Disney.\" However, the information in the video did not bear much resemblance to the story on BleacherBreaker.com, and appeared to be unrelated. Inside the Magic and Vox also published stories about an interview with a former Disney princess. However, this interview was published several weeks after BleacherBreaker.com posted its the 66-page story.", "Snopes debunks a wide range of content, and online advertisements are no exception. Misleading ads often lead to obscure websites that host lengthy slideshow articles with lots of pages. It's called advertising \"arbitrage.\" The advertiser's goal is to make more money on ads displayed on the slideshow's pages than it cost to show the initial ad that lured them to it. Feel free to submit ads to us, and be sure to include a screenshot of the ad and the link to where the ad leads.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]