["A photo of rapper and cannabis enthusiast Snoop Dogg smoking is being shared on social media with this text: \"JAMAICA has not recorded any case of the CORONAVIRUS. Are you thinking what I’m thinking?\"", "It was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "According to Johns Hopkins University of Medicine and the World Health Organization, Jamaica has had more than 35,300 reported COVID-19 cases and more than 530 deaths because of the disease. The website for Jamaica’s Ministry of Health & Wellness reports fewer total cases and deaths, but the page was last updated on Feb. 25.", "The U.S. Centers for Disease Control and Prevention has flagged the country for having a \"very high level of COVID-19\" and advises people to avoid travel to Jamaica.", "While some researchers are investigating the potential benefits and risks of cannabis in preventing or treating COVID-19, the science is inconclusive. But health officials have discouraged smoking marijauna, as COVID-19 attacks the lungs.", "What’s clearly not true: that Jamaica has no reported COVID-19 cases thanks to cannabis.", "We rate this post Pants on Fire!", "Facebook post, March 19, 2021", "Johns Hopkins University of Medicine Coronavirus Resource Center, Jamaica, visited March 22, 2021", "World Health Organization, Jamaica, visited March 22, 2021", "Centers for Disease Control and Prevention, COVID-19 in Jamaica, visited March 22, 2021", "Jamaica Ministry of Health & Wellness, COVID-19 dashboard, visited March 22, 2021", "Forbes, Cannabis shows potential to help and harm in coronavirus cases: experts explain why, Aug. 11, 2020", "New York Post, Scientists believe cannabis could help prevent and treat coronavirus, May 21, 2020", "Fox 10 Phoenix, Study: THC in marijuana could help avert fatal COVID-19 complications, Sept. 30, 2020", "University of Miami, A new survey sheds light on ‘vulnerable’ cannabis users, May 12, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]