["About this rating", "Ask anyone who has experienced a urinary blockage due to kidney stones and they will tell you there is nothing fun or remotely pleasant about the experience. Caused when salt and mineral residues form small \"stones\" inside the kidneys that move and become stuck in the ureter (the passageway via which urine passes from the kidneys to the bladder), a kidney stone blockage often results in severe pain, bleeding, nausea, and vomiting.", "Sometimes, especially when the stones are small, they eventually pass through the ureter and are excreted without medical intervention. Larger stones usually require treatment, which may involve one or more of the following: medication to relax the walls of the ureter; extracorporeal shock wave lithotripsy (ESWL) to break up the stones into smaller pieces so they can pass in the urine; ureteroscopy, a minimally invasive surgery in which a small tube is inserted into the urinary tract to break up the stones and remove them; or a surgical procedure to excise the stones if they are very large.", "Or, according to urologist and professor emeritus in the Department of Osteopathic Surgical Specialties at Michigan State University Dr. David Wartinger, DO, you could consider the lower-cost alternative of taking a ride on the Big Thunder Mountain roller coaster at Walt Disney World in Orlando, Florida and letting the force of gravity do the work.", "Wartinger made a media splash in September 2016 by publishing a study in the peer-reviewed Journal of the American Osteopathic Association stating that experiments he performed using a lifelike silicone model of the human urinary tract confirmed that \"roller coaster facilitation of calyceal renal calculi passage\" (i.e., taking a roller coaster ride to facilitate the passage of kidney stones) may be a feasible alternative to standard medical treatment in some cases.", "Predictably, the news also made the social media rounds in the simplified form of an image macro:", "Wartinger explained how the research came to pass in an interview with the Michigan State University publication MSU Today:", "“Basically, I had patients telling me that after riding a particular roller coaster at Walt Disney World, they were able to pass their kidney stone,” Wartinger said. “I even had one patient say he passed three different stones after riding multiple times.”", "This resulted in Wartinger going out and testing the theory. Using a validated, synthetic 3D model of a hollow kidney complete with three kidney stones no larger than 4 millimeters inserted into the replica, he took the model in a backpack on Big Thunder Mountain at the theme park 20 times. His initial results verified patient reports.", "“In the pilot study, sitting in the last car of the roller coaster showed about a 64 percent passage rate, while sitting in the first few cars only had a 16 percent success rate,” Wartinger said.", "The anecdotal reports Wartinger said he heard from patients resembled ones noted by a Taiwanese urologist in a February 2009 article in Taiwan Today News:", "Chu Lang-hsuan, a doctor in the Department of Urology of Taichung Hospital, said on Thursday that after accompanying a group of Rotary students bungee jumping over winter vacation, a chaperone suddenly had severe pain in the back and stomach about 10 minutes after the activity. Upon his return to Taichung, he went for a medical examination, where blood studies and X-rays gave a preliminary indication that a kidney stone had lodged in the urethra. The stone was about 0.6 cm in size, and was broken up using extracorporeal shock waves, after which the man was able to pass it. The doctor suspects that the stone moved from the kidney into the ureter during the free fall activity.", "Chu says that when he started asking around, he discovered that another 30-something man had come into the hospital three years ago on four occasions for the same sort of complaint. Each time, shortly prior to the onset of the pain, he had been riding a roller coaster with his children. After going to the hospital, the man was told each time that a kidney stone had lodged in a ureter. Could it be that activities involving free fall can be helpful in passing kidney stones?", "One of the more interesting findings Wartinger reported was that out of the three Disney World roller coasters he and his co-researcher tried, only one of the rides achieved the desired result:", "“In all, we used 174 kidney stones of varying shapes, sizes and weights to see if each model worked on the same ride and on two other roller coasters,” Wartinger said. “Big Thunder Mountain was the only one that worked. We tried Space Mountain and Aerosmith’s Rock ‘n’ Roller Coaster and both failed.”", "Wartinger went on to explain that these other rides are too fast and too violent with a G-force that pins the stone into the kidney and doesn’t allow it to pass.", "“The ideal coaster is rough and quick with some twists and turns, but no upside down or inverted movements,” he said.", "In interviews, Wartinger went further than simply reporting the results of his study, to the point of actually proposing a roller coaster ride as an alternative non-medical remedy for kidney stones:", "If you have a kidney stone, but are otherwise healthy and meet the requirements of the ride, patients should try it. It’s definitely a lower-cost alternative to health care.", "We hasten to point out that Dr. Wartinger did not recommend foregoing diagnosis or treatment by a medical professional in favor of taking a roller coaster ride. Note, too, that the research was conducted not using actual human subjects, but rather a urinary tract simulator made of silicone (though the kidney stones used were real). Despite the doctor's enthusiasm, therefore, in the absence of any follow-up research confirming his results, the study cannot be considered conclusive; it does not suffice to prove that a roller coaster ride is an effective means of dislodging kidney stones.", "All we have, to date, is preliminary evidence suggesting that a ride on Disney World's Big Thunder Mountain roller coaster may help some patients spontaneously pass kidney stones (and only \"very small stones\" at that, according to a urologist familiar with the study consulted by the New York Times in 2016).", "Wartinger indicated as much himself in comments quoted in Slate shortly after the study was published. \"This is the validation model for getting the attention to do the human trial,\" he said. No human trials have yet taken place.", "We reached out to Wartinger for further comment but had not heard back by publication time.", "Matthews, Susan.   \"We Don't Know Whether Roller Coasters Cure Kidney Stones.\"\r\n    Slate.   3 October 2016.", "Wartinger, David and Marc A. Mitchell.   \"Pyelocalyceal Renal Model for the Evaluation of Renal Calculi Passage While Riding a Roller Coaster.\"\r\n    The Journal of the American Osteopathic Association.   October 2016.", "Yin, Steph.   \"A Roller Coaster Remedy for Kidney Stones?\"\r\n    The New York Times.   3 October 2016.", "Wolcott, R.J.    \"They Tried It: Disney World's Big Thunder Coaster Rolls Out Kidney Stones.\"\r\n    USA Today.   28 September 2016.", "Taiwan Today News.   \"Roller Coasters Newest 'Cure' for Kidney Stones?\"\r\n    20 February 2009.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]