["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Florida legislators are taking up the usual public policy topics this session: health care, taxes and campaign finance reform. Then there’s the bill about feral cats.", "Don’t call them feral cats, though. Bills in the Legislature are re-branding them with a more user-friendly name: \"community cats.\"", "Not so fast, say the bird lovers. The American Bird Conservancy is crying fowl, er foul.", "The bills \"would authorize the public hoarding of cats by feral cat activists, in the face of potential public health and property value impacts, as well as predicted high mortality for native animals,\" the groups said in a press release.", "The conservancy says passage of two bills (HB 1121/SB 1320) would make it easier for people to dump unwanted cats in areas where they roam aplenty.", "\"This is shocking,\" said Grant Sizemore, the conservancy’s Cats Indoors program manager. \"Hoarding of animals in homes is prohibited in most places, but we now have Florida encouraging it in public places such as city parks. There is no question that the health of local citizenry -- including children -- is being put at risk, property values in the hoarding areas will be impacted and local wildlife will continue to be devastated.\"", "PolitiFact Florida wanted to research whether this bill would allow cat hoarding.", "The cat bills", "The \"Community Cats\" legislation, sponsored by Rep. Holly Raschein, R-Key Largo, and Sen. Darren Soto, D-Orlando, attempts to rein in cat overpopulation.", "Several communities have established programs to spay and care for feral cats and release them, however there were concerns among some involved in such programs that the release of cats would constitute abandonment and violate state animal cruelty laws.", "The bill amends the state’s animal cruelty law to state that someone who spays or neuters a feral cat and then releases it is not abandoning the cat or breaking the law. The bill also states that counties and cities can still adopt their own ordinances to curtail the feral cat population.", "The bill defines a community cat as an \"outdoor, free-roaming cat that lacks visible owner identification\" and defines a \"community cat owner\" as someone who gives that cat food or water.", "Cat and wildlife activists have been battling each other about how to handle feral cats for years. A 2003 Tampa Bay Times article described a cat vs. rat battle at the Ocean Reef Club, an exclusive community of multimillion-dollar homes near a state park and wildlife refuge. Homeowners set up a program to take care of hundreds of stray cats, but meanwhile the populations of the Key Largo wood rat and cotton mouse, both endangered, dwindled. Wildlife experts pointed fingers at the cats.", "\"It's a very serious problem for Key Largo wood rats,\" University of Florida wildlife scientist Frank Mazzotti said at the time. \"Releasing a feral cat in a natural area is like releasing a serial murderer in a maternity ward.\"", "Central to the bill debate is whether programs that encourage the trap, neuter and release of feral cats reduce the feral cat population and the dangers to wildlife and humans.", "A study by scientists including from the U.S. Fish and Wildlife Service estimated that cats kill up to 3.7 billion birds a year, and found no connection between the programs (called TNR) and fewer bird deaths. \"Claims that TNR colonies are effective in reducing cat populations, and, therefore, wildlife mortality, are not supported by peer-reviewed scientific studies,\" it said.", "A 2003 Florida International University study concluded that TNR cat programs at two parks encouraged illegal dumping of cats and led to a population increase at one park, while the other remained stable.", "The Florida Department of Health, which remains neutral on the cat bill, stated in a 2012 rabies prevention report that managing feral cats \"is not tenable on public health grounds because of the persistent threat posed to communities from injury and disease.\"", "Bill supporters point to a study published in the journal of the American Veterinary Medical Association that concluded a TNR program at the University of Central Florida reduced the population. They also point to this research about the benefits of vaccinating cats.", "Would this lead to hoarding?", "So there is evidence that feral cats carry diseases and kill wildlife. But would this bill allow animal hoarding?", "A spokeswoman for the Humane Society, a group supporting the bill, said bill opponents are misusing the word \"hoarding.\"", "\"Animal hoarding is a serious mental illness,\" Humane society spokeswoman Katie Lisnik told PolitiFact. \"It is a severe case of neglect and abuse of animals.\" That’s different from programs that care for cats, she said.", "Hoarding -- generally speaking, not exclusively to animals -- will be listed by the American Psychiatric Association’s Diagnostic and statistical Manual for the first time this year, said Smith College psychology professor Randy Frost who studies hoarding.", "We asked Frost if Florida’s bill could lead to increased hoarding.", "\"I don’t know that there is any way to tell,\" he said.", "\"I think it would be hard to hoard in a field or public place. ... I don’t know of many cases of hoarding where hoarding occurred in public. I’d have to think about that.\"", "Brevard County recently placed a moratorium on registration for cat colonies -- county officials know of several hundred colonies. Bob Brown, captain of enforcement for Brevard County animal services, said he doesn’t think he would call these cat colonies hoarding.", "In a cat colony, \"they have no control if the cat comes or goes. Usually cat hoarders want to keep things confined within their control.\"", "An outdoor colony is different than the homes where there are cat urine stains all over the walls or cat feces dripping out of cabinets.", "\"We’ve seen some real doozies,\" he said.", "Robert Johns, a spokesman with the bird conservancy, said the law removes penalties for people who abandon animals to public places.", "\"Instead of having a hoard of cats in a house, which is illegal in many places, we would simply have dozens or hundreds of them outdoors in many places, essentially taking over public land to be used by feral cats,\" he said.", "Our ruling", "The American Bird Conservancy said a bill \"would authorize the public hoarding of cats by feral cat activists.\"", "The bill would authorize people to neuter and release feral cats. But it’s difficult to predict how these future cat colonies will be managed and controlled by local ordinances.", "Is it possible that someone could hoard feral cats outdoors? Sure. But animal hoarders typically want to be able to control their cats, so that’s why they hoard inside their own homes.", "The research we reviewed about feral cats focused on numbers, health problems and threats to wildlife they pose -- not whether it constitutes hoarding. That could be because hoarding isn’t the central debate about these feral cats, but it is a heated word that draws attention.", "We rate this claim Half True.", "American Bird Conservancy press release, \"Florida Legislature poised to approve public cat hoarding,\"March 29,  2013", "Florida House, S.B. 1320 Community Cats, Temporarily postponed March 27, 2013", "News Service of Florida, \"Florida lawmakers take on feral cat problem,\" March 20, 2013", "Miami Herald, \"Health officials say feral cats likely source of hookworm outbreak in Miami Beach,\"Nov. 24, 2010", "Tampa Bay Times, \"Cat fight in the lap of luxury,\"June 15, 2003", "New York Times, \"Writer, and bird lover, at center of a dispute about cats is reinstated,\"March 26, 2013", "Nature Communications, \"The impact of free-ranging domestic cats on wildlife of the United States,\"Sept. 6, 2012", "Florida Department of Health, \"Rabies prevention and control in Florida,\" 2012", "PolitiFact, \"Central Falls R.I. animal control says one male cat can father 420,000 kittens in just five years,\"Feb. 2, 2013", "Florida Statutes, Chapter 828 animal cruelty, Accessed April 10, 2013", "American Veterinary Medical Association journal, \"Evaluation of the effect of a long term trap-neuter-release program and adoption program on a free-roaming cat population,\"Jan. 1, 2003", "American Veterinary Medical Association journal, \"Response of feral cats to vaccination at the time of neutering,\" Jan. 1, 2007", "The Hoarding of Animals Research Consortium, Website, Accessed April 11, 2013", "Brevard County Code animal enforcement ordinance, Feral cats and Feral cat colonies Section 4 14-64, 2005", "Florida International University Department of Environmental Studies, \"Trap/neuter/release methods ineffective in controlling domestic cat ‘colonies’ on public lands,\" 2003", "Zoonoses and Public Health, \"Zoonotic diseases associated with free-roaming animals,\"2012", "Interview, Robert Johns, spokesman for the American Bird Conservancy, April 2, 2013", "Interview, Katie Lisnik, director of cat protection and policy, Humane Society, April 2, 2013", "Interview, Julie Levy, Director Maddie’s Shelter Medicine ProgramCollege of Veterinary Medicine, April 4, 2013", "Interview, Kate DeFoor, spokeswoman for Rep. Holly Raschein, April 3, 2013", "Interview, Randy Frost, Smith College psychology professor, April 11, 2013", "Interview, Bob Brown, captain of enforcement for Brevard County animal services, April 11, 2013", "Interview, Stephanie Stefanie Chicko, Administrative Manager, Broward County", "Permitting, Licensing and Consumer Protection Division, April 5, 2013", "Interview, Nancy Rubin, Broward assistant county attorney, April 11, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]