["The video was shared in multiple Facebook posts, including here on January 16, 2021.", "“The preparation for the 26 January parade are in full swing. Hail soldiers, hail farmers. No farmers, no country,” the Hindi-language caption reads.", "The video circulated online against a backdrop of ongoing protests by Indian farmers against Prime Minister Narendra Modi’s new agriculture laws.", "The farmers have called for a tractor rally on January 26, 2021, on the sidelines of the annual Republic Day parade in the capital Delhi, as reported here by The Indian Express.", "The video was shared alongside a similar claim on Facebook here, here and here and on Twitter here, here and here.", "The claim, however, is false. The video was actually filmed in Germany and shows a charity event in December 2020.", "Italy? Ireland?", "A reverse image search on Yandex using keyframes from the video found a longer and clearer version of the footage has circulated on Facebook since at least mid-December 2020 in various misleading contexts.", "One Facebook post from December 14 claims the video was filmed in Italy, while another from December 16 says it shows an annual Christmas tractor run in Ireland.", "But AFP reporters said the voices heard in the video were actually speaking German, and additional analysis of the video found further evidence that the footage was filmed in Germany.", "A number plate of the vehicle seen at the 02:08 time mark of the video reads 'OD TP 112'. This matches the patterns of vehicle number plates in Germany, with ‘OD’ representing the northern German town of Bad Oldesloe.", "AFP also found a logo of the Burchardt Transporte, a north Germany-based transport firm, on another vehicle at the end of the video.", "AFP spoke to Burchardt Transporte manager Jens Burchardt, who confirmed that the video showed a charity event for children’s cancer aid in Hamburg-Eppendorf on December 6, 2020.", "“It took place on the day of St. Nicholas on December 6. I too drove one of the trucks. We drove from Bargteheide to Hamburg which took about an hour and half,” he said over the phone on January 21, 2021.", "A further search led to another video of the event at a different stage of the drive published on Facebook on December 6, 2020.", "A comparison of screenshots from the video shared in misleading Facebook posts (L) and the second video shared alongside a German-language caption (R) reveals various identical features, such as decorations on the tractors.", "The charity event was also reported by local media in Germany here and here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]