["A viral screenshot shared widely on Facebook claims Spain has legalized cannabis and four-day working weeks.", "\"Spain legalized weed and starting 32 hour work weeks. The 'American dream' is now to move out the country lol,\" reads a screenshot of a tweet with over 489,000 likes that was shared to Facebook. The March 22 Facebook post has more than 2,000 shares and 27,000 reactions.", "USA TODAY reached out to the Twitter user for comment. The Facebook page did not have a way to be contacted.", "The same screenshot has since gone viral on different sites including   Americasbestpics.com, iFunny and Reddit.", "Fact check: A valid passport is required to cross U.S.-Mexico border in most cases", "Maldita.es, a nonprofit organization based in Spain that focuses on disinformation, found no new legislation on the legalization of marijuana in Spain on the electronic registry of the Official State Gazette.", "According to Maldita, article 368 of the Spanish Penal Code states that individuals will be \"punished\" for carrying out “acts of cultivation, manufacturing, trafficking or who in any other way promote, favour or ease the illegal consumption of toxic drugs, narcotics or psychotropic substances, or possess them with such purposes.”", "Get these in your inbox: We're fact-checking the news and sending it to your inbox. Sign up here to start receiving our newsletter.", "While it is illegal to sell marijuana in Spain, it is legal to smoke it for personal use in the space of your own home or on private property, according to SpainWeedGuide, a cannabis resource in Spain.", "If an individual is caught with marijuana in a public space, it is considered a criminal offense resulting in fines or jail time.", "Maldita notes that while the Spanish government accepted a recommendation from an expert at the World Health Organization to eliminate \"cannabis and cannabis resin from List IV of the 1961 Single Convention of Narcotic Drugs,\" it does not mean that it has been legalized in Spain or the European Union.", "Fact check:Image falsely shows Mercury, Venus and Saturn aligned with the pyramids of Giza", "Spain does not have 32-hour workweeks, however, there is a proposed pilot program recently introduced by Más Pais, Spain's small left-wing political party, that is advocating the idea.", "Specifics of the pilot program are still being discussed with the government, but Más Pais has proposed a three-year, $59.5 million project that would allow companies to test out the four-day workweek, according to The Guardian.", "Under the proposal, the government would cover the expenses of the program at 100% for the first year, 50% for the second year and 33% for the following year. Héctor Tejero of Más País said around 200 companies with a total of 3,000 to 6,000 workers could participate in the program, The Guardian reported.", "Maldita emphasizes that the pilot program has not been authorized nationwide in Spain and the Work and Social Economy Ministry's website states that \"the maximum duration of an ordinary working day will be of 40 hours per week.\"", "Fact check: A baobab tree in South Africa that once housed a pub is closed to the public", "The claim that Spain has legalized marijuana and 32-hour workweeks is FALSE, based on our research. There are no reports of the country legalizing cannabis. The Spanish government has reportedly agreed a pilot program testing out 32-hour workweeks, however an ordinary workweek in Spain nationwide is 40 hours.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]