["This post was published on Facebook on February 22, 2020. It has been shared hundreds of times.", "Below is a screenshot of the misleading post:", "The lengthy post purports to provide new information about the novel coronavirus outbreak from a “Dr. Khin Maung U”, a medical expert “with a master’s degree, and works in Shenzhen Hospital”.", "It reads, in part: “If you have a runny nose and sputum when you have a cold, you cannot be a new type of coronavirus pneumonia, because coronavirus pneumonia is a dry cough without runny nose. That is the simplest way to identify.”", "The post also mentions possible home remedies for the virus, such as “eat more ginger, garlic”; both of which have been debunked as misleading claims by AFP Fact Check here and here.", "The same post was also published here and here on Facebook, and here on Twitter.", "The claims are false; health advisories from China, the US and the World Health Organization (WHO) all list a runny nose and sputum production as symptoms of novel coronavirus infection.", "This information sheet on the novel coronavirus released by the Chinese Center for Disease Control and Prevention states: “The main clinical manifestations of 2019-nCoV infection are fever, fatigue and dry cough. A few patients also develop symptoms such as nasal obstruction, runny nose, sore throat and diarrhea.\"", "This Q&A section of the WHO’s website also states: “The most common symptoms of COVID-19 are fever, tiredness, and dry cough. Some patients may have aches and pains, nasal congestion, runny nose, sore throat or diarrhea”; and this US Centers for Disease Control study lists “sputum production” as a “less commonly reported symptom”.", "AFP conducted several searches for the Dr. Khin Maung U named in the misleading posts, but was unable to find a medical expert with the same name at a hospital, or otherwise.", "There is also no “Shenzhen Hospital”, where the misleading post claimed Dr. Khin Maung U works — the closest names are Peking University Shenzhen Hospital, The University of Hong Kong-Shenzhen Hospital and Shenzhen Hospital of Southern Medical University, as noted here on the website of the Shenzhen local government. None of the hospitals list a doctor by the name of Dr. Khin Maung U as a member of the faculty.", "As of March 2, 2020, the coronavirus has killed over 3,000 people and infected more than 88,000 since emerging in China in December 2019, AFP reported.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]