["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "An A-team of Florida Republicans packed a Tampa stage Wednesday to welcome Mitt Romney and rally supporters in the final days of the presidential campaign.\n\nFormer Gov. Jeb Bush and U.S. Sen. Marco Rubio were in the lineup, as well as Agriculture Commissioner Adam Putnam, who warmed up the crowd and encouraged voters to head to the polls early.\n\n\"Early vote now so that you can wave signs on election day next Tuesday,\" Putnam said. This is a team sport. This is a team sport. It's fully interactive. We can't just show up and cheer and slap a bumper sticker on the back of our car and think we're done. We've got to drag people to the polls. That's what they're doing. You don't have to offer them cell phones like they're doing.\"\n\nThat line about cell phones caught our attention. We decided to investigate. Is the Obama campaign offering cell phones to get voters to the polls?\n\nThe ‘Obama phone’ myth\n\nWay back in 2009, a reader asked us to check out a chain email declaring, \"TAX PAYER MONEY IS BEING REDISTRIBUTED TO WELFARE RECIPIENTS FOR FREE CELL PHONES.\"\n\nThe email called the phones \"Obama phones,\" suggesting the program was an Obama administration creation. The phone program, the email said, threatened \"the very foundations that this country was built on,\" and \"the age old concepts of God, family, and hard work.\"\n\nWe learned that there is, in fact, a government program that provides discounted phone service to low-income people, depending on where participants live, through Federal Communications Commission programs. Specifically, a program called Lifeline provides discounts on basic monthly phone service, according to the FCC website.\n\nEligible participants must have an income that is at or below 135 percent of the federal poverty level or use Medicaid, food stamps, federal public housing assistance, or supplemental security income, among other things. In some cases, states administer their own programs.\n\nLifeline and programs like it have been around quite a while. Lifeline was created in 1985 and expanded in 2008 during the Bush administration to include cell phone service. An FCC spokeswoman told PolitiFact in 2009 that the 1996 Telecommunications Act required the FCC to create the Universal Service Fund, a pool of money subsidized by small charges on phone bills and redistributed to low-income service programs, as well as programs that bring telecommunications services to rural areas and schools.\n\nIn early 2012, the FCC implemented changes to Lifeline aimed at modernizing the program and eliminating fraud and waste. One goal: ensuring availability of broadband for all low-income Americans.\n\nNew life in the campaign\n\nDebunking aside, the \"Obama phones\" myth re-emerged during the presidential race. In September, video of an unidentified woman protesting at a Romney rally in Cleveland made its way onto some conservative websites, including the Drudge Report. The woman claimed to have received a free \"Obama phone.\"\n\n\"Everybody in Cleveland -- low, minority -- got Obama phones,\" she tells an interviewer. \"Keep Obama in president (sic). He gave us a phone. He’s gonna do more.\"\n\nThe interviewer asks how Obama gave her a phone. Her response: \"You sign up if you on food stamps, you on Social Security, you got low income, you disability.\"\n\nRadio host Rush Limbaugh reacted by saying, \"She may not know who George Washington is or Abraham Lincoln, but she knows how to get an Obama phone.\"\n\nThe Obama campaign also responded, posting a story on its Truth Team website swatting down the rumor and explaining the history of the phone program.\n\nThe \"he gave us a phone\" video has become an internet meme, yielding remixes and parodies galore. And earlier this month the group Tea Party Victory Fund released a political ad in Ohio featuring the woman’s rant.\n\nPutnam’s response\n\nWe reached out to Putnam’s spokesman at the Florida Department of Agriculture, Sterling Ivey, for backup to the claim. Shortly after our inquiry, Ivey pointed us to Putnam’s Facebook page, where this note was posted:\n\n\"About those cell phones: I'd heard about the YouTube video, wasn't aware it was disclaimed. Won't happen again,\" Putnam wrote Wednesday afternoon.\n\nIvey added: \"I think it’s one of those myths that’s obviously grown a life of its own. He wasn’t aware there was a disproving of the statements in the video.\"\n\nOur ruling\n\nPutnam told Romney supporters that the Obama campaign is offering cell phones to get its voters to the polls.\n\nInternet chatter claiming that Obama gave cell phones to welfare recipients contained a tiny grain of truth: The federal government does have a program to subsidize phone service for low-income people. That program, though, existed long before Obama became president.", "Putnam then squeezed all reality out of the story, twisting it into an allegation of dirty campaigning. He has since acknowledged the statement was wrong -- but not before announcing it at a high-profile presidential campaign rally. We rate his statement Pants on Fire!", "PolitiFact, \"Chain e-mail claims Obama is handing out free cell phones to the needy,\" Oct. 28, 2009\n\nFederal Communications Commission, consumer facts about Lifeline , accessed Oct. 31, 2012\n\nFederal Communications Commission press release, \"FCC reforms, modernizes Lifeline to keep low-income Americans connected to jobs, family, 911 services,\" Jan. 31, 2012\n\nObama campaign website, \"Fact check: Right-wing blogs push debunked ‘Obama phones’ attack,\" Sept. 29, 2012\n\nYoutube.com, \"Original Obamaphone Lady: Obama Voter Says Vote for Obama because he gives a free Phone,\" Sept. 26, 2012\n\nThink Progress, \"Tea Party Group Launches Racist ‘Obama Phone’ Ad,\" Oct. 15, 2012\n\nAtlantic, \"The Obama phone’s roots in government deregulation,\" Oct. 2, 2012\n\nTea Party Victory Fund ad, \"Obama Gave Us a Phone\" Oct. 12, 2012\n\nAdam Putnam Facebook page, accessed Oct. 31, 2012\n\nInterview with Sterling Ivey, Florida Department of Corrections spokesman, Oct. 31, 2012", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]