["“I am not required to descend into poverty for YOU. I am not required to abstain from human contact for YOU. I refuse to participate in ‘quarantine life’ until there's an unsafe, untested vaccine released in eighteen months,” says part of a lengthy August 6, 2020 Facebook post.", "“YOU stay home. YOU wear a mask. YOU live in fear. I on the other hand will not as is my soverign right to choose NOT TO,” the post says.", "The post is also attributed to Carlson on Facebook here, on Instagram here and here and on Reddit here.", "The conservative Fox News host has criticized measures aimed at curbing the spread of the coronavirus.", "But Carlson is not the source of the specific comments attributed to him in the social media posts and by this website, a Fox News spokeswoman told AFP by email.", "Searching for the text of the comments on the Fox News site as well as on the internet as a whole does not credibly tie them to Carlson.", "And the comments -- either in part or in full -- have also been credited on social media to Tucker Wilson and Kristen Lynne Hall, as well as to an unknown author.", "They also appear in full in this letter to a North Carolina weekly, while parts are included in this column for a newspaper from California.", "Carlson’s show has an average audience of several million viewers every weeknight, and is the most-watched show in the history of cable TV.", "The comments attributed to Carlson are just the latest example of text written by others circulating on social media under a famous person’s name. AFP Fact Check has previously debunked posts falsely attributed to Anthony Fauci, Tim Allen, Ron Howard and Serena Williams.", "AFP Fact Check has also debunked more than 590 examples of false or misleading information about the novel coronavirus crisis. A complete list of our fact checks on the topic in English can be found here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]