["About this rating", "On 6 May 2017 the somewhat official-looking web site United News published an item reporting that a Texas man hired a prostitute, only to discover upon her arrival that he had accidentally hired his own wife:", "In a story resembling elements of the classic 1979 ‘Piña Colada Song’, the man – who we cannot identify for privacy reasons – had been using the booking website for some months to hire prostitutes and meet them for sex at motels in neighboring areas ... On the most recent occasion, which occurred last weekend, the man told his wife he was going on a fishing trip with friends, when in reality he was travelling to a motel on the outskirts of town.", "Upon checking into the motel on Saturday afternoon the man used his phone to access his regular website used to book prostitutes. According to a statement he made to authorities, he saw the profile of a new 28-year old woman who caught his attention.", "As with many of the photos on the site, the photo only showed the woman from her neck down, but the man is said to have liked what he saw and he sent her a message to see if she was free later that night, and what her price would be for 2 hours.", "She replied back within minutes to confirm she was available, and could meet up with him at the motel that night. The pair agreed on a price of $150, bargained down from her original request of $200.", "Guests at the hotel in adjoining rooms called the front desk to report a disturbance at around 8 pm after the woman arrived at the property and found that her client was none other than her husband of the last 17 years.", "The item bears an uncanny resemblance to a decades-old urban legend about a man who hires a prostitute (or visits a brothel) only to learn that his daughter is employed at the establishment. Additionally, the page format is virtually identical to a recent Border Herald fake news item about a \"diarrhea incident\" at a Florida strip club:", "Although United News bears no disclaimer we can find, it appears to be one of a number of regional fake news sites; its fellows include outfits like the Baltimore Gazette, the Seattle Tribune, and the Florida Sun Post. The sites, which pose as the digital counterparts for non-existent regional newspapers and primarily share shocking or salacious claims fabricated to rack up social media shares and traffic, are occasionally picked up by tabloids and other sources and then reproduced as \"real\" news.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]