["About this rating", "In November 2020, Sony released the newest in the line of PlayStation consoles: PlayStation 5 (PS5). But shoppers had a hard time finding a PS5 because of shortages and scalpers who used \"sophisticated bots\" to quickly buy up any stock. Meanwhile, Google searches for PS5 availability at Walmart trended in November and December 2020, following the Nov. 12, 2020, release date.", "So when we came across TikTok videos that purported to show Walmart employees \"trying 2 stash\" away PS5s for themselves, we decided to take a closer look.", "The videos were posted by TikTok user @skitdaddle_420. He claimed to find a \"stash\" of PS5s that were hidden away by Walmart employees in what appeared to be the store's garden section. We were unable to confirm the Walmart location where the videos were recorded. The first video had been viewed more than 269,000 times:", "A second video showed a cage with multiple PS5 consoles and accessories locked inside:", "However, the TikTok videos did not show that Walmart employees had \"stashed\" a bunch of PS5 consoles for themselves. All of the boxes visible in the second video were marked with names and either \"pickup\" or \"delivery,\" because they were already purchased. At the end of the first video, an unidentified person told @skitdaddle_420: \"These are for people who ordered them online.\" This meant they were likely preorders or online orders.", "As for the scalper problem that had plagued the launch of the PS5 and Xbox Series S and X, Chicago Tribune reported it could threaten the platform's longterm success:", "A console’s debut is supposed to set off a virtuous cycle of consumers rushing to buy the devices, while developers release games that capitalize on new graphics and processor capabilities, sending demand on both sides surging. Sony risks suffering the opposite.", "“The PlayStation 5 could miss a critical chance to get into a good hardware-software upward spiral,” said Kazunori Ito of Morningstar Research. “The peak of the platform will likely be low and the platform’s total revenue earned won’t be as strong as we hoped for.”", "Scalpers deploy bots that constantly monitor online stores for changes in inventory and supplies, then automatically place orders and check out in seconds when devices become available. The technique is based on familiar web-crawling or scraping technology, but is specifically tailored for e-commerce and can sometimes jump to the front of order queues.", "Walmart published a blog post about what it calls \"grinch bots\" and called on lawmakers to help with the problem:", "We have more next-gen consoles coming online soon, and we’re continuing to work hard to get them into the hands of as many customers as possible. We hope others across the retail industry will join us by asking lawmakers to do more to prevent these unwanted bots on retail sites, so customers have equal access to the products they want.", "For further reading, we previously published another story about video games that claimed Grand Theft Auto (GTA) 6 was hinted at in a GTA Online teaser.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]