["One of the posts is this January 14, 2019, entry that has been shared hundreds of times and has a caption that translates in English to: “How about this one? The ship is sinking. They raise the two-finger salute #2019PrabowoSandi”.", "Subianto is the sole opposition candidate to President Joko Widodo in national elections in April. Raising two fingers has become a sign of support for Subianto because he is number two on the ballot in the elections. Here is a story on the ballot numbers.", "#2019PrabowoSandi is a popular hashtag for Subianto and his vice presidential running mate, Sandiaga Uno.", "The text overlay in the misleading photo of Mulyani and Shihab translates to English as: “The ship is sinking, captain. The crews are starting to find rescue by jumping to another ship”.", "The photo was also used in the same misleading context here on the Facebook page of “PRABOWO - SANDI #PAS UNTUK INDONESIA” (PRABOWO - SANDI #FIT FOR INDONESIA) on December 21, 2018.", "AFP’s examination using Google Reverse Image found that the image is genuine but was taken in 2017 at a literary festival sponsored by Indonesia’s finance ministry.", "Shihab shared the photo to her Instagram and Facebook page on September 5, 2017. In the caption, she said “At the Literacy Festival at the finance ministry building with Ms. Sri Mulyani Indrawati. We exchanged stories about our favourite books.”", "Below is her Instagram post.", "Festival Literasi di Kementerian Keuangan bersama Ibu @smindrawati. Bertukar cerita soal berbagai buku kesukaan. #salamliterasi #dutabacaindonesia #AyoMembaca * Thank u @amandahartantobatik x @whulandary", "A post shared by  Najwa Shihab (@najwashihab) on Sep 5, 2017 at 5:20am PDT", "Below is her Facebook post.", "The finance ministry on September 5, 2017, also shared a poster of the event to its official Facebook page. The post and its image said Shihab was one of the speakers attending the event.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]