["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The University of Texas System’s chancellor suggests that if you’ve been a UT undergraduate--on any campus--you’re likely not buried in school debt.", "Bill McRaven prefaced his January 2016 declaration: \"I’m proud to say, and I checked these numbers for about the hundredth time yesterday, because I always make sure that I don’t get my pants on fire in terms of that Pants on Fire meter.\"", "\"But across the University of Texas,\" McRaven told the Texas Higher Education Coordinating Board, \"our undergraduates..., their debt is less than $21,000… That’s probably one of the lowest debts across the nation--and so we’re proud of that.\"", "We couldn’t resist checking his figure, finding it has a basis yet there are paths to a range of figures, especially if you bore in on graduates of particular UT institutions.", "A 12-year median", "Asked what McRaven was recalling, a UT System spokeswoman told us the median cumulative debt for certain UT graduates was $20,755 (meaning half the graduates had more debt, half had less) in inflation-adjusted 2014 dollars. By email, Jenny LaCoste-Caputo said McRaven’s figure, based on data collected for graduates from UT institutions over the dozen years through 2012-13, reflected borrowing related to tuition and fees, room and board, books and supplies as well as transportation and other expenses.", "Those figures show some graduates accumulating far less debt, others more. For instance, some 10 percent owe $5,415 or less while at the high end, 10 percent owe $42,051 or more.", "LaCoste-Caputo, asked why McRaven highlighted the 12-year median, said the chancellor seeks to show that a UT degree pays off. She said that according to a UT System analysis, median annual earnings of graduates 10 years after graduation run about $60,000.", "Whatever the chancellor's intention, 12 years struck us as a pretty wide time window. So to our request, LaCoste-Caputo provided the median debt for loan-taking graduates of UT schools solely for the latest available year, 2012-13. That median debt load was $23,350, some 13 percent greater than the 12-year median.", "Transfer students not considered", "We confirmed another wrinkle: UT's median debt figures don’t reflect every graduate or loan.", "LaCoste-Caputo said the median calculations consider only graduates who also had been first-time students on a UT campus--not reflecting any debts accumulated by transfer students from non-UT institutions such as community colleges. For the dozen years, she advised, McRaven relied on data for 43,900 bachelor’s degree recipients and didn’t have sufficient data for 82,380 degree recipients who borrowed money while attending other schools besides UT. Put another way, she said, the median figure McRaven touted considers information for about 35 percent of the student-borrowers to get a UT degree in the period.", "Brace yourself. We're about to share other ways of looking at UT student debt plus some national figures.", "Another Texas analysis", "More research made us think a graduate's debt level can be influenced by which UT school she or he embraces.", "On behalf of the coordinating board, spokeswoman Kelly Carper Polden replied to our email queries by saying loan-taking UT students who graduated in the 12 months through August 2015 had average debt ranging from less than $17,500 to more than $39,000, counting state, federal and reported parent loans.", "Average Debt, Loan-Taking Graduates, University of Texas Schools, Fiscal 2015", "Institution", "Average Debt", "UT-Arlington", "$24,970", "UT-Austin", "$39,305", "UT-Brownsville", "$23,634", "UT-Dallas", "$24,028", "UT-El Paso", "$22,593", "UT–Pan American", "$17,264", "The University of Texas of the Permian Basin", "$20,516", "UT-Rio Grande Valley*", "Not Available*", "UT-San Antonio", "$30,406", "UT-Tyler", "$28,474", "SOURCE: Texas Higher Education Coordinating Board (chart fielded by email from Kelly Carper Polden, assistant director of communications, May 6, 2016)", "*UT-RGV, bringing together the former UT-Brownsville and UT-Pan American, started operations in September 2015.", "From beyond Texas, Sandy Baum of the Washington, D.C.-based Urban Institute nudged us to information on a federal website enabling us to peg the median federal-loan student debt for 2013-14 graduates from each of nine UT campuses. By our calculation, the median across the UT schools averaged $18,465. Graduates of UT-Pan American had the lowest median debt, $12,994. Graduates of UT-San Antonio had the biggest, $23,723.", "Also, Sara Goldrick-Rab at the University of Wisconsin responded to our inquiry by suggesting we consider work by the Oakland-based Institute for College Access & Success, an independent nonprofit that says it works to make higher education more available and affordable for people of all backgrounds.", "Next, the institute’s Matthew Reed said by email that according to data volunteered by the majority of U.S. colleges to Peterson’s, which publishes a college guide, among 2013-14 graduates from UT schools who took out loans, the average debt level (not adjusted for inflation) ranged, by campus, from $14,900, at UT-Pan American, to $27,337, at UT-San Antonio--with average debt at the Austin flagship being $27,207. An institute spreadsheet also showed average loan totals for graduates of UT-Dallas ($19,613), UT-Arlington ($23,210) and UT-El Paso ($24,000).", "All told, these figures suggest a 2013-14 average debt level for loan-taking UT graduates of $22,711--about $2,000 more than McRaven’s 12-year inflation-adjusted median figure.", "But the \"transfers\" caveat persists: Reed said that like McRaven, the institute was limited to data for students who went to the same institution before graduating; no transfers considered. What gives? Reed said colleges resist efforts to collect data for all students, saying it’s unfair to hold them accountable for students who borrowed while studying elsewhere. Separately, Mark Kantrowitz, a Chicago-based expert, said by phone that Congress even barred the government from tracking individual students and their respective debt loads.", "\"Not perfect data,\" Reed said, \"but they’re the best available.\"", "UT versus nation", "McRaven also said UT students probably carry smaller debt loads than peers nationally. Asked how he reached that judgment, LaCoste-Caputo pointed out the College Board’s Trends in Student Aid 2015 report, which states that in 2012-13, the average cumulative debt for bachelor’s degree recipients from U.S. public, four-year institutions was $25,500. Worth noting: 61 percent of students who earned bachelor’s degrees in 2013-14 from the public or private nonprofit four-year institutions at which they began their studies graduated with debt, the report says. Such borrowers, it says, averaged $26,900 in loans, reflecting an inflation-adjusted increase of 17 percent over a decade.", "Separately, we spotted an institute web page stating the average debt of 2013-14 graduates of public four-year institutions was $25,902 with the average debt in federal loans equaling $22,901. The average debt for graduates of private nonprofit institutions was $29,567, according to the page.", "And by our read of the spreadsheet provided by Reed, the average debt for loan-taking graduates of six reporting UT schools exceeded the average debt for graduates from about 200 other institutions nationally. But the UT average trailed the average for graduates of about 910 U.S. colleges and universities.", "By phone, Kantrowitz said  that by his estimate, debt accumulated by 2015 loan-taking U.S. college graduates averaged $35,000, counting federal and private-institution loans. Worse: Kantrowitz said he projects 2016 graduates to average about $37,000 in accumulated debt. We wondered why his figures considerably outpace estimates from others. Kantrowitz said he rolls in data from more institutions, public and private.", "He also emailed us a spreadsheet indicating that about 70 percent of recent graduates carry some school-loan debt.", "Our ruling", "McRaven said that across the UT system, undergraduate student debt \"is less than $21,000… probably one of the lowest debts across the nation.\"", "The experiences of graduates over a dozen years supports this figure. Data also support the notion that UT graduates wind up less debt-burdened than most peers.", "Still, UT's analysis (like others) doesn't account for debts piled up by transfer students. Significantly too, UT graduates in 2012-13 had a median debt of $23,350, which outpaces the long-term figure aired by McRaven by more than $2,000.", "We rate the claim Mostly True.", "MOSTLY TRUE – The statement is accurate but needs clarification or additional information. Click here for more on the six PolitiFact ratings and how we select facts to check.", "Video, remarks by Bill McRaven, chancellor, University of Texas System, before Texas Higher Education Coordinating Board, Jan. 21, 2016 (1:23:09 to 1:23:20 mark)", "Emails, Jenny LaCoste-Caputo, executive director for public affairs, University of Texas System, April 20 and 25; May 5 and 9, 2016", "Emails, Kelly Carper Polden, assistant director of communications, Texas Higher Education Coordinating Board, May 5-9, 2016", "Report, Trends in Student Aid 2015, the College Board, 2015 (accessed May 9, 2016)", "Web page, \"Student Debt of Graduating Seniors, 2013-14,\" College Insight website, the Institute for College Access & Success, undated (accessed May 9, 2016)", "Email and telephone interview, Matthew Reed, program director, The Institute for College Access & Success, May 5-6, 2016", "Telephone interview and emails, Mark Kantrowitz,  publisher and vice president of strategy, Cappex.com, May 9, 2016", "Spreadsheet, \"Debt at Graduation for Bachelor's Degree Recipients with Geometric Interpolation/Projection,\" Mark Kantrowitz (received by email May 9, 2016)", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]