["The OECD says that jobs and earnings in the UK are good.", "Correct.", "The OECD says that important steps have been taken in the UK to improve educational outcomes.", "Correct.", "The OECD says that fiscal sustainability in the UK has improved.", "Correct.", "The OECD says that the UK has the most efficient, accessible healthcare system.", "Incorrect. The OECD says that the UK’s healthcare efficiency is weak.", "“The OECD says about the United Kingdom:  we have the most efficient, accessible healthcare system, fiscal sustainability has improved, important steps have been taken to improve educational outcomes, and jobs and earnings are good. That’s what the OECD says about the strong economy under this Conservative government.”", "Theresa May’s claims seem to be drawn from an October 2017 report by the OECD into the UK economy. We’ve asked the Department of Health for more information.", "The report assesses many aspects of the UK economy in order to give an overall picture. This means that quoting small parts of the report does not tell the whole story. For instance, whilst they recognise the UK’s low unemployment rate, they also recognise that growth is slow in 2017.", "Overall, the OECD considers UK economic performance to be “solid” up to the end of 2016.", "Honesty in public debate matters", "You can help us take action – and get our regular free email", "I’m in", "The OECD says that the UK’s healthcare efficiency is weak. The OECD measure this by comparing how efficiently UK healthcare works compared to the best performing countries. We’ve asked the Department of Health for more information.", "Fiscal sustainability looks at whether government spending can be maintained in the long run and it can continue to pay its debts.", "The OECD report says: “Fiscal sustainability has also improved, with the budget deficit falling towards 3.0% of GDP and public debt stabilising at below 90% of GDP in 2016.”", "The budget deficit (the difference between the government’s income and spending) has been falling since 2010/11. Public debt has risen significantly since the recession, but has recently stabilised just below 90%.", "The report says that “Important steps have been taken to improve the educational outcomes and basic skills of disadvantaged students.”", "However, it has a number of criticisms including that “low basic skills in the United Kingdom prevail across all education levels, and the percentage of young adults with low basic skills is higher than in the OECD” and it says higher child poverty could “increase the number of children whose disadvantaged background affects their educational chances”.", "The OECD does also say that “jobs and earnings are good”.", "They also say that “low-skilled workers in the United Kingdom have comparatively lower earnings than low-skilled workers in other G7 countries, and the effect of higher skills proficiency on wages is particularly important in the United Kingdom.”", "Full Fact fights for good, reliable information in the media, online, and in politics.", "Bad information ruins lives. It promotes hate, damages people’s health, and hurts democracy. You deserve better.", "Full Fact, 17 Oval Way, London, SE11 5RR", "Full Fact is a registered charity (no. 1158683) and a non-profit company (no. 06975984) limited by guarantee and registered in England and Wales. © Copyright 2010-2023 Full Fact. Thanks to Bytemark for donating our web hosting.\n                        \n                        Privacy, terms and conditions."]