["Former New York Mayor Rudy Giuliani was indeed an original member of the Iraq Study Group, formed at the request of Congress to conduct a bipartisan assessment of the situation in Iraq.", "And he was either fired or quit from that panel after missing two official meetings.", "Here's what we know.", "Giuliani was appointed to the panel in March 2006, then missed two two-day meetings. On the dates of those meetings, he was paid for lucrative speaking appearances elsewhere.", "On April 11-12, 2006, the first official meeting of the Iraq Study Group was held in Washington, D.C. Where was Giuliani? On April 12, he was a keynote speaker at the FT Asian Financial Centers Summit in South Korea. His net fee: $160,000.", "The second official meeting of the group was May 18-19, 2006. Where was Giuliani? On May 18, he spoke at the Georgia 100 annual awards breakfast in Atlanta. His net fee: $80,000. Later that day, he attended a $100-a-plate fundraiser for former Christian Coalition leader Ralph Reed, then a candidate for lieutenant governor of Georgia.", "James Baker, secretary of state under the first President Bush, was co-chair of the Iraq Study Group, along with former U.S. Rep. Lee Hamilton, D-Ind. Baker declined to comment for this story.", "But his co-chair explains how Giuliani left the group.", "Hamilton says that after Giuliani told Baker he couldn't attend the second meeting in a row, \"(Baker) said, 'I'm going to have to go to another person.' \"", "On May 31, 2006, the group announced former U.S. Attorney General Edwin Meese III would replace Giuliani.", "At the time, Giuliani said: \"My previous time commitments do not permit me the full and active participation that the Iraq Study Group deserves.\"", "It's unclear whether he was fired or forced to quit, but consider this: During his two-month tenure on the panel, between March 15, 2006, and May 24, 2006, Giuliani made 30 paid appearances for a net revenue of $2.25-million, according to his financial disclosure forms.", "Pretty simple to us; McCain's attack is True.", "Iraq Study Group,\n\nReport", "Press release,\n\n\"Edwin Meese Replaces Rudolph Giuliani on Iraq Study Group,\"\n\nU.S. Institute of Peace, May 31, 2006", "Event Program,\n\nFT Asian Financial Centers Summit,\n\nSeoul, South Korea, April 2006", "Associated Press article, \"Giuliani named to bipartisan panel reviewing U.S. policy in Iraq,\" March 16, 2006", "New York Times article, \"In a Southern Foray, Giuliani Helps a Friend but Skirts an Issue,\" by Patrick Healy, May 19, 2006", "Atlanta Journal-Constitution article, \"Giuliani endorses Reed for lieutenant governor, 300-plus turn out for fundraiser,\" by Jim Galloway, May 19, 2006", "Atlanta Journal-Constitution article, \"Giuliani shares secrets,\" by Maria Saporta, May 25, 2006", "News conference, Rudy Giuliani in Tampa, Nov. 15, 2007", "Interview with Lee Hamilton, former U.S. representative from Indiana and co-chair of Iraq Study Group, Nov. 15, 2007", "Interview with Alan Simpson, former U.S. senator from Wyoming and Iraq Study Group panel member, Nov. 15, 2007", "Interview with Leon Panetta, former White House chief of staff and Iraq Study Group panel member, Nov. 16, 2007", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]