["Sometimes it's the contradictions that drive PolitiFact to check a statement.", "In a commentary published Aug. 5, 2013, in The Providence Journal, Steve Goreham, executive director of the Climate Science Coalition of America, was critical of the science behind the warnings that Earth is getting hotter due to pollution. His first paragraph made this assertion: \"Global surface temperatures have been flat for 16 years.\"", "Yet three days earlier, the National Oceanic and Atmospheric Administration reported that 2012 was one of the 10 warmest years on record. All 10 have occurred since 1998.", "Who's right here? We decided to check Goreham's factoid.", "We contacted him to ask where he got his numbers and how his claim stacked up with NOAA's.", "\"The short answer is that both are correct,\" he said in an email. \"Temperatures have been flat for the last 16 years and 2012 was one of the 10 warmest years on record.\"", "We weren't sure how they could both be correct, so we again asked Goreham what he was using for data. We didn't hear back immediately, so we started looking on our own.", "Our first stop was the National Oceanic and Atmospheric Administration database.", "Those data show that over the past 16 years -- 1997 through 2012 -- 15 have been the warmest on record. The readings go back to 1880.", "But how did the temperatures change during that period?", "In 2012, the global temperature was 0.43 degrees Fahrenheit higher over land than it was in 1997. Over land and water, the difference was 0.11 degrees. That's not flat.", "But temperatures naturally fluctuate so much from year to year, It's misleading to just compare two points in time. Goreham is talking about the overall trend, which climate experts use to see long-term changes over time.", "To find a trend, you have to do a more sophisticated calculation, preferably over a much longer period than 16 years. But 16 years is the period Goreham chose -- and what many other global warming skeptics have focused on -- so we'll stick with that for now.", "The trend line shows that the annual global temperatures listed by NOAA rose by 0.141 degrees during that stretch.", "To put this in perspective, when you're only dealing with a 16-year period, a lot depends on when you want to start looking.", "If you shift the timeframe back by just one year, beginning with 1996, the increase more than doubles, to 0.351 degrees.", "When we heard back from Goreham after asking about the NOAA database, he said we would \"probably\" see flat temperatures beginning in 1997. He also suggested we look beginning in 2001 to 2012 and said the temperature trend in that period would be flat. In fact, it was a bit negative. But that's not the 16 years he cited in his claim.", "Why start 16 years ago? It includes 1998, when an El Nino made surface temperatures exceptionally warm. When you start near an unusually hot year, there's a good chance that subsequent years will be cooler.", "There's another problem: When you get into temperature changes that small and time frames that short, the natural variability of climate can be so large that any \"trend\" might be the result of chance.", "\"Generally, for these short periods, if you're within 0.05 [of a degree Celsius] per decade you're not significantly different from zero,\" said John Christy of the University of Alabama in Huntsville, one of the country's best-known skeptics of global warming. (Over a 16-year period, that means the change would have to be higher or lower than 0.144 degrees Fahrenheit to be significant.)", "\"None of the data sets show anything much different from zero since the last 16, 17 years,\" he said. Since the 1998 El Nino, \"it's been pretty flat. There's been a slowdown in the trend.\"", "So by Christy's gauge of what would be significant, the 0.141 degree increase from 1997 through 2012 seen in the NOAA database is essentially no increase, as Goreham said.", "In addition to the NOAA database, we looked at the two other major climate databases, one from NASA and the other from the Hadley Centre of the Met Office, which is the United Kingdom's National Weather Service.", "We used a tool available at SkepticalScience.com, which supports the global warming theory as do the vast majority of climate scientists. Its Temperature Trend Calculator page allows users to pick from among several sets of temperature data and pick various timeframes.", "Hadley showed a .170 degree increase over those 16 years and NASA's numbers showed a .251 rise. Although they would indicate a significant rise by Christy's off-the-cuff definition, a more precise calculation done by the Temperature Trend Calculator showed that none of the increases exceeded chance.", "Thus, the global temperatures that were rising so rapidly in the 1970s, ‘80s, and ‘90s have stalled.", "The Met Office has begun referring to the last 16 years as \"the recent pause in warming.\" Officials there have issued three reports to try to explain the plateau. They stressed that the last decade was still the warmest on record and asserted that temperatures will likely resume their rapid rise soon, although the agency is not offering a timetable.", "Said physicist Robert Brecha, of the University of Dayton: \"There is increasing evidence in the peer-reviewed literature that over the past decade or so more thermal energy is going into the deep ocean, rather than into the atmosphere. This is almost certainly just a temporary, cyclical process.", "\"The key point is that additional greenhouse gases trap heat in the earth system, keeping that energy from flowing back out to space,\" Brecha said. \"So if the atmosphere doesn't receive that heat [thereby increasing its temperature] that trapped energy is nevertheless building up.\"", "One last note. Goreham, in his commentary, was citing the 16-year trend in a broader context.", "He and other warming skeptics argue, with some justification, that the newest global readings are so far afield from the alarming temperature increases that were once predicted by climate computer models, it raises serious questions about whether scientists understand Earth's changing climate as well as they think they do, and whether it's worth spending trillions of dollars to try to influence it.", "But we'll save that controversy for another fact-check.", "Our ruling", "Steve Goreham said \"Global surface temperatures have been flat for 16 years.\"", "The databases we checked generally show small increases during that period, but not enough to be statistically significant, thanks to a short timeframe and a starting point that included an unusually warm year in 1998.", "That's why, at the same time, NOAA data clearly show that global temperatures in 15 of the last 16 years have been the hottest recorded.", "So Goreham is correct that the temperature trend has been flat, but it's flat at record highs. Because his statement reflects cherry-picked numbers and leaves out important details that would give a very different impression, we rate it Half True.", "(If you have a claim you’d like PolitiFact Rhode Island to check, e-mail us at [email protected]. And follow us on Twitter: @politifactri.)", "ProvidenceJournal.com, \"Steve Goreham: Why the climate models of global warming are wrong,\" Aug. 5, 2013", "Emails, Steve Goreham, executive director, Climate Science Coalition of America, Aug. 17 and 19, 2013", "NCDC.NOAA.gov, \"Global Surface Temperature Anomalies\" and \"State of the Climate,\" NOAA, National Climatic Data Center, accessed Aug. 16, 2013", "MetOffice.gov.uk, \"The recent pause in warming,\" Aug. 13, 2013, accessed Aug. 20, 2013", "SkepticalScience.com, \"Temperature trend calculator,\" undated, and \"What has global warming done since 1998?\" updated Jan. 10, 2013, both accessed Aug. 19, 2013", "NASA.gov, \"Global Temperature Difference,\" accessed Aug. 20, 2013", "Email, Robert Brecha, physicist, University of Dayton, Aug. 21, 2013", "Email, Dan Williams, press officer, Met Office, Aug. 20, 2013", "Interview and emails, John Christy, director, Earth System Science Center, University of Alabama in Huntsville, Aug. 19-22, 2013", "Emails, Alyson Kenward, chemist and senior scientist, Climate Central, Aug. 15-16, 2013", "Interview, Thomas C. Peterson, principal scientist, National Climatic Data Center, Aug. 23, 2013", "DrRoySpencer.com, \"Global Warming Slowdown: The View from Space,\" April 13, 2013, accessed Aug. 19, 2013", "ScienceMediaCentre.org, \"Briefing Notes on Recent Slowdown in Global Temperature Rise,\" undated, accessed Aug. 20, 2013", "NYTimes.com, \"What to Make of a Warming Plateau,\" June 10, 2013, accessed Aug. 20, 2013", "Skeptical Inquirer, \"Has Global Warming Stopped?\" September/October 2013 issue", "DailyMail.co.uk, \"Global warming stopped 16 years ago, reveals Met Office report quietly released . . . and here is the chart to prove it,\" Oct. 13, 2012, updated Oct. 16, 2012, accessed Aug. 19, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]