["Radio show host Chris Salcedo said that Justice of the Peace Dianne Hensley (pictured) is being asked to choose between giving up her careers or violating her religious beliefs by performing same-sex marriages. That's False. (Houston Chronicle)", "During an interview on a Fort Worth radio program with Texas Attorney General Ken Paxton, host Chris Salcedo pressed his guest about the case of a Waco justice of the peace who was sanctioned by a state commission earlier this month for only officiating opposite sex, but not same-sex, marriages.", "The State Commission on Judicial Conduct issued Justice of the Peace Dianne Hensley a public warning over her refusal to perform same-sex ceremonies; the commission could take further action if she refuses to stop the practice.", "Paxton, a Republican, reiterated the stance of his office, one that has not changed since just after the 2015 Supreme Court decision legalizing gay marriage. He said people are entitled to religious exemptions when it would violate their faith to carry out the duties of their job.", "On the show, Salcedo characterized the case as such:", "\"I shouldn’t have to give up my career — make a choice, either give up your career or violate your religious beliefs,\" Salcedo said. \"The government shouldn’t put me in that position.\"", "Saledo’s description of Hensely’s situation is inaccurate. No one is asking Hensley to violate her religious beliefs to keep her career: officiating marriages is an optional activity. A state commission’s opinion on the matter suggested she could officiate all or no marriages, but not selectively choose one type.", "Protection of religious beliefs", "Justices of the peace handle low-level civil and criminal cases, including traffic and other Class C misdemeanor cases and civil cases involving up to $10,000.", "They can also officiate marriages, but this is considered \"extra-judicial,\" an optional activity that earns them thousands per year in personal income.", "So while there may be some financial incentive to do it, it is by no means required.", "In fact, some justices of the peace in Texas have chosen not to officiate any marriages in order to avoid the religious dilemma, including in McLennan County, where Hensley hails.", "The commission decided to investigate Hensley based at least in part on a Waco Herald-Tribune article in which she was quoted about her decision to decline same-sex marriages and how she believed she was entitled to a religious accommodation.", "It found that she had refused to perform same-sex marriages since 2016, instead only performing opposite-sex marriages and referring same-sex couples to other officiating JPs and clergy.", "The state commission that sanctioned Hensley said her actions cast \"doubt on her capacity to act impartially to persons appearing before her as a judge due to the person’s sexual orientation.\"", "Now, Hensley can appeal the sanction, start performing same-sex marriages or stop performing marriages altogether.", "Hensley has argued that she is entitled to a \"religious exemption,\" but there is no law or legal precedent in Texas establishing such an exemption for a justice of the peace in this context.", "This question varies by state, depending on whether the state’s Supreme Court has taken up a case and established a precedent.", "In separate interviews, Douglas Laycock and John Dzienkowski, law professors at the University of Texas, said they weren’t aware of any such cases in Texas.", "Two legal opinions on the subject that have been issued by state agencies — a 2015 opinion from the attorney general’s office and the Judicial Commission sanction — are nonbinding.", "In a 2015 opinion filed after the U.S. Supreme Court case on same-sex marriage, Paxton supported people’s right to assert a religious exemption under the First Amendment, though he noted that fines and litigation were possible.", "The recent Judicial Commission opinion punished Henlsey for giving off the appearance of bias, seeming to indicate an exemption would not be possible.", "But Laycock said neither document is legally binding.", "\"The basic answer is we don’t know yet,\" Laycock said. \"This may well wind up in the courts.\"", "Some states, such as North Carolina, have passed laws on this subject, but Texas has not.", "The North Carolina law allows some officials, similar to a justice of the peace, to decline to administer any marriages if they have a \"sincerely held religious objection\" to same-sex marriage, but they may not be selective and only marry opposite-sex couples.", "Other positions have different requirements", "People in other government positions, like county clerks who issue marriage licenses, have less flexibility, as issuing marriage licenses can be part of their job description.", "Perhaps most famously, Kim Davis, a clerk in Kentucky, refused to issue a license to a same-sex couple and, in a high-profile case, she was sued. When she refused to comply with the judge’s order compelling her to follow the law, she was jailed for six days for being in contempt of court. Davis was later released after agreeing not to interfere with other clerks in the office issuing licenses.", "Some county clerks in Texas are allowing those officials who object to same-sex marriage to find another clerk within the office to issue a license in their place.", "But if everyone else in the office also refuses, the office as a whole can’t deny a couple the right to marry in defiance of the law, Laycock said.", "That may explain why no religious exemption case has risen to the Supreme Court level in Texas, Laycock said. As long as the couple receives their license or has their marriage officiated, the damages they can claim in court are limited to emotional distress.", "That someone in Hensley’s position should not be forced to choose between their job and religious belief, as Salcedo commented, is \"not a settled rule of law yet; it’s an opinion about what the law ought to be,\" Laycock said.", "Our ruling", "Salcedo said justices of the peace like Hensley are being asked to choose: \"give up your career or violate your religious beliefs.\"", "Justices of the peace are not required to officiate marriages and do so mainly for their own benefit, not as an integral duty of the job. Clerks, on occasion, may not have the luxury of that choice, but that is not what Salcedo called out in the statement. Plus, there hasn’t been an authoritative ruling in Texas on either situation.", "We rate this statement False.", "Interview with University of Texas law professor Douglas Laycock, Dec.", "Interview with University of Texas law professor John Dzienkowski, Dec.", "Vermont Law Review, Icing on the Wedding Cake: Same-sex marriage and religious objections — is there an accomodation that will make everyone equally happy (or unhappy)?, Feb. 3, 2018", "USA Today, Court rejects Kentucky's attempt to shirk legal fees in Kim Davis gay marriage case, Aug. 23, 2019", "Waco Tribune-Herald, No courthouse weddings in Waco for same-sex couples, 2 years after Supreme Court ruling, June 24, 2017", "Houston Chronicle, Texas judge gets a warning for refusing to perform gay marriages, Dec. 3, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]