["By D'Angelo Gore", "Posted on February 8, 2021", "The campaign committee for House Democrats is running ads that claim eight House Republicans “stood with Q, not you,” because they voted against impeaching then-President Donald Trump for inciting the violent insurrection at the Capitol.", "But none of the targeted Republicans is known to be an actual supporter of QAnon, whose acolytes baselessly think a group of elite pedophiles runs the government and the entertainment industry. Some QAnon followers also participated in the deadly Jan. 6 riot because they believed the false claims that the 2020 election was stolen from Trump.", "While all eight members named by the Democratic Congressional Campaign Committee voted against impeaching Trump for a second time, three of them — Reps. Brian Fitzpatrick of Pennsylvania, Don Bacon of Nebraska and Young Kim of California — supported a resolution to censure Trump for the role he played in the attack on Congress.", "The DCCC says it is spending over $500,000 on the ad campaign that “exposes seven vulnerable Washington Republicans and [House] Minority Leader [Kevin] McCarthy for being too weak to stand up to President Trump and the QAnon mob after Trump whipped them into a murderous frenzy, making it clear that each ‘stood with Q, not you.'”", "The ads, which are some of the first ones the committee has released for the 2022 election cycle, are playing online and airing on broadcast and cable stations in Dallas, Los Angeles, Miami, Philadelphia, Omaha and Washington, D.C.", "All seven of the ads start with a narrator saying: “QAnon, a conspiracy theory born online, took over the Republican Party, sent followers to Congress, and, with Donald Trump, incited a mob that took over the Capitol and murdered a cop.”", "From there, the ads accuse Fitzpatrick, Bacon, Kim, McCarthy, as well as Reps. Beth Van Duyne of Texas, Maria Elvira Salazar of Florida, and Michelle Steel and Mike Garcia of California of being cowards who voted to protect Trump.", "At the end of each ad, the narrator says the GOP representatives in question “stood with Q, not you.” Here’s an example:", "But it’s misleading to suggest they all support QAnon because — according to the citations in the ads — they opposed Trump’s second impeachment.", "We know of only two members of Congress who have previously promoted or expressed support for the QAnon movement: Republican Reps. Marjorie Taylor Greene of Georgia and Lauren Boebert of Colorado. Boebert, however, later said that she is “not a follower of QAnon.” (Both Greene and Boebert are shown on screen in the DCCC ads.)", "In fact, in September, Fitzpatrick was among a bipartisan group of five House members who co-sponsored Democratic Rep. Tom Malinowski’s nonbinding resolution “condemning QAnon and rejecting the conspiracy theories it promotes,” according to a congressional summary. Bacon, Garcia and McCarthy also were among the 371 House members who voted in favor of that resolution the following month. (The other four Republicans the DCCC is going after were not in Congress at the time of the vote.)", "In addition, Fitzpatrick, Bacon and Kim supported a resolution to censure Trump rather than impeach him.", "In a statement, Fitzpatrick, who introduced the resolution, which attracted a total of nine Republican co-sponsors, said: “I support a bipartisan censure resolution making sure that the Congress holds the President accountable by putting it on the record that Congress condemns his reprehensible conduct which led to the riots at our nation’s Capitol — a permanent stain on his legacy. Our country deserves closure, and the opportunity to begin anew with the incoming administration. And a censure resolution is the only unifying means for achieving this.”", "Bacon said he supported a censure because Trump “was wrong to not concede and bears much responsibility for what happened on January 6.” Kim said censuring Trump was “a better option” than impeachment and “would be a strong rebuke of his actions and rhetoric and unite our country and chamber, rather than divide it.”", "As for the other GOP members mentioned in the attack ads:", "DCCC spokesman Cole Leiter defended the ads in a phone call.", "He told us there is no question that Republicans who opposed impeachment voted to protect Trump rather than hold him accountable, which he said puts them on the side of many QAnon members who also were against impeaching Trump.", "But, as we said, three of those who voted not to impeach Trump — Fitzpatrick, Bacon and Kim — criticized Trump over the attack on the Capitol and supported reprimanding him with a censure, which is a form of disapproval.", "That wouldn’t carry the same legal weight as an impeachment conviction, but it’s direct criticism of Trump, not an endorsement.", "Editor’s note: FactCheck.org does not accept advertising. We rely on grants and individual donations from people like you. Please consider a donation. Credit card donations may be made through our “Donate” page. If you prefer to give by check, send to: FactCheck.org, Annenberg Public Policy Center, 202 S. 36th St., Philadelphia, PA 19104.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]