["About this rating", "A tax on feminine hygiene products (also known as a \"tampon tax\") was not new by the time social media interest in the topic appeared in May 2016, but a screenshot published by the page \"Women's Rights News\" contributed the buzz:", "The image originated with a 15 January 2016 interview between YouTube personality Ingrid Nilsen and President Barack Obama. The \"I don't know anyone who has a period who thinks it's a luxury\" comment was made by Nilsen, not the President:", "The topic was already steadily popular.  NYMag.com published an article on 29 April 2016 that explored social media interest in the tampon tax:", "Pads and tampons have made political headlines in every single month of this year. In January, lawmakers in California, Utah, Virginia, and Michigan introduced anti-tampon-tax bills. They were mostly sponsored by women (shout out to Delegate Mark Keam in Virginia, though!). Notably, in each of those states, except California, the mostly Democratic sponsors are vastly outnumbered in their Republican-heavy legislatures. Also in January, the tampon tax made headlines when Obama learned about it while the camera was rolling, and declared he thought the tax was unfair. Then, in February, similar bills were introduced in Illinois, Wisconsin, and New York. In March, the city of Chicago dropped its tampon tax, and a class-action lawsuit brought by women in Ohio and New York state added pressure to stop taxing periods. In April, the New York Senate unanimously passed the tampon tax bill.", "This is an astounding amount of national legislative momentum for an issue that was long considered to be women’s private, shameful burden. It’s no coincidence that efforts to end the tampon tax have cropped up alongside viral art projects, new businesses, and digital campaigns to destigmatize menstruation. The tampon tax is the perfect of-the-moment issue for lawmakers who want to signal their support for women — and take a stance on inequality. Ending the tax, which promises practical benefits for low-income women, is low-hanging fruit for legislators in liberal states.", "A widely circulated June 2015 map created by Fusion illustrated the tampon tax with color coding.  Most states taxed feminine hygiene products, except a few that had either specific exemptions or no sales tax at all:", "Minnesota, Pennsylvania, New Jersey, Massachusetts, and Maryland specifically did not tax [PDF] feminine hygiene products. Alaska, Oregon, Montana, New Hampshire, and Delaware do not have sales tax on any items (including tampons). The rest of the states maintained a tax on such products. One outlier was the state of New York, which moved in April 2016 to abolish the tax:", "The Republican-led Senate on Monday unanimously passed a bill exempting feminine hygiene products from sales tax, two months after the debate over the so-called tampon tax reached Albany.", "The bill, sponsored by freshman Sen. Sue Serino, a Republican from Hyde Park, passed with 58 votes.", "The vote on the Senate floor took about one minute, just enough time for at least one period joke.", "“It is a way of providing some tax relief to women everywhere, young girls in particular,” Sen. Diane Savino said, thanking the bill sponsor. “But on behalf of women of a certain age everywhere, I would love to offer a friendly amendment and ask for a rebate program, Senator Serino. But I know it would probably bankrupt the state.”", "Lawmakers in Michigan expressed interest in advancing a similar initiative, and the city of Chicago (but not the state of Illinois) axed the tax. On 12 April 2016, MarketWatch reported some momentum both in and outside the U.S. to end the additional charges:", "The issue has made it onto the agenda in about 10 states, seven of which introduced the legislation, including New York (though Utah’s never made it out of committee) and three, South Carolina, Tennessee and Illinois, that recently debated it. It has also gone international, with France cutting the sales tax in late 2015 and the European Union taking a stance on the issue this year.", "In May 2016, the majority of the 40 states with a tampon tax retained it (although New York was on its way to tax-free status for feminine hygiene products). By and large, social media tampon tax claims were accurate. To be clear, tampons weren't taxed at a special or higher rate than other taxable items — they simply were subject to sales tax in general.", "Coughlin, Sarah.   \"Chicago Removes Its Tampon Tax —& The State Of New York Is On Its Way To Doing The Same.\"\r\nRefinery29.   13 April 2016.", "Court, Emma.   \"New York Is The Latest State To Scrap Tampon Tax.\"\r\nMarketWatch.   12 April 2016.", "Friedman, Ann.   \"How Ending The Tampon Tax Became Viral Legislation.\"\r\nNYMag The Cut.   29 April 2016.", "Hillin, Taryn.   \"These Are The U.S. States That Tax Women For Having Periods.\"\r\nFusion.   3 June 2015.", "Larimer, Sarah.   \"The 'Tampon tax,' Explained.\"\r\nWashington Post.   8 January 2016.", "Miller, Faith.   \"Why Two Senators Want To Get Rid Of Michigan's 'Tampon Tax.'\"\r\nWILX.   14 April 2016.", "Velasquez, Josefa.   \"Senate Unanimously Passes Bill Eliminating 'Tampon Tax.'\"\r\nPolitico New York.   11 April 2016.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]