["The Oprah Winfrey Network told PolitiFact “there was no payment of any kind to Prince Harry and Meghan, The Duke and Duchess of Sussex, for the interview.”", "In the interview heard across the pond and around the world, tens of millions of viewers tuned in March 7 to watch Oprah Winfrey interview Prince Harry and Duchess of Sussex Meghan Markle in a prime time special aired on CBS.", "Almost immediately following the interview, unsourced social media posts claimed the former royals benefited financially from the experience and were paid $7 million for their time.", "\"When a Hollywood actress gets paid $7,000,000 to complain to a billionaire talk show host about how becoming a princess made her a victim, it becomes clear that America is in dire need of a better class of attention whores,\" read a March 9 Facebook post.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "Winfrey herself stated at the beginning of the televised interview that Prince Harry and Markle were not receiving any sort of direct financial compensation for their cooperation. Markle also affirmed this, but that didn’t prevent widespread conjecture from unnamed sources on social media from claiming otherwise.", "Chelsea Hettrick, who is vice president for the Oprah Winfrey Network, said in an email to PolitiFact that \"there was no payment of any kind to Prince Harry and Meghan, The Duke and Duchess of Sussex, for the interview.\"", "The only party that profited was Winfrey’s production studio when it came time to sell the rights to broadcast the special.", "The blockbuster interview was a product of Winfrey’s production company, Harpo Productions, and was ultimately picked up by CBS Entertainment Group for an undisclosed sum. Hettrick declined to discuss the figure that CBS paid for licensing rights. Chris Ender, executive vice president for CBS Entertainment, also declined in an email to PolitiFact to reveal the agreed upon license fee.", "However, on March 5, two days before the interview was slated to air, The Wall Street Journal reported that CBS shelled out between $7 million and $9 million for the license fees, adding that a spokesperson for the Duke and Duchess of Sussex were not being paid for the interview. Representatives for Archewell, the organization founded by the couple that includes audio and video production arms as well as a nonprofit, did not respond to an email from PolitiFact.", "There is no evidence that suggests Meghan Markle was paid any amount, let alone $7 million, to give an interview to Oprah. We rate this claim False.", "Facebook post, March 9", "Video: \"CBS Presents Oprah with Meghan and Harry: A Primetime Special,\" March 7, 2021", "Email interview with Chelsea Hettrick, vice president for the Oprah Winfrey Network, March 10, 2021", "Email interview with Chris Ender, CBS Entertainment Group executive vice president for communications, March 10, 2021", "The Wall Street Journal, \"Meghan Markle and Prince Harry Interview With Oprah Fetches at Least $7 million From CBS,\" published March 5, 2021. Accessed March 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]