["The claim was shared to Facebook by a Fiji-based user here. It has been shared more than 180 times.", "The text superimposed on the image reads in part: “Himalayan flowers that only flowers [sic] every 400 years. Our generation has the privilege of being able to see it.”", "Similar Facebook posts were published to Facebook, here, here, here and here. Collectively they have been shared tens of thousands of times on the platform.", "The claim, however, is false.", "A reverse image search found the same image published here on a Chinese blog about the South African white king protea flower.", "A Google image search for “white king protea flower bud” also found multiple other images that show similar or exactly the same flower that is seen in the Facebook post and the Chinese blog post. Examples can be seen here, here and here.", "The king protea, or protea cynaroides, grows throughout the southern parts of South Africa and has a number of different colours and leaf shapes across varying subspecies. It is also the country’s national flower.", "The king protea blooms at different times throughout the year depending on habitat and climate, according to the South African National Biodiversity Institute.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]