["A video of Elizabeth Antony, the wife of former Defence Minister AK Antony, performing a ritual on ‘INS Vikrant’ is doing the rounds on social media. It is being claimed that Mrs Antony was drawing a ‘cross’ on the aircraft carrier and baptising the vehicle. “Former Defence Minister A.K Anthony’s wife Elizabeth drew a cross on INS Vikrant and Baptised it during its launch….no one had any problem.. Hallelujah!!!”, read the message tweeted along with the video, which has been retweeted more than 6,700 times so far.", "Former Defence Minister A.K Anthony’s wife Elizabeth drew a cross on INS Vikrant and Baptised it during its launch…. no one had any problem.. Hallelujah!!! pic.twitter.com/34nauFgRid", "— Dón Grieshnak (@DGrieshnak) October 9, 2019", "Indian folk singer and Padma Shri Malini Awasthi posted the same video with a similar narrative. It has garnered more than 1,200 retweets.", "हिन्दू रीतियों से ॐ के अंकन को पुरातनपंथी मानने वाले छद्म धर्मनिरपेक्षियों को यह ज़रूर देखना चाहिए।युद्धकपोत आईएनएस विक्रांत को नौसेना में शामिल करते समय तत्कालीन रक्षामंत्री ए के एंथोनी द्वारा #INSVikrant को ‘बेपटाइसड’ किया गया था और उनकी पत्नी एलिज़ाबेथ ने उसपर ‘क्रॉस’ बनाया था pic.twitter.com/bFp2hvBAgC", "— मालिनी अवस्थी (@maliniawasthi) October 10, 2019", "The same video posted Facebook page India Against Urban Naxals has amassed more than 1,600 shares.", "Twitter handle @AMIT_GUJJU also posted the video with a similar narrative. It has garnered close to 1,900 retweets so far.", "With a Google search, Alt News found that Elizabeth Antony had launched the indigenously-built Aircraft Carrier ‘INS Vikrant’ at Cochin Shipyard in Kochi on August 12, 2013. Moreover, Twitter user Sanakan Venugopal found a video where the wife of former Defence Minister can be seen performing puja on the ship and not ‘baptising’ the ship as claimed on social media. At 55 seconds in the video, Mrs Antony can be seen drawing a figure on the ship. Throughout the rituals performed during the inauguration, a Hindu priest can be seen constantly instructing Antony, hence it couldn’t have been a catholic ceremony.", "According to an article published by Prokerala website on August 13, 2014, Mrs Antony was applying kumkum on the IAC as part of the launch ceremony.", "In conclusion, an old video of the former Defence minister’s wife performing puja on the aircraft carrier was shared with the false claim that she was baptising the ship. It was suggested that she had then performed a ‘Christian’ ritual on the ship.", "Donate Now", "Jignesh is a writer and researcher at Alt News. He has a knack for visual investigation with a major interest in fact-checking videos and images. He has completed his Masters in Journalism from Gujarat University.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]