["About this rating", "Niagara Falls (actually the collective name for a set of three waterfalls along the Niagara River that forms the border between New York and Ontario: the American Falls, the Bridal Veil Falls, and the Canadian/Horseshoe Falls) is the celebrated natural phenomenon that has awed generations of honeymooners. Although it may seem astounding to contemplate, the tremendous volume of rushing water (hundreds of thousands of gallons per second) that is Niagara Falls does \"freeze\" from time to time, although very rarely \"completely\" as suggested in the text accompanying the following image -- despite the abundance of ice visible in the image, water can still be seen flowing over the falls in several distinct streams:", "Thought you might appreciate seeing this old photo. I've read of this but never saw the photo before. Makes you wonder just HOW COLD and HOW LONG it was that cold!!", "THIS PICTURE WAS TAKEN WHEN NIAGARA FALLS WAS COMPLETELY FROZEN IN THE YEAR 1911. A VERY RARE PHOTO.", "As noted in the Washington Post, the sight of a \"frozen\" Niagara falls is not so unusual a phenomenon:", "Niagara Falls gets cold every year. The average temperature in Niagara Falls in January is between 16 and 32 degrees. Naturally, it being that cold, ice floes and giant icicles form on the falls, and in the Niagara River above and below the falls, every year. The ice at the base of the falls, called the ice bridge, sometimes gets so thick that people used to build concession stands and walk to Canada on it. It’s nothing out of the ordinary. It is not, to put it bluntly, big polar vortex news.", "During occasional periods of prolonged cold weather falling water and spray from Niagara Falls may freeze into ice formations, and ice mounds or floes may form in the Niagara River (sometimes creating ice bridges that stretch across the width of the river), but only once in recorded history has freezing weather actually stopped water from flowing over the falls. This instance occurred in March 1848 when a preponderance of ice above the falls reduced the flow of water over the falls to a trickle, as reported in the Buffalo Express newspaper:", "The Falls of Niagara can be compared to nothing but a mere mill dam this morning. In the memory of the oldest inhabitants, never was there so little water running over Niagara's awful precipice, as at this moment! Hundreds of people are now witnessing that which never has, and probably never may again be witnessed on the Niagara River.", "Last night at 11 o'clock the factories fed from the waters of this majestic river were in full operation, and at 12 o'clock the water was shut off, the wheel suddenly ceased their revolutions, and everything was hushed into silence. Various are the conjectures as to the cause; the most reasonable of which is that Lake Erie must be making a grand delivery of ice, and this the mouth of the Niagara, although large, is not quite enough to take in the whole at once, and that the consequences are, back water.", "The sepia-toned photograph shown above (which dates to about 1909) corresponds to a view of the American Falls:", "Although the text that accompanies the sepia image in e-mail forwards and social media postings usually states that the photo dates from 1911, other sources assign a variety of different dates to it. Much of the Niagara River around the falls was frozen in 1912, an occurrence that resulted in a tragic accident when an ice bridge across the river broke free from its shoring as several people were traversing it. Three people were unable to make it back to shore in time and were killed as the loosened ice plunged down the river.", "In the wake of the January 2014 \"polar vortex\" that brought bitterly cold weather to much of the eastern half of the United States, a number of photographs were circulated via social media purporting to show Niagara falls in a currently frozen state:", "All of these images antedated the January 2014 polar vortex, however, having originated in 2007, 2012, and 2011, respectively. (The falls did ice over twice during the winter of 2014, however.)", "Later versions of the example e-mail that was originally forwarded in 2007 included additional (undated) photographs of the falls in winter, obviously from different years (from top left: 1906, 1902, and 1936):", "Boston Cultivator.   “Phenomenon at Niagara Falls.”\r\n15 April 1848   (p. 125).", "Los Angeles Times.    “A Crash and Death.”\r\n    5 February 1912    (p. I1).", "The New York Times.    “Swept to Death on Niagara Ice.”\r\n    5 February 1912    (p. 1).", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]