["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In March 2020, cities across the United States started to implement various orders to \"shelter in place,\" \"stay at home,\" or \"self-quarantine\" in an attempt to stop the spread of COVID-19, the disease caused by the new strain of coronavirus that emerged in 2019. While these measures appeared to work in helping to \"flattening the curve\" of cases, they also caused a dramatic economic downturn and caused millions of people to lose their jobs.", "In mid-April 2020, U.S. President Donald Trump and the White House started working on a plan to \"re-open America.\" Around the same time, cities such as Lansing, Michigan, started to see small, anti-quarantine protests that Trump gave verbal support to on his social media account, tweeting \"LIBERATE MICHIGAN!\" and \"LIBERATE MINNESOTA!\" and \"LIBERATE VIRGINIA and save your great 2nd Amendment. It is under siege.\"", "As Trump worked toward easing social distancing measures and re-starting the economy — a decision that worried many health experts — an old tweet started to recirculate on social media that supposedly showed him criticizing governors for relaxing quarantine rules during the Ebola outbreak in 2014:", "This is a genuine tweet from Trump. It is still available on his Twitter timeline here. An archived version of this tweet can be seen here.", "Trump's old tweets are frequently shared on social media along with the message \"There's a tweet for everything,\" a phrase meant to encapsulate the idea that for every current Trump statement there is an equal and opposite statement of his from another time. While many of the \"there's-a-tweet-for-everything\" messages point to genuine and seemingly contradictory tweets from the president's past, we've also encountered quite a few fake tweets supposedly sent from Trump.", "It should also be noted that the quarantines in 2014 during the Ebola outbreak were much different than the quarantines put in place during the COVID-19 coronavirus disease pandemic. In 2014, no state-wide \"shelter-in-place\" orders existed. Rather, a handful of states required people who had come in contact with someone infected with Ebola to quarantine for 21 days.", "Trump, who was the host of the television show \"The Apprentice\" during the Ebola outbreak, frequently criticized President Barack Obama during that epidemic. On Oct. 23, 2014, for instance, he said it was \"Obama's fault\" after a case of Ebola was confirmed in New York.", "Conversely, in March 2020, Trump said \"I don't take any responsibility\" when he was asked about a lack of testing to deal with the spread of COVID-19.", "Guinea, Liberia, and Sierra Leone saw more than 11,000 die from Ebola between 2014 and 2016. In the United States, two people died from the disease.", "Infectious Disease Society of America.   \"Ebola Facts.\"\r\n    Retrieved 21 April 2020.", "Fantz, Ashley.   \"'Doctor's Death Marks Second U.S. Ebola Fatality.\"\r\n    CNN.   17 November 2014.", "Oprysko, Caitlin.   \"'I Don't Take Responsibility at All': Trump Deflects Blame for Coronavirus Testing Fumble.\"\r\n    Politico.   13 March 2020.", "Kenen, Joanne.   \"Trump’s Plans to Reopen the Country Face Major Obstacles.\"  \r\n  Politico.   18 April 2020.", "Beauont, Peter.   \"WHO Warns of 'Deadly Resurgence' if Coronavirus Controls Lifted Too Soon.\"\r\n    The Guardian.   10 April 2020.", "Lambert, Lance.   \"The Worst Part About the U.S. Losing 10 Million Jobs in Two Weeks? The Real Number May be Much Higher.\"\r\n    Fortune.   2 April 2020.", "Karni, Annie; Lovett, Kenneth; Otis, Ginger.   \"Travelers in Contact with Ebola Patients, Including Returning Nurse with Fever, Now Face Mandatory 21-Day Quarantine in New York, New Jersey.\"\r\n    New York Daily News.   25 October 2014.", "Shesgreen, Deirdre and Maureen Groppe.   \"Anti-Quarantine Protests, Trump Pressure Put Governors on Political Tightrope Over Coronavirus.\"\r\n    USA Today.   22 April 2020.", "Forgey, Quint.   \"Trump breaks with his own guidelines to back conservative anti-quarantine protesters.\"\r\n    Politico.   17 April 2020.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]