["Multiple posts shared hundreds of times on Facebook and Twitter claim the Australian government cut AUD 200 million from the New South Wales Rural Fire Service (NSW RFS) in the state’s 2020-21 budget. The claim is false; NSW RFS told AFP that budget documents show government funding for the fire service has actually increased for 2020-21.", "The misleading claim was published here in a Facebook post on November 17, 2020.", "The image in the post reads: “Hidden in the NSW budget, the Liberals have cut $200 million from the Rural Fire Service. Unbelievable.”", "The amount AUD 200 million is equivalent to $146 million.", "A similar claim appeared here and here on Facebook, as well as here on Twitter, where it has been shared nearly 1,000 times.", "The claim circulated after Australia suffered a particularly devastating bushfire season from September 2019 to early 2020, with parts of New South Wales intensely affected.", "The claim is false.", "In response to the posts, a New South Wales Rural Fire Service spokesperson told AFP by email on November 18, 2020, that “the claim is not true.”", "The spokesperson also pointed to a tweet published on November 18, 2020, by NSW RFS commissioner Rob Rogers, noting the “record budget” the agency had received.", "Great to see another record budget for the #NSWRFS. An additional $148.2 million will be spent in key areas of firefighter mental health, protective clothing, new and improved trucks, and enhancements to Fires Near Me. Important funding to support our volunteers and community", "It states: “Great to see another record budget for the #NSWRFS. An additional $148.2 million will be spent in key areas of firefighter mental health, protective clothing, new and improved trucks, and enhancements to Fires Near Me. Important funding to support our volunteers and community”.", "As per the footnotes in this NSW 2020-21 budget document, the NSW RFS’s budget was increased by AUD 148.2 million ($108.3 million) after a catastrophic 2019-20 bushfire season.", "“NSW RFS 2019-20 Original Budget was $524.3 million. The 2019-20 summer bushfires led to a significantly higher Natural Disaster Response and Recovery expenditure, with a significant portion within NSWRFS. Compared with the 2019-20 Budget, the NSWRFS budget has increased by $148.2 million in 2020-21,” reads the footnote.", "Below is a screenshot of the relevant section in the document, highlighted by AFP:", "A table on page 20 of the same document shows that the NSW RFS was originally allocated AUD 524.3 million ($383 million) for 2019-20, but its estimated actual expenditure was AUD 867.2 million ($633.5 million).", "The same table shows the NSW RFS budget for 2020-21 is AUD 672.5 million ($491.3 million), thus an increase of AUD 148.2 million compared to the previous year’s allocation.", "Below is a screenshot of the table:", "Dr Michelle Cull, senior lecturer of accounting from the University of Western Sydney, also refuted the claim. \"The budget has actually increased,\" she told AFP by phone on November 20, 2020.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]