["About this rating", "In February 2021, an image supposedly showing musician Rihanna holding the flag of Pakistan circulated on social media:", "This is not a genuine image of Rihanna holding a Pakistan flag.", "This fake photo was created by altering an image of Rihanna at an ICC 2019 World Cup cricket match between the West Indies and Sri Lanka. In the genuine photograph, Rihanna is holding a flag in support of the West Indies team.", "The International Cricket Council shared the genuine photograph to their Twitter account on July 1, 2019. Here's a look at the genuine photo (left) and the doctored image (right):", "The fake image of Rihanna holding a Pakistan flag was circulated on social media after the singer drew attention to farmers in India who have been staging a months-long protest against new agriculture laws.", "Here's an excerpt from the article Rihanna shared with her 100 million followers:", "Internet access remained blocked Monday in several districts of a state bordering India's capital following violent weekend clashes between police and farmers protesting controversial agricultural reforms.", "Online access would be suspended in at least 14 of 22 districts in Haryana state near New Delhi, until 5 p.m. Monday, according to the Department of Information and Public Relations of Haryana on Sunday. That order was first imposed Tuesday in three Haryana districts for 24 hours, but has been extended every day since.", "[...]", "The internet restrictions came after violent scenes last week as demonstrations continue against three agricultural laws passed in September. Since late November, hundreds of thousands of protesters have gathered on the outskirts of New Delhi to demonstrate against changes they say they weren't consulted on and which will hurt their livelihoods.", "The News International, an English-language Pakistani newspaper, noted that people who express criticism of India's government are often accused of being connected in some manner to Pakistan:", "Indian trolls have started taking aim at Barbados singer Rihanna after she tweeted on the farmers protest, urging people to start a conversation about her. Some Pakistanis on Twitter took the opportunity to craft witty memes that take aim at India's Pakistan-phobia anytime something happens in their country.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]