["Bihar police on October 15 arrested Mahagathbandhan (grand alliance) candidate from CPI-ML Aaftab Alam while he was filing his nomination papers to contest the upcoming state polls from Aurai constituency in Muzaffarpur. BJP Bihar claimed that Alam was accused of bombing Prime Minister Modi’s election rally in Patna. Ahead of the 2014 Lok Sabha election, a series of bomb blasts had injured over 80 and killed six persons on October 27, 2013 hours before then Prime Ministerial candidate Narendra Modi was to address a rally in Gandhi Maidan, Patna.", "दुष्कर्म के आरोपी, भगोड़े की पत्नी, जिन्ना समर्थक, सबको टिकट दिए,", "अब तो पीएम मोदी की रैली में बम धमाकों के आरोपी को भी ‘माले’ से उम्मीदवार बना दिए हो।", "Tejashwi Yadav बाबू", "#ई_का_किए_हो ?", "Posted by BJP Bihar on Sunday, 18 October 2020", "News18 Bihar also reported that Alam was accused of bombing PM Modi’s rally. “NIA had arrested Aaftab Alam from Muzaffarpur in a case pertaining to a series of bomb blasts that took place in Narendra Modi’s rally in Patna. He is currently out on bail,” wrote the outlet, later updating its report without citing any reasons for the change.", "National spokesperson of Vishwa Hindu Parishad (VHP) Vinod Bansal tweeted, “While Aaftab Alam who blasted Modi ji’s Patna rally has been given a Congress ticket from Aurai, Maskoor Usmani, the anti-national who hanged Jinnah’s portrait is contesting on Congress’s ticket from Darbhanga. The party has further strengthened its 70 years of commitment to jihadists and terrorists.”", "मोदी जी की पटना रैली में ब्लास्ट करने वाले आतंकी आफताब आलम को औराई से तो जिन्ना की फोटो लगाने वाले देशद्रोही मशकूर उस्मानी को दरभंगा के जाले से कांग्रेस की टिकट। पार्टी ने इससे 70 वर्षों की अपनी जिहादियों व आतंवादियों के साथ प्रतिबद्धता को और मजबूत किया है!!", "— विनोद बंसल (@vinod_bansal) October 18, 2020", "Several others who promoted the claim were Hindu Yuva Vahini member Yogi Devnath, Prashant Patel Umrao, Gaurav Pradhan, @Pushpendrakulss and Abhishek Kumar Khushwaha.", "This slideshow requires JavaScript.", "Facebook page ‘The Chaupal’ also published a report claiming Alam was arrested for his involvement in the Patna blast case.", "पीएम मोदी की रैली में सीरीज ब्लास्ट करने वाले महागठबंधन उम्मीदवार आफताब आलम को पुलिस ने किया गिरफ्तार", "Posted by The Chaupal on Sunday, 18 October 2020", "Alt News had debunked the false claim about Congress candidate Maskoor Usmani in an earlier report. Usmani did not hang Pakistan’s founder Muhammad Ali Jinnah’s portrait at Aligarh Muslim University (AMU). The portrait has been inside the campus since 1938. Our detailed fact-check report can be read here.", "The claim about Aaftab Alam accused in the 2013 Patna blast case is also false.", "Alam was indeed arrested on October 15 however, for an old case related to obstruction of government work. An FIR was lodged against him at Katra police station, according to Aaj Tak.", "“Aaftab was arrested by the police as soon as he stepped out after filing his nomination papers. CPI-ML workers protested against his arrest but the cops did not pay heed and took Aaftab to present him in court,” said the report. “The police said that a complaint was filed against Aaftab Alam on August 20, 2020 at Katra police station for obstructing a government servant from carrying his duties,” added the report. Navbharat Times carried a similar article.", "A non-bailable warrant was issued against the grand alliance candidate. Alam said that he was arrested for staging a protest against the murder of Katra resident Dilip Rai. “This is vendetta and a political conspiracy,” he responded.", "On August 27, Dilip Rai was found hanging from a tree in Singwari, Katra. Rai was a khaini (tobacco) trader. The police said that the youth was murdered and subsequently hanged. The incident angered villagers who accused the police of failing to catch murder culprits in several past cases. Alam had staged a protest to demand the arrest of the perpetrators. He had also posted about the protest on August 27. “We will not hand over the dead body unless the SP arrives. It is the public’s demand that the SHO is dismissed…Such incidents regularly happen and the police leave after filling panchnama,” he wrote.", "Alam was subsequently booked under IPC sections 143 (unlawful assembly), 186 (obstructs any public servant in the discharge of his public functions), 188 (punishment for disobedience to an order duly promulgated by a public servant), 353 (assault or criminal force used to deter public servant from discharging his duty), 504 (provocation to break public peace), 506 (punishment for criminal intimidation) and 34 (common intention). Alam was also booked under the Epidemic Diseases Act, 1897.", "Katra police confirmed Alam’s arrest details with Alt News. The relevant portions of the FIR have been attached below.", "This slideshow requires JavaScript.", "CPI-ML filed a complaint with Facebook public policy manager Vijaya Moorthy on the misinformation circulated by News18 Bihar and The Chaupal.", "“We are writing to report against malicious and fake news being spread against our party and our candidate from Aurai constituency for Bihar Election 2020, Comrade Aftab Alam by certain political and media organisations on their official Facebook page…Please find attached the copy of Aftab Alam’s election nomination document (which includes the mention of criminal cases against a candidate, if any) and it is clearly declared that the only case against Comrade Aftab Alam (see page 10 of Nomination form) is FIR 192/2020 at Kathra PS registered in 2020 in connection with a protest,” reads the complaint.", "Who were the accused in the Patna blast case?", "The National Investigation Agency (NIA) chargesheet named 10 people accused of carrying out a series of bomb blasts at then Gujarat CM Narendra Modi’s Patna rally in 2013. Aaftab Alam’s name does not feature on the list.", "“Investigations revealed that Imtiyaz along with others had planted the bombs at the Patna railway station and Gandhi Maidan, where the Hunkar rally of Gujarat Chief Minister Narendra Modi was being organised. Imtiyaz was associated with the Students Islamic Movement of India and also had very close links with the members of Indian Mujahideen,” said an NIA release, reported The Hindu in an August 24, 2014 report.", "The Economic Times had reported on August 23, 2014, “The NIA charge-sheet says the ten accused in this case also believed that Modi was responsible for the 2002 riots in Gujarat and held BJP responsible for the riots in Muzzafaranagar that had taken place just a month before Modi’s rally in Patna was targeted by the said terrorists in Patna.”", "BJP Bihar and News18, therefore, falsely claimed that grand alliance candidate from CPI-ML Aaftab Alam is one of the accused in the 2013 Patna bomb blast case. An FIR was registered against Alam in August 2020 after he staged a protest against the murder of a Katra youth.", "Donate Now", "Pooja Chaudhuri is a senior editor at Alt News.", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]