["About this rating", "The southern fjords of Greenland see some vegetation in the summer months. However...", "Greenland was primarily an ice-covered island when it was discovered by Erik the Red in the 10th century. He chose the name \"Greenland\" to encourage settlers to the area.", "The world's largest island is a vast tundra whose most defining geographical features are the large icebergs that line its coast. How then, did this icy region become known as Greenland?", "In March 2021, the etymological origins of Greenland found themselves at the center of the conversation on social media after Republican U.S. Sen. Ron Johnson of Wisconsin was quoted in The New York Times saying that Greenland was named Greenland because it was once a green land. The article, which focused primarily on Johnson's shaky relationship with the truth, later quoted Johnson saying that he had \"no idea\" if his statements about Greenland in this interview were accurate:", "But there were signs in that first campaign of Mr. Johnson’s predilection for anti-intellectualism. On several occasions, he declared that climate change was not man-made but instead caused by “sun spots” and said excess carbon dioxide in the atmosphere “helps the trees grow.” He also offered a false history of Greenland to dismiss the effects of global warming.", "“You know, there’s a reason Greenland was called Greenland,” Mr. Johnson told WKOW-TV in Madison back then. “It was actually green at one point in time. And it’s been, you know, since, it’s a whole lot whiter now so we’ve experienced climate change throughout geologic time.”", "In the interview on Thursday, Mr. Johnson was still misinformed about the etymology of Greenland, which got its name from the explorer Erik the Red’s attempt to lure settlers to the ice-covered island.", "“I could be wrong there, but that’s always been my assumption that, at some point in time, those early explorers saw green,” Mr. Johnson said. “I have no idea.”", "As the Times notes above, the \"reason Greenland was called Greenland\" is not because it was once a green land. The island actually received its deceptive name from Erik the Red, a Norse explorer who was exiled from Iceland circa 980 for murder. When Erik the Red established the first permanent European settlement in the ice-covered region to the west of Iceland, he dubbed the area \"Greenland\" in an attempt to make it sound more hospitable to potential settlers.", "The deceptive origins of Greenland's naming can be found in \"The Saga of Erik the Red,\" a text compiled between the 13th and 15th centuries. Here's an excerpt from an 1880 translation (emphasis ours):", "Eirik and his people were outlawed at Thorsnes Thing. He prepared a ship in Eiriksvagr (creek), and Eyjolf concealed him in Dimunarvagr while Thorgest and his people sought him among the islands. Eirik said to his people that he purposed to seek for the land which Gunnbjorn, the son of Ulf the Crow, saw when he was driven westwards over the ocean, and discovered Gunnbjarnarsker (Gunnbjorn's rock or skerry). He promised that he would return to visit his friends if he found the land. Thorbjorn, and Eyjolf, and Styr accompanied Eirik beyond the islands. They separated in the most friendly manner, Eirik saying that he would be of the like assistance to them, if he should be able so to be, and they should happen to need him.", "Then he sailed oceanwards under Snæfellsjokull (snow mountain glacier), and arrived at the glacier called Blaserkr (Blue-shirt); thence he journeyed south to see if there were any inhabitants of the country.", "He passed the first winter at Eiriksey, near the middle, of the Vestribygd (western settlement). The following spring he proceeded to Eiriksfjordr, and fixed his abode there. During the summer he proceeded into the unpeopled districts in the west, and was there a long time, giving names to the places far and wide. The second winter he passed in Eiriksholmar (isles), off Hvarfsgnupr (peak of disappearance, Cape Farewell); and the third summer he went altogether northwards, to Snæfell and into Hrafnsfjordr (Ravensfirth); considering then that he had come to the head of Eiriksfjordr, he turned back, and passed the third winter in Eiriksey, before the mouth of Eiriksfjordr.", "Now, afterwards, during the summer, he proceeded to Iceland, and came to Breidafjordr (Broadfirth). This winter he was with Ingolf, at Holmlatr (Island-litter). During the spring, Thorgest and he fought, and Eirik met with defeat. After that they were reconciled. In the summer Eirik went to live in the land which he had discovered, and which he called Greenland, \"Because,\" said he, \"men will desire much the more to go there if the land has a good name.\"", "This origin story is also recounted on the tourism site \"Visit Greenland,\" Etymology Online, and in the following passage from book \"Amid Greenland Snows; Or, The Early History of Arctic Missions\":", "In order to entice people to go to his new country he called it Greenland, and pointed it out as such an excellent place for pasture, wood, and fish, that the next year he was followed thither by twenty-five ships full of colonists, who had furnished themselves richly with household goods and cattle of all sorts ; but only fourteen of these ships arrived.", "While naming this ice-covered island Greenland was certainly a deceptive marketing ploy, Erik the Red was not being entirely dishonest. Greenland is primarily covered in ice, but there is vegetation in the southern fjords, especially during the summer when temperatures can reach 50 degrees Fahrenheit.", "The government of Greenland noted in a 2020 report:", "The deep fjords become so green, due to the warm summers, that Erik the Red, who was outlawed from Iceland for killing Eyjolf the Foul and Hrafn the Dueller, named the country Greenland. He believed the name to be likely to attract new settlers. South Greenland is still a hub of agriculture, based on the breeding of sheep imported from Iceland in 1915 and mixed with a few Faroese ewes and seven Scottish rams.", "It should also be noted that while Erik the Red may have slightly exaggerated the extent of Greenland's \"greeness\" when he encouraged his fellow Icelanders to settle the area, this name would have aptly described the island a few hundred thousand years before it's discovery by European settlers.", "According to Scientific American, the southern part of Greenland contained a forest 400,000 to 800,000 years ago:", "In 1981 researchers removed a long tube of ice from the center of a glacier in southern Greenland at a site known as Dye 3. More than a mile (two kilometers) long, the deep end of the core sample had been crushed by the pressure of the ice above it and sullied by contact with rock and soil. By destroying the pattern of annual layers, this contamination seemingly made it impossible to assess the region's ancient climate. But DNA extracted from the previously ignored dirty bottom has revealed that Greenland was not only green, it boasted boreal forests like those found in Canada and Scandinavia today.", "[...]", "Adds team member and glaciologist Martin Sharp of the University of Alberta in Edmonton: \"One could argue that this shows that natural forcing could account for the current warm conditions, but the current orbital configuration does not support this, even when other natural forcings are taken into account. One could also argue that if natural warming can deglaciate much of southern Greenland, then natural warming plus anthropogenic warming could cause even more extensive deglaciation.\"", "In short, the reason Greenland was named Greenland was because a Norse explorer named Erik the Red was hoping that the name would encourage people to settle on the newly discovered island. While Erik the Red had some standing to bestow this name on the land — the southern portion of Greenland does have some vegetation in the summer months — the island was primarily covered in snow and ice.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]