["On Feb. 1, the Myanmar military took control of the country, citing unproven allegations of voter fraud as their justification. In the days since, the action has been widely condemned by international leaders as an anti-democratic human rights violation.", "However, social media users are using the event to spin false narratives that bolster baseless pro-Donald Trump election disputes in the United States.", "“The Biden White House is freaking out after Myanmar Military arrests political leaders for Election Fraud in their November 8 elections,” claims one such Facebook post shared on Feb. 1. “Myanmar used Dominion Voting Systems.”", "The claim is accompanied by an image of former President Barack Obama, former Secretary of State Hillary Clinton and detained Myanmar politician Aung San Suu Kyi. Photojournalist Pete Souza took the photo on Nov. 19, 2012, at Suu Kyi’s residence in Yangon.", "The post mischaracterized the military takeover in Myanmar and falsely states Dominion Voting Systems was involved.", "Dominion, a voting technology company used by many U.S. states and municipalities, has been the center of many false claims about election fraud promoted by Trump’s supporters and legal team since he lost the election in November. USA TODAY has fact-checked several  of  these  claims and found none to be true.", "More:Fact check: No basis for claims that President Joe Biden's inauguration was faked", "USA TODAY reached out to the Facebook user and did not receive a response.", "Dominion machines were not used in Myanmar’s 2020 election, according to a statement from Dominion Voting Systems issued to USA TODAY. The statement described the claim as \"completely false\" and noted that the company's machines have never been used in Myanmar.", "More:Fact check: Altered 2014 image used to make false White House blackout claim", "A European Union-funded report and a Reuters Myanmar correspondent confirm Myanmar used paper ballots that staff counted by hand in its 2020 election.", "Myanmar military television announced Feb. 1 that troops are taking control of the country's government for the next year due to a national emergency. A military spokesperson said the military intervened after the government failed to postpone the November election due to the pandemic and because the government did not act on the military's allegations of voter fraud.", "More:Fact check: Meme of 9 questions makes false inauguration claims", "In November, Suu Kyi’s National League for Democracy party won in the parliamentary election. Myanmar’s election commission rejected allegations of fraud in late January, saying there was no evidence.", "The military takeover comes after days of concern of a possible military coup. The Associated Press called the military action “a sharp reversal” of Myanmar’s progress toward democracy after five decades of military rule.", "According to reports, Suu Kyi was among many senior politicians detained in the effort.", "Suu Kyi won the 1991 Nobel Peace Prize for her “non-violent struggle for democracy and human rights.\" A founder of Myanmar’s National League for Democracy, she spent almost 15 years under house arrest by the military for her efforts to democratize the country.", "The NLD called the military takeover a “coup” and urged citizens not to give in to a “military dictatorship” in a Feb. 1 Facebook statement.", "International media have been unable to reach NLD leadership.", "G7 foreign ministers — from Canada, France, Germany, Italy, Japan, the United Kingdom and the United States — and a High Representative of the European Union condemned the military takeover in a Feb. 3 statement. The statement called upon the military to release” unjustly detained” politicians, hand power back to the democratically elected government and “respect human rights.\"", "“We stand with the people of Myanmar who want to see a democratic future,” the statement ends.", "In a Feb. 1 statement, President Joe Biden called the military takeover, detention of Suu Kyi and declaration of a national emergency “a direct assault on the country’s transition to democracy and the rule of law.”", "“In a democracy, force should never seek to overrule the will of the people or attempt to erase the outcome of a credible election,” he wrote.", "More:Fact check: Nancy Pelosi will not resign if Donald Trump is acquitted in impeachment trial", "We rate the claim that Dominion Voting Systems was used to commit election fraud in Myanmar FALSE because the voting software was not used in Myanmar's 2020 election. Reports confirm that Myanmar used paper ballots and hand counted votes, which rendered a majority vote that opposed the military-backed candidate. Myanmar's election commission and world leaders hold that the countries election results were authentic.", "Thank you for supporting our journalism. You can subscribe to our print edition, ad-free app or electronic newspaper replica here.", "Our fact check work is supported in part by a grant from Facebook."]