["About this rating", "Fantastical horror stories may not automatically come to mind when thinking of famed writer John Steinbeck, whose iconic novels addressed social issues and economic problems faced by rural laborers, especially in California. But he did write at least one unusual story that stepped well outside of his conventional work.", "In a 2003 letter to the editor in The New York Times, a high school teacher mentioned the short story “The Affair at 7 Rue de M—” by Steinbeck and described its unexpected plot:", "When I read your article on chewing gum (\"Out, Damned Spot,\" Jan. 26), I thought of the John Steinbeck story \"The Affair at 7 Rue de M--.\" In it, a kid who loves to chew gum finds himself being chewed by the gum. His father tries many ways to get rid of the gum, but it keeps finding its way back to their house, in horror movie fashion, eager to get back into the kid's mouth.\nAs a high school teacher, I've seen gum stuck everywhere you can imagine. When did it become acceptable to stain our environment this way? If we can't ban gum, how about making manufacturers responsible for creating a product that won't desecrate our world? Or we could deter young people from chewing gum by making Steinbeck's story required reading.", "We looked into whether such a story exists and we found it does. The story was first published in English in the April 1955 issue of Harper’s Bazaar and later published in the 1965-66 winter issue of the Magazine of Horror. The short story is available in an archived version of the publication here.", "The story is also cited in a catalogue of Steinbeck’s works on the website of the author’s National Museum Center, which is located at California State University in Salinas, where Steinbeck grew up. The catalogue describes Harper's Bazaar as the \"first appearance in print in English of this satirical horror story about bubble gum. This story originally appeared in Le Figaro (in French) and was later included in Un Américain À New York Et À Paris.\"", "The plot follows what was described in the letter to The New York Times. The narrator’s son is chewing gum that was gifted to him, only to find that the gum is chewing him. When he takes it out and puts it away, the gum returns to his mouth. His father, the narrator, comes up with increasingly elaborate ways to get rid of the menace. An excerpt from the story:", "For a long time we watched it while I drove through my mind for some kind of explanation. Either I was dreaming or some principle as yet unknown had taken its seat in the pulsing bubble gum on the desk. I am not unintelligent; while I considered the indecent thing, a hundred little thoughts and glimmerings of understanding raced through my brain. At last I asked, “How long has it been chewing you?”", "Given that we found this story in an online archive and it is mentioned in his catalogues, we rate this claim as “True.”", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]