["By Saranac Hale Spencer", "Posted on November 22, 2019", "An altered image makes it look like Republican Rep. Elise Stefanik stuck up her middle finger in a House committee room at the end of a public impeachment inquiry hearing. She didn’t.", "Rep. Elise Stefanik, a Republican from upstate New York who sits on the House intelligence committee, has drawn attention recently for her role in the impeachment inquiry’s public hearings.", "She also has been the target of misinformation.", "A manipulated image circulating on social media makes it look like Stefanik was sticking up her middle finger  at the end of a public impeachment inquiry hearing, but video from the Nov. 15 hearing shows that she never made that gesture. Rather, as Marie Yovanovitch, the former U.S. ambassador to Ukraine, exited the chamber after giving testimony, Stefanik looked at a news video camera for a moment, then turned away.", "A still image from that short piece of footage was later doctored and then shared on Twitter. George Conway, a prominent critic of President Donald Trump and husband of Trump advisor Kellyanne Conway, was among those who retweeted it and later deleted it.", "Conway had retweeted a post from Brian O’Malley, who later posted several tweets apologizing for the error. O’Malley, a writer and producer, posted this tweet addressed to Stefanik: “I erroneously posted an image of you that I believed was real. I deleted the image after it was exposed as a fake. I take full responsibility for what I did. I’ve spent the last 2 hours apologizing to all who saw it. I apologize to you most of all for my mistake.”", "But it had already migrated to Facebook, where screenshots of the tweet are being shared as a meme.", "Stefanik addressed the bogus image in a tweet: “The photoshopped picture that the Leftist Twitter mob led by George Conway is circulating is FAKE – I’ve been so busy exposing Adam Schiff’s #regimeofsecrecy that I haven’t had time for a manicure in weeks!”", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "CNN. “Impeachment hearing ends with fireworks and applause.” YouTube. 15 Nov 2019.", "O’Malley, Brian (@BrianJOMalley). “@EliseStefanik I erroneously posted an image of you that I believed was real. I deleted the image after it was exposed as a fake. I take full responsibility for what I did. I’ve spent the last 2 hours apologizing to all who saw it. I apologize to you most of all for my mistake” Twitter. 16 Nov 2019.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]