["Shiite rebels, known as Houthis, hold up their weapons to protest against Saudi-led airstrikes, as they chant slogans during a rally in Sanaa, Yemen, on March 26, 2015. (AP Photo)", "Bernie Sanders delivered his long-awaited speech on democratic socialism last week, also outlining his plan for fighting ISIS.", "Sanders called for a broad international coalition but stressed that Muslim nations must shoulder the fight, which he called \"a struggle for the soul of Islam.\" So far, he said, wealthy and powerful countries in the region like Saudi Arabia, Kuwait, Qatar, and the United Arab Emirates have done very little.", "\"Saudi Arabia, turns out, has the third-largest defense budget in the world,\" Sanders said on Nov. 19. \"Yet instead of fighting ISIS they have focused more on a campaign to oust Iran-backed Houthi rebels in Yemen.\"", "Sanders is correct that Saudi Arabia’s military budget is the third largest in the world. But is he also right that the Saudis aren’t prioritizing ISIS? In a word, yes.", "A striking scaleback", "The Saudi embassy in Washington did not return our requests for comment. But the Sanders campaign forwarded us a New York Times article that says, \"Saudi Arabia and the United Arab Emirates have shifted most of their aircraft to their fight against Iranian-backed Houthi rebels in Yemen.\"", "In 2014, the Houthis — a longstanding Shiite separatist group in northern Yemen, a country with a Sunni majority — rebelled against the Yemeni government and seized the presidential palace. After months of tense peace brokered by the United Nations, the Houthis took over the government and placed the president under house arrest in early 2015.", "Saudi Arabia, which has a Sunni majority and is ruled by a Sunni monarch, led a 10-state Arab coalition and launched airstrikes against the Houthis on March 26. It pledged to use 100 warplanes and 150,000 soldiers. In a month, the Saudis conducted 2,415 sorties (a deployment of an aircraft), releasing at least 1,000 air-to-ground weapons.", "Meanwhile, as part of the U.S.-led coalition of 60 countries, Saudi Arabia has also been involved with the international effort against ISIS since September 2014. Since then, it has deployed just four F-15 fighter jets and an unspecified number of Typhoon combat jets against ISIS. (Saudi state media trumpeted the participation, releasing photos of pilots who flew in the strikes and highlighting that the son of King Salman was among them.)", "Experts said Saudi Arabia doesn’t publicize the exact number of airstrikes it has carried out, but the data shows that the amount of non-U.S. airstrikes overall has been scaled back since the Saudi-led intervention in Yemen began in late March. Conversely, the United States has beefed up its strikes.", "Here’s a chart from Airwars.org, a project tracking the international air war against ISIS, that demonstrates this point:", "Data compiled by Airwars.org shows that from Dec. 1, 2014, to Nov. 16, 2015, Arab allies conducted just 143 of the 2,827 airstrikes in Syria, 90 of which occurred before April 3 (intervention in Yemen began March 26). For comparison, Saudi Arabia sometimes conducted as many as 125 strikes a day against the Houthis, according to the BBC.", "\"Bottom line, Bernie Sanders is right. All the evidence points to it,\" said Chris Woods, an investigative journalist who leads the Airwars project. \"Clearly, we saw with the Saudis a capability unleashed in Yemen that we never saw in Syria.\"", "\"The volume of Saudi military forces deployed to combat the Houthis puts the Saudi deployment against ISIS to shame,\" said David Weinberg, an expert on the Gulf monarchies at the Foundation for the Defense of Democracy.", "Weinberg looked at tallies from the Defense Department which are consistent with Airwars.org data. He also noted a decline in the number of non-U.S. airstrikes in Syria and \"a pitiful lack of participation by America’s Arab allies in what was supposedly unveiled as a joint U.S-Arab effort when it was launched last fall.\"", "According to the New York Times article cited by the Sanders campaign, the Saudis flew their last strikes in Syria in September, Jordan in August, and the UAE in March.", "Conflicting crises", "Riyadh has its reasons for prioritizing the Houthis over ISIS. Among them: Yemen’s proximity, Iran’s gains in the region, sectarianism and, simply put, practicality.", "\"Yemen is the soft underbelly of the kingdom, and Iranian presence there through its support of Houthis is viewed as an existential threat to the kingdom,\" said David Ottaway, the Middle East specialist at the Woodrow Wilson Center.", "\"In the end, Syria doesn’t border Saudi Arabia like Yemen does,\" said Lori Plotkin Boghardt of the Washington Institute for Near East Policy. \"And more fundamentally, the Saudis view Assad as the root of the ISIS problem and have argued from the beginning that Assad has to be defeated first in order to defeat ISIS.\"", "Saudi Arabia is also somewhat relying on the United States to take on ISIS, added Weinberg of the Defense of Democracies. It’s also politically easier for the Sunni kingdom to mobilize public opinion there against radical Shiites like the Houthis rather than radical Sunni terrorists like ISIS, he said.", "The United States, for its part, supports the Saudi-led intervention in Yemen (the Houthis’ slogan is \"Death to America, Death to Israel, Damn the Jews, Victory to Islam\"), despite concerns over civilian casualties and possible war crimes. What’s more, Boghardt pointed out, \"the irony and the danger\" is that the conflict in Yemen has given al-Qaida and ISIS room to operate there.", "As for ISIS, there’s no question that the Saudis are aware of the threat it poses. The terrorist group has repeatedly targeted the kingdom, bombing mosques and detonating car bombs. Beyond military engagement, the Saudis have foiled terrorist plots and arrested hundreds of ISIS supporters. But experts say the kingdom could be doing a lot more.", "\"Saudi Arabia really should be doing more to militarily combat the twin scourges of ISIS and al-Qaida,\" Weinberg said. \"Bernie Sanders is right that we should expect more from our Saudi allies in the fight against terror in Syria as well as beyond.\"", "Our ruling", "Sanders said, \"Instead of fighting ISIS, (the Saudis) have focused more on a campaign to oust Iran-backed Houthi rebels in Yemen.\"", "This is an accurate assessment. The Saudis have prioritized the conflict in Yemen over the fight against ISIS, as evidenced by the amount of resources it has committed to both crises.", "We rate Sanders’ claim True.", "BernieSanders.com, \"Senator Bernie Sanders on Democratic Socialism in the United States,\" Nov. 19, 2015", "Email interview with Warren Gunnels, policy director for Bernie Sanders, Nov. 23, 2015", "Interview with Chris Woods, Airwaves.org, Nov. 24, 2015", "Email interview with David Weinberg, senior fellow at the Foundation for Defense of Democracy, Nov. 23, 2015", "Email interview with Lori Plotkin Boghardt, fellow at the Washington Institute for Near East Policy, Nov. 24, 2015", "Email interview with David Ottaway, Middle East specialist at the Woodrow Wilson Center, Nov. 23, 2015", "Email interview with Gregory Gause, professor of international affairs at Texas A&M University, Nov. 23, 2015", "Email interview with Bruce Riedel, senior fellow at the BRookings Institute, Nov. 23, 2015", "PolitiFact, \"Bernie Sanders: 'Saudi Arabia has the third-largest military budget in the entire world,’\" Aug. 30, 2015", "New York Times, \"As U.S. Escalates Air War on ISIS, Allies Slip Away,\" Feb. 18, 2015", "Al Jazeera, \"Houthis take over Yemen presidential palace,\" Jan. 21, 2015", "CNN, \"Saudi Arabia launches airstrikes in Yemen,\" March 26, 2015", "BBC, \"Mixed success for Saudi military operation in Yemen,\" May 12, 2015", "Reuters, \"Saudi Arabia confirms role in strikes against Islamic State in Syria,\" Sept. 23, 2014", "Defense News, \"Saudi Typhoons Use Paveway IV Bombs on ISIS,\" Feb. 25, 2015", "The National, \"Saudi prince flew jet in Syria ISIL attacks,\" Sept. 25, 2014", "Airwars.org", "Defense Department, \"Strikes in Iraq and Syria,\" accessed Nov. 24, 2015", "The Economist, \"The long arm,\" Jan. 24, 2015", "Council on Foreign Relations, \"The Sunni-Shia Divide,\" accessed Nov. 24, 2015", "The Guardian, \"Jihadis likely winners of Saudi Arabia's futile war on Yemen's Houthi rebels,\" July 7, 2015", "Al Arabiya, \"Timeline: Al-Qaeda and ISIS attacks in Saudi Arabia,\" Aug. 6, 2015", "BBC, \"Yemen crisis: Who is fighting whom?\" March 26, 2015", "Al-Monitor, In the battle against IS, where is the Arab coalition?, Nov. 12, 2015", "Vocativ, Allies Are Abandoning the U.S.-Led Air War Against ISIS In Syria, Oct. 21, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]