["About this rating", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "In late December 2020, many on social media reacted angrily when U.S. legislators announced they had passed the first bill in nine months that would provide economic relief from the COVID-19 pandemic. The measure included $600 stimulus checks for most Americans.", "Some of the ire was focused on prosperity gospel pastor Joel Osteen, who runs Houston, Texas-based, Lakewood Church, one of the largest evangelical megachurches in the country. Lakewood received $4.4 million in federal coronavirus relief, which prompted some to compare that amount to the $600 stimulus checks.", "For example, author Marianne Williamson, who ran in the Democratic presidential primaries, tweeted that she was \"very upset\" about millions of dollars in funds given out to wealthy people under the federal government's Paycheck Protection Program (PPP), which was part of the March 2020 coronavirus stimulus package. At that time, most Americans each received a $1,200 check — double the amount approved by Congress in December.", "It's true that Lakewood received more than $4.4 million in PPP loans, which can be found in an easily searchable database of such loans provided by The Washington Post.", "Don Iloff, a spokesperson for Lakewood Church, told Houston television station KPRC that Osteen didn't personally benefit from the loan, and that the money from the federal government was used to support 368 church employees while in-person services have been suspended due to the pandemic.", "On Dec. 22, 2020, U.S. President Donald Trump stated that he may torpedo the spending package approved by both chambers of Congress, which includes the $600 stimulus checks, stating that he thought Americans should instead get $2,000 each.", "The rollout of the PPP loan program has been controversial. An estimated 5.2 million businesses (including Snopes) received loans of various amounts. But some of the disbursals have stoked anger because of the wealth of the people associated with businesses receiving them, while many struggling small businesses that applied for loans were unable to secure them.", "For example, NFL quarterback Tom Brady's sports performance and nutrition company TB12, for example, received nearly $1 million even as Brady signed a $50 million, two-year contract to play for the Tampa Bay Buccaneers. Successful musician Kanye West's shoe brand Yeezy received $2 million.", "San Antonio, Texas-based, television station KSAT reported that Osteen is one of the wealthiest pastors in the world with an estimated net worth of $40 million. However, he doesn't take a salary from Lakewood and instead makes most of his money from book sales and giving speeches.", "Bethania Palma is a journalist from the Los Angeles area who started her career as a daily newspaper reporter and has covered everything from crime to government to national politics. She has written for  ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]