["Before President Donald Trump became the first American president to stand on North Korean soil, he told reporters he and Kim Jong Un have a \"a certain chemistry\" that could lead to good things.", "Trump noted under President Barack Obama, face-to-face meetings never happened.", "\"Nobody was going to meet,\" Trump said. \"President Obama wanted to meet, and Chairman Kim would not meet him. The Obama administration was begging for a meeting. They were begging for meetings constantly. And Chairman Kim would not meet with him.\"", "The statement that Obama and his administration \"were begging for a meeting\" is not backed up by the record.", "We reached out to the White House press office, and staff there had no comment.", "Obama’s special representative for North Korea policy, Glyn Davies, laid out the administration’s position for senators at a 2013 hearing.", "\"The United States will not engage in talks for the sake of talks,\" Davies said March 7, 2013. \"The United States will not accept North Korea as a nuclear-armed state. We will not reward the DPRK for the absence of bad behavior. We will not compensate the DPRK merely for returning to dialogue. We have also made clear that U.S.-DPRK relations cannot fundamentally improve without sustained improvement in inter-Korean relations and human rights. Nor will we tolerate North Korea provoking its neighbors. These positions will not change.\"", "This policy came on the heels of discussions with North Korean negotiators in 2011 aimed at restarting more robust talks that had been on hold since 2008. Initially, Pyongyang indicated it was open to the return of international inspectors, and a moratorium on nuclear tests, long-range missile launches, and all nuclear activity, including uranium enrichment.", "In 2012, the process broke down when North Korea announced plans to launch a satellite, a move the Americans called a deal-breaker.", "US-North Korean expert Frank Jannuzi, president of the Mansfield Foundation, said Obama was \"reticent to engage the top leader without having the pieces in place.\"", "\"Obama never, to the best of my knowledge, asked, much less begged, for a meeting with Kim Jong Un,\" he said. \"In fact, he took a stand-off approach, which came to be known as strategic patience.\"", "In his 2013 State of the Union address, Obama spoke of the preconditions for talks.", "\"The regime in North Korea must know they will only achieve security and prosperity by meeting their international obligations,\" Obama said.", "Joseph DeThomas at the Penn State School of International Affairs said he is unaware that Obama ever sought to meet with Kim \"at all.\"", "\"Certainly in the second term, the United States conditioned all talks in pretty strict terms,\" DeThomas said.", "The closest Obama came, said Kelsey Davenport with the Arms Control Association, was holding out talks as reward for strong promises of change from North Korea.", "\"The Obama administration remained open to talks with North Korea, but set onerous preconditions requiring Pyongyang to take steps toward denuclearization before beginning negotiations,\" Davenport said.", "David Albright with the Institute for Science and International Security echoed all of the above.", "\"I have never heard this,\" Albright said.", "In addition, the Obama administration imposed stiff economic sanctions on North Korea, including sanctions on Kim himself.", "Trump said the Obama administration was begging for a meeting with Kim.", "The public record shows the Obama administration rejected the idea of meetings of any sort until North Korea promised to back off of its nuclear program and accept international inspections.", "While the administration held out hope of North Korea meeting those preconditions during Obama’s first term, in the second, it took a harder line. There is no evidence that Obama begged for a meeting.", "We rate this claim False.", "White House, Remarks by President Trump and President Moon of the Republic of Korea in Joint Press Conference, June 30, 2019", "U.S. Senate Foreign Relations Committee, Testimony of Glyn T. Davies, Special Representative for North Korea Policy U.S. Department of State, March 7, 2013", "Arms Control Association, Chronology of U.S.-North Korean Nuclear and Missile Diplomacy, accessed July 1, 2019", "White House, Remarks by President Trump and Chairman Kim Jong Un of the Democratic People’s Republic of Korea in 1:1 Meeting, June 30, 2019", "White House, Remarks by President Trump to Korean Business Leaders, June 30, 2019", "White House Obama Archives, Remarks by the President in the State of the Union Address, Feb. 12, 2013", "East West Center, \"The North Korea Crisis and Regional Responses\", 2015", "Brookings Institution, Strategic Patience Has Become Strategic Passivity, Dec. 22, 2010", "Email interview, Kelsey Davenport, director of nonproliferation policy, Arms Control Association, July 1, 2019", "Email interview, Joseph DeThomas, professor of international affairs, Penn State University, July 1, 2019", "Email interview, Frank Jannuzi, president, Mansfield Foundation, July 1, 2019", "Email interview, David Albright, president, Institute for Science and International Security, July 1, 2019", "Email exchange, White House Press Office, July 1, 2019", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]