["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Theresa Greenfield stepped up to the podium in Des Moines, Iowa, at a Friday rally for fellow Democratic Party candidate Joe Biden the weekend before the contentious 2020 campaign for control of the White House and Congress and talked about Iowans’ toughness.", "\"You know, Iowans are going through really tough times right now, and I think these are going to be some of the most consequential times of our life, with the pandemic, the recent derecho, farm bankruptcies at an eight-year high…,\" Greenfield told those who gathered for the Oct. 30 coronavirus-era drive-up rally.", "We’ve touched on the farm economy previously and have heard the bankruptcy comments before from Democrats who want to paint a bleak picture of the economy, which was moving forward before the coronavirus pandemic disrupted it.", "The Greenfield campaign says it relied on a Reuters news report for its information but other news organizations also have reported the trend.", "An independent check of the U.S. Courts’ most recent report on bankruptcy cases shows 595 bankruptcies filed in 2019 under Chapter 12, which covers family farms. That is up from 498 in 2018 and 501 in 2017.", "You have to go back to 2011, when 637 family farm bankruptcies were filed under Chapter 12, for a higher number than what the courts system reported for 2019.", "We should note that, although Greenfield uses the statistic to paint a negative picture of Republicans in control of the presidency and Senate, a Democrat was in the White House in 2011.", "Greenfield lifts the statistic about farm bankruptcies from federal records and reporting about those records when making campaign statements about the farm economy. This is pretty straightforward. We rate her claim to be True.", "This fact check is available at IFCN’s 2020 US Elections #Chatbot on WhatsApp. Click here, for more.", "Joe Biden campaign rally, Des Moines, Iowa, Oct. 30, 2020.", "PolitiFact, Donald Trump fact check, by Julia Shanahan, May 22, 2020.", "Reuters, U.S. Job growth robust before coronavirus outbreak hit shores, by Lucia Matakana, March 6, 2020.", "Email exchange with Sam Newton, Theresa Greenfield campaign spokesperson.", "USCourts.gov, Bankruptcy Filings Increase Slightly, Jan. 28, 2020.", "USCourts.gov, U.S. Bankruptcy Courts–Business and Nonbusiness Cases Commenced, by Chapter of the Bankruptcy Code,  During the 12Month Period Ending December 31, 2014", "USCourts.gov, U.S. Bankruptcy Courts–Business and Nonbusiness Cases Commenced, by Chapter of the Bankruptcy Code,  During the 12Month Period Ending December 31, 2013", "USCourts.gov, U.S. Bankruptcy Courts–Business and Nonbusiness Cases Commenced, by Chapter of the Bankruptcy Code,  During the 12Month Period Ending December 31, 2012", "USCourts.gov, U.S. Bankruptcy Courts–Business and Nonbusiness Cases Commenced, by Chapter of the Bankruptcy Code,  During the 12Month Period Ending December 31, 2011", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]