["About this rating", "The Stanley R. Mickelsen Safeguard Complex near Nekoma, North Dakota, cost around $5.7 billion and had a radar system that resembled the shape of a pyramid. The military base was the first of a planned 12-part, anti-ballistic missile (ABM) defense system. It opened on Oct. 1, 1975. On Oct. 2, the U.S. House of Representatives voted to shut it down.", "However, the base remained operational until Feb. 10, 1976. This early development of the Safeguard Program was reportedly used as a bargaining chip with Russia during the Cold War. An agreement was reached to limit each country to one ABM site each. Following the agreement, an argument was made that billions were saved by not building the 11 other Safeguard Program bases. Further, nearly half of the $5.7 billion was spent on research and development that would have occurred anyway and led to advances in technology.", "On March 12, 2021, TikTok user @benben.son published a video about an abandoned military base. It documented the Stanley R. Mickelsen Safeguard Complex in Nekoma, North Dakota. The site partly resembled the shape of a pyramid.", "In the video, @benben.son said that the site \"cost $6 billion to make\" but \"was only operational for a single day\":", "Places in America that the government doesn't want you knowing about. This is the Mickelsen Safeguard Complex in North Dakota. This place was originally created in 1975 as a way to deter missiles from the Russians. But here's the weird part. This site cost $6 billion to make. Mysteriously, the site was only operational for a single day. It opened on Oct. 1, 1975 and then closed down the next day, on Oct. 2, 1975. Are you really going to try to tell me that the government dropped $6 billion on this place just to keep it operational for less than 24 hours? But for real, just, just look at this place. Like, are, are you serious? Many people have theorized that this could be a possible headquarters for the illuminati, given its extremely close resemblance to the pyramid that's commonly associated with it. Also guys, when I was doing research on this place, I clicked on their website, and what came up I can't show on TikTok. But go look it up for yourselves. It'll creep you out.", "Let's take a look at all of the points that @benben.son made.", "The Stanley R. Mickelsen Safeguard Complex was the first of 12 planned sites in the Safeguard Program. According to the Panama City News, the site was named for General Stanley R. Mickelsen, \"a pioneer in the Army's guided missile program.\"", "The El Paso Herald-Post reported that it was an \"antiballistic missile system that was supposed to protect American missile and bomber bases from nuclear attack.\"", "Some of the most prominent structures on the site. (Courtesy: Benjamin Halpern / Library of Congress)", "A November 1975 story from The New York Times shed light on the purpose of the ominous buildings pictured in many archival photographs. It reported that the large pyramid structure was built to be a radar system. Other tall buildings \"held air-intake vents.\"", "According to The Palm Beach Post, the military base thrived for a short period of time.", "\"There was a year or so in the mid-'70s during which the base had its full complement of personnel — 500 military and 1,200 civilians,\" the Post reported. \"Its 200-unit subdivision was full of military people and their families. Its commissary was running. Its all-faiths chapel was planning an addition.\"", "The article also mentioned that the site was equipped with a gymnasium, bank, and filling station.", "The site was approved in 1969 and construction began in 1970.", "A 1971 photograph of construction on the radar system for the Mickelsen Safeguard Complex. An \"escape tunnel\" is pictured below. (Courtesy: Library of Congress)", "It opened on Oct. 1, 1975. However, on the next day, the U.S. House of Representatives voted to close the military base. Discussions revolved around when to close the site in the following year. In the end, a decision was made to cease operations around Feb. 10, 1976.", "The Safeguard Program was a collaborative effort of 20 years of research. However, not everyone believed in its mission, or even the idea that the program had one. The 1975 article from The New York Times reported \"that its Senate critics came to charge that it was 'a system in search of a mission.'\"", "The story mentioned that \"it was technically infeasible to provide an area-wide defense for American cities against a missile attack.\" Further, there were concerns about the balance of power, in terms of one country perhaps having a nuclear advantage over others.", "Various sources reported that the cost of the site was about $5.7 billion. The idea that all of the $5.7 billion was perhaps wasted doesn't line up with past reporting, though.", "On Nov. 24, 1975, the El Paso Herald-Post published that the first of 12 planned bases was essentially used as a \"bargaining chip\" with Russia. That country was purportedly impressed with the base in North Dakota. (In this article, the figure was cited as $5.8 billion instead of $5.7 billion.)", "The facts don't back up the boondoggle cry. Here's why.", "The Kremlin saw what that $5.8 billion was buying and agreed to limit Russia and the United States to one ABM (antiballistic missile) site each, thus saving the United States untold billions. Seen in that light, Safeguard was a multibillion-dollar bargaining chip that worked.", "This was also used as a talking point by former U.S. President Richard Nixon's administration. In the course of our research, we found some publications that referred to the Mickelsen Safeguard Complex as \"Nixon's Pyramid.\"", "The story in the El Paso Herald-Post also argued that nearly half of the $5.7 billion spent was for research and development. The R&D would purportedly prove useful in future endeavors and \"would have occurred anyway\":", "Safeguard research and development led to numerous breakthroughs in radar technology, microminiaturized circuits, fast-acceleration missiles, and scores of other high-technology advances.", "Safeguard research produced phased-array radars which permit the United States to track hundreds of incoming missiles while simultaneously guiding U.S. missiles helped the Pentagon develop new missile fuels and components and taught the Air Force how to make U.S. intercontinental ballistic missiles (ICBMs) less vulnerable to Soviet defenses either by fooling or avoiding them.", "Then there are the intangible benefits — the psychological message Safeguard delivered in Moscow. The system was tested 54 times with 47 total successes. Thanks to Safeguard, the United States is years ahead of Russia in ABM technology and, for that matter, ICBM technology too.", "In the TikTok video, @benben.son claimed: \"Many people have theorized that this could be a possible headquarters for the illuminati.\" Casting aside a number of points that could be made about this statement, put very simply ... the base largely appeared to be abandoned.", "On YouTube, videos exist that show urban explorers walking around the damp, littered, and graffiti-filled site.", "According to @benben.son's TikTok video description, \"don't click on the website.\" Despite the warning, we clicked on the website. It led to mickelsendefense.ml. Domains ending in .ml reference the African country of Mali. It redirected to a basic placeholder page about girls and webcams.", "We corrected the link to end in .mil, which is for U.S. Department of Defense domains. The website mickelsendefense.mil did not appear to be real either, nor did we find any archives of either website.", "In sum, the Stanley R. Mickelsen Safeguard Complex was part of a costly, missile-defense program by the U.S. government. Some money spent on the overall project was perhaps effective for research and development. The site in North Dakota may also have been helpful as a \"bargaining chip\" with Russia. However, it was operational for less than a year, and appeared to have since been abandoned.", "Jordan Liles is a Senior Reporter who has been with Snopes since 2016.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]