["By Saranac Hale Spencer", "Posted on August 14, 2020", "Contrary to claims in viral internet posts, Sen. Kamala Harris did not call former Vice President Joe Biden a “racist” or a “rapist.” Rather, she has been critical of Biden’s position on busing to integrate schools and comments he made about segregationist senators, and she has said that she believed women who accused Biden of making them feel uncomfortable.", "Sen. Kamala Harris was critical of former Vice President Joe Biden when the two were among a crowded field of candidates running for the Democratic presidential nomination.", "Now that Biden is the presumptive nominee, he has chosen Harris to run as vice president and the statements she made during the primary race are being inaccurately recast.", "One meme that’s been shared thousands of times on Facebook, Twitter, and Instagram uses a picture of Harris — the first Black woman to be named to a major party ticket — with the claim: “I just accepted a job offer from a man I called a racist and a rapist.”", "She has not used those words to describe Biden.", "In fact, in one instance, Harris specifically said to Biden, “I do not believe you are a racist.” That was in the June 27, 2019, debate during which moderators asked a question about racial inequities in policing. The question grew into a wider discussion of race among the 10 candidates on stage, and Harris directed her remarks to Biden, who was leading in the polls at the time.", "Interestingly, despite Harris’ preface to her comments, the exchange that followed is the primary piece of evidence used by those advancing the claim that Harris called Biden “a racist.”", "On Aug. 11, the day that Biden announced Harris would join his ticket, President Donald Trump’s re-election campaign released a statement that said: “Not long ago, Kamala Harris called Joe Biden a racist.” The same day, the conservative news outlet the Daily Caller tweeted a clip from the debate below this text: “How nice of him to pick her after she called him a vile racist on the debate stage a little over a year ago.”", "A Trump campaign spokesperson told FactCheck.org that their statement was based on Harris’ comments at the debate and similar comments she made on CBS’ “Face the Nation” and in a press gaggle earlier that month.", "In June 2019, Biden made news for remarks he had recently made at a fundraiser in New York City. That’s what Harris was addressing in the debate.", "At the fundraiser, Biden had referenced two segregationist senators with whom he worked after he arrived in the Senate in 1973. “Well, guess what? At least there was some civility. We got things done. We didn’t agree on much of anything. We got things done. We got it finished. But today, you look at the other side and you’re the enemy. Not the opposition, the enemy. We don’t talk to each other anymore,” Biden said.", "Biden also said that one of the senators called him “son,” rather than “boy,” in an apparent reference to the racist expression that refers to Black men as boys.", "Sen. Cory Booker, who is Black and was seeking the Democratic nomination, also responded to Biden’s remarks at the time.", "Biden apologized the following month during a speech in South Carolina, saying, “Now was I wrong a few weeks ago, to somehow give the impression to people that I was praising those men who I successfully opposed time and again? Yes, I was. I regret it. I’m sorry for any of the pain or misconception that I caused anybody.”", "Harris had described his remarks as “hurtful” during the debate. She also criticized his record of opposing federally mandated busing to integrate schools, which he defended by arguing that busing policies were better set by local governments. We wrote about the exchange at the time of the debate.", "As for the claim that Harris called Biden “a rapist,” that’s inaccurate, too.", "Some conservative outlets have either made that claim explicitly, as is the case with the Chicks on the Right, or made the claim more suggestively, as is the case with the website, The Post Millennial.", "In either case, they ultimately point to the same article from The Hill in early April 2019. The article ran as several women came forward to publicly accuse Biden of making them feel uncomfortable with unwanted physical contact. Biden hadn’t yet officially entered the race, but there was widespread speculation at the time that he would run. Biden entered the primary later that month.", "More than a dozen other candidates were already running and many responded to the allegations in early April. The article from The Hill featured Harris’ response to the accusations during a campaign stop in Nevada on April 2, 2019.", "Referring to the accusers, Harris reportedly said, “I believe them and I respect them being able to tell their story and having the courage to do it.”", "None of the allegations at that time included rape.", "About a year later, in March 2020, one of the women expanded on her original allegation and accused Biden of digitally penetrating her. Biden has denied those allegations.", "We could find no comments from Harris since her remarks in early April 2019, which did not involve any accusations of rape. So the claim that she has called Biden a rapist is false.", "Editor’s note: FactCheck.org is one of several organizations working with Facebook to debunk misinformation shared on social media. Our previous stories can be found here.", "Biden, Joe (@JoeBiden). “I have the great honor to announce that I’ve picked @KamalaHarris — a fearless fighter for the little guy, and one of the country’s finest public servants — as my running mate.” Twitter. 11 Aug 2020.", "Hartigan, Rachel. “At least 11 women have vied for U.S. vice president. Here’s what happened to them.” National Geographic. 12 Aug 2020.", "NBC News. “Democratic Presidential Debate – June 27 (Full).” YouTube. 27 Jun 2020.", "Donald J. Trump for President. Press release. “Trump Campaign Statement on Kamala Harris.” Donaldjtrump.com. 11 Aug 2020.", "Daily Caller (@DailyCaller). “BREAKING: Joe Biden has picked Senator Kamala Harris as his running mate. How nice of him to pick her after she called him a vile racist on the debate stage a little over a year ago.” Twitter. 11 Aug 2020.", "Spokesperson, Donald J. Trump for President. Email exchange. 14 Aug 2020.", "CBS News. “Transcript: Sen. Kamala Harris on ‘Face the Nation,’ June 23, 2019.” CBSnews.com. 23 Jun 2019.", "Cadei, Emily. “Kamala Harris is good at making opponents ‘nervous.’ Are Joe Biden and Bernie Sanders next?” McClatchy DC. 26 Jun 2019.", "Detrow, Scott. “Democrats Blast Biden For Recalling ‘Civil’ Relationship With Segregationists.” NPR. 19 Jun 2019.", "Vasquez, Christian. “Biden apologizes for remarks about segregationists, defends civil rights record.” POLITICO. 6 Jul 2019.", "Kiely, Eugene, et al. “FactChecking Round Two of the Democratic Debate.” FactCheck.org. Updated 3 Jul 2019.", "Burke, Michael. “Harris: ‘I believe’ Biden accusers.” The Hill. 3 Apr 2019.", "Corey, Dan. “What 2020 Democrats are saying about the allegations against Joe Biden.” NBC News. 4 Apr 2019.", "Axios Media. “Timeline: Tara Reade’s sexual assault allegations against Joe Biden.” Updated 22 May 2020.", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]