["Several Facebook and Twitter users have uploaded an image of a girl surrounded by police officers. It is claimed that she is the “first Muslim woman SP (superintendent of police) from an Urdu medium in Maharashtra…” who is not following the official dress code for policewomen instead, wearing a hijab. “Do only ‘you people’ get such lenience in Maharashtra or is it for everybody? This is a good joke. (महाराष्ट्र मे ये छूट आप लोगो के लिये ही है या सबको दी जायेगी? अच्छा मजाक है),” wrote Twitter user TEAM SCB बबलू सैनी 🇮🇳 (@bablu3796) on September 2.", "उर्दू मीडियम से पढ़कर IPS बनी पहली मुस्लिम SP महिला बधाई की पात्र हैं किन्तु ड्रेस कोड को दरकिनार करके आप जिस वेशभूषा मे सरकारी कुर्सी पर विराजमान हैं तो पहला नियम का उल्लंघन तो आपने आते ही कर दिया है महाराष्ट्र मे ये छूट आप लोगो के लिये ही है या सबको दी जायेगी ? अच्छा मजाक है 😠 pic.twitter.com/5xwBKSwFa9", "— 🇮🇳 TEAM SCB बबलू सैनी 🇮🇳 (@bablu3796) September 2, 2020", "The same image was also circulating in March however, the posts were commending the girl for becoming the first “Muslim woman SP” in Maharashtra.", "Along with the image, a video was also viral with the same claim. A Facebook user posted the video on March 8.Alt News had received several requests to fact-check the viral image on WhatsApp (+91 76000 11160) and on our official Android application.", "After unsuccessful reverse image search attempts, Alt News performed a keyword search on YouTube and found a March 5, 2020 video by Times of India. The video title reads, ‘Women’s Day: 14-year-old girl becomes DSP ‘for a day’ in Maharashtra’s Buldhana.’", "The video description states that Sahrish Kanwal, a 14-year-old high school student, was made the district superintendent of police (DSP) for a day in Maharashtra’s Buldhana district ahead of International Women’s Day.", "On March 4, Buldhana Police tweeted, “I want to be a police superintendent. It’s important to me” (Expectation of) Sahrish Kanwal, one day police superintendent, District school, Malkapur. Statement on the occasion of the international woman’s day. (मलाही पोलीस अधिक्षक व्हायचयं..” आजचा दिवस माझ्यासाठी अत्यंत महत्वाचा! – एक दिवसाच्या पोलीस अधिक्षीका सहरीश कवल, जिल्हा परिषद हायस्कुल, मलकापुर यांच्या अपेक्षा –पोलीस अधिक्षक, बुलडाणा मा.डॉ.दिलीप पाटील-भुजबळ यांचा जागतिक महिला दिनानिमित्त अभिनव उपक्रम.)”", "Therefore, the claim on social media associated with the viral image is false.", "Last year, Tata Trusts, the philanthropist arm of Tata Group, published ‘India Justice Report 2019.‘ According to the report, “Over fifteen years, from 1999–2013, Muslim representation in the police has remained consistently low, at 3–4 per cent (including Jammu and Kashmir pushes it up to 8 per cent), as against the 14.2 per cent population that is Muslim. A few states like Kerala, Tamil Nadu, Telangana and West Bengal include reservation for Muslims under the Other Backward Classes category. Inexplicably, since 2013, the National Crimes Records Bureau annual report has ceased reporting the level of Muslim representation in the police.”", "This report also found that “Women make up just 7% of the police (Bureau of Police Research and Development, Jan 2017). Over 5 years, 31 states and UTs have improved women’s representation in the force. The pace, however, is much too slow.” The infographic below shows the time Indian States will take to reach 33% women representation in the police.", "Donate Now", "🙏 Blessed to have worked as a fact-checking journalist from November 2019 to February 2023.", "Entering its fifth day on October 11, the Israel-Palestine conflict all but escalated into a…", "On September 29, two youths named Iqbal and Rahul were involved in a bike collision…", "Amid the ongoing Israel-Palestine conflict, media outlet Times Now put out a report claiming that…", "A 45-second video clip is being shared widely on social media where a group of…", "All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi addressed a rally at Dumri in Giridih,…"]