["About this rating", "U.S. Education Secretary Betsy DeVos, a frequent target of criticism from left-leaning observers and activists in the United States, came under renewed scrutiny in March 2019 after the publication of her department's 2020 budget request, which proposed eliminating almost $6.7 billion in spending on 29 different programs.", "In particular, DeVos faced criticism for what was presented as the proposed elimination of \"all $18 million\" in spending on the Special Olympics.", "On 26 March, the left-leaning Occupy Democrats Facebook page posted a meme that read:", "\"Just when you thought the Trump administration couldn't possibly stoop ANY lower, Education Secretary Betsy DeVos is now trying to ELIMINATE all $18 million in funding for the Special Olympics ...\"", "The post linked to a Detroit Free Press article that reported the following:", "Education Secretary Betsy DeVos on Tuesday [26 March] defended deep cuts to programs meant to help students and others, including eliminating $18 million to support Special Olympics, while urging Congress to spend millions more on charter schools.", "\"We are not doing our children any favors when we borrow from their future in order to invest in systems and policies that are not yielding better results,\" DeVos said in prepared testimony before a House subcommittee considering the Department of Education's budget request for the next fiscal year.", "...While proposing to add $60 million more to charter school funding and create a tax credit for individual and companies that donate to scholarships for private schools, DeVos' budget proposal would still cut more than $7 billion from the Education Department, about 10 percent of its current budget. Trump proposed a $4.7 trillion overall budget this month with an annual deficit expected to run about $1 trillion.", "It calls for eliminating billions in grants to improve student achievement by reducing class sizes and funding professional development for teachers as well as cutting funds dedicated to increasing the use of technology in schools and improving school conditions. In many cases, DeVos said the purpose of the grants has been found to be redundant or ineffective.", "In the case of the $17.6 million cut to help fund the Special Olympics, a program designed to help children and adults with disabilities, DeVos suggested it is better supported by philanthropy and added, \"We had to make some difficult decisions with this budget.\"", "The Department of Education's 2020 budget proposals did indeed call for the total elimination of \"Special Olympics Education Programs,\" a savings of $17.6 million, very close to the \"$18 million\" claimed by Occupy Democrats.", "The full list of programs marked for elimination can be found on page 49 of the department's budget request and total roughly $6.67 billion in savings.", "DeVos also proposed eliminating her department's funding for the Special Olympics in the 2018 and 2019 financial year budgets, to the tune of $10.1 million and $12.6 million, respectively. On all three occasions, the explanation given for the proposal has been the same:", "\"This program supports a directed grant award to a not-for-profit organization. Funds are used to expand the Special Olympics and the design and implementation of Special Olympics education programs. Such activities are better supported with other Federal, State, local, or private funds.\"", "The proposal to eliminate the Special Olympics programs did not make it into the final versions of the 2018 or 2019 budgets. Democrats in the House of Representatives strongly opposed DeVos' $17.6 million cut for 2020 during her appearance at a 26 March hearing of the Labor, Health and Human Services, Education and Related Agencies subcommittee of the House Appropriations Committee:", "WATCH: Education Sec. DeVos is grilled by members of Congress over funding cuts to special education programs and the Special Olympics. pic.twitter.com/iDp2uEpCjf", "— NBC News (@NBCNews) March 27, 2019", "Given that Democrats have had a majority in the House of Representatives since January 2019, it is highly unlikely that DeVos' proposal to eliminate the Special Olympics programs will be implemented for 2020 either.", "During the 26 March hearing, DeVos told the subcommittee: \"We had to make some difficult decisions with this budget\" and justified her proposal by affirming that, roughly speaking, the Special Olympics receives enough funding from other sources, saying: \"Special Olympics is an awesome organization, one that is well-supported by the philanthropic sector as well.\"", "In a press release on 27 March, DeVos outlined her rationale at greater length, saying:", "The Special Olympics is not a federal program. It's a private organization. I love its work, and I have personally supported its mission. Because of its important work, it is able to raise more than $100 million every year. There are dozens of worthy nonprofits that support students and adults with disabilities that don't get a dime of federal grant money. But given our current budget realities, the federal government cannot fund every worthy program, particularly ones that enjoy robust support from private donations.", "Special Olympics Inc. and its affiliates received a total of $15.46 million in federal grants during the 2017 calendar year, just under 10.4 percent of its total revenue of $148.7 million, according to the charity's 2017 financial report, the most recent such document published on its website.", "By contrast, individual and corporate contributions and sponsorships made up 46 percent of the charity's revenue in 2017, and direct-mail contributions provided 30 percent.", "Readers and viewers of some news reports on 26 and 27 March may have been given the impression that DeVos had proposed ending all federal government funding of Special Olympics, such as when MSNBC's Andrea Mitchell claimed that the Education Secretary had proposed \"eliminating all federal money -- all federal money -- from the [2020 federal] budget.\"", "In fact, Special Olympics receives funding from at least one other federal agency, the Centers for Disease Control and Prevention (CDC), which is overseen by the Department of Health and Human Services.", "According to that department's grant-tracking database TAGGS, the CDC provided Special Olympics Inc. $62.6 million in grants between 2007 and 2019, with $23.9 million being provided since 2017, and $9.9 million in 2019 alone. That funding has largely gone to two projects: \"Healthy Athletes\" and \"Inclusive Health.\"", "The Department of Health and Human Services' 2020 budget request does not contain any mention of the CDC's Special Olympics grants, nor any proposals to eliminate that funding.", "We asked a spokesperson for Special Olympics to provide a breakdown of the funding it receives from federal government departments and agencies, but unfortunately we did not receive a response in time for publication.", "It's not true to say that DeVos proposed in March 2019 to put an end to all federal funding of Special Olympics. However, she certainly did propose, in her department's budget request, to eliminate all the funding at her disposal, in her capacity as secretary of education — $17.6 million for Special Olympics Education Programs — and she then publicly defended that proposal.", "Spangler, Todd.  \"Betsy DeVos: Deep Cuts to Special Olympics, Student Programs Are Warranted.\"\r\n  The Detroit Free Press.  26 March 2019.", "U.S. Department of Education.  \"Fiscal Year 2020 Budget Summary.\"\r\n  13 March 2019.", "U.S. Department of Education.  \"Fiscal Year 2018 Budget Summary and Background Information.\"\r\n  23 May 2017.", "U.S. Department of Education.  \"Fiscal Year 2019 Budget Summary and Background Information.\"\r\n  12 February 2018.", "Special Olympics, Inc. and Affiliates.  \"Combined Financial Statements and Supplemental Combining Schedules as of and for the Years Ended December 31, 2017 and 2016, and Independent Auditor's Reports.\"\r\n  29 May 2018.", "Kesslen, Ben.  \"Special Olympics Chair: DeVos' Cuts Would Hurt Work to End Children's 'Social Isolation.'\"\r\n  MSNBC.  27 March 2019.", "U.S. Centers for Disease Control and Prevention.  \"CDC and Special Olympics: Inclusive Health.\"\r\n  13 March 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]