["About this rating", "On 20 November 2017, an anonymous Twitter account reported — without citing any evidence — that hate crime charges against four African-American people accused in a livestreamed video attack on a white special-needs teen had been \"quietly\" dropped by a judge:", "Chicago judge quietly drops hate crime charges against the domestic terrorists known as the \"BLM kidnappers\"", "These thugs beat and tortured a mentally disabled white boy while screaming \"Fuck Trump\" \"Fuck white people\". Cities would literally be burning if the roles were reversed pic.twitter.com/DTOFnhChb8", "— Thirsty Grunt ?? (@Thirsty_Grunt) November 20, 2017", "Jordan Hill, Tesfaye Cooper, and sisters Brittany and Tanishia Covington, all between the ages of 18 and 24, were arrested in January and are accused of beating a bound, disabled 18-year-old man in Chicago while filming the torture and streaming it via Facebook Live. According to Cook County State's Attorney spokeswoman Tandra Simonton, all four have been charged with a hate crime. In addition, they face charges of kidnapping, battery and robbery and Hill faces charges of possession of a stolen vehicle. Simonton told us none of the charges have been dropped, and all have upcoming court dates. All have pleaded not guilty.", "From the outset, the already disturbing case has been beset by exaggerations and misinformation. The false claim that the four suspects in the video were associated with the Black Lives Matter movement was launched by Internet personalities that peddle racialized conspiracy theories, including Mike Cernovich, who tweeted \"Chicago #BlackLivesMatter Supporters Kidnap, Torture Trump Supporter on Facebook Live Video,\" and InfoWars editor Paul Joseph Watson, who tweeted, \"Police: #BLMKidnapping is not a hate crime because it wasn't race motivated. 'F**k white people' not race motivated?\"", "There has never been any evidence linking the four suspects to Black Lives Matter, which is a racial justice movement, not an organization to which one can claim membership — and even if such evidence existed, it would be unrelated to the case, police and a defense attorney told us. But just as false information about Black Lives Matter spread far and wide on Twitter, so too did the false claim that hate crime charges had been \"quietly\" dropped.", "In the video, the victim (since identified as 18-year-old Austin Hillburn) can be seen bound with duct tape over his mouth. The suspects can be heard making disparaging comments about white people and President Donald Trump. They allegedly threatened Hillburn with a knife, cut his scalp, and forced him to drink toilet water. Authorities said they pursued hate crime charges because of the racial remarks, and because of the victim's disability. Hill, Cooper and the Covington sisters are all currently in custody. Cooper and Tanishia Covington are being held without bond, according to Cook County inmate records, while Hill and Brittany Covington are being held in lieu of $900,000 and $500,000 respectively.", "Main, Frank, et al. \"4 Face Hate Crime Charges in Videotaped Attack.\"\r\n  Chicago Sun-Times. 15 January 2015.", "Hussain, Rummana. \"Four Accused in Facebook Live Torture Case Plead Not Guilty.\"\r\n  Chicago Sun-Times. 10 February 2017.", "Menegus, Bryan. \"Alt-Right Trolls Use Chicago Kidnapping to Spread Lies About Black Lives Matter.\"\r\n  Gizmodo. 5 January 2017.", "Yan, Holly, et al. \"Chicago Torture Video: 4 Charged With Hate Crimes, Kidnapping.\"\r\n  CNN. 5 January 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]