["The photo was posted here on June 10, 2018, with the caption, “This is 1932 when Kenyans first heard music from a speaker,” and here on May 22, 2019, with the caption, “The first time music sound was heard in the speaker, in Nigeria (1895).”", "The same photo was posted on Facebook here and here with similar captions claiming it was taken in either Kenya or Nigeria.", "The image was also posted here by a Facebook user claiming to be from Papua New Guinea, with the caption, “That moment our people first heard music from a speaker.”", "Reverse image searches allowed AFP to track the image down to the archives of the International Library of African Music (ILAM) in South Africa.", "The image appeared in this 2016 post by Public Radio International, which sourced the image to ILAM.", "Contacted by AFP, sound engineer and manager Elijah Madiba said the photograph was taken in 1952 in the northeastern Democratic Republic of Congo, which was known as the Belgian Congo at the time.", "The image appeared on the cover of an album of recordings made by the British ethnomusicologist Hugh Tracey, 'On the Edge of the Ituri Forest'.", "The Ituri Rainforest is nestled in northeastern Democratic Republic of Congo.", "Madiba said that Tracey -- the founder of ILAM, who died in 1977 -- may have shot the photo, but that there is no record of the photographer.", "\"Tracey traveled with a team which always included a sound engineer, a translator and sometimes a camera man. He always had speakers to play back the music to the people he recorded,\" Madiba said.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]