["About this rating", "On 3 July 2016, the YouTube channel NBT Films (Nothing But the Truth) shared a video purportedly showing an \"Arab guy\" angrily renouncing his faith on live television:", "Recently, an Arab TV station discussed the controversial book 'The People vs Muhammad'. The result was an explosive meltdown after one of the guests renounced his faith on national TV.", "NBT Films is a video outlet for J.K. Sheindlin, who wrote the book referenced above.  While the video purports to tell the \"black and white facts\" about someone renouncing his faith because of Sheindlin's book, the clip in reality does not capture an Arab's reaction to a controversial book, nor does it capture that person renouncing his faith on live television. Sheindlin added fabricated captions to the video (while pledging to tell \"nothing but the truth\") in order to generate buzz for his book The People vs Muhammad.", "This footage is dated 2 July 2013, when Egyptian president Mohamed Morsi rejected the military's ultimatum to leave office. Opposition activist Ihab al-Khouli, the \"Arab guy\" in the video displayed above, was reacting to Morsi's speech:", "Opposition activist Ihab Al-Khouli: This \"former\" president is addicted to his throne. This man is a liar and a deceiver. The Muslim Brotherhood does not...", "Gets worked up and chokes", "TV host: Relax, have some water... Calm down, Ihab.", "Al-Khouli continues to shout", "Ihab Al-Khouli: He doesn’t know that when he goes to meet the Lord, he will not see Muhammad Badi' or Kheirat Al-Shater next to him. He will be buried in a space of one square meter. More than 33 million people have taken to the streets, but they don't see them. They are blind. Don't they know what has happened to this country because of them? They dare to talk about foreign and domestic conspiracies?! Morsi sent letter to Peres and to Obama. He is asking for the Americans' protection.", "The president challenges his own people. He is pitting his supporters against us. He wants to fight. All Egyptian blood is sacred. I swear to you that I won't go home before Morsi is gone. All the patriotic people have taken to the streets. We could not have convinced all these people to take to the streets if not for all the things that Morsi did.", "Full translations for the video can be found online. The original video, with its original captions, can be viewed below:", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]