["About this rating", "On 14 December 2017 a rapidly-moving Facebook rumor appeared to claim that a high-profile Senate race in Alabama two days before, in which Republican pick Roy Moore (who lost the election) received 953 votes and Doug Jones earned 5,327 — in a town of just 1,867 registered voters:", "Early versions provided a name of the town (Bordalama), but most simply stated the purported tallies and nearly none of them had any corroborating information at all:", "According to official tallies, Roy Moore received 953 votes in the small town. Doug Jones received 5,327. If the disparity in numbers isn’t enough to give you reason to smell something fishy, the population of the town should. There are 2,256 residents there and only 1,867 registered voters. In other words, more people voted for Doug Jones than even live in Bordalama.", "Although the rumor spread like wildfire, most of its appearances didn't include a town name (and the ones that did include the town named \"Bordalama,\" which does not exist) or any identifying details. The source of the claim was an article published by LadiesofLiberty.net, which mentioned the also nonexistent \"State Election Board of Voting Integrity\":", "The State Election Board of Voting Integrity said early on that “more than a third” of Jones’ votes up to 11 a.m. looked suspicious — and with good reason. Many of them came from the small town of Bordalama, a rural community about 20 miles outside Birmingham.", "According to official tallies, Roy Moore received 953 votes in the small town. Doug Jones received 5,327. If the disparity in numbers isn’t enough to give you reason to smell something fishy, the population of the town should. There are 2,256 residents there and only 1,867 registered voters. In other words, more people voted for Doug Jones than even live in Bordalama.", "The claim was quickly picked up by other blogs, but without Ladies of Liberty's disclaimer:", "PAY ATTENTION:", "sat·ire ~ˈsaˌtī(ə)r\nnoun\nthe use of humor, irony, exaggeration, OR ridicule to expose and criticize people’s stupidity or vices, particularly in the context of contemporary politics and other topical issues.\nIf you disagree with the definition of satire or have decided it is synonymous with “comedy,” you should really just move along ... Copyright © 2017 | Paid Liberal Trolls Of America", "A Facebook page embedded at the end suggested that the fake news site is yet another linked to the Last Line of Defense, Our Land of the Free, and As American as Apple Pie — all sites with a stated mission of making conservative social media users look foolish by inducing them to spread outlandish lies.", "Kim LaCapria is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]