["About this rating", "In 2019, Senator Elizabeth Warren of Massachussetts began to resile from previous statements she had made about her Native American ancestry, a source of criticism that had been used against her since she first ran for the U.S. Senate in 2012.", "During that 2012 campaign, the Boston Globe revealed that Warren had listed herself as a member of a racial or ethnic minority in a directory of law professors between 1985 and 1996, after it emerged that Harvard Law School, where she taught from 1995 to 2011, had publicly described her as a Native American during her tenure there. (In 2018, dozens of Warren's colleagues over her decades as a law professor told the Globe that perceptions of her Native American ancestry had played no role in her rise through the ranks of legal academia.)", "In reality, Warren has very little Native American ancestry (albeit more than the average American of European origins), but her public pronouncements, including professing herself to be \"very proud\" of her heritage, have attracted criticism and even ridicule since 2012. President Donald Trump routinely refers to the Democratic senator with the mocking epithet \"Pocahontas\" and on one occasion offered to pay $1 million to a charity of Warren's choice if she could demonstrate Native American ancestry.", "Warren did just that in October 2018, when she published the results of a DNA test which concluded that the \"vast majority\" of her ancestry was European but that her lineage was very likely to include one Native American ancestor somewhere between six and 10 generations ago.", "The DNA test engendered further controversy, and Cherokee Nation Secretary of State Chuck Hoskin Jr. strongly criticized Warren's actions, writing in a statement that \"Using a DNA test to lay claim to any connection to the Cherokee Nation or any tribal nation, even vaguely, is inappropriate and wrong. It makes a mockery out of DNA tests and its legitimate uses while also dishonoring legitimate tribal governments and their citizens, whose ancestors are well documented and whose heritage is proven. Senator Warren is undermining tribal interests with her continued claims of tribal heritage.\"", "On 31 December 2018, Warren announced she was launching an exploratory committee for a 2020 presidential campaign and was widely expected to formally declare her candidacy for that office in early 2019.", "Against that background, the high-profile Democrat began in February 2019 to step back from her earlier public statements about her Native American ancestry.", "First, the Cherokee Nation revealed that Warren had contacted tribal leaders and apologized for touting the results of her DNA test as evidence of her Native American ancestry. Then on 5 February, the Washington Post reported that Warren had issued a significantly expanded statement, apologizing for describing herself as Native American for many years:", "Sen. Elizabeth Warren said that she was sorry that she identified herself as a Native American for almost two decades, reflecting her ongoing struggle to quiet a controversy that continues to haunt her as she prepares to formally announce a presidential bid.", "... “I can’t go back,” Warren said in an interview with The Washington Post. “But I am sorry for furthering confusion on tribal sovereignty and tribal citizenship and harm that resulted.”", "Warren has been trying for the past year to get past the lingering controversy over her past assertion that she is Native American. In addition to the DNA test, she released employment documents over the summer to show she didn’t use ethnicity to further her career. And in a speech a year ago she addressed her decision to call herself a Native American, though she didn’t offer the apology that some wanted at the time.", "But as Warren undergoes increased scrutiny as a presidential candidate, additional documents could surface to keep the issue alive. Using an open records request during a general inquiry, for example, The Post obtained Warren’s registration card for the State Bar of Texas, providing a previously undisclosed example of Warren identifying as an “American Indian.” Warren filled out the card by hand in neat blue ink and signed it. Dated April 1986, it is the first document to surface showing Warren making the claim in her own handwriting. Her office didn’t dispute its authenticity.", "The revelation that Warren had personally described herself as \"American Indian,\" in her own handwriting, formed the basis of widespread news reports on 5 and 6 February 2019 and prompted enquiries from Snopes readers about the authenticity of the document described by the Washington Post.", "We can confirm that the document is authentic. The State Bar of Texas, the agency that originally issued it, sent us a redacted copy of Warren's 1986 Texas State Bar registration card, which can be viewed below:", "The card showed that in blue ink, Warren entered her race as \"American Indian,\" listing her office address as 727 E. 26th Street in Austin -- the address of the University of Texas law school, where she was a professor at the time. The card was signed by Warren and was dated 18 April 1986.", "On 6 February, Warren addressed the 1986 Texas Bar registration card when speaking to reporters in Washington, D.C.:", "﻿", "Bustamante, Carlos D.   \"Elizabeth Warren DNA Test Results.\"\r\n    The Boston Globe.   10 October 2018.", "Ebbert, Stephanie.   \"Directories Identified Elizabeth Warren as Minority.\"\r\n    The Boston Globe.   30 April 2012.", "Madison, Lucy.   \"Warren Explains Minority List, Talks of Grandfather's 'High Cheekbones.'\"\r\n    CBS News.   3 May 2012.", "Garcia, Arturo.   \"Did Trump Offer $1 Million If Elizabeth Warren Could Show Native American Heritage?\"\r\n    Snopes.com.   15 October 2018.", "Cherokee Nation.   \"Cherokee Nation Response to Senator Warren's DNA Test.\"\r\n    15 October 2018.", "Lee, MJ and Gregory Krieg.   \"Elizabeth Warren Launches Exploratory Committee Ahead of Likely 2020 Presidential Run.\"\r\n    CNN.   31 December 2018.", "Krieg, Gregory.   \"Elizabeth Warren Apologized to Cherokee Nation Over DNA Test, Tribe Says.\"\r\n    CNN.   1 February 2019.", "Linskey, Annie and Amy Gardner.   \"Elizabeth Warren Apologizes for Calling Herself Native American.\"\r\n    The Washington Post.   5 February 2019.", "Re, Gregg.   \"Elizabeth Warren Listed Race as 'American Indian' in Newly Revealed Texas State Bar Card From 1986.\"\r\n    Fox News.   6 February 2019.", "Kelly, Caroline.   \"Washington Post: Warren Listed Race as 'American Indian' on Texas Bar Registration.\"\r\n    CNN.   6 February 2019.", "Cummings, William.   \"Elizabeth Warren Wrote 'American Indian' for Race on 1986 Bar Registration, Report Says.\"\r\n    USA Today.   6 February 2019.", "Dan Mac Guill is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]