["The image was shared in this Facebook post on May 26, 2020.", "The post’s Tagalog-language caption states in part: “While I was walking earlier here along the stretch of Shibuya, Japan. I noticed this portrait of Japan's prime minister Shinzo Uzumaki Jotaro Abe next to the president of the Philippines president Duterte. Displayed in front of one of the national museums here in Japan.\"", "Shibuya is a district in Tokyo, Japan’s sprawling capital.", "This profile on the official website for the Japanese prime minister indicates his name is actually \"Shinzo Abe\", not \"Shinzo Uzumaki Jotaro Abe\".", "The same photo was shared alongside a similar claim on Facebook here, here and here.", "The claim is false.", "A combined reverse image and keyword search on Google found the image was digitally manipulated to include Abe’s portrait. The original photo was taken in the Indonesian capital of Jakarta.", "The original photo, which clearly shows portraits of Duterte and Jokowi, was published on September 8, 2016 on Twitter here by a reporter for GMA News Online, a Philippine media organisation. The tweet was embedded in this GMA article on the same day.", "“A portrait of President Rodrigo Duterte has been displayed at the National Monument in Central Jakarta, Indonesia as the country awaits his arrival,” the GMA report states. “[Duterte’s photo] was placed beside the portrait of Indonesian President Joko Widodo.”", "The article adds that “Indonesia is Duterte's second stop in his tour of neighboring Southeast Asian countries for his first international travel as head of state.”", "Below is a screenshot comparison of the doctored photo (L) and the original photo which shows Jokowi (R):", "The photo showing the portraits of Duterte and Jokowi also appeared in this report published by Indonesian news site IDN Times on September 9, 2016.", "The location where the portraits were displayed in Jakarta in 2016 can be viewed here on Google Street View.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]