["About this rating", "The Bermuda Triangle (also known as the Devil's Triangle) is a mythical section of the Atlantic Ocean (roughly bounded by Miami, Bermuda and Puerto Rico) where numerous ships and airplanes have purportedly disappeared, with many of the vanishings supposedly due to mysterious or undiscovered causes.", "On Dec. 18, 2020, the Holodilnick website published an article suggesting a scientific explanation had at last been discovered for the Bermuda Triangle enigma, headlined \"Scientists Find Evidence That May Finally Explain the Bermuda Triangle.\"", "However, readers scanned the Holodilnick article in vain to learn what evidence or explanation had been offered by scientists to explain the mystery, as the text of the report merely made vague reference to \"researchers at the University of Southampton in England\" with no elaboration:", "The Bermuda Triangle has been the subject of intense debate for decades. Over the years, ships and planes have mysteriously disappeared while crossing through the 500,000-square mile area of ocean, and in every instance, no one knows what happened.", "But those who study the vanishing phenomenon know solid objects don’t just go missing; there has to be some kind of logical explanation for the occurrences. Well, researchers at the University of Southampton in England think they have the answer.", "The Holodilnick article was apparently an incomplete rehash of news that was already well over two years old. Back in August 2018, multiple news outlets reported on a study by oceanographers from the University of Southampton that posited an oceanographic explication for the so-called \"Bermuda Triangle\" phenomenon:", "British oceanographers from the University of Southampton believe the mystery of the Bermuda Triangle has been busted. After an investigation lasting decades, they’ve concluded that ships are being sucked into the ocean by \"rogue waves\" over 30 metres in height.", "So what are rogue waves? Basically, they’re abnormally large and unexpected waves in open sea. According to a study on Freak Waves, a standard-issue large wave of around 12 metres will have a breaking pressure of 8.5 psi. Modern ships are designed to tolerate a breaking wave of 21 psi, but a rogue wave can deliver a crushing 140 psi, grossly exceeding the limits of what ships are expected to tolerate.", "Dr Simon Boxall, an Oceanographer from the University of Southampton who led the new study, explained in the documentary The Bermuda Triangle Enigma: “there are storms to the South and North, which come together ... we’ve measured waves in excess of 30 metres. The bigger the boat gets, the more damage is done.”", "“If you can imagine a rogue waves with peaks at either end, there’s nothing below the boat, so it snaps in two. If it happens, it can sink in two to three minutes,” explained Boxall.", "Even this information was not exactly new in 2018, as a rogue wave measuring 18.5 metres was first recorded back in 1995. And according to some researchers, there's really no mystery to the Bermuda Triangle at all; the area just sees proportionally more losses due to the presence of more traffic in that part of the world:", "Australian Scientist Dr Karl Kruszelnicki [said] there is no mystery to solve because the incidents were likely caused by human error.", "“According to Lloyds of London and the US coast guard, the number of planes that go missing in the Bermuda Triangle is the same as anywhere in the world on a percentage basis,” Dr Kruszelnicki said.", "“It is close to the equator, near a wealthy part of the world, America, therefore you have a lot of traffic.”", "The Bermuda Triangle is one of the most heavily travelled shipping lanes in the world, with vessels crossing through to get to ports in America, Europe and the Caribbean.", "The mystery surrounding the area grew in the 20th century with a large number of planes and ships going missing over the decades.", "David Mikkelson founded the site now known as snopes.com back in 1994 as a creative outgrowth of his wide-ranging interests in a variety of subjects (particularly folklo ... read more", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]