["About this rating", "Dunkin' Donuts offered free coffee for teachers at a handful of their locations in 2014 and 2015.", "The donut chain is not holding a national promotion that offers free coffee for teachers on Mondays in September.", "In August 2017, a photo making the rounds online appeared to advertise a \"teacher appreciation\" promotion at Dunkin' Donuts restaurants across the country:", "According to the meme, teachers are eligible to receive a medium hot or iced coffee on each Monday in September if they presented their school IDs during purchase. This is untrue, although the claim itself is not technically a scam, but it is outdated, overblown, and taken out of context.", "Dunkin' never held a national promotion to offer free coffee to teachers; instead, this meme originated when a single store in Minooka, Illinois, offered the deal in September 2014. After people in other states allegedly drove to their own local stores thinking the offer was available in their area, the company confirmed on their Facebook page at the time that the offer was limited to one store in one town. In early January 2015, however, the offer was expanded when a group of eleven stores across six states held a variant of the promotion, offering customers one free cup of coffee per day on Mondays.", "A company spokesperson, Michelle King, told us via e-mail that Dunkin' Donuts does not currently offer a national free coffee promotion for teachers and apologized for any confusion.", "The donut chain did hold a free iced coffee promotion in certain markets for one day a decade ago, on 21 March 2007.", "Tuttle, Brad.    \"Free Coffee on Mondays at McDonald's and Dunkin' Donuts.\"\r\n    TIME.   7 January 2015.", "Granata, Kassondra.   Dunkin Donuts Promotion Causes Confusion for Educators.\"\r\n    Education World.   17 July 2017.", "Arturo Garcia is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]