["About this rating", "A bizarrely bejeweled alien-like creature reportedly seen swimming through deep ocean waters sparked a new round of internet fact-or-fiction in July 2020. Despite its ethereal appearance, the enigmatic deep-sea strawberry squid -- so named for its sparkling fraise appearance -- is a very real animal, and a specimen of it has indeed been “caught.”", "Caught on camera, at the very least:", "https://youtu.be/pHIUxEiprsk\n\nThree “very large” strawberry squid were recorded by the National Oceanic and Atmospheric Administration (NOAA) and Woods Hole Oceanographic Institution (WHOI) during part of the Deep-See research cruise through the ocean twilight zone, a layer of water located at a depth of between 650 and 3,300 feet (200 and 1,000 meters).", "Otherworldly organisms that call this dark, light-limited region home have adapted and evolved a number of unique characteristics which allow them to thrive at such highly pressurized depths, including the peculiar eyes of cockeyed squid. Known scientifically as Histioteuthis heteropsis, these bedazzled cephalopods have a highly specialized left eye that grows up to two times the size of the right eye as the squid matures. The larger of the two eyes is used to look upward into dimmer, shallower waters, while the smaller one points down in search of bioluminescent flashes indicative of prey or predators, according to WHOI.", "“On the last trawl of the cruise, we caught three very large strawberry squid. The largest had a mantle length of about 11.5 inches (29 centimeters) and an overall length of roughly 39 inches (about a meter), which seems to be the maximum size reported for these squid. It's good to confirm the presence of some of these large animals in the twilight zone,” wrote scientist Mike Jech of the Northeast Fisheries Science Center in a blog post.", "Described for the first time in the 19th century, various cockeyed squid individuals have been visually observed over the last several decades and continue to help marine scientists better understand the mysterious world below the ocean surface.", "Jech, Mike.   \"Strawberry Squid and More from the Ocean Twilight Zone.\"\r\n    NOAA Fisheries.   7 Aug 2019.", "Schlining, Kyra.   \"The Curious Eyes of the Cockeyed Squid.\"\r\n    Monterey Bay Aquarium Research Institute Blog.   13 Feb 2017.", "Madison Dapcevich is a freelance contributor for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]