["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "A fake headline says beachgoers ignored Arizona’s social-distancing rules in droves.", "Arizona is landlocked.", "Some people just don’t get a joke.", "An April 22 Facebook post had a mock screenshot of beachgoers crammed cheek by jowl to enjoy the waves at Arizona’s ever popular seaside. The image looked as though it was pulled from television news and under the headline, \"Crowded beaches in AZ,\" was the summary \"People defying stay-at-home order fill Arizona beaches.\" (We tweaked the image to avoid spreading bad information.)", "Some users appreciated the phony timestamp of 0:01.", "This post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "We might have given this item a pass as all in good fun. Except some users were taken in.", "\"Are people really that ignorant?\" one person commented.", "\"Wow, this took me forever until I realized AZ doesn’t have beaches, does it?\" said another.", "Arizona has much to recommend it, but ocean frontage isn’t one of them. The closest major beach lies along the Gulf of California, in Mexico, about 50 miles from the border.", "Source: Google Maps", "Arizona does have its sandy deserts, and it has plenty of places to swim. There are lakes, rivers and swimming holes, with small patches of sand. Lake Havasu State Park on the state’s western border with California has some beachfront looking out on its placid reservoir.", "But the surfing is a lot better at Muizenberg Beach in Cape Town, South Africa, which is where this image appears to be from, judging by the row of painted huts on the sand.", "Arizona Gov. Doug Ducey issued a stay-at-home order that runs through April 30, and has made no decision on whether to extend it. He said he’ll be looking at the trends in coronavirus cases.", "Meanwhile, save your swimsuit for Arizona’s swimming holes and go after the crisis passes.", "We rate this post Pants on Fire.", "Bloggers, Facebook post, April 22, 2020", "State of  Arizona, Executive order: Stay home, stay healthy, stay connected, March 30, 2020", "Fox 10 News, Arizona governor not ready to end virus stay-at-home order, April 23, 2020", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]