["About this rating", "On 16 April 2019, local news stations in Coloma Township, Michigan, began reporting that razor blades had been found in the handles of gas pumps there.", "Historically we have found an overlap between real reports of sharp objects placed in mundane items, like gas-pumps and shopping-cart handles, and urban legends of such incidents. So Snopes.com readers questioned whether the latest round of sharp-objects-on-handles could be believed.", "In this case, the reports are true. A total of eight razor blades were found at a Speedway gas station. Two of them were lodged in the plastic handle covering, police said. \"It's kind of shocking and it's kind of unsettling, to say the least, that someone would actually put that there or try to do that intentionally,\" Coloma Township Police Chief Wes Smigielski told local television news station WSBT.", "For years, hoaxes about HIV-infected needles tucked into places like the coin-return slots of pay phones and gas-station pump handles have circulated on the internet, as well as false claims that madmen were using such needles to prick unsuspecting moviegoers.", "However in May 2017, a California man was hospitalized after getting stuck by a needle lodged in a gas-pump handle.", "Hiding razor blades in places so that people might accidentally hurt themselves is a demented but familiar phenomenon. In 2012, a baby was treated for minor injuries after being cut by a razor blade hidden in her new footie pajamas. In 2014, a little boy also received minor injuries from razor blades maliciously taped to playground equipment in Illinois. In 2015, a North Dakota woman reported finding one embedded in the handle of a shopping cart.", "Every year, parents and children hear rumors of Halloween candy tainted with everything from razor blades to poison to drug. Oftentimes those reports are nothing more than hoaxes.", "WSBT. \"Coloma Township Police Warning Public After Razor Blades Found Hidden in Gas Pump Handle.\"\r\n  16 April 2019.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]