["By Robert Farley", "Posted on September 11, 2017", "Kris Kobach, vice chairman of the Presidential Commission on Election Integrity, claims to have “proof” of voter fraud in New Hampshire that’s widespread enough to have swung a U.S. Senate election in favor of the Democrats. He doesn’t.", "Kobach’s proof? He says several thousand people who registered to vote on Election Day with an out-of-state driver’s license have not since registered a car or gotten a driver’s license in New Hampshire.", "But that’s no smoking gun. It is plausible, in fact likely, that most of those voters were college students who are allowed by state law to vote in New Hampshire even though they only live in the state part of the year.", "Kobach’s baseless allegation came ahead of the commission’s second public meeting on Sept. 12 in New Hampshire. Kobach will chair the meeting.", "“It has long been reported, anecdotally, that out-of-staters take advantage of New Hampshire’s same-day registration and head to the Granite State to cast fraudulent votes,” Kobach, the Kansas secretary of state, wrote in an opinion piece for Breitbart on Sept. 7. “Now there’s proof.”", "As we said, Kobach doesn’t have the goods. But here’s his argument:", "Kobach, Sept. 7: According to statistics released by the Speaker of the New Hampshire House of Representatives, on the date of the general election in November 2016, there were 6,540 same-day registrants who registered to vote in New Hampshire using an out-of-state driver’s license to prove their identity. In and of itself, that doesn’t prove that any fraud occurred – theoretically, each of those individuals could have been someone who recently moved to the State and had not yet had time to get a New Hampshire driver’s license. According to New Hampshire law, a new resident has 60 days to obtain a New Hampshire driver’s license.", "So if those 6,540 voters were bona fide New Hampshire residents, they would get their driver’s license no later than January 7, 2017. However, the numbers tell a very different story. It turns out that, as of August 30, 2017 – nearly ten months after the election – only 1,014 of the 6,540 same-day registrants who registered with an out-of-state license had obtained a New Hampshire driver’s license. The other 5,526 individuals never obtained a New Hampshire driver’s license. And, of those 5,526, only 213 registered a vehicle in New Hampshire.", "So 5,313 of those voters neither obtained a New Hampshire driver’s license nor registered a vehicle in New Hampshire. They have not followed the legal requirements for residents regarding driver’s licenses, and it appears that they are not actually residing in New Hampshire. It seems that they never were bona fide residents of the State.", "As a result, Kobach writes, “a pivotal, close election was likely changed through voter fraud on November 8, 2016: New Hampshire’s U.S. Senate Seat, and perhaps also New Hampshire’s four electoral college votes in the presidential election.”", "Kobach notes that Republican Sen. Kelly Ayotte was beaten by challenger Maggie Hassan, a Democrat, by just 1,017 votes. “Those 5,313 fraudulent votes were more than enough to swing the election,” Kobach writes. “If 59.2 percent or more of them went for Hassan, then the election was stolen through voter fraud. That’s likely, since the surrounding states are Democrat strongholds.”", "Using the same logic, Kobach says New Hampshire’s four electoral college votes may have swung to Democratic presidential nominee Hillary Clinton as a result of this same “illegal voting by nonresidents.”", "But Kobach hasn’t provided evidence of any illegal voting.", "New Hampshire is one of 15 states that has a same-day voter registration policy. That means eligible voters can show up and vote on Election Day if they sign an affidavit attesting that New Hampshire is their “domicile.” They also must present valid identification, which can include as an out-of-state driver’s license.", "As the secretary of state website explains, “Your domicile is that place, more than any other, where you sleep most nights of the year, or to which you intend to return after a temporary absence.” State law spells out clearly that that specifically includes college students (provided they don’t also vote in another state — which would be illegal).", "The numbers cited by Kobach square with those provided in a joint letter sent by New Hampshire’s Secretary of State Bill Gardner and Safety Commissioner John Barthelmes to New Hampshire House Speaker Shawn Jasper on Sept. 6. But Gardner and Barthelmes do not cite the figures as evidence of voter fraud, as Kobach did.", "“It is likely that some unknown number of these individuals moved out of New Hampshire, it is possible that a few may have never driven in New Hampshire or have ceased driving, however, it is expected that an unknown number of the remainder continue to live and drive in New Hampshire. If they have established their residence in New Hampshire, they may have failed to obtain a New Hampshire driver’s license,” Gardner and Barthelmes wrote.", "Jasper, a Republican, told WMUR-TV that if the discrepancy is from college students, then those students should have gotten their driver’s licenses within 60 days if they claim to be domiciled in New Hampshire.", "“College students are eligible to vote if they declare domicile here, but anybody who does that then has to comply with the laws of the state,” Jasper said. “If someone is domiciled in New Hampshire (and has a vehicle), then within 60 days, they need to obtain a driver’s license. I think we will find that within that 5,000, there will be many who did not comply with the law.”", "That’s not right, according to Barthelmes and Gardner. In their letter to Jasper, the two state officials cited a state Supreme Court decision that found, “a person may be domiciled in New Hampshire for voting purposes and be a resident of another state for motor vehicle/driver’s licensing purposes.”", "Mike Burns, the national director for nonpartisan Campus Vote Project, told us the Supreme Court has ruled that states cannot deny residency and voting rights to  students attending a college in their state. But in practice, he said, some states make it harder than others, such as requiring that voters provide either federal or in-state photo ID at the polling place, but not accepting out-of-state driver’s licenses or student IDs.", "There’s no way to know for sure how many of those who registered to vote with an out-of-state license are (or were) college students, but an analysis in February by New Hampshire Public Radio found that “the towns that see the highest rates of out-of-state IDs used at the polls are all home to college campuses.”", "NHPR, Feb. 14: Overall, the towns that see the highest rates of out-of-state IDs used at the polls are all home to college campuses: the University of New Hampshire (Durham, with some spillover in Dover and Portsmouth), Dartmouth (Hanover and Lebanon), Keene State University (Keene), Franklin Pierce University (Rindge), Plymouth State University (Plymouth), Saint Anselm University (near the border of Goffstown and Manchester), New England College (Henniker) and Southern New Hampshire University (Hooksett).", "“Probably most of them [those who registered using an out-of-state license as ID] are college students, but it’s hard to tell how many,” Fergus Cullen, a former chair of the New Hampshire Republican Party in 2007-2008, told us in a phone interview.", "“What Kobach and the commission are conflating is a state law they don’t like with massive fraud, and they are two different things,” Cullen said.", "Cullen said he’s not a fan of same-day registration and domicile laws. In the past, he said, there have been instances of paid political campaign workers using the addresses of elected officials or campaign offices to vote — only to leave the state shortly after the election.", "“We call it drive-by voting,” Cullen said, adding that those kinds of cases number in the dozens, not the thousands.", "“You may find that distasteful — I do,” Cullen said, “But there’s nothing illegal about it.”", "Cullen said a case can also be made against otherwise out-of-state college students being allowed to vote in New Hampshire.", "“There is a legitimate argument to be made that if you are going to live here, you ought to register your car here, and pay taxes here and get a driver’s license here,” Cullen said. “But those are questions of state law. That’s different than the massive fraud claims of this sham commission.”", "Republicans who say they don’t like same-day registration have only themselves to blame, Cullen added. The same-day registration law, he said, was passed in 1996 by a Republican majority to get around the federal motor voter law, which requires states to offer voter registration at the Division (or Department) of Motor Vehicles when people get their driver’s licenses or at state agencies that provide public assistance. Cullen said Republicans feared that that would be a boon to Democratic Party registration.", "Cullen said that while the current law makes it possible for some to try to game the system, it’s also easy for prosecutors to catch them if they do. “Is there a paper trail? yes,” he said. “And do you face possible prosecution? Yes.”", "Indeed, Gardner and Barthelmes wrote that after a cross-check with other states, they are “further analyzing 196 names that appear to have been marked on a New Hampshire checklist and one other state as having voted in the November 2016 general election.” In other words, they may have voted twice, which, of course, is illegal.", "“We will be working with the attorney general to determine next steps and to transfer those cases which are appropriate to the attorney general for investigation,” they wrote.", "In addition to college students, Cullen said the list cited by Kobach may also include people who may have recently moved to New Hampshire and simply have not gotten around to obtaining a New Hampshire driver’s license. It may be required for drivers to obtain a New Hampshire license within 60 days of moving to the state, but some may not see the urgency to get a new one in New Hampshire if their old license is still valid, he said. That may not be proper, Cullen said, but it’s not voter fraud.", "Jasper, the state House speaker, told WMUR that there are “troubling” aspects to what is going on in New Hampshire’s elections, but he cautioned that the figures cited by Kobach are not necessarily proof of fraud.", "“There can be no conclusions drawn regarding the driver’s licenses, other than for whatever reason, those people didn’t stay in the state or didn’t comply with the law or never were actually residents of the state,” Jasper said.", "After Kobach’s opinion piece was published by Breitbart, Democratic Sens. Hassan and Jeanne Shaheen issued a joint statement accusing Kobach of trying to “mislead the public” in order to “lay the groundwork for broad-scale, politically motivated voter suppression.”", "“The law clearly states that college students and other New Hampshire residents can vote without a New Hampshire ID, and these false partisan claims are deliberately twisting the facts,” Hassan and Shaheen wrote.", "We will update this piece if Kobach or others present any real proof that thousands of out-of-state voters illegally voted in New Hampshire.", "FactCheck.org Rating:", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]