["On June 16, the news of the death of 20 Indian army soldiers along the Galwan Valley in Ladakh shook the nation. The news was widely reported and the Congress party came down heavily upon the PM Modi-led government. Congress MP Rahul Gandhi shared a link of a video where he paid homage to the martyred soldiers. In another tweet, he questioned Defence Minister Rajnath Singh on the soldiers’ deaths. He also questioned the Prime Minister and wrote, “Why is the PM silent? Why is he hiding? Enough is enough. We need to know what has happened. How dare China kill our soldiers? How dare they take our land?”", "Why is the PM silent? Why is he hiding?", "Enough is enough. We need to know what has happened.", "How dare China kill our soldiers? How dare they take our land?", "— Rahul Gandhi (@RahulGandhi) June 17, 2020", "A supposedly Chinese user quote-tweeted Gandhi on June 17 and thanked him for asking “genuine questions”. He further wrote, “Till the moment you are there we don’t have to worry about anything.” The user Li Jie (@Lijeng_) identified as a journalist with China-based Global News.", "Thanks @RahulGandhi for your genuine questions.. till the moment you are there we don’t have to worry about anything. https://t.co/JYwHqKtYIX", "— 李杰 Li Jie (@Lijeng_) June 17, 2020", "The tweet expectedly raised eyebrows. A purported Chinese national’s commendation for Rahul Gandhi in the current atmosphere was deemed significant. It was a reminder of the time when Hafiz Saeed had praised journalist Barkha Dutt.", "Vikas Pandey retweeted the tweet thus giving it further traction. Pandey has over 1 lakh followers on Twitter and he runs the misinformation and pro-BJP propaganda page ‘I Support Narendra Modi’ on Facebook. The page has more than 16 lakh followers.", "The first hint that pointed toward the ingenuity of the account was the fact that it was created in June 2020. In fact, we found no tweets posted by the account before June 17, the day he quote-tweeted Rahul Gandhi. All the retweets were also of tweets posted in June except one tweet from April. Furthermore, a brand new account of a journalist associated with Global Times also raised suspicion. The video below shows the account’s timeline until June 17, 2020, 9:10 PM.", "The followers of the account also raised doubts. It is strange that a person who claims to be a Chinese national has no Chinese followers but mostly Indian followers. Furthermore, a ‘Global Times’ journalist has no one from Global Times following him.", "The profile picture of the account features Huang Yibo, a Chinese child prodigy. The earliest instance of this photo was found in a May 2011 article in UK-based The Independent.", "Who is behind the account?", "We searched for the earliest tweets made by @Lijeng_ to check which prominent handle retweeted its tweets. Since it has already been established that the account started tweeting on June 17, Alt News used Epoch Time converter to search for all tweets posted by the account on that day till 6:56:18 PM. This revealed that the account ‘@SmokingSkills_’ had retweeted its first tweet. One can find out which handle has retweeted a certain tweet by going through the replies on the tweet. The account which has retweeted the tweet would be tagged in the replies if a user comments on the retweeted tweet. In the screenshot below, user Vijay (@vijaymishrakh) had commented at 6:53 PM which means that @SmokingSkills_ had retweeted @Lijeng_’s tweet within three minutes of when it was shared.", "@SmokingSkills_ is a known troll account which hasn’t revealed its identity, The account has over 66,000 followers and the fact that it retweeted the first tweet by a new account in less than three minutes raises a lot of questions.", "This either suggests that @SmokingSkills_ has created @Lijeng_ or is behind making it gain popularity. The account which was created in June 2020 identifies as a Global News journalist yet has no one following him either from China or from Global News. @Lijeng_ is quite evidently a fake account.", "Since the India-China border dispute, several fake accounts impersonating prominent individuals have also cropped up. National in-charge of social media, BJP Mahila Morcha, Priti Gandhi retweeted a fake account impersonating US President Donald Trump’s daughter, Ivanka Trump. The fake account had tweeted, “I stand with India” to which Gandhi retweeted, “India appreciates”. Ivanka Trump’s official account is @IvankaTrump while the fake account is @IvankaaTrump.", "Dr Vijay Chauthaiwale, who ironically identifies as the in-charge BJP’s Foreign Affairs Department, had retweeted a fake account of Donald Trump which also said, “Stand with India”. Journalist Nidhi Razdan had pointed out the faux pas to Dr Chauthaiwale. The genuine Twitter username of the US President is @realDonaldTrump while the username of the fake account is @RealDonldTump_.", "A fake account of Chinese President Xi Jinping has also cropped up.", "I stand with India 🇮🇳 China 🇨🇳 stands with India", "— Xi Jinping (@logicalgandu) June 17, 2020", "Another fake account of Benjamin Netanyahu, Israeli Prime Minister, received a lot of traction.", "After falling for parody account of @realDonaldTrump , many in India, including journalists, now falling for parody account of @netanyahu . Is there no end to our stupidity? pic.twitter.com/40IWT4P4Vd", "— Maneesh Chhibber (@maneeshchhibber) June 18, 2020", "Cabinet minister of UP Suresh Kumar Khanna and National Vice President of BJP Prabhat Jha retweeted a tweet by the fake Netanyahu account.", "Cabinet minister of UP & National Vice President of BJP RTing Netanyahu’s parody account supporting India !! 😂😂 pic.twitter.com/gRA7foXwLH", "— IIIIIIIIII (@_NairFYI) June 18, 2020", "Donate Now", "A video showing three women tackling several men who were apparently trying to harass them…", "On November 15, Israeli forces raided the al-Shifa Hospital in the Gaza Strip as part…", "Trigger Warning: Graphic Image Amid the ongoing Israel-Hamas war, a collage of two pictures is…", "A video of a Palestinian woman allegedly saying that she ‘prefers the Jews’ in Arabic…", "A 13-second clip from Gaza is viral on social media where a seemingly injured man…"]