["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Ultraviolet, a women's rights advocacy group, posted this list about Jeb Bush on Facebook on June 15, 2015. (via Facebook)", "A political group has highlighted a controversial fight over fetal rights that former Gov. Jeb Bush mounted years ago, but it went too far in its description of what the current presidential candidate did.", "Ultraviolet, a women’s rights group, posted an image on Facebook on June 15, 2015, with the title \"5 things you should know about Jeb Bush.\" The first item read, \"Appointed a guardian for the fetus of a rape survivor.\"", "We checked into all five of the claims listed on the image and found this one was not accurate. (Read our story on the rest here.)", "In May 2003, a severely mentally handicapped woman identified only as J.D.S. had been raped in a group home at 22 and was six months pregnant. J.D.S., who was abandoned at birth and raised in foster care, suffered from severe mental retardation, cerebral palsy and autism, with the mental capacity of a 4- or 5-year-old.", "But Bush actually didn’t appoint a guardian, because he didn’t have that power. What he did was order state lawyers to ask the Orange County Circuit Court in Orlando to appoint a representative for the fetus.", "Though Bush opposes abortion, he said the court case was not about that. \"This is a question of protecting an innocent life,\" Bush told the Miami Herald. \"And it will be the policy of our government in the case of a woman who is incapacitated or cannot make decisions for her child, that there should be a guardian.\"", "The Florida Department of Children and Families had already asked the court to appoint a guardian once the baby was born. No parties involved had suggested aborting the fetus.", "But Judge Lawrence Kirkwood did not consider the guardian request, saying he had to follow state statute. Appointing a guardian for the fetus would be \"a clear error,\" he wrote.", "\"A trial judge must follow the law as written,\" Kirkwood said. \"Many had expected this court to blaze new territory and write new law for the facts beyond the Florida statute.\"", "The issue moved forward, even after a healthy girl known as Baby S was born in August 2003. Kirkwood appointed her a guardian at birth. In January 2004, a three-judge panel in a Daytona appeals court ruled against Bush in a 2-1 decision.", "Kirkwood had adhered to a 1989 state Supreme Court ruling that said appointing a representative for an unborn fetus would be \"clearly improper.\" A fetus was not a person under state law, and was therefore without the same rights as a person. Judge Emerson Thompson noted in the majority opinion that fetal rights were not mentioned anywhere in state statutes about guardianship.", "Bush continued to hold his position after the appeal ruling in Daytona.", "\"I do think that a child that could be brought to term, as this child was, in the case where a mother has little or no capabilities in representing the child's interest, a legal guardian should be appointed,\" he said.", "Our ruling", "Ultraviolet said Bush \"appointed a guardian for the fetus of a rape survivor.\"", "Bush asked a judge in 2003 to name someone to act in the interests of the fetus of a mentally disabled woman raped in a group home. But the judge did not, because state law does not give a fetus the same protections as a person. An appeals court upheld the judge’s compliance with a 1989 Florida Supreme Court ruling.", "To be clear, Bush did not appoint anyone as a representative for the fetus, but he did want one. We rate the statement Mostly False.", "Ultraviolet (via Facebook), \"5 things you should know about Jeb Bush,\" June 15, 2015", "New York Times, \"Gov. Jeb Bush to Seek Guardian for Fetus of Rape Victim,\" May 15, 2003", "Orlando Sentinel, \"Court Prohibits Guardian For Fetus,\" Jan. 11, 2004", "Cleveland Plain Dealer, \"That time he sought a guardian for the fetus of a disabled rape victim: Jeb Bush's Right Angle,\" March 25, 2015", "Miami Herald, \"Guardian sought for unborn child,\" May 14, 2003, accessed via Nexis on June 23, 2015", "Miami Herald, \"Judge delays appointing guardian for pregnant rape victim in DCF case,\" May 15, 2003, accessed via Nexis on June 23, 2015", "Miami Herald, \"Bush still seeking a legal guardian for fetus,\" June 3, 2003, accessed via Nexis on June 23, 2015", "Miami Herald, \"Judges say ‘no’ to guardian for fetus,\" Jan. 11, 2004, accessed via Nexis on June 23, 2015", "Miami Herald, \"Governor insists fetus deserved a guardian,\" Jan. 13, 2004, accessed via Nexis on June 23, 2015", "Interview with Brett Abrams, Ultraviolet spokesman, June 22, 2015", "Interview with Allie Brandenburger, Jeb Bush spokeswoman, June 23, 2015", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]