["About this rating", "As the protests against an oil pipeline near the Standing Rock Sioux reservation escalated in November 2016, environmentalist activists began targeting financial institutions backing the Dakota Access Pipeline and urging supporters to boycott them with various memes shared around social media, or petitions calling on the banks to pull their funds out of the project:", "Financial documents from Energy Transfer Partners, the pipeline builder, lists a number of large banking institutions that have provided credit for the project, including: Credit Suisse; Royal Bank of Canada; Suntrust Bank; BNP Paribas; HSBC; Citibank; Morgan Stanley; Wells Fargo, Bank of America; and JP Morgan Chase.", "The Standing Rock Sioux, who fear the pipeline's route presents a threat to their sacred sites and water supply, have been fighting the project since 2014, but protesters calling themselves \"water protectors,\" lead by the tribe, have been camping near the site since April 2016 in an effort to stop the project. As of late November 2016, the Army Corps of Engineers, which manages the land, and the governor of North Dakota, have made statements indicating they want the thousands of demonstrators encamped near the project site to leave.", "But the demonstration and continued opposition by the Standing Rock Sioux have turned an oil pipeline project into an intensifying cause that has drawn international scrutiny, an open letter from BankTrack notes:", "The debacle has escalated into a national crisis and an international scandal. A member of the UN’s Permanent Forum on Indigenous Issues has been deployed to North Dakota to monitor the situation, while President Obama has intervened to ask the Army Corps of Engineers to examine alternative routes for the pipeline. Meanwhile, the protest at Standing Rock is backed by over a million – and growing – allies worldwide, with numerous solidarity actions springing up across the United States and beyond, including protests at EPFI headquarters and outlets.", "The world is closely watching how all actors involved will deal with the situation, including the banks that provide financial support to the project. Given the presumed Indigenous rights commitments of EPFIs, it is for us inexplicable that gross violations of Native land titles, threats to water sources and the desecration of burial grounds have not been identified early on as reasons for EPFIs to not provide funding for this project. However, this unfortunately fits into a documented and consistent pattern of disrespect of local communities and Indigenous rights by EPFI-backed projects worldwide.", "We understand that it is not the role of the EP Association to intervene in specific project situations. Nevertheless, we consider it crucial for the credibility of the Equator Principles as an effective safeguard against violation of Indigenous Peoples’ rights that your meeting calls upon the EPFIs involved in financing DAPL that they take swift action to stop the ongoing violation of the rights of Native Americans.", "The letter urges the banks to halt further loan payments and raises the concern that the project falls out of line with Equator Principles, a consortium that sets minimum standards to which signing institutions are expected to adhere on matters of community and environmental accountability.", "According to Energy Transfer Partners, the end project will be a 1,172-mile, 30-inch diameter pipeline:", "....that will connect the rapidly expanding Bakken and Three Forks production areas in North Dakota to Patoka, Illinois\" enabling the domestic production of light sweet crude oil \"to reach major refining markets in a more direct, cost-effective, safer and environmentally responsible manner.", "The pipeline is expected to carry 470,000 barrels of oil per day. Energy Transfer Partners CEO Kelcy Warren has said the company will not reroute the pipeline.", "Frijns, Johan. \"An open letter to the Equator Principles Association.\"\r\n  BankTrack. 7 November 2016.", "Tabuchi, Hiroko. \"Environmentalists Target Bankers Behind Pipeline.\"\r\n  The New York Times. 7 November 2016.", "The Associated Press. \"Trump’s Stock in Dakota Access Pipeline Company Raises Concern.\"\r\n  Fortune. 26 November 2016.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]