["About this rating", "Before the 2016 presidential election, when both candidates pledged to nominate Supreme Court judges who would overturn court rulings they disagreed with, the idea of using a political \"litmus test\" in the selection of federal judges was widely frowned upon. A remark often held up as a classic example of the litmus test mentality, specifically with respect to religion, is this one allegedly made some years ago by Sen. Chuck Schumer (D-New York, the current Senate Minority Leader):", "WHAT A TWIT!!!! @CharlesSchumer quote: Candidates With Deeply Held Christian Beliefs Are Unfit and Disqualified... https://t.co/i0CS7TrRzV", "— DUANE ALLEN (@DUANEALLEN) April 7, 2017", "It's a misquote, however. Schumer never uttered such a sentence, although it does have a few words in common with something he did say during an 11 June 2003 Senate hearing on the confirmation of William H. Pryor, a George W. Bush judicial appointee to the United States Court of Appeals for the Eleventh Circuit:", "[I]n General Pryor's case his beliefs are so well known, so deeply held, that it is very hard to believe, very hard to believe that they are not going to deeply influence the way he comes about saying, \"I will follow the law,\" and that would be true of anybody who had very, very deeply held views.", "That's the closest Schumer came (that is to say, not very close at all) to stating what has been attributed to him. And although he didn't specify in that excerpt which \"deeply held beliefs\" of Pryor's he was worried about in particular, given more context it becomes clear what they were.", "The phrase \"deeply held\" came up several times during the Pryor hearing, originally in reference to the appointee's religious faith (Roman Catholicism), and subsequently in reference to some political views that may be said to follow from that faith (as well as other faiths). The first time the phrase was uttered was by Sen. Orrin Hatch (R-Utah), who brought it up, interestingly enough, to make the opposite point that Schumer would go on to make:", "In an effort to defeat challenges to school prayer and the display of the Ten Commandments in the Alabama Supreme Court, both the Governor and the Chief Justice urged General Pryor to argue that the Bill of Rights does not apply to the States. General Pryor refused, despite his own deeply held Catholic faith and personal support for both of these issues.", "It's clear from Hatch's opening statement that he perceived the appointee's \"deeply held Catholic faith\" as a potential stumbling block to his confirmation and therefore argued that it ought not to be:", "As you will undoubtedly hear during the course of this hearing, General Pryor is no shrinking violet. He has been open and honest about his personal beliefs, which is what voters expect from the people whom they elect to represent them. Yet General Pryor has shown again and again that when the law conflicts with his personal and political beliefs, he follows the law.", "However, as Schumer made clear in his own opening statement, his reservations had not been allayed. Taking his statements in their fuller context, we find that Schumer was quite specific about what troubled him, and it wasn't that Pryor is a Christian, or that he is a Catholic, or that he is conservative. What troubled him was that (in Schumer's own opinion, of course) Pryor's \"incredibly strong ideology\" placed him outside \"the ideological mainstream.\" And in this respect he was referring to such issues such as women's rights, abortion rights, LGBT rights, and the separation of church and state:", "When the President sends us nominees who are legally excellent, diverse and within the ideological mainstream, even though we may not agree with them on most issues, and those who will respect to the Senate's constitutionally mandated coequal role in the process, the nominees pass through the Senate like a hot knife through butter.", "[...]", "But I will say this, and I would caution my colleagues, it is just not enough to say, \"I will follow the law.\" Every nominee says that. And then we find when they get to the bench they have many different ways of following the law. And what I worry about, I do not like nominees too far left or too far right, because ideologues tend to want to make law, not do what the Founding Fathers said judges should do, interpret the law. And in General Pryor's case his beliefs are so well known, so deeply held, that it is very hard to believe, very hard to believe that they are not going to deeply influence the way he comes about saying, \"I will follow the law,\" and that would be true of anybody who had very, very deeply held views.", "We all know that judging is not a rote process. If it were, we would have computers on the bench instead of men and women in black robes. I would refer my colleagues to an article on the op-ed page of today's New York Times, which shows that when those nominated by Democratic Presidents follow the law on cases of women's rights, environmental rights, et. al, they seem to follow the law in completely different ways or many different ways than the way nominees of Republican Presidents follow the law. We all know that. So a person's views matter. There is a degree of subjectivity, especially in close cases and controversies on hot-button issues, and it is hard to believe that the incredibly strong ideology of this nominee will not impact how he rules if confirmed.", "Schumer's concern about what he termed \"the incredibly strong ideology of this nominee\" synced up with previous statements he had made, such as when he said of Attorney General nominee John Ashcroft in 2001:", "Senator Ashcroft, as much as I respect you as a person and your faith, your past causes me grave concern on these issues. And like Bill Lann Lee, when you became the attorney general of Missouri, you did not relinquish your role as a passionate advocate. You sued nurses who dispensed contraception and continued litigating against them for years, despite being told by every court you came before that you were wrong.", "You sued the National Organization of Women under the antitrust laws to muzzle their attempt to pass the Equal Rights Amendment. Will you now use, as United States attorney general, that office to continue crusading against those you passionately and fervently disagree with?", "Senator Ashcroft, the issue boils down to this: When you have been such a zealous and impassioned advocate for so long, how do you just turn it off? This may be an impossible task.", "We have found no record of Chuck Schumer's ever saying, \"Candidates with deeply held Christian beliefs are unfit and disqualified from serving as a federal judge.\" Perhaps the quote originated as a paraphrase of what someone thought Schumer meant when he expressed misgivings about William Pryor's views.", "But the quote attributed to Schumer doesn't really hit the mark, even as a paraphrase. Consider the content and context of what Schumer actually said. As in the earlier case of Ashcroft, he didn't raise an alarm about Pryor's religion; he raised it about the potential for Pryor to become precisely what Orrin Hatch argued he would not: an ideologue who would make rulings based on his personal beliefs instead of the Constitution.", "The American Presidency Project.   \"Attorney General Nominee John Ashcroft's Senate Confirmation.\"\r\n   16 January 2001.", "Congress.gov.   \"Confirmation Hearing on the Nominations of William H. Pryor, Jr. to Be Circuit Judge for the Eleventh Circuit and Diane M. Stuart to Be Director, Violence Against Women Office, Department of Justice.\"\r\n    11 June 2003.", "David Emery is a West Coast-based writer and editor with 25 years of experience fact-checking rumors, hoaxes, and contemporary legends.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]