["About this rating", "Did a woman die during a screening of the movie It in Syracuse, New York? Or was it Monroe, Louisiana? Maybe Paducah, Kentucky? Well, that depends on which fake news article from the web site SundayPost.org you happened to read. They all went a little something like this:", "A 41-year-old woman died in a Syracuse cinema auditorium Saturday while watching a screening of Stephen Kings horror movie remake, IT.", "The incident occurred at Regal Cinemas in Syracuse, New York. The cinema-goer attended the new release screening with friends and had complained of chest pains and difficulty breathing during one the film’s climax scenes. According to witnesses, the woman let out a large scream and then collapsed in her seat.", "In September 2017, SundayPost.org published at least three fake news articles claiming that a woman died during a screening of the movie It. All of these articles were nearly verbatim copies of one another, except for the name of the city where the death allegedly took place:", "This is a common tactic among fake news purveyors as it allows them to publish a single hoax article numerous times with only slight changes. We saw a major uptick in this type of story in early 2016 as web sites such as The McKenzie Post and Headline Brief published dozens of articles claiming that [insert celebrity name] had moved to [insert small town].", "But the rumor went beyond SundayPost.org. The web site QualitySharing.com, for instance, upped the death count to 43 when they posted a similar story:", "A packed theatre in Haddonfield, New York watched an advanced screening of IT and they had to cut the movie short after several people were so horrified they passed out and went into cardiac arrest.", "[...]", "Scientist Frederick Bookman gave a statement saying: Unfortunately, movies are not just entertainment, but a way to attack your consciousness. This movie could have triggered the brain by those images, they are powerful too, and their body had a natural response to terror. Fight or flight. And sadly it was flight. So please be careful when you looking for entertainment in movies like IT", "Unlike SundayPost.org, QualitySharing.com carried a disclaimer labeling itself as \"satire\":", "Qualitysharing.com is the most notorious fauxtire & satire entertainment website in the world. If it's trending on social media you'll find it here!", "These articles are not accurate. As of this writing, we've yet to see any credible reports about someone suffering a heart attack and dying during the new Stephen King movie.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]