["U.S. Senate candidate Alan Grayson dismissed a New York Times story about his hedge fund as \"full of s---\" in a sit-down with CBS4’s Jim Defede, a reaction so wrong his own campaign corrected him on the facts.", "But that wasn’t the only attack in the interview that ran off the rails. Grayson called rival Patrick Murphy a \"walking, talking crook\" and zeroed in on Murphy’s wealthy businessman father, another focal point in the race between the two Democratic congressmen running for Sen. Marco Rubio’s seat.", "Grayson accused Murphy of flip-flopping on the passenger rail project when it snubbed a bid from builder Thomas P. Murphy Jr., owner of Coastal Construction Group.", "Murphy \"switched his vote on All Aboard Florida and tried to destroy the program -- the only Democrat in the entire country who voted to destroy the All Aboard Florida program -- because his father tried to get in a bid to build it and was unsuccessful,\" Grayson said May 15. \"So he went from being in favor of the program to being against the program. That’s certainly using your congressional influence. He tried to kill the entire program -- the only Democrat to do so -- because his father didn't get a contract out of it.\"", "Did Murphy really flip-flop on votes for All Aboard Florida after his father’s company lost its bid?", "There is no dispute that Murphy initially supported the rail project and later opposed it. There is dispute, however, over why he did it.", "Murphy’s campaign argues that he came out against the project as he learned more about it and heard community opposition. Grayson, who supports All Aboard Florida, points to more nefarious reasons, but he doesn’t prove his charge that it was connected to Murphy’s dad’s business.", "There’s also an issue with Grayson’s wording about flip-flopped \"votes.\" There were two votes in Congress related to the financing, but Murphy consistently voted no on those votes. The Grayson campaign acknowledged to PolitiFact Florida that Murphy changed his \"support\" for the project, but not his votes.", "Coastal Construction’s role", "All Aboard Florida is a $3 billion passenger rail line that will connect Miami, Fort Lauderdale and West Palm Beach in 2017, with plans to extend it to Orlando. The owners applied for a $1.6 billion federal loan to supplement private financing but later put that request on hold. All Aboard Florida’s federal application for $1.75 billion in tax-exempt bonding authority was approved. (The state is also kicking in some money connected to the project.)", "An All Aboard Florida spokeswoman declined to comment about Coastal Construction’s interest.", "Coastal Construction along with a joint venture partner, Tishman Construction, had preliminary conversations with All Aboard Florida from October 2012 until the fall of 2013 but never submitted a bid, said Dan Whiteman, Coastal Construction vice chairman.", "\"In early December of 2013, it was decided to no longer pursue the project,\" Whiteman wrote. \"All Aboard Florida was advised in mid-December 2013 that we were not going to proceed any further in discussions, and we never submitted a response to their request for proposals to build the project.\"", "Asked why Coastal declined to bid on the project, Whiteman said: \"Other projects came available and were starting more quickly.\"", "Whiteman said that Coastal Construction had no conversations with Rep. Murphy about the project. A spokesman for Murphy's campaign, Joshua Karp, agreed with that point.", "Murphy changed his stance", "Murphy supported All Aboard Florida in the fall of 2013 when it benefited from a $13.75 million federal grant. The state applied for the grant to improve connectivity between multiple rail operators including All Aboard Florida.", "In October 2013, Murphy was one of 16 Florida members to sign a letter to U.S. Transportation Secretary Anthony Foxx praising the project. They wrote it had \"potential to modernize and upgrade a busy transportation corridor\" and provide an economic boost.", "But by the spring of 2014, local opposition had grown due to fears about noise and other impacts. Resolutions from local governments and groups, such as Indian River County, the city of Port St. Lucie and the village of Tequesta, started to pile up. Ultimately, 60,000 people signed a petition against it.", "Murphy, who faced re-election, hopped on board the opposition train. He won his race.", "In March 2014, Murphy sought a meeting with Foxx to discuss constituent concerns. By April, he was an adamant opponent. In a letter to Foxx, Murphy wrote that the rail line would likely \"delay emergency vehicles, create traffic jams, raise noise pollution and block waterways.\"", "Over the next several months, Murphy contacted federal and state officials, sought public hearings as well as a federal study in an effort to quash the rail line.", "Murphy’s changed stance drew media attention. Murphy’s chief of staff, Eric Johnson, told the TC Palm that initially the project drew local support because of the economic benefits.", "\"But since then,\" Johnson is quoted as saying, \"with everything (Murphy) learns, the more information he gets, the less he likes it. The more he learns, he sours on this project more.\"", "(Murphy campaign spokeswoman Galia Slayen provided a similar explanation for this fact-check.)", "K.C. Ingram Traylor, leader of the opposition group Florida Not All Aboard, told PolitiFact Florida, \"As the facts about All Aboard Florida came to light, Rep. Murphy intelligently took another look at the project and strongly opposed it.\"", "Murphy’s votes", "A spokesman for Grayson, David Damron, initially argued that Grayson had specified Murphy switched his \"support\" and not his vote. But after PolitiFact Florida sent Damron the transcript and CBS4 video, Damron acknowledged that Grayson errantly mentioned votes.", "Congress didn’t get an up-or-down vote on the project. However, there were two votes on amendments offered by U.S. Rep. Bill Posey, R-Rockledge, to an appropriations bill about financing.", "Murphy was the lone Democrat to vote in favor of the two amendments to ban funds for the project. One amendment banned funds in general, and the other banned tax-exempt bonds. Both amendments failed by wide margins on June 9, 2015.", "Our ruling", "Grayson says Murphy \"switched his vote on All Aboard Florida ... because his father tried to get in a bid to build it and was unsuccessful.\"", "There is one kernel of truth here: Murphy did switch his position on the rail project. But he did not switch his votes, which were consistently against funding for it. Murphy said he switched his vote because of community blowback to the rail project, and not as a result of his father’s business dealings.", "The onus is on Grayson to prove that Murphy flip-flopped because his father didn’t get a contract out of it, and he did not prove his case. The entities involved are private, which makes primary documents hard to obtain. Coastal Construction’s vice chairman said the company had preliminary talks with the private rail project but did not file a bid.", "We rate this claim Mostly False.", "CQ Roll Call, Fiscal 2016 Transportation-HUD Appropriations - Passenger Rail Projects House Roll Call Vote 317 , June 9, 2015", "Thomas Library of Congress, H.R. 2577 Roll Call Vote 313, June 9, 2015", "Letter from U.S. Rep. Patrick Murphy and other members to U.S. Transportation Secretary Anthony Foxx, Oct. 17, 2013", "U.S. Rep. Patrick Murphy, Press release, April 7, 2014", "U.S. Rep. Patrick Murphy, Letter to U.S. Transportation Secretary Anthony Foxx, April 10, 2014", "U.S. Rep. Patrick Murphy, Press release, April 16, 2014", "U.S. Rep. Patrick Murphy, Press release, July 15, 2014", "U.S. Rep. Patrick Murphy, Press release, Aug. 14, 2014", "U.S. Rep. Patrick Murphy, Press release, Sept. 9, 2014", "U.S. Rep. Patrick Murphy, Email, Sept. 26, 2014", "U.S. Rep. Patrick Murphy, Press release, Sept. 30, 2014", "U.S. Rep. Ted Deutch press release, \"Deutch Joins U.S. Transportation Secretary Foxx for Major South Florida Grant Announcement,\" Sept. 13, 2013", "Florida Not All Aboard, Resolutions and letters of concern, Accessed May 16, 2016", "All Aboard Florida, Press release, July 24, 2014", "South Florida Business Journal, \"All Aboard Florida names general contractor for two stations,\" Jan. 20, 2015", "Informed Infrastructure, \"All Aboard Florida Selects Archer Western to Build Rail Infrastructure at Orlando International Airport,\" July 8, 2015", "Stuart News, \"Murphy to express All Aboard concerns,\" Accessed in Nexis, March 21, 2014", "Stuart News, \"Murphy no longer All Aboard,\" Accessed in Nexis,  April 12, 2014", "Palm Beach Post, \"Rival's ad suggests Murphy backs All Aboard Florida project,\" July 14, 2014", "Stuart News, \"In District 18 race, rail is the bad guy,\" Accessed in Nexis,  Aug. 10, 2014", "Palm Beach Post, \"All Aboard seeks private financing to replace or augment federal loan request,\" Oct. 7, 2014", "Palm Beach Post, \"All Aboard Florida divides likely Democratic Senate rivals Patrick Murphy, Alan Grayson,\" June 10, 2015", "Orlando Politics.com, \"Progressive Democrats of Florida jab \"Benedict Arnold Murphy,\" Dec. 22, 2015", "American Crossroads, \"Is Patrick Murphy legislating under the influence?\" Dec. 22, 2015", "YouTube clip, U.S. Rep. Patrick Murphy on All Aboard Florida, April 17, 2014", "Politico, \"Grayson’s own campaign corrects him on claim that Times is ‘full of shit’\"May 15, 2016", "Miami Herald, \"Alan Grayson calls Patrick Murphy 'a walking, talking crook' on CBS Miami,\" May 15, 2016", "Tampa Bay Times/Miami Herald, \"The financial muscle behind Patrick Murphy’s Senate bid: Dad,\" May 13, 2016", "PolitiFact Florida, \"Rick Scott says All Aboard is '100% private venture' and 'no state money involved,'\" Aug. 7, 2014", "Interview, K.C. Ingram Traylor, Florida NOT All Aboard director, May 16, 2016", "Interview, Dan Whiteman, Coastal Construction Vice Chairman, May 16, 2016", "Interview, David Damron, U.S. Rep. Alan Grayson campaign spokesman, May 16, 2016", "Interview, Galia Slayen, U.S. Rep. Patrick Murphy campaign spokeswoman, May 16, 2016", "Interview, Joshua Karp, U.S. Rep. Patrick Murphy campaign spokesman, May 17, 2016", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]