["Three photos -- two of which show Soomro, and one which shows a very tall object wrapped in white -- were published in this Facebook post on May 17, which was shared 38,000 times before it was removed.", "Below is a screenshot of the misleading Facebook post:", "The post’s Urdu language caption translates to English as: “A very tall man of the world has passed away, pray for him, he was a Muslim.”", "Soomro is seven foot nine inches according to this report published by Pakistan’s Express Tribune newspaper on December 20, 2018.", "Zia Rashid, a 23-year-old from Mutlan, is now Pakistan's tallest man at eight foot, according to this January 11, 2019 Associated Press report.", "The three photos and similar misleading claims about Soomro's death have been shared widely on Facebook, for example here, here, here and here and on Twitter, for example here and here.", "The top image in the misleading posts shows a group of men transporting a long object wrapped in a white cloth:", "A red and white Indonesian flag can be seen in the upper left hand corner of the image, which has circulated online in Indonesian-language social media posts since at least 2018, for example here, here, and here.", "The second photo used in the misleading posts shows Soomro, who works for Pakistan International Airlines (PIA), with a group of men at Karachi airport, dressed in his employee uniform.", "The same image was published here by the National Courier on December 20, 2018.", "The third image in the photo collage shows Soomro on a pilgrimage at the Great Mosque of Masjid al-Haram in Saudi Arabia.", "The same photo was shared in this Arabic-language report with the headline: \"Giant man appearing in Al-Haram Al-Sharif, impresses Facebook users\".", "The claim that Soomro has died is false; AFP spoke to Naseer Soomro, by phone on June 12, 2019.", "“I am alive and speaking to you and I don’t understand what people get from spreading such false news,” Naseer Soomro told AFP", "“I am not well as I have breathing troubles, I am on oxygen at my home,” Soomro said.", "Pakistan International Airlines (PIA), where Soomro works in the Customer Services department, also told AFP by phone on June 19, 2019, that Soomro was alive.", "“Mr Soomro is alive and his is still an employee of PIA,” airline spokesman Mashhood Tajwar told AFP.", "This news report published by Pakistani newspaper The News on January 3, 2019 gives details about Soomro’s recovery in hospital after he fell ill. It states the 54-year-old was recovering after six days on a ventilator in intensive care.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]