["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Gov. Scott Walker high-fived students after signing the 2017-'19 state budget bill into law. He touted an increase in state aid to schools, but previously he made cuts. (Dan Powers/USA TODAY NETWORK-Wisconsin)", "After Republican Scott Walker dubbed himself the \"education governor,\" many Democrats, figuratively speaking, started baying for blood.", "To them, Walker slashed and burned school funding in 2011 with his first state budget. They are galled by the notion of \"education governor,\" even if Walker has since been adding back funding.", "So, let’s sort out the Republican governor’s record on school funding.", "We’ll use a claim by state firefighters union president Mahlon Mitchell, one of the eight Democrats hoping to win the Aug. 14, 2018, primary to run against Walker.", "All our fact checks in the governor’s race.", "The claim", "Mitchell made his claim June 19, 2018, on the \"Devil’s Advocates,\" a Milwaukee-based liberal radio talk show. He declared that Walker \"has cut more from public education than he's put back in, obviously. He took $1.6 billion and some change away and then puts back $630 million, and he's calling that progress.\"", "It’s a claim Mitchell has made repeatedly, in one form or another, and one we’re likely to hear again before the primary and the Nov. 6, 2018, general election.", "Based on previous fact checks we’ve done, there is an element of truth in Mitchell’s claim. But he gets into trouble, partly by mixing apples and oranges in the two figures he uses.", "‘Cut’ $1.6 billion -- not really a cut", "Like us on Facebook. Follow us on Twitter: @PolitiFactWisc.", "On saying Walker cut $1.6 billion, Mitchell’s campaign cited a 2013 report by the Forward Institute, a Madison-based think tank that operated for several years. The report doesn’t state, though, that Walker made a $1.6 billion cut in education funding. Rather, it says he reduced by that amount the maximum that school districts could increase their property tax levies.", "The report’s author, Scott Wittkopf, who is advising the campaign of another Democrat for governor, Mike McCabe, told us Mitchell has a point but his statement reflects a common misunderstanding of the complexities of school funding.", "To flesh this out, here’s what we found in a 2011 fact check on a similar claim  — that Walker’s 2011-’13 budget \"cuts overall funding for public schools by $1.6 billion.\" We rated it Mostly False.", "The 2009-’11 state budget, the one just prior to Walker’s first budget, cut state aid to schools and slowed the growth in how much school districts could raise from property taxes.", "That 2009-’11 budget, approved by a Democratic governor and Democratic-run Legislature, also directed the next Legislature to reset the property tax limit in the 2011-’13 budget (Walker’s first) to what it was before it was reduced.", "But Walker and the Legislature, which had turned Republican, did not abide by that directive. Instead, the 2011-’13 budget imposed a lower limit on how much school districts could increase their property taxes than what the 2009-’11 budget called for.", "In sum, some Democrats argue that by not abiding by the 2009-’11 budget directive, school districts were prevented from levying $1.6 billion more in property taxes.", "But that figure assumes that all school districts levy the maximum allowed in property taxes, which never occurs. And that calculation doesn’t take into account some school districts’ ability, under Walker’s Act 10 collective bargaining legislation, to save money by requiring employees to pay more for their health and pension benefits.", "Bottom line: The $1.6 billion refers to a limit on school districts’ ability to increase how much they collect in property tax revenue, but it is not an actual funding cut.", "As we found in April 2018, in a fact checking a claim by another of the Democratic candidates, Tony Evers, the actual reduction in state funding of schools over the two-year period of Walker’s 2011-’13 state was $784 million.", "‘Put back’ $630 million -- no, more than that", "The other part of Mitchell’s claim is meant to convey that, even though Walker touts recent increases he’s made in school funding, those increases don’t come close to making up what was cut.", "But Mitchell gets into trouble because, while the first part of his claim refers to the ability of school districts to raise taxes, the second part of his claim refers to actual cash that the state gives to school districts.", "Moreover, in saying that only $630 million has been put back, Mitchell’s campaign cites only Walker’s 2017-’19 state budget, which increases state funding to schools by $639 million. It provides for an additional $200 per student in the first year and additional $204 in the second year, as Walker now touts in his re-election campaign.", "But that wasn’t the first time Walker has increased state funding to schools. In fact, in each budget since the 2011 budget that reduced school funding, he has increased state funds to schools. The total restored is about $1 billion.", "That being said, as we found in the Evers fact check, during Walker’s tenure school districts have collected about $183.6 million less in state money than they would have had funding levels remained where they were when Walker took office.", "Our rating", "Mitchell says Walker \"has cut more from public education than he's put back in, obviously. He took $1.6 billion and some change away and then puts back $630 million and he's calling that progress.\"", "Walker’s first state budget in 2011 did reduce by $1.6 billion the maximum amount that school districts had expected they would be allowed to increase their property tax levies. So, that was not a cut, but it did curtail how much additional money school districts could raise on their own.", "On actual state funding of schools, Walker did cut about $784 million with his first state budget. But he has been adding back funding with each of his subsequent budgets, to the tune of about $1 billion in total.", "Mitchell’s statement contains an element of truth, but mixes apples and oranges and ignores facts that would give a different impression. Our rating is Mostly False.", "Devil’s Advocates Radio Network, Mahlon Mitchell interview (3:00), June 19, 2018", "Email, Mahlon Mitchell campaign spokeswoman Kirsten Allen, July 16, 2018", "Email, Wisconsin Republican Party spokesman Alec Zimmerman, July 17, 2018", "Capital Times, \"Wisconsin budget committee approves $639 million boost for K-12 schools,\" Aug. 28, 2017", "PolitiFact Wisconsin, \"Did Scott Walker take $1 billion from Wisconsin schools, as governor candidate Tony Evers claims?\" April 20, 2018", "Forward Institute, \"Wisconsin Budget Policy and Poverty in Education,\" 2013", "Email, political adviser and former Forward Institute chairman Scott Wittkopf, July 31, 2018", "Interview, Wisconsin Department of Public Instruction spokesman Tom McCarthy, July 31, 2018", "PolitiFact Wisconsin, \"Wisconsin Rep. Jennifer Shilling says the state’s 2011-’13 state budget cut public school funding by $1.6 billion,\" July 25, 2011", "Interview, Wisconsin Legislative Fiscal Bureau director Bob Lang, July 31, 2018", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]