["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Mitt Romney set up camp at a Texaco station in West Palm Beach, Fla., on Monday to take a poke at the McCain-Lieberman bill that aims to reduce greenhouse gas emissions.", "\"On a very different topic, we're at a gas station,\" Romney told reporters. \"And the reason for that is that I want to underscore the fact that Senator McCain's McCain-Lieberman (bill) would be a very expensive bill for the people of Florida. By our calculation, a family of four would have to spend about an extra $1,000 a year if McCain-Lieberman became law. And again that's because gasoline would rise in price by approximately 50 cents a gallon and natural gas would rise about 20 percent. The burden on Florida homeowners would obviously be excessive.\"", "The McCain-Lieberman Climate Stewardship and Innovation Act of 2007 requires that greenhouse gas emissions be reduced to 2004 levels by 2012, 1990 levels by 2020, and 60 percent below 1990 by 2050. It is a so-called cap-and-trade plan because it includes a market-driven plan in which companies that significantly reduce greenhouse gas emissions can sell emission allowances to other companies struggling to meet required standards. The plan also would provide some support for low-carbon alternative fuels, including nuclear power.", "We're not taking sides on whether the McCain-Lieberman plan makes economic sense, or even whether it would help to solve global warming. But there's enough research in to judge Romney's numbers.", "Lots of assumptions go into various projections about the impact of the McCain-Lieberman plan (or any other, for that matter), so you could probably find a study to say about anything. But take a look at the information Romney cites as background material in a press release about his attack on McCain's plan.", "First off, the Romney camp switches back and forth between analyses of the 2003 and 2007 versions of the McCain-Lieberman plan. For example, it cites an American Council for Capital Formation study that concluded the McCain plan could increase gas prices 30 to 50 cents by 2020. But that was an analysis of the 2003 plan.", "More on point are two government analyses of the 2007 McCain-Lieberman bill, one by the EPA and the other by the Energy Information Administration, which produces the official energy statistics from the U.S. government.", "The EPA concluded in July 2007 that if the bill passed, it would increase gasoline prices about 26 cents per gallon by 2030; 68 cents per gallon by 2050.", "The Energy Information Administration analysis, released in August 2007, concluded the price of gas would increase 34 cents per gallon by 2030.", "Romney's claim that gas prices would rise 50 cents per gallon is grossly misleading considering these two reports conclude the increase would be 26 cents or 34 cents\n\nin 22 years.\n\nRomney's projection of the plan costing Florida families $1,000 a year rests on a 50-cent increase. Sure, the projections may come into Romney's wheelhouse in 30 or 40 years, but c'mon.", "Both plans do, however, suggest that the price of electricity would rise (22 percent according to the EPA projections; 21 percent according to the EIA). But again, that's a projection for 2030.", "Janet Peace, a senior economist with the Pew Center on Global Climate Change, doesn't take issue with either the EPA or EIA projections — based on the assumptions they made — but she argues that the farther out you go in years, the more difficult it is for the government to anticipate energy technology that may significantly alter the picture. The whole idea is to decrease Americans' reliance on fossil fuels through alternative energy sources.", "Romney's claims didn't give a time frame, but we bet voters would be surprised to hear that he's talking about 20, 30, maybe even 40 years from now. We rate his statement Barely True.", "Mitt Romney,\n\n\"Sen. McCain: Pay at the Pump,\"\n\npress release from Mitt Romney campaign, Jan. 28, 2008", "Energy Information Administration,\n\n\"Energy Market and Economic Impacts of S.280, the Climate Stewardship and Innovation Act of 2007,\"\n\nAugust 2007", "Environmental Protection Agency,\n\n\"EPA Analysis of The Climate Stewardship and Innovation Act of 2007,\"\n\nJuly 2007", "National Center for Policy Analysis,\n\n\"Regulating Greenhouse Gas Emissions,\"\n\nby H. Sterling Burnett, Nov. 18, 2004", "Interview with Janet Peace, a senior economist with the Pew Center on Global Climate Change, Jan. 28, 2008", "Interview with Antonia Herzog, staff scientist at the Natural Resources Defense Council, Jan. 28, 2008", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]