["About this rating", "On 20 December 2017, the America's Last Line of Defense web site published an article headlined \"Latest Dead Body Tied to the Clintons Turns Up Valuable Evidence,\" reporting the discovery in Arkansas of the body of a former housekeeper for the Clintons, a woman who had disappeared over thirty years earlier:", "Another body found in a shallow grave in Arkansas has been tied to the Clintons. Marcia Ann Bosley, who was the head housekeeper at the Governor’s Mansion before she was mysteriously let go in 1985, has been positively identified after spending more than 3 decades in the ground.", "Bosley, who had no family when she was let go, was assumed to have left the area for other opportunities. She was never reported missing. According to the Hamilton County Coroner:", "“The body was wrapped so well in plastic thast much of the tissue is still intact. We were able to extract 2 DNA samples. We’ve determined that one was an unborn child. That could be huge in determining who else was a part of this young woman’s life.”", "None of this was true; it was just another riff on the decades-old \"Clinton Body Count\" political urban legend. Neither police in Arkansas nor any legitimate news organization reported such a discovery, and the photograph that accompanied the article was an unrelated picture taken from a 2015 news report about students participating in a \"Crime Scene re-enactment day\" at West Suffolk College in the UK.", "This report originated solely with America's Last Line of Defense, a site that is part of a network of fake news sites dedicated to spreading political misinformation under the guise of proffering “satire.”", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]