["About this rating", "In May 2020, a video surfaced online that purportedly showed the killing of 25-year-old Ahmaud Arbery on Feb. 23 in southern Georgia. The video led to widespread criticism of Georgia lawmakers and to police officers' perceived slow response to the killing. Travis McMichael and his father, Gregory McMichael, were arrested on May 7 and charged with aggravated murder and assault, according to the Georgia Bureau of Investigation.", "As this controversy churned, a photograph supposedly showing Georgia Gov. Brian Kemp with Gregory McMichael, a former police officer, started to circulate on social media:", "The man on the left is Kemp, but the man on the right wearing an Islamophobic T-shirt is not Gregory McMichael.", "This photograph actually features another controversial person, James J. Stachowiak, whom the Southern Poverty Law Center described as a former police officer and owner of the anti-government propagandist \"Freedom Fighter Radio,\" and \"who has repeatedly urged his listeners to consider lone wolf acts of violence.\"", "The picture was reportedly taken at an event during Republican Kemp's 2018 campaign against Stacey Abrams. The Root reported that Abrams, an African-American Democratic politician, and her team had been harassed and threatened by Stachowiak and the Nationalist Liberty Union, a white nationalist hate group:", "Everything was going great until four men and one woman, members of the Nationalist Liberty Union, a white nationalist hate group, decided to crash the party by protesting in favor of Confederate monuments and flashing “Kemp for Governor” signs.", "[...]", "“Everyone but James Stachowiak is new to us,” says Daryle Lamont Jenkins, director of the One People’s Project, an organization dedicated to combating race and hate groups in America. They received a video of the incident online and investigated the men involved. \"They’re spouting off at the mouth now but it’s the small groups that end up doing big things.\"", "Kemp's campaign communications director defended the photograph at the time, saying that, \"Brian Kemp takes hundreds of photos a day while traveling the state ... It’s ridiculous to think he should be held responsible for the beliefs of every person who wants to snap a picture with him. Brian Kemp stands against hatred.\"", "McLaughlin, Eliott; Morris, Jason; Barajas, Angela.   \"Ahmaud Arbery Was Killed Doing What He Loved, and a South Georgia Community Demands Justice.\"\r\n    CNN.   7 May 2020.", "Johnson, Jason.   \"White Nationalist Who Threatened Stacey Abrams' Campaign Poses for Picture With Brian Kemp.\"\r\n    The Root.   28 December 2018.", "SPLC.   \"Longtime Antigovernment Militia Organizer Calls For 'Lone Wolf' Action Against Antifa.\"\r\n    20 December 2018.", "McCord, Susan.   \"Candidates Defend Taking Photos with Local Extremist at Kemp Event.\"\r\n    Augusta Chronicle.   29 October 2018.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]