["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "In anticipation of Equal Pay Day on April 9, Rhode Island State Treasurer Gina Raimondo sent out a tweet declaring, \"Women make 77 cents for every dollar earned by men.\"", "It sounds very unfair, and the statistic has become an oft-repeated rallying cry for wage equity.", "But PolitiFact has found, in several analyses, that the statistic is misleading.", "It's all about the context.", "The 77-cent figure comes from the U.S. Census Bureau. It's based on annual pay and it only includes men and women who work full time and year round -- about 67.8 percent of the total work force, according to the Bureau of Labor Statistics.", "Thus, that estimate excludes one-third of the work force.", "The amount rises to 82 cents if you look at weekly wages, according to other BLS data. That estimate also includes teachers, construction workers and seasonal workers who are left out of the Census Bureau estimate if they are not working year-round or full time. That's up a penny from the previous year.", "The gap closes even more -- to 87 cents -- if you compare hourly wages for men and women. This comes from Table 9 of the BLS data and it includes part-time jobs, which are often filled by women.", "Going back to weekly wages, on Table 5 of that report, if you look at part-time work (less than 35 hours), women earned 5 cents more for every dollar earned by men. Women who worked 35 to 39 hours earned nearly 10 cents more than men. But as soon as the number of hours rose to 40 hours, women's earnings dropped to about 87 cents per dollar.", "The underlying concern here is that women are being paid less than men for doing the same job. Job-by-job data are harder to come by, but there is evidence that the gender difference is not as wide as the 77-cents-per-dollar statistic suggests.", "We went to Table 2 of that BLS report to look at specific occupations. In most cases, there were not enough data to make a gender comparison. But in the 113 instances where it was possible, women earned less than 77 cents on the dollar in 28 jobs and more than 77 cents in 85 jobs. In five jobs -- such as computer support specialists, medical scientists and stock clerks and order filers -- the average weekly wage for women was higher than for men.", "The U.S. Department of Labor looked at the question in a 2009 report. It noted that there are several work-related attributes of women and men that account for most of the wage gap. So its statistical analysis adjusted for the fact that women are more likely to work part-time (where the pay for everyone tends to be lower), leave the labor force for children or elder care, and gravitate toward \"family friendly\" occupations where compensation is more likely to be in the form of health insurance or other fringe benefits.", "It found that women earned 93-95 cents for every dollar earned by men.", "Raimondo's spokeswoman, Joy Fox, responded to our inquiry with an e-mail that said, in part, \"We are referring to the widely-used across-the-workforce number that is from the Census report.\" She added, \"this has also been quoted by numerous respectable sources\" such as the American Association of University Women, the Institute for Women’s Policy Research, the National Committee on Pay Equity and Sheryl Sandberg, the chief operating officer of Facebook.", "Our ruling", "Gina Raimondo said, \"Women make 77 cents for every dollar earned by men.\"", "That's only true for one oft-cited statistic that does not, for example, look at part-time jobs where women tend to make more per week and does not address the crucial underlying question of whether women are getting equal pay for equal work.", "The gap shrinks -- sometimes considerably -- when complicating factors such as pay per hour or the decisions of women to leave the work force to raise children are considered.", "The 77-cent statistic has been widely cited by PolitiFact and other fact-checkers as oversimplified and misleading, yet it is still being used without qualification.", "On the other hand, other reliable measures of pay by gender also show that a significant gap persists, although not in all professions.", "Because Raimondo's statement leaves out important details or takes things out of context, we rate it Half True.", "(Get updates from PolitiFactRI on Twitter. To comment or offer your ruling, visit us on our PolitiFact Rhode Island Facebook page.)", "Twitter.com, \"@GinaRaimondo,\" April 8, 2013, accessed April 9, 2013", "Census.gov, \"Income, Poverty, and Health Insurance Coverage in the United States: 2011,\" Figure 2, U.S. Census Bureau, September 2012, accessed April 11, 2013", "BLS.gov, \"Highlights of Womens' Earnings in 2011,\" U.S. Bureau of Labor Statistics, October 2012, accessed April 11, 2013.", "BLS.gov, \"Household Data Annual Averages -- Persons at work in agriculture and nonagricultural industries by hours of work,\" data from 2012, accessed April 16, 2013", "PolitiFact.com, \"U.S. Rep. David Cicilline says women earn only 77 percent of what men earn in the same job,\" June 24, 2013", "CONSAD.com, \"An Analysis of Reasons for the Disparity in Wages Between Men and Women,\" Jan. 12, 2009, accessed April 15, 2013", "WashingtonPost.com, \"The White House's use of data on the gender wage gap,\" June 5, 2012, accessed April 15, 2013", "WashingtonPost.com, \"Women earn 91 cents for every dollar men earn -- if you control for life choices,\" June 5, 2012, accessed April 15, 2013", "FactCheck.org, \"Obama’s 77-cent exaggeration,\" June 22, 2012, accessed April 15, 2013", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]