["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "President Trump speaks during an NBC Town Hall on Oct. 15, 2020.", "To hear President Trump tell it, North Carolina just landed a major automaker.", "In a speech at the White House on Labor Day, Trump said North Carolina is getting one of \"many auto plants\" being built.", "He suggested it again during a speech in Michigan on Sept. 10.", "And then Oct. 15, Trump declared it again before a television audience of more than 10 million people.", "\"The reason we’re coming back so strong is because we built a very strong foundation. Companies are moving in. Car companies are moving into Michigan and to Ohio and to South Carolina and North Carolina — just today,\" Trump said during an NBC Town Hall.", "So what is Trump talking about? Is a major auto plant or an auto manufacturer coming to North Carolina?", "Not that we could find.", "The Washington Post looked into Trump’s claims from Labor Day. The Center for Automotive Research couldn’t substantiate Trump’s statement for the Post, which gave his claim Four Pinocchios.", "Inside the state, North Carolina is known for pursuing automakers — and losing out to South Carolina, Georgia and Alabama.", "As recently as Sept. 15, the Triangle Business Journal reported that North Carolina is still chasing its first full fledged car assembly plant. By TBJ’s count, North Carolina missed out on ElectraMeccanica in September, as well as Toyota-Mazda, Peugeot, Volvo and Mercedes-Benz — all since 2015.", "WRAL TechWire reported that North Carolina’s industrial leaders also recruited Tesla, which picked Texas earlier this year.", "The trend has not gone unnoticed.", "\"We've wondered about why North Carolina gets onto finalist lists, only to come up short,\" Miami University professor James Rubenstein, a leading auto industry researcher, told PolitiFact for a separate story.", "TBJ reports that North Carolina is under consideration for an Indian SUV maker. However, that project is on hold amid the pandemic.", "PolitiFact North Carolina reached out to the state’s Department of Commerce about Trump’s claim.", "\"We have not recruited an assembly plant since 2017, although North Carolina offers several attractive sites for such a plant and we’re actively in the hunt,\" David Rhoades, the department’s communications director, said in an email.", "Rhoades noted that truck maker Freightliner and school bus maker Thomas Built Buses, both part of Germany’s Daimler AG, have locations in North Carolina that are considered automotive assembly operations. However, they predate Trump’s administration.", "And while North Carolina has not landed a major car company of late, Rhoades said the state has successfully recruited manufacturers of auto components.", "He provided a spreadsheet showing a total of 44 auto-related manufacturers that have expanded operations in North Carolina since 2019. In 2017, Tristone Flowtech announced 300 jobs in Iredell County and Triangle Tyre announced an 800-job expansion in Edgecombe County. Sonic Automotive announced 500 jobs in Gaston County in 2018, and Bharat Forge Aluminum announced 300 jobs in Lee County last year.", "Still, none of those projects live up to the size of Trump’s claim. And neither the White House nor the Trump campaign responded to our requests for clarification.", "President Trump recently said an auto \"company\" or an auto \"plant\" has opened or would be opening in North Carolina.", "This claim stands out in a state that has aggressively pursued automakers, but has so far fallen short.", "That’s because it’s not true. Trump’s teams haven’t backed up his claims. Fact checkers can’t find evidence for them. And North Carolina’s Department of Commerce isn’t aware of any new, major automaker opening a plant in the state.", "We rate this claim false.", "Video, \"Donald Trump holds a Labor Day press conference,\" posted Sept. 7, 2020.", "Video, \"Donald Trump holds a campaign rally in Freeland, Michigan,\" posted Sept. 10, 2020.", "Video, \"Donald Trump Town Hall with voters,\" posted Oct. 15, 2020.", "Email correspondence with David Rhoades, communications director for the North Carolina Department of Commerce.", "Story by PolitiFact, \"As auto industry plateaus, Donald Trump touts car plants that don’t exist,\" posted Oct. 22, 2020.", "Story by the Washington Post, \"Trump keeps bragging about imaginary auto plants in swing states,\" posted Sept. 10, 2020.", "Stories by the Triangle Business Journal, \"Rejected again: North Carolina misses out on another automaker,\" posted Sept. 15, 2020; \"With goal of landing big-time automaker, NC has been down this path before,\" posted Aug. 12, 2019;", "Story by WRAL TechWire, \"NC loses another auto plant: Tesla picks Austin for new factory, 5,000 jobs,\" posted July 23, 2020.", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]