["Photos of what seems to be a dead human body lying on a butchery table have been circulating on Facebook.", "They’re captioned: \"Chinese people have started producing corned beef with their dead bodies and sending them to Africa. Please stay away from corned beef irrespective of brand, most especially in Africa and from Afro-Asian grocery shops.”", "A reverse image search brings up similar images that lead to an article, posted on My Gaming in 2012. The article says the \"human body\" was sculpted out of raw meat as a marketing stunt to promote the release of the game Resident Evil 6.", "Capcom, a manufacturer and distributor of computer game consoles, had set up an exhibit titled \"Wesker & Son Resident Evil Human Butchery\". The exhibit featured animal meat fashioned into human body parts to promote the game.", "A 2012 Huffington Post article explains that Resident Evil is a “survival horror video game series that’s bloody, to say the least”. The article assures readers that the meat in the photo is not human flesh, “although it’s unclear what meat is used”. The sculpture was created by artist Sharon Baker.", "The article says the “human butchery” exhibit was held set at London's Smithfield Market in September 2012.", "It’s not the first time the photos have been used in a hoax.", "In 2016 the photos started making the rounds on Facebook with the claim that China was marinating dead bodies, canning them and selling them in African countries. The rumour was apparently encouraged by the press in Zambia, which published articles quoting “sources” from Chinese meat factories.", "China’s ambassador to Zambia Yang Youming issued a strong denial.", "“This is completely a malicious slandering and vilification which is absolutely unacceptable to us,” he said.", "“We hereby express our utmost anger and the strongest condemnation over such an act.”", "Zambia's deputy defence minister Christopher Mulenga said he would have the reports investigated. – Africa Check (20/05/19)", "Please complete this form to receive the HTML sharing code.", "A fact-checker has rated your Facebook or Instagram post as “false”, “altered”, “partly false” or “missing context”. This could have serious consequences. What do you do?", "Click on our guide for the steps you should follow.", "Africa Check is a partner in\nMeta's third-party fact-checking programme\nto help stop the spread of false information on social media.", "The content we rate as “false” will be downgraded on Facebook and Instagram. This means fewer people will see it.", "You can also help identify false information on Facebook. This\nguide explains how.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "For democracy to function, public figures need to be held to account for what they say. The claims they make need to be checked, openly and impartially. Africa Check is an independent, non-partisan organisation which assesses claims made in the public arena using journalistic skills and evidence drawn from the latest online tools, readers, public sources and experts, sorting fact from fiction and publishing the results.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "© 2023 - Africa Check - All rights reserved.", "We will never charge you for verified, reliable information. Help us keep it that way by supporting our work.", "Africa Check values your trust and is committed to the responsible management, use and protection of personal information. See our privacy policy.", "Support independent fact-checking in Africa."]