["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Millennials are not big fans of professing commitment, according to a recent poll. They’re not ready to declare a lifelong love for a political party (or a spouse, for that matter). In Facebook lingo, they might say \"It’s complicated\" or claim to be in an open relationship with political parties.", "\"They should call us the ‘party pooper’ generation,\" tweeted Rock the Vote, an organization focused on increasing young registered voters, on March 11, 2014. \"50% of #millennials don't associate w/ any political party.\"", "After hearing about the youth vote helping elect President Barack Obama, we wondered if that statistic could be correct: Do half of millennials not associate with a political party?", "Identification and voting aren’t the same", "In the tweet, Rock the Vote linked to a study released by Pew Research Center in March. Pew conducted the telephone survey of 1,821 adults nationwide in February, including 617 millennials ages 18 to 33, and analyzed previous surveys. This survey asked a variety of questions, ranging from whether they know what a \"selfie\" is to their thoughts on the tea party.", "As for millennials, Pew concluded: \"They are relatively unattached to organized politics and religion, linked by social media, burdened by debt, distrustful of people, in no rush to marry — and optimistic about the future.\"", "The survey showed that 50 percent of millennials describe themselves as political independents, up from 38 percent in 2004. Meanwhile, 27 percent identify as Democrats and 17 percent as Republicans.", "But a follow-up question shows how they tilt: The 50 percent who self-identified as independents were then asked if they leaned more to either party. Among those 50 percent, 44 percent lean Democratic and 31 percent lean Republican. That leaves about 25 percent who either mentioned another party or say they are independents and don’t lean.", "When Pew included \"leaners,\" they found that half of millennials identify as Democrats or say they lean toward the Democratic Party, which is 16 points greater than the percentage who identify or say they lean Republican.", "A Democratic leaner \"behaves like a Democrat, thinks like a Democrat, votes like a Democrat,\" John Petrocik, a University of Missouri political science professor, told PolitiFact Florida.", "Many voting experts told us that when stated in isolation, describing half of millennials as independents is misleading because it omits their partisan leanings and voting behavior.", "\"A substantial proportion of self-described independents vote consistently Democratic or Republican; they just don’t like to use a party label,\" said Peter Levine, professor of citizenship and public affairs at Tufts. \"True independents -- those who really don’t know which party they’ll support -- are few, and they tend to have low turnout.\"", "In the past, millennials have overwhelmingly voted Democratic. In 2008, 66 percent of voters age 18-29 voted for Obama -- that fell to 60 percent in 2012.", "Other surveys", "The Pew survey isn’t the only recent poll to look at millennial party identification.", "A 2012 survey done by American National Election Studies, a collaboration of Stanford University and the University of Michigan, divided respondents into strong and not very strong Democrats and Republicans; independents who lean Democratic or Republican; and flat out independent.", "Not surprisingly the number of true independents drops -- and it’s far below 50 percent for respondents ages 18-33.", "Strong Democrat", "16.47%", "Not very strong Democrat", "19.77%", "Independent-Democrat", "11.81%", "All Democrats and leaners", "48.05%", "Independent", "16.36%", "Independent-Republican", "11.26%", "Not very strong Republican", "13.37%", "Republican", "10.96%", "All Republicans and leaners", "35.59%", "Partisan leanings and voting behavior, \"demonstrate quite clearly that millennials are by far the most Democratic age group in the American electorate today,\" said Alan I. Abramowitz, a political science professor at Emory University.", "Independents in Florida", "So what about here in Florida, where about 25 percent of the electorate is independent?", "In the ages 18-29 category, 40 percent were registered Democrat, 27 percent Republican and 29 percent no party affiliation as of August 2012, according to University of South Florida professor Susan MacManus.", "\"They see themselves as neither (Democrat or Republican) but when push comes to shove, depending on the candidate, they tend to lean Democratic,\" MacManus told PolitiFact Florida.", "Our ruling", "Rock the Vote said \"50% of #millennials don't associate w/ any political party.\"", "The group quoted a Pew study that showed half of millennials don’t self-identify with either major political party. However, that statement could create a misleading impression that their vote is up for grabs and they have no leanings, and that’s not the case.", "Half of millennials identify as Democrats or say they lean toward the Democratic Party, which is 16 points greater than the percentage who identify or say they lean Republican, Pew found. Other data and polling experts suggest millennials lean decisively toward Democrats, even when they identify as independents.", "We rate this claim Half True.", "Rock the Vote’s Twitter, Tweet about Millennials, March 11, 2014", "Pew Research Center, Millennials in adulthood, March 7, 2014", "University of South Florida Professor Susan MacManus post on Sayfie Review, \"Who and where are Florida’s Democrats and Republicans,\" August 2012", "Florida Division of Elections, Monthly registration statistics, Through January 2014", "American National Election Studies, Accessed March 12, 2014", "American National Election Studies, Survey of partisanship question ages 18-33, 2012", "Miami Herald, \"Swing voters decide fate of presidential race in Florida,\" Nov. 3, 2012", "NPR, \"4 reasons the Pew millennials report should worry Democrats too,\" March 10, 2014", "The Daily Beast, \"Millennials unfriend Democrats,\" March 11, 2014", "Interview, John R. Petrocik, Professor Department of Political Science University of Missouri, March 11, 2014", "Interview, Peter Levine, Professor of Citizenship & Public Affairs, Director of CIRCLE: the Center for Information & Research on Civic Learning & Engagement, Jonathan M. Tisch College of Citizenship and Public Service at Tufts University, March 12, 2014", "Interview, Alan I. Abramowitz, professor of political science Emory University, March 12, 2014", "Interview, Michael McDonald, associate professor of government and politics in the Department of Public and International Affairs at George Mason University, March 12, 2014", "Interview, Curtis Gans, Director of the Center for the Study of the American Electorate, March 12, 2014", "Interview, Susan MacManus, political science professor University of South Florida, March 14, 2014", "Interview, Molly Rohal, spokeswoman, Pew Research Center, March 12, 2014", "Interview, Chrissy Faessen, spokeswoman for Rock the Vote, March 12, 2014", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]