["About this rating", "In February 2020, shortly after Senate Republicans voted to acquit U.S. President Donald Trump of impeachment charges of abuse of power and obstruction of Congress, Trump fired National Security Council official Lt. Col. Alexander Vindman and removed Gordon Sondland, the ambassador to the European Union, from his post.", "Both Vindman and Sondland had offered testimony unfavorable to Trump during the House's impeachment investigation, and Trump's sudden dismissal of them brought additional criticism that the president was engaging in improper retaliation against government personnel.", "That controversy prompted the recirculation of a meme which originally appeared during the 2016 presidential election — a meme that quoted British business magnate and Virgin Group founder Richard Branson as having said he once had a two-hour lunch with Trump, during which the latter spoke of nothing but gaining revenge on certain people who had declined to help him:", "It is true that, a few weeks before the 2016 U.S. presidential election (which Trump won), Branson published a blog entry describing a two-hour, one-on-one lunch meeting with Trump that had taken place — at Trump's invitation — in the 1990s. According to Branson, during those two hours Trump spoke of nothing else but his plans to \"destroy\" five people who had been unwilling to help him:", "Some years ago, Mr Trump invited me to lunch for a one-to-one meeting at his apartment in Manhattan. We had not met before and I accepted. Even before the starters arrived he began telling me about how he had asked a number of people for help after his latest bankruptcy and how five of them were unwilling to help. He told me he was going to spend the rest of his life destroying these five people.", "He didn’t speak about anything else and I found it very bizarre. I told him I didn’t think it was the best way of spending his life. I said it was going to eat him up, and do more damage to him than them. There must be more constructive ways to spend the rest of your life.", "I was baffled why he had invited me to lunch solely to tell me this ... I left the lunch feeling disturbed and saddened by what I’d heard ... What concerns me most, based upon my personal experiences with Donald Trump, is his vindictive streak, which could be so dangerous if he got into the White House. For somebody who is running to be the leader of the free world to be so wrapped up in himself, rather than concerned with global issues, is very worrying.", "Branson has also spoken of that lunch with Trump in the course of several television interviews:", "https://www.cnbc.com/video/2017/10/18/richard-branson-trump-was-fixated-on-mission-to-destroy-people-who-refused-him-a-loan.html", "Given that Branson's lunch meeting with Trump was \"one-on-one,\" and Trump himself has never confirmed it, we can't independently verify how much of the former's description of that meeting is accurate. However, Branson's account is congruent with a television interview Trump gave to PBS host Charlie Rose in 1992, in which Trump proclaimed that he \"loves getting even with people\" who have been \"disloyal\" to him:", "Trump: I would have wiped the floor with guys who weren't loyal [to me], which I will now do. I love getting even with people ...", "Rose: You love getting even?", "Trump: Oh, absolutely ...", "Rose: Tell me, you're going to get even with some people ...?", "Trump: If given the opportunity, I will get even with some people that were disloyal to me.", "Rose: How do you define disloyal?", "Trump: They didn't come to my aid.", "Branson, Richard.   \"Meeting Donald Trump.\"\r\n    Virgin.com.   21 October 2016.", "McCaskill, Nolan D.   \"Richard Branson: Trump Vowed to Destroy 5 People Who Refused to Help Him.\"\r\n    Politico.   21 October 2016.", "CNBC.   \"Richard Branson: Trump ‘Was Fixated’ on Mission to Destroy People Who Refused Him a Loan.\"\r\n    18 October 2017.", "David Mikkelson founded the site now known as snopes.com back in 1994.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]