["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "The figures listed in the Facebook post for six components of President Joe Biden’s $1.9 trillion relief bill are largely accurate.", "The post lacks context. For example, the largest of the six — $1.5 billion for Amtrak — was also requested by the Trump administration.", "The components comprise a small fraction of the $1.9 trillion.", "An attack ad claims that the American Rescue Plan includes money for a bridge connecting Canada to New York, an underground rail project in Silicon Valley, museums and Native American language preservation, Amtrak, environmental justice grants and family planning organizations like Planned Parenthood.", "The ad is in response to President Joe Biden’s $1.9 trillion American Rescue Plan for tackling COVID-19 and related economic challenges. It includes a $1,400-a-person stimulus payment, enhanced unemployment insurance, and a boost for coronavirus vaccination and testing efforts.", "It’s also loaded with pork, according to a group founded by Nikki Haley, the former U.S. ambassador to the United Nations and potential contender for the presidency in 2024.", "The attack is made in a Facebook post from Stand for America and is headlined, \"Democrats’ COVID ‘Stimulus’ Bill Wishlist.\" It lists six figures, ranging from $1.5 million to $1.5 billion, for spending on things such as underground rail, Amtrak, Native American language preservation, environmental justice and family planning.", "The post was flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)", "H.R.1319 does include some of the projects as described, but the post lacks context. For example, the largest of the six — $1.5 billion for Amtrak — was also requested by the Trump administration to help the railroad operate during the pandemic.", "Stephen Ellis, president of Taxpayers for Common Sense, points out that the amounts in the post account for about $2.2 billion of the $1.9 trillion bill, or about 0.1%.", "We sent messages to Stand for America via Facebook and its website asking for information to back up the Facebook post, but did not get a reply.", "Correct. But the Trump administration made the same request.", "The bill would give $1.5 million to the Great Lakes St. Lawrence Seaway Development Corp. \"to prevent, prepare for and respond to coronavirus by conducting the operations, maintenance and capital infrastructure activities of the Seaway International Bridge,\" which connects New York State and Ontario.", "In May 2020, the Transportation Department asked for the same amount of money for the bridge because toll revenue had \"dramatically decreased\" due to decreased traffic from the pandemic, the New York Daily News reported.", "\"$100 million for underground rail project in Silicon Valley\"", "Correct.", "The bill allots $1.25 billion for federal transit capital investment grants. It does not specify a project in the Silicon Valley.", "Stand for America cites a Fox Business news article that says the language of the bill alludes to $112 million going to phase two of the San Francisco Bay Area Rapid Transit (BART) expansion. The Washington Post also reported that it’s estimated the expansion will receive about $112 million.", "The long-planned six-mile extension would include five miles in a subway beneath downtown San Jose, with construction expected to start in 2022 and the line carrying passengers in 2030, according to the San Francisco Chronicle. The newspaper says the project’s stimulus funding would be $141 million.", "\"$500 million for museums & Native American language preservation\"", "Largely correct.", "The bill \"would appropriate $480 million for grants to fund activities related to the arts, humanities, libraries and museums, and Native American language preservation and maintenance,\" according to the nonpartisan Congressional Budget Office.", "The bill appropriates the $480 million this way:", "$270 million — split between the National Endowment for the Humanities and the National Endowment for the Arts — to provide grants \"to prevent, prepare for, respond to and recover from the coronavirus.\"", "$200 million to the Institute of Museum and Library Services to carry out the Library Services and Technology Act.", "$10 million in \"emergency grants\" to \"ensure the survival and continuing vitality of Native American languages during and after the (COVID-19) public health emergency.\"", "Museums have been financially disadvantaged by COVID-19, according to a survey of 850 museum directors by the American Alliance of Museums. The Metropolitan Museum of Art recently made news when its director said it was considering selling artwork to cover operational expenses.", "\"$1.5 billion for Amtrak, which still has $1 billion in unspent aid\"", "The $1.5 billion is correct. But it follows similar aid provided by the Trump administration. (The articles that Stand for America cites don’t address whether Amtrak has unspent aid.)", "The bill would steer grants totaling $1.5 billion to the National Railroad Passenger Corp. (Amtrak) \"to prevent, prepare for and respond to coronavirus\": $820.4 million for the northeast corridor and $679.6 million for the national network.", "In April 2020, Trump’s transportation department announced it was making more than $1 billion available to Amtrak \"to support the railroad’s activities to prevent, prepare for and respond to the spread of\" COVID-19.", "\"$50 million for environmental justice grants\"", "Correct.", "The bill appropriates to the Environmental Protection Agency $50 million for \"grants, contracts and other agency activities that implement the environmental justice purposes and objectives\" described in \"Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations,\" an executive order signed by President Bill Clinton in 1994; and President Joe Biden’s \"Tackling the Climate Crisis at Home and Abroad\" executive order.", "Biden’s order amended Clinton’s order to create a White House Environmental Justice Interagency Council to \"develop a strategy to address current and historic environmental injustice.\"", "\"$50 million for ‘family planning’ orgs like Planned Parenthood\"", "Largely correct.", "The bill appropriates $50 million \"for making grants and contracts under\" the Public Health Service Act, which gives grants and contracts for family planning.", "No organization is specified.", "The National Family Planning & Reproductive Health Association issued a statement praising the $50 million for Title X.", "We rated as a Promise Kept Trump’s pledge to defund Planned Parenthood. His administration enacted a rule that effectively said that any facility receiving federal Title X funding cannot also be an abortion provider. Previously, abortion providers such as Planned Parenthood could receive Title X funds as long as the funds were only used for non-abortion services.", "Biden on Jan. 28 directed the Health and Human Services Department to consider whether to rescind the rule.", "A Facebook post claimed: \"Democrats’ COVID ‘stimulus’ bill wish list\" includes money \"for a bridge connecting Canada to New York\"; an \"underground rail project in Silicon Valley\"; museums and \"Native American language preservation\";  Amtrak; \"environmental justice grants\"; and \"‘family planning’ organizations like Planned Parenthood.\"", "The figures listed in the post for six components of Biden’s $1.9 trillion relief bill are largely accurate.", "But the post needs additional information. For example, the largest of the six — $1.5 billion for Amtrak — was also requested by the Trump administration. And the six components comprise a tiny fraction of the $1.9 trillion.", "We rate the post Mostly True.", "Facebook post, Feb. 24, 2021", "Stand For America, \"Democrat Stimulus = Special-Interest Giveaway,\" Feb. 24, 2021", "Wall Street Journal, \"The Non-Covid Spending Blowout,\" Feb. 21, 2021", "Foundation for Economic Education, \"10 Crazy Examples of Unrelated Waste and Partisan Kick-Backs in New ‘COVID’ Bill,\" Feb. 22, 2021", "Center on Budget and Policy Priorities, \"House Relief Package Would Help Millions and Bolster the Economy,\" Feb. 17, 2021", "PolitiFact, \"What’s in Joe Biden’s $1.9 trillion American Rescue Plan?\", Jan. 15, 2021", "PolitiFact, \"Trump rule change prods Planned Parenthood to forgo federal funds,\" July 15, 2020", "Congressional Budget Office, \"Reconciliation Recommendations of the House Committee on Education and Labor,\" Feb. 17, 2021", "Washington Post Fact Checker, \"Dissecting the House GOP spin against Biden’s $1.9 trillion covid relief bill,\" Feb. 25, 2021", "Congress.gov, H.R.1319, accessed Feb. 26, 2021", "Committee for a Responsible Federal Budget, \"What's in the $1.9 Trillion House COVID Relief Bill?\", Feb. 18, 2021", "MedPage Today, \"Biden Makes Good on Two Early Promises,\" Jan. 28, 2021", "The White House, \"Memorandum on Protecting Women’s Health at Home and Abroad,\" Jan. 28, 2021", "Email, Stephen Ellis, president, Taxpayers for Common Sense, Feb. 25, 2021", "Washington Free Beacon, \"Dems Include Money for Abortion Providers in $1.9 Trillion COVID Aid Package,\" Feb. 12, 2021", "Republican Study Committee, memo, Feb. 16, 2021", "Environmental Protection Agency, \"Summary of Executive Order 12898 - Federal Actions to Address Environmental Justice in Minority Populations and Low-Income Populations,\" accessed Feb. 26, 2021", "Federal Register, \"Tackling the Climate Crisis at Home and Abroad,\" Feb. 1, 2021", "Fox Business, \"House COVID bill includes over $100 million for controversial Silicon Valley underground rail project,\" Feb. 20, 2021", "U.S. Transportation Department, news release, April 10, 2020", "New York Daily News, \"Senate GOP pans Biden’s COVID relief plan by taking aim at N.Y. bridge cash sought by Trump,\" Feb. 24, 2021", "Twitter, John Bresnahan tweet, Feb. 24, 2021", "San Francisco Chronicle, \"BART, Muni, Caltrain would be big winners in Democrats' COVID stimulus bill,\" Feb. 25, 2021", "U.S. Code, Public Health Service Act, accessed Feb. 26, 2021", "National Family Planning & Reproductive Health Association, statement, Feb. 10, 2021", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]