["The video was published here on Twitter on July 5, 2020. It has been viewed more than 5,600 times.", "The video consists of two clips: the first clip shows a bird’s-eye view of a burning structure and the second shows a ground-level image of a similar structure fire.", "The text overlaid at the top of the video translates from simplified Chinese to English as: “Fire scorched a groceries and food company in Shanghai / Shanghai Fire Service dispatched 12 teams of firefighters, 46 fire engines and 322 commanders to the scene”.", "The traditional Chinese-language caption of the Twitter post translates to English as: “[Food reserves] Fires have been reported at grain depots in Guizhou and Shanghai, but similar fires that occurred at various grain warehouses across the country are not news. People with a clear mind would know what’s going on. To quote a person who worked at a grain depot half their life: ‘Grain depots don’t catch fire under normal circumstances, even if there is a short circuit, because their walls and roof are made of inflammable materials. Also, there were cases where wooden houses were burned to the ground, but the grains inside only had their surface scorched. I have never seen thick smoke and roaring fire like this, so don’t believe in information from the government about food reserves.”", "Comments under the tweet can be translated as “the food reverse warehouse is on fire, there must be something sketchy in it! Nothing can be found after the fire! The greedy officials are very tricky!” and “Destruction of the national food reserve evidence”.", "The video also circulated here on Twitter; here on Facebook, here on YouTube and here on a Hong Kong online forum with a similar claim.", "The claim, however, is misleading.", "A reverse Google Image search of keyframes extracted from the video found a higher-definition version of the first clip in this report published by Storyful, a social media news and intelligence agency, on December 13, 2019.", "The footage, credited to “China Fire Service”, shows an industrial fire in Shanghai’s Pudong district, according to the report.", "Below is a screenshot comparison of the first clip in the misleading post (L) and the footage published by Storyful (R) with similar features circled in red:", "A subsequent keyword search found the same video published here on the verified Weibo account of China Fire Service on December 13, 2019.", "The simplified Chinese-language caption states: “[Shanghai: groceries and food company fire under control] A fire broke out at Shanghai Kerry Oils & Grains Industrial Co on 118 Gaodong Road, Pudong, Shanghai, at 11:56 December 13. Shanghai Fire Service’s rescuers responded to calls for help and dispatched 12 teams of firefighters, 46 fire engines and 322 commanders to the scene. The fire has now been brought under control. No casualties were reported.”", "The second clip corresponds to a photo published here on the Chinese internet portal Sohu.com on December 14, 2019.", "The photo, the second down from the top, is credited to Shanghai Fire Service.", "Below is a screenshot comparison between the second clip in the misleading post (L) and the Sohu photo (R) with similar features circled in red:", "The headline of the Sohu article reads: “Fire broke out at Shanghai oils and grains company midday December 13”. The article reports on a fire at the same company mentioned in the China Fire Service Weibo post.", "The misleading claim has also been debunked by the University of Hong Kong Journalism & Media Studies Centre’s fact-checking project Annie Lab here.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]