["-- New COVID-19 vaccine? --", "This Facebook post published on March 29, 2020 claims Japan has succeeded in creating a vaccine for COVID-19 called Avigan.", "The post features a screenshot of a Japanese news report showing Prime Minister Shinzo Abe. The English-language text overlaid on the image reads: \"Good News! Japan has Successfully made a vaccine drug for this COVID-19 just waiting for approval from the AVIGAN!\"", "Below is a screenshot of the misleading post:", "The post’s caption states in part: \"There's already a vaccine drug for corona virus. AVIGAN 200, made by JAPAN.”", "The image was also shared on Twitter here, here and here with a similar claim.", "The claim is misleading; the English text overlaid on the purported screenshot is an inaccurate translation of the actual report.", "The report in fact says that Japan is set to begin clinical trials for Avigan, which is a potential anti-viral drug to treat COVID-19, not a vaccine.", "The report reads: “To formally approve Avigan / The process of clinical study (studies) begins. / Development of treatment, vaccine\".", "Abe announced on March 28 that Japan \"will begin the necessary process to formally approve (Avigan) as a treatment against the new coronavirus”, AFP reported here. The trial is set to be conducted on one hundred patients until June.", "The prime minister’s announcement on Avigan was also reported by other Japanese media organisations including the national broadcasting organisation NHK here and the Nikkei newspaper here. Both articles accurately report that Avigan is an anti-viral drug.", "-- New COVID-19 drug? --", "This post shared on Facebook on March 31, 2020 claims a new anti-COVID-19 drug has been developed in the Philippines.", "Below is a screenshot of the misleading post:", "The post’s caption states: \"GOOD NEWS: BASED ON MY RESEARCH THERE IS AN EFFECTIVE DRUG FOR COVID 19 FROM JAPAN, AVIGAN IS THE NAME, AMAZING THERE'S ONE TOO IN THE PHILIPPINES PRODEX-B IS THE NAME, I JUST DON'T KNOW IF THE DOH KNOWS THIS\".", "A similar claim about Prodex-B’s effectiveness in treating COVID-19 was also shared here on Facebook.", "This claim is misleading; the Philippine FDA called the claims “baseless” and warned against the use of such \"unregistered\" drugs.", "In this advisory issued March 30, 2020, the FDA said: “The drug combination of Procaine and Dexamethasone with Vitamin B called 'Prodex-B' is circulating in various media platforms and claims that it has promising effects against viral infections and diseases. However upon verification, the drug product 'Prodex-B' is unregistered in this Office.", "“Unregistered drug products have no guaranteed quality, safety and efficacy data which may lead to patient harm.”", "Below is a screenshot of the FDA advisory:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]