["This Facebook post, published on April 16, 2019, contains a photo of Widodo and other men and women dressed in white and holding their hands up as if in prayer.", "A blue arrow has been drawn onto the photo pointing to a man standing to the left of Widodo.", "The misleading post’s caption says: “Caught red handed. The KPU chairman joining team 01 to perform umrah.”", "“01” was Widodo’s ballot number in the presidential election. Widodo was seeking re-election against challenger Prabowo Subianto, whose ballot number is “02”. KPU refers to the General Election Commission.", "Here is an official announcement by the KPU on the ballot numbers.", "The logo of Indonesian news outlet Viva can be seen on the top right corner of the photo along with tagline “#1 newstainment”.", "Widodo arrived in Saudi Arabia on April 14 2019 to perform umrah, a minor pilgrimage, ahead of Indonesian elections. During the visit, he also met with Saudi King Salman bin Abdul Aziz. Here is a Bloomberg about the president’s visit.", "Below is a screenshot of the misleading Facebook post:", "But the person marked with an arrow in the misleading Facebook post’s photograph is actually an interpreter called Unsil Habieb who works at the Indonesian Embassy in Saudi Arabia.", "Habieb can be seen in his social media accounts here and here on Facebook, here and here on Instagram, and here and here on Twitter.", "In this video of Widodo’s visit posted on the official YouTube channel of Indonesian news outlet Viva, Habieb can be seen interpreting for Jokowi and King Salman at 1:44.", "The video is titled: “Performing umrah, Jokowi goes to the Kabah and meets with King Salman.”", "Kabah, also spelt Kaaba, is a small black building located in the Al Haram Mosque in Mecca where Muslims face when they pray. Here is a photo of the building on AFP’s Image Forum.", "Below is a screenshot of Widodo, Habieb, and King Salman from the Viva footage:", "Here is a March 6, 2017, article by Indonesian news outlet Tempo about Habieb.", "The Facebook account of Indonesia’s election commission chairman Arief Budiman can be seen here.", "The president left Jakarta on April 13, 2019, right after the presidential debate that evening, and arrived in Saudi Arabia on April 14, 2019, according to media reports here and here.", "Widodo and his family conducted umrah on the morning of Monday, April 15, 2019, local time. Here is a Kompas report and here is the Cabinet Secretary’s Instagram post about their pilgrimage.", "Presiden Joko Widodo dan Ibu Negara Iriana Joko Widodo bersama kedua putranya Gibran Rakabuming Raka dan Kaesang Pangarep telah menunaikan ibadah umrah pada Senin pagi, 15 April 2019. . Pada kesempatan itu, Presiden, Ibu Iriana, dan rombongan terbatas berkesempatan masuk ke dalam Kakbah. . Usai masuk ke dalam Kakbah, Presiden bersama rombongan melakukan tawaf yang kemudian dilanjutkan dengan Salat Subuh berjamaah di depan Multazam. . Kemudian setelah salat, Presiden bersama rombongan melaksanakan sai. Mengakhiri ibadah umrah, Presiden dan rombongan melakukan tahalul pada pukul 06.37 waktu setempat. (Foto: BPMI)", "A post shared by  Sekretariat Kabinet (@sekretariat.kabinet) on Apr 14, 2019 at 9:46pm PDT", "He flew back to Jakarta on April 15, 2019, after an umrah pilgrimage in Mecca and a visit to the Nabawi Mosque in Medina in the morning, according to this news report.", "According to this post on the official Twitter page of the KPU, Budiman was in Jakarta on April 14, 2019. The tweet includes photos of the KPU chairman at an election-related event in Jakarta.", "15 Anggota KPU Kab 2019-2024 untuk Kab Deli Serdang, Kep Meranti serta Ende menjalani proses pelantikan, Minggu (14/4) dini hari. Mereka dituntut untuk kerja solid jelang hari pemungutan suara 17 April 2019. #KPUmelayani#Sukseskanpemilu2019 pic.twitter.com/sWzbMzzg7B", "According to this photo of Budiman posted on the official Facebook page of Indonesia’s election commission, the KPU, Budiman was at an event in Jakarta on April 15, 2019.", "According to another post on the KPU’s official Facebook page, Budiman was also in Jakarta early morning on April 16, 2019.", "The photo’s caption says: “In early morning hours, KPU [the General Election Commission] inaugurated five election officials for the North Tapanuli district for the period of 2019-2024. KPU chairman Arief Budiman: Keep integrity, transparency and integrity, in Jakarta, Tuesday (16/4/2019).”", "Here is a side-by-side comparison of an image of Budiman (R), from the official KPU Facebook page, and Habieb (L) from the Viva footage.", "When contacted by AFP, KPU chairman Budiman said on April 19, 2019, that the allegation was “a hoax”.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]