["Our only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.", "More Info", "Presidential candidate Republican Sen. Marco Rubio gives his closing remarks at the fourth Republican presidential debate in Wisconsin. (Getty Images)", "Florida Senator Marco Rubio is a fan of vocational training. At the Fox Business Network GOP debate in Milwaukee, Rubio made a pitch for young Americans to put down the textbooks and pick up a blowtorch.", "\"For the life of me, I don’t know why we have stigmatized vocational training,\" Rubio said. \"Welders make more money than philosophers. We need more welders and less philosophers.\"", "It was a big moment for Rubio, but was he correct? Philosophically and statistically speaking, no.", "It’s hard to know exactly how many philosophers there are in America, as many don’t have the title \"philosopher\" in their job descriptions. For this fact-check, we will look at those who majored in philosophy in college.", "According to Payscale, a company that collects salary information, philosophy majors make an average first-year salary of $42,200. The average mid-career pay for philosophy majors is even better: $85,000 per year.", "Additionally, the median pay for philosophy professors is nearly $90,000 per year, according to salary.com. The top 10 percent of philosophy professors make more than $190,000 a year.", "Rubio will be hard-pressed to find a welder who makes a comparable salary. According to the Bureau of Labor Statistics, the median wage for welders, cutters, solderers and brazers is $37,420 -- about $18 an hour. The top 10 percent of welders earn $58,590 or more. That’s significantly less than the top 10 percent of philosophy professors, who earn $190,000 or more.", "We haven’t heard back from the Rubio campaign yet, but it’s possible that Rubio read something along the lines of this 2014 Wall Street Journal column, which cites a few cases in which welders bring home annual salaries exceeding $150,000. While this might be the case for some extremely high-level welders -- just as some philosophy professors make significantly more money than others -- the labor and salary data suggests these cases are the exception, not the norm.", "Our ruling", "Rubio said, \"Welders make more money than philosophers.\"", "It made for a great sound bite, but neither salary nor labor statistics back up Rubio’s claim. Statistically, philosophy majors make more money than welders -- with much more room to significantly increase pay throughout their careers. It’s clear that Rubio was making a pitch for more vocational training in the United States, but his claim on welders doesn't hold together.", "As Aristotle said, \"The least initial deviation from the truth is multiplied later a thousandfold.\" We rate Rubio’s claim False.", "CNN, \"Marco Rubio’s quip about welders gets torched,\" Nov. 11, 2015", "Bureau of Labor Statistics, Occupational Employment and Wages: Welders, Cutters, Solderers and Brazers, May 2014", "The Wall Street Journal, \"Welders Make $150,000? Bring Back Shop Class,\" April 21, 2014", "The Washington Post, \"Fact checking the fourth round of GOP debates,\" Nov. 10, 2015", "University of Kentucky Department of Philosophy, \"Where Can Philosophy Take Me?\"", "PayScale, \"Highest Paying Bachelor Degrees by Salary Potential\"", "Salary.com, \"Professor - Philosophy Salaries\"", "The Principles of the Truth-O-Meter", "In a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up", "Sign me up", "District of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006", "Florida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494"]