["By Robert Farley", "Posted on September 13, 2016 | Updated on September 14, 2016", "Trump says he could “stop funding programs that are not authorized in law” to help pay for more spending on the military. But unauthorized spending isn’t necessarily wasteful spending. It includes all of the federal funds spent on veterans’ medical care, the National Institutes of Health, the FBI, the Federal Election Commission and U.S. embassies and consulates abroad.", "It also includes most of the money spent on NASA, the Transportation Security Administration and the National Weather Service.", "By rule, government spending is supposed to occur in two successive stages. First, Congress votes to authorize spending, and then it votes to appropriate spending. But for reasons we will get into later, some programs are not formally reauthorized, and Congress intentionally appropriates money to them anyway — what is sometimes referred to as “zombie” spending.", "The Congressional Budget Office tracks those instances in an annual report on “Unauthorized Appropriations and Expiring Authorizations.” In its most recent such report, in January, CBO determined that Congress appropriated about $310 billion in 2016 related to 256 laws for programs whose authorizations of appropriations have expired, but which had money appropriated to them anyway.", "Douglas Elmendorf, dean of the John F. Kennedy School of Government at Harvard University and a former director of the Congressional Budget Office first appointed in 2009 by Democratic congressional leaders, warned not to dismiss the worthiness of funding simply because congressional authorization has technically expired.", "“Sometimes Congress does not follow its own procedures by authorizing programs before appropriating money to them,” Elmendorf told us via email. “That mistake does not mean that the appropriated spending is any less valuable than spending for programs that have been authorized.”", "Donald Marron, director of economic policy initiatives at the Urban Institute and a former acting director of the Congressional Budget Office in 2006, when Republicans controlled the House and Senate, agreed. “I am sure you can find some outdated programs on the list,” Marron said. “But the list also includes large, popular programs like medical care for veterans, the National Institutes of Health, and NASA that Congress simply hasn’t bothered to reauthorize.”", "There may be savings to be had in any or all of those programs, of course — as one could argue there are in any government program — and Trump is free to argue that any one of them is obsolete or wasteful. But to dismiss them simply as “programs that are not authorized in law” leaves a distorted impression about the expenditures.", "In a speech at the Union League of Philadelphia on Sept. 7, Trump outlined a number of proposed spending increases to “rebuild our military,” which he said has become “depleted” due to the defense cuts in the sequester.", "The Committee for a Responsible Federal Budget estimates it would cost $450 billion over 10 years to repeal the defense sequester cuts — as Trump said he would ask Congress to do. Trump said that he would also ask Congress to fully offset that cost, and he highlighted several places where he could increase revenues or cut spending.", "Trump said he would reduce improper government payments “estimated to exceed $135 billion per year” and the amount of unpaid taxes “estimated to be as high as $385 billion a year.” CRFB warns, however, that even with “extraordinarily aggressive effort to close the tax gap and reduce improper payments,” the best the government could hope for would be savings of $100 billion over a decade.", "Trump also said he would shrink the federal workforce through attrition, which CRFB estimates could save another $50 billion over 10 years.", "And finally, Trump said he would “stop funding programs that are not authorized in law.”", "Trump, Sept. 7: We can also stop funding programs that are not authorized in law. Congress spent $320 billion last year on 256 expired laws. These are laws that are gone. Spent all of that money. Removing just 5 percent of that will reduce spending by almost $200 billion over a 10-year period.", "Trump’s estimate that reducing unauthorized appropriations by 5 percent would bring in $200 billion is a bit high, according CRFB, which projects it would save about $150 billion over a decade.", "And, CRFB estimates all of those measures together would still only cover about two-thirds of the total cost of Trump’s military spending increases.", "(Trump added that defense could draw on extra revenues from increased energy production, but as CRFB noted, Trump has previously earmarked those revenues for infrastructure spending.)", "Let’s focus on money spent on expired laws — which Trump gives the impression are outdated, obsolete or otherwise wasteful or unnecessary.", "Technically, House rules prohibit appropriations bills from awarding funding to agencies or programs that are not already authorized by law. But that rule is regularly waived.", "In a report on unauthorized appropriations, David Reich, a senior fellow at the left-leaning Center for Budget and Policy Priorities, explained that in recent decades, legislators often began adding special “authorization of appropriation” language to authorization law. Appropriations that exceed that amount, or which have expired, are considered “unauthorized.” Congress often does not renew the authorization as prescribed.", "In a story for the Weekly Standard, Kevin Kosar, the director of the governance project at the R Street Institute, a libertarian think tank, said that the amount of unauthorized appropriations has doubled over the last decade, while the number of programs operating under expired authorizations has increased by more than 45 percent.", "“So, why does Congress not bother to reauthorize agencies and programs? Because it is time-consuming and often opens up difficult political feuds,” Kosar told us via email. “So why doesn’t Congress allow some agencies and programs to just shut down? Because shutting them down can make some voters mad, and could create policy disasters. There’s a small $22.5 million grant program for bulletproof vests for police whose authorization has expired. What politician is comfortable shutting that program down? And the Department of State has not been reauthorized since 2004. Instead of appropriating funds without authorization, should Congress simply shut down America’s embassies and diplomatic offices?”", "Nonetheless, Kosar argues that there are good reasons to authorize and appropriate funds separately. The two-step process “makes spending harder” and gives Congress “regular opportunities to rethink and revise policies,” Kosar wrote in the Weekly Standard.", "Similar arguments have been raised by some Republican legislators who criticize Congress for allowing programs to “run on autopilot,” as Rep. Cathy McMorris Rodgers and Tim Phillips, president of Americans for Prosperity, wrote in a Sept. 1 op-ed in the Washington Post. In March, McMorris Rodgers introduced H.R. 4730, which would impose an automatic 10 percent spending cut for a program in the first year after authorization expires, with deeper cuts — and ultimately elimination of the program — in subsequent years if there is no reauthorization.", "Reich, of the Center for Budget and Policy Priorities, argues that such legislation would do more harm than good.", "“A concern about all these proposals is that Congress is already having serious trouble enacting appropriations in a timely manner; creating more hurdles would likely worsen the delays and difficulties,” Reich stated. “Also, making up-to-date authorizations of funding levels a prerequisite to maintaining appropriations for important agencies and programs would create more ‘must pass’ measures that members could use as leverage to force action on other matters and that could lead to more brinkmanship and impasses.”", "We take no position on whether or not it’s a good idea for Congress to appropriate funds to programs with expired authorization.", "But for Trump to suggest there may be $320 billion a year to be had by ending funding to “programs that are not authorized in law,” leaves the impression that Congress did not intend to fund these programs.", "The Center for Budget and Policy Priorities went through the CBO’s list of unauthorized appropriations and found it included the entirety of federal funding for veterans’ medical care, the National Institutes for Health, tenant-based rental assistance, Head Start and the National Science Foundation. It also includes most of the budget for the Department of Justice’s law enforcement and legal activities, NASA, the Department of Homeland Security’s Transportation Security Administration, and half the budget of the Environmental Protection Agency.", "“This is not stuff that Congress intended to shut down, I don’t think,” Reich told us.", "“If a candidate wants to end unauthorized appropriations — fine,” Kosar told us. “They are a violation of the law and lamentable. But for him or her to say so credibly means saying aloud which of the unauthorized agencies and programs he wants to abolish.”", "Ed Lorenzen, a senior adviser at the Committee for a Responsible Federal Budget, told us, “The fact that a program has an expired authorization does not necessarily mean the program is outdated or obsolete. It doesn’t even mean Congress hasn’t reviewed the program recently. It simply means that the language in the underlying law for the program which says Congress is authorized to appropriate money for the program – often a specific dollar amount – has expired. But Congress will often review a program and amend the underlying laws regarding the program without updating the authorization for appropriations.”", "Lorenzen cited the example of the Department of Veterans Affairs health system, which is considered an unauthorized program because the specific authorization of appropriations expired years ago. It was appropriated $61.1 billion for fiscal year 2016.", "Although it is the biggest ticket item on the list of unauthorized appropriations, Lorenzen noted that “Congress completed a thorough review of and enacted reforms to the VA health system last year in response to the issue of long waiting times.”", "Nor does the fact that a program is “unauthorized” mean there is no congressional oversight of it.", "“All these programs are still subject to the annual appropriations process in which the Appropriations Committee reviews the programs, decides whether or not to continue funding and what level of funding to provide and often contains provisions regarding operations of those programs,” Lorenzen said.", "“Requiring that programs be reauthorized is a good way to provide for regular review of the programs and it would be better if Congress were to reauthorize programs with expired authorizations,” Lorenzen said. “But the simple fact that a program has an expired authorization does not mean it is outdated or unnecessary.”", "Update, Sept. 14: This story has been updated to clarify that the director of the Congressional Budget Office is appointed by the leadership in Congress. An earlier version of this story identified two former CBO directors as serving under Presidents George W. Bush and Barack Obama. We did not intend to imply that presidents appoint CBO directors.", "https://www.sharethefacts.co/share/10afdeee-81f6-4a96-aa75-70764f246736", "Q: Does consumption of aspartame harm human health?", "A: Some research indicates possible negative effects from aspartame, but there’s no definitive evidence linking it to health problems in the general population. Aspartame is safe when consumed within certain limits, according to the U.S. Food and Drug Administration. The daily limit is above the amount people typically ingest."]