["About this rating", "President Trump, like other Twitter users with large followings, has a large number of new followers that appear to be bots or inauthentic, automated user profiles.", "Trump did not receive an influx of five million new Twitter followers in three days.", "On 30 May 2017, the web site Empty Lighthouse Magazine reported that President Donald Trump's Twitter account gained 5 million new followers in three days — the bulk of which were fake, automated profiles known as \"bots\":", "According to numerous reports, Donald Trump's Twitter account has grown by 5 million followers in the last three days. Previously, Trump's Twitter growth was relatively steady. So it's interesting to see such dramatic growth over such a short period of time. But what's more interesting is the fact that the vast majority of these new followers are bots — fake computerized followers. So what's going on?", "Trump had around 25 million followers only a few days ago. Suddenly now, he has over 30 million followers. This growth is very much unlike what we have seen in the past. So we decided to do some investigation into who trumps new followers are.", "In our audit, we found that most of the new followers that Trump is received are people with no names (or dictionary word names) and a number appended.", "According to archived snapshots of President Trump's Twitter account, he did not gain a net five million followers in the three days prior to 30 May 2017.  As of the end of the month, Trump's personal account has a total of 31 million — he gained 3 million new followers for the entire month of May. According to archives, it has taken Trump since the beginning of March to gain a total of 5 million new followers.", "Here is an archived image of President Trump's account from 3 March 2017:", "That number steadily degraded through the month of May — although TwitterAudit's David Caplan cautioned that the margin of error for the fraction representing \"real\" users is large because of the large numbers in play.", "Although many of Trump's new followers do appear to be fake accounts that do not belong to actual people, the phenomenon is not specific to him. Recent followers to accounts like Kim Kardashian, Katy Perry and even CNN Breaking News that have larger followings seem to be experiencing the same pattern.", "Johnson, Brian. \"Why Did Trump Get Millions of Twitter Bots to Follow Him This Week?\"\r\n  EmptyLighthouse.com. 30 May 2017.", "Andrews, Travis M. \"Trump Targets ‘Negative Press Covfefe’ in Garbled Midnight Tweet That Becomes Worldwide Joke.\"\r\n  The Washington Post. 31 May 2017.", "Barbaro, Michael. \"Pithy, Mean and Powerful: How Donald Trump Mastered Twitter for 2016.\"\r\n  The New York Times. 5 October 2015.", "Feldman, Brian. \"What’s Up With All Those Trump Twitter Bots? Probably Nothing.\"\r\n  New York Magazine. 30 May 2017.", "Bethania Palma is a journalist from the Los Angeles area who has been working in the news industry since 2006.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]