["The photo collage was published in this Facebook post published on August 5, 2019, where it has been shared more than 2,300 times.", "Below is a screenshot of the misleading post:", "The Hindi language text superimposed on the top image translates to English as: “Yesterday’s photo”. The text superimposed on the bottom photo translates to English as: “Today’s photo.”", "The top photo shows the flag of the state of Jammu and Kashmir alongside the Indian national flag on top of an administrative building in Srinagar, in Indian-administered Kashmir.", "The bottom photo shows the same building with just the Indian national flag.", "The building in the photo is an administrative office of Jammu and Kashmir in Jammu city, the photo corresponds with the user images tagged at the building’s location here on Google images.", "The misleading post was published on the same day the Indian government stripped Kashmir of its special autonomy. Here is an AFP report about the developments.", "The same photo was collage was shared with a similar claim on Facebook here and on Twitter here.", "The claim is false; the bottom photo in the photo collage has been doctored from the top one.", "The top photo in the misleading posts has been taken from this Kashmir Observer article published on November 7, 2016.", "Below is a screenshot of the report:", "AFP analysed the photo collage in the misleading posts and found the photo at the bottom had been doctored from the Kashmir Observer photo. Below is a screenshot of the photo collage with the corresponding identical features circled in green:", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]