["About this rating", "Under Ohio law, consumers can bring lawsuits against suppliers for unfair or deceptive practices, though a lot of these practices are up to court interpretation.", "The letter in question was not sent by the Ohio State Bar Association (OSBA) nor the American Bar Association (ABA). The OSBA also warned readers to be wary of its contents.", "Given government recommendations encouraging homemade masks, the way these laws would apply to particular situations like masks created at home remains unclear.", "Snopes is still fighting an “infodemic” of rumors and misinformation surrounding the COVID-19 pandemic, and you can help. Find out what we've learned and how to inoculate yourself against COVID-19 misinformation. Read the latest fact checks about the vaccines. Submit any questionable rumors and “advice” you encounter. Become a Founding Member to help us hire more fact-checkers. And, please, follow the CDC or WHO for guidance on protecting your community from the disease.", "As Ohio Gov. Mike DeWine announced a statewide mask mandate starting July 23, 2020, amidst a rise in COVID-19 cases in the region, online rumors suggested any mask manufacturers, including those selling masks from home, were at risk of facing lawsuits.", "Snopes readers alerted us to the circulation of the above-displayed letter purportedly from the Ohio State Bar Association (OSBA), printed on an American Bar Association (ABA) letterhead. Dated July 19, 2020, the letter claimed that under \"Ohio Consumer Laws\" individuals could bring a lawsuit against establishments selling or manufacturing masks without licenses or warning labels, including those selling out of their homes, especially if wearers got lung damage.", "The letter, full of grammatical errors and deprived of punctuation, stated:", "Under Ohio Consumer Laws you can now bring lawsuit against any retail establishment selling or manufacturing Face Masks or Facial Coverings for the purpose virus protection", "You can now file lawsuits against anyone selling a facial covering that has not been Medically Approved to filter contagious diseases. This includes any Homemade or Factory made mask", "With the rise in lung damage caused by pleurisy you can Legally sue for Medical Damages and or selling a Medical Device without license", "Any mask sold without proper warning labeling sewn into the fabric will be considered in violation, you can also file a mislabeled or not FDA approved lawsuit", "You can also pursue anyone selling face masks out of their home\nYou can also bring suit if selling a medical device without license\nYou can also bring suit for Illegal Monetary Sales and failure to disclose income under IRS 254-70994US\nYou can also now bring suit against any small business that knowingly sells a defective face covering that causes lung damage", "We believe these lawsuits will be very lucrative moving forward", "We learned that the letter attribution was fake and its contents were suspect. In a statement on their Facebook page, the OSBA said they did not issue a letter and readers should be “wary of its contents”:", "We reached out to the OSBA who would not comment on the contents of the letter because as an organization they refrain from giving legal advice.", "Snopes also reached out to the Ohio attorney general’s office about the information in the letter. A representative confirmed that under Ohio law consumers can bring lawsuits against suppliers for unfair and deceptive practices, but much of what constitutes a violation relies on court interpretation. According to the Ohio Revised Code, such deceptive practices include:", "That the subject of a consumer transaction has sponsorship, approval, performance characteristics, accessories, uses, or benefits that it does not have;", "That the subject of a consumer transaction is of a particular standard, quality, grade, style, prescription, or model, if it is not [...]", "It is likely that this applies to any mask manufacturers that make deceptive promises about the quality of their product(s) and the level of protection the product(s) provide.", "DeWine and the Centers for Disease Control and Prevention (CDC) recommended the use of homemade and non-medical grade masks in addition to practicing social distancing. The CDC stated that surgical masks or respirators are “critical supplies that should continue to be reserved for healthcare workers.” The Ohio state and federal governments have shared recommendations for do-it-yourself (DIY) or homemade masks without any requirement for a license or warning labels. Consumer protection laws may apply to people selling these homemade masks without affixed labels, but the actual legal implications remain unclear given government recommendations.", "The Federal Drug Administration (FDA) regulates masks used for medical purposes only. In April 2020, when health care providers in the U.S. reportedly did not have access to enough personal protective equipment, including masks, the FDA issued an Emergency Use Authorization (EUA) for face masks used by the general public and in health care settings during the COVID-19 public health emergency. In short, this EUA required that face masks should be labeled accurately and their use not be misrepresented. Authorized masks were to meet the following requirements:", "1. The product is labeled accurately to describe the product as a face mask and includes a list of the body contacting materials (which does not include any drugs or biologics);", "2. The product is labeled accurately so that it does not claim to be intended for use as a surgical mask or to provide liquid barrier protection;", "3. The product labeling includes recommendations against use in a clinical setting where the infection risk level through inhalation exposure is high;", "4. The product is not labeled in such a manner that would misrepresent the product’s intended use; for example, the labeling must not state or imply that the product is intended for antimicrobial or antiviral protection or related uses or is for use such as infection prevention or reduction;", "5. The product is not labeled as a respiratory protective device, and therefore should not be used for particulate filtration; and", "6. The product is not labeled for use in high risk aerosol generating procedures.", "In sum, although the above-displayed letter was fake, it is possible that consumer protection laws that apply to all kinds of manufacturers would also apply to mask manufacturing, even though its interpretation in situations involving homemade masks is unclear. We thus rate this claim as “Mostly False.”", "Codes.Ohio.gov.   \"Chapter 109:4-3 Deceptive Acts or Trade Practices in Connection with Consumer Transactions.\"\r\n  Accessed 3 August 2020", "FDA.gov.  \"To: Manufacturers of Face Masks; Health Care Personnel; Hospital Purchasing Departments and Distributors; and Any Other Stakeholders.\"\r\n    24 April 2020.", "Ingles, Jo.   \"Coronavirus in Ohio: Ohioans Advised To Wear Homemade Masks in Public.\"\r\n    WOSU.   6 April 2020.", "Morello, Carol.   \"Coronavirus Cases on the Rise in the Midwest as They Ebb in the Sun Belt.\"\r\n    The Washington Post.   28 July 2020.", "The Centers for Disease Control and Prevention.   \"Considerations for Wearing Masks.\"\r\n    16 July 2020.", "Waldrop, Theresa.   \"Ohio Governor Orders Statewide Mask Mandate as of Thursday.\"\r\n   CNN.  22 July 2020.", "Nur Nasreen Ibrahim is a reporter with experience working in television, international news coverage, fact checking, and creative writing.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]