["About this rating", "A video supposedly showing a 10-month-old baby drawing well-crafted cartoons racked up millions of views as it circulated around social media in 2019. One posting from Facebook user Farzana Akhlaq, which was accompanied by the caption \"This baby is only ten months old. No science can explain how n when she has learnt this,\" was viewed 22 million times within a month of its initial posting.", "The following video from YouTube had more than 1 million views:", "This clip was met with a hefty dose of skepticism because most viewers simply couldn't fathom a 10-month-old having this level of artistic skill. Several small oddities in this footage also pointed to it being a fake. For instance, the child turns its head around the 7-second mark after apparently hearing a noise, but the baby's hands continue to draw on the paper. And at the end of the video, the tail on the third character simply appears on the paper out-of-sync with the child's hand movements.", "The child's motor skills also simply seemed too advanced for a 10-month-old. According to The Bump, 10-month-old babies should be crawling, sitting on their own, pointing, and starting to pick things up with their thumb and pointer finger. In other words, most 10-month-olds are still working on grasping an object, let alone drawing perfect circles:", "Sitting. Baby now can probably sit up without any support—maybe for as long as he likes.\nCrawling. Nine months is the average age babies start to crawl, which means yours might have been doing it for as long as a month or so, or you’re still waiting for her to start. A 10-month-old not crawling is not typically a cause for concern. In fact, doctors say some perfectly healthy and well-developed babies never crawl at all—they jump straight to walking! Encourage baby to crawl by positioning her favorite toy just out of her reach—and cheer her on!\nStanding. Baby may be able to stand upright while holding onto a piece of furniture. (And in a matter of months, she may be letting go!)\nHand skills. A 10-month-old baby can often pick things up using their thumb and pointer finger and have learned how to point (and anything and everything exciting) too.\nTalking. About half of 10-month-olds say “mama” or “dada” to refer to their parents. Aw!", "If this were the only video showing this child drawing, we'd have a hard time believing that the footage was genuine. However, we've found a number of other videos that presumably showcase this same child's artistic talent. On 7 January 2019, the \"Cartoons\" Facebook page uploaded a four-minute video consisting of several smaller clips featuring this child drawing:", "The claim that this child was just 10 months old appears to have originated out of the blue. While we haven't been able to track down the source of this footage, the video appears to have first started circulating on the social media platform TikTok in early January 2019. The most popular postings at that time simply identified the child as a \"baby\" with no mention of a specific age or gender. It doesn't appear that the \"10-month-old\" claim was attached to this footage until several weeks later.", "If we presume that the Peppa Pig backpack in the background of the viral video belongs to this child (in other clips the child can be seen drawing Peppa Pig and wearing clothes featuring the cartoon character), it may be reasoned that this child was at least old enough to attend school and likely 4-5 years old. If that's the case, while this child's artistic abilities were impressive, such skills would be plausible.", "4- to 5-Year-Old Development: Movement Milestones and Hand and Finger Skills", "Stand on one foot for more than 9 seconds\nDo a somersault and hop\nWalk up and down stairs without help\nWalk forward and backwards easily\nPedal a tricycle\nCopy a triangle, circle, square, and other shapes\nDraw a person with a body\nStack 10 or more blocks\nUse a fork and spoon\nDress and undress, brush teeth, and take care of other personal needs without much help", "Some of the strange edits in the viral clip (such as the tail appearing out of thin air on the third character as mentioned above) can also be explained away by the original medium. While TikTok only allows users to upload 15-second videos, longer clips can be created by splicing together sequential clips. The jaunty movement at the end of the clip possibly was an editing error.", "In short, we have not been able to definitively determine the authenticity of this clip and claim, though this child likely is not 10 months old and probably closer to 4 or 5 years old.", "Childdevelopment.com.au.   \"Fine Motor Development Chart.\"\r\n    Retrieved 11 March 2019.", "WebMD.   \"4- to 5-Year-Olds: Developmental Milestones.\"\r\n    Retrieved 11 March 2019.", "Schwedel, Heather.   \"A Guide to TikTok for Anyone Who Isn’t a Teen.\"\r\n    Slate.   4 September 2018.", "The Bump.   \"10 Month Old Baby.\"\r\n    Retrieved 11 March 2019.", "Dan Evon is a former writer for Snopes.", "Your membership is the foundation of our sustainability and resilience.", "Company", "Navigate", "Sections", "Account", "© 1995 - 2023  by Snopes Media Group Inc.", "This material may not be reproduced without permission.", "Snopes and the Snopes.com logo are registered service marks of Snopes.com"]