["The screenshot and claim were published on Facebook here on April 29, 2020.", "The news bulletin, which aired on the Hindi-language news channel News Nation, translates to English as: “100 nurses have resigned in Jhalwara’s Rajasthan.”", "The post’s Hindi caption translates to English as: “100 nurses have resigned in Rajasthan's Jhalawar because the members of Tablighi Jamaat used to spit on them, they would demand biryani and if the demand was not met, they abused them.”", "Jhalawar is a city in the southeastern part of Rajasthan.", "The post also references Tablighi Jamaat, which is an Islamic missionary organisation. The group made headlines in March 2020 after it held an event at a mosque that was later identified as a major COVID-19 hotspot. The gathering sparked a manhunt across India after dozens of infections and several deaths were linked to the gathering, AFP reported on March 31, 2020.", "The screenshot was also shared alongside a similar claim here and here on Facebook, and here and here on Twitter.", "The claim is false.", "The full online News Nation report, published here on April 27, 2020, explains that over 100 nurses resigned over low wages and a lack of personal protective equipment (PPE) during the COVID-19 pandemic.", "The part of the Hindi article translates as: “More than 100 nurses have resigned in Jhalawar Hospital and Medical College in Rajasthan. Nurses have echoed their sentiments that they cannot work for a meagre sum of 6000 Indian rupees a month [less than $100]. The nurses have also alleged that they are being denied PPE kits for their safety during COVID-19 pandemic.”", "The Rajasthan Nurses Association also refuted the claim in the misleading posts, saying the resignations were unrelated to members of Tablighi Jamaat.", "“All these claims are rubbish, it was a salary issue, where in the nurses demanded an increase in the salary along with additional sum of 2,500 Indian rupees [approximately $35] which they were promised with PPE kits during COVID-19 pandemic,” Deepak Tiwari, the president of the association, told AFP by phone on May 11, 2020.", "Another local Hindi news channel interviewed one of the nurses who resigned and published a video report on YouTube here on April 27, 2020. The nurse stated: “We are risking our lives by working in wards and under so much pressure, however, they are still paying us a maximum of 6,000 Indian rupees, whereas we should be getting a much higher salary. This is why we are here to stage a protest and tender our resignations.”", "The resignations were also reported by several other media outlets in Rajasthan, for example here by News Tree and here by Lokus News.", "Follow us", "Copyright © AFP 2017-2023. All rights reserved. Users can access and consult this website and use the share features available for personal, private, and non-commercial purposes.  Any other use, in particular any reproduction, communication to the public or distribution of the content of this website, in whole or in part, for any other purpose and/or by any other means, without a specific licence agreement signed with AFP, is strictly prohibited.  The subject matter depicted or included via links within the Fact Checking content is provided to the extent necessary for correct understanding of the verification of the information concerned.  AFP has not obtained any rights from the authors or copyright owners of this third party content and shall incur no liability in this regard.  AFP and its logo are registered trademarks."]