["More Info\n\n  I would like to contribute\n\n   _____________________\n   [ ] One Time\n   [ ] Monthly\n   [ ] Yearly\n   Join Now\n   Facebook posts\n   stated on March 18, 2020 in a Facebook post:\n   Says President Donald Trump said, “People are dying who have never died\n   before.”\n   true pants-fire\n     * National\n     * Fake news\n     * Public Health\n     * Facebook Fact-checks\n     * Coronavirus\n     * Facebook posts\n   President Donald Trump listens a meeting with nurses in the White House on\n   March 18, 2020, in Washington.", "(AP/Brandon)\n\n   Bill McCarthy\n   By Bill McCarthy March 19, 2020\n\nNo, Trump didn’t say, ‘People are dying who have never died before’\n\n    If Your Time is short\n\n     * We searched a number of databases and found no evidence that Trump, on\n       March 18, said, “People are dying who have never died before.”\n   See the sources for this fact-check\n\n   The spread of the novel coronavirus has put President Donald Trump on TV\n   screens across the nation as the White House task force gives regular\n   press briefings on the U.S. response.", "But Trump never said that \"people\n   are dying who have never died before,\" despite what a number of social\n   media posts have claimed.", "Our Sources\n\n   Facebook posts, March 18, 2020\n\n   Various searches on Factba.se, accessed March 19, 2020\n\n   Donald J. Trump on Twitter, accessed March 19, 2020\n\n   Politwoops, \"Deleted Tweets From Donald J. Trump, R-D.C.\" accessed March\n   19, 2020\n\n   C-Span, \"President Trump and Coronavirus Task Force Brief Reporters,\"\n   March 18, 2020\n\n   C-Span, \"President Trump Meeting with Nurses on Coronavirus Response,\"\n   March 18, 2020\n\n   The White House, \"Statement by the President,\" March 18, 2020\n\n   The White House, \"Remarks by President Trump, Vice President Pence, and\n   Members of the Coronavirus Task Force in Press Briefing,\" March 18, 2020\n\n   The White House, \"Remarks by President Trump and Vice President Pence in a\n   Briefing with Nurses on COVID-19 Response,\" March 18, 2020\n\n   Snopes, \"Did President Trump Say ‘People Are Dying Today That Have Never\n   Died Before’?\""]