{"Drop in cellphone subscribers": "The first aspect employed to verify the authenticity of the claim is the reported drop in cellphone subscribers in China in early 2020. The Chinese Ministry of Industry and Information Technology published figures showing a drop of about 21 million cellphone users, indicating a significant decline in subscribers during the initial months of the COVID-19 pandemic.", "Online data from cellphone carriers": "The second aspect involves the analysis of online data published by China's three largest cellphone carriers. According to The Associated Press, China Mobile Ltd., China Unicom Hong Kong Ltd., and China Telecom Corp. reported substantial losses in subscribers for January and February 2020. China Mobile alone reported a drop of nearly 7.25 million subscribers, while China Unicom Hong Kong lost 7.8 million subscribers, and China Telecom Corp. lost 5.6 million in February alone. These figures further support the claim of a significant decrease in cellphone users during the early stages of the pandemic.", "Disparity between reported COVID": "19 cases and cellphone subscribers: The third aspect involves highlighting the disparity between the reported number of COVID-19 cases and the drop in cellphone subscribers. As of April 2020, China had officially reported around 81,000 COVID-19 cases and approximately 3,300 deaths. However, some sources argue that the significant decline in cellphone subscribers suggests a concealed and vastly underreported death toll from COVID-19 in China. This comparison raises questions about the accuracy and transparency of the official COVID-19 figures.", "Intelligence officials": "concerns and reports: The fourth aspect involves the concerns and reports of intelligence officials regarding the underreporting of COVID-19 cases and deaths in China. The New York Times reported that American intelligence agencies, including the CIA, had warned the White House about China's understatement of coronavirus infections since early February 2020. These officials believe that the Chinese government itself may not know the true extent of the virus and that midlevel bureaucrats in Wuhan and other parts of China have been providing inaccurate information about infection rates, testing, and death counts. This information adds credibility to the claim that the death toll from COVID-19 in China may have been significantly underreported."}