["And in fact, (Tony Evers) sought and\n   received the largest charter school grant in the country from the\n   Trump-DeVos administration to start new charter schools in Wisconsin.\"", "true half-true\n     * Education\n     * Wisconsin\n     * Kelda Helen Roys\n   Gubernatorial candidate Kelda Roys, criticizing “privatization” of the\n   public school system, says state schools leader Tony Evers sought and\n   received the largest federal grant for charter schools.", "In fact, on page 33 of the PDF of DPI's application\n   for the grant, DPI touts recent changes to Wisconsin laws that ‘expanded\n   the reach of independent charter schools and expanded access to these\n   schools across the state.’ They go on to state that ‘the number of\n   independent charter schools will likely increase during this grant\n   period.’ As we previously established, the use of this grant to increase\n   or expand independent charters will very clearly result in an increase in\n   privatization, even if some public charters are also created.\"", "And in fact, (Tony Evers) sought and\n   received the largest charter school grant in the country from the\n   Trump-DeVos administration to start new charter schools in Wisconsin.\"", "Expanding Opportunities Through Quality Charter Schools Program (CSP)\n   Grants to State Entities > Awards, Office of Innovation and Improvement,\n   U.S. Department of Education, June 22, 2018\n\n   Charter Schools Program State Educational Agencies (SEA) Grant > Awards,\n   U.S. Department of Education, June 22, 2018\n\n   \"Betsy DeVos, Secretary of Education— Biography,\" U.S. Department of\n   Education, June 22, 2018\n\n   About Tony Evers, Wisconsin Department of Public Instruction, June 22,\n   2018\n\n   \"Application for grants under the 84.282A CSP Grants to State Entities\n   Award #U282A170002,\" U.S. Department of Education, submitted May 15, 2017\n\n   Telephone interview, Maggie Gau, campaign spokeswoman for Tony Evers, June\n   22, 2018\n\n   Email, Brian Evans, campaign spokesman for Kelda Roys, June 22&25, 2018\n\n   Email conversation and telephone interview, Tom McCarthy, communications\n   director for the Wisconsin Department of Public Instruction, June 25-28,\n   2018\n\n   \"Charter grant applications now available,\" News release, Wisconsin\n   Department of Public Instruction, Feb 1, 2018\n\n   Brown, Emma.", "And in fact, (Tony Evers) sought and\n   received the largest charter school grant in the country from the\n   Trump-DeVos administration to start new charter schools in Wisconsin.\""]