{"State purchase application process": "The expert mentions that individuals who want to buy a gun in Rhode Island must fill out a state purchase application form with a licensed gun shop. This form is then run through the FBI's National Instant Criminal Background Check System (NICS) database. The application is also sent to local or state police and the attorney general's department, who must destroy the copies if no disqualifying information is found. This aspect verifies the authenticity of the claim by highlighting the legal process involved in purchasing a gun in Rhode Island.", "NICS Firearm Background Checks data": "The expert refers to the NICS Firearm Background Checks data to support the claim. They mention that the number of background checks in Rhode Island has been steadily increasing in recent years, with specific figures provided for 2012 and 2013. This aspect verifies the authenticity of the claim by using official data to estimate the number of gun purchases in Rhode Island.", "Multiple guns purchased per application": "The expert mentions that multiple guns can be purchased per application, but it still results in only one background check. This aspect verifies the authenticity of the claim by acknowledging that the number of background checks may not directly represent the exact number of guns sold. However, it supports the claim by stating that even with this consideration, the estimate of approximately 20,000 annual gun purchases in Rhode Island is accurate.", "Federal law and gun purchase records": "The expert mentions that federal law prohibits the creation of a federal registry of gun transactions, and the FBI must destroy all approved gun purchase records within 24 hours. This aspect verifies the authenticity of the claim by highlighting the legal framework surrounding gun purchase records and emphasizes that the available data from NICS Firearm Background Checks is the most reliable source for estimating the number of gun purchases in Rhode Island."}