{"Length of the recession": "The expert's verdict mentions that the length of the Reagan recession is somewhat tricky to determine, as there were two recessions that some economists argue should be considered as one \"double-dip\" recession. However, when excluding the months of expansion between the two recessions, the length of the Reagan recession is stated to be 23 months, which is the same length as the current recession under Obama. Verdict: Call it a wash - for now.", "Economic growth or contraction": "The expert's verdict compares the decline in inflation-adjusted GDP during the Reagan recession and the current recession. It states that over the full three-year period of the double-dip recession, the decline in GDP was 0.6 percent, while in the current recession, it was a 2.8 percent decrease over two years. However, when comparing the second dip of the early-1980s recession to the current recession, the GDP loss is similar, with a 2.6 percent contraction. The expert also mentions that unless there is a significant boost in the economy during the final quarter of the year, the contraction in 2009 is likely to be bigger than the worst year of the 1980s recession. Verdict: They're close, but the current recession will likely end up somewhat worse.", "National Bureau of Economic Research classification": "The expert's verdict mentions that the National Bureau of Economic Research (NBER) is the official arbiter of recession-dating. It classifies one recession during Reagan's presidency as lasting from January 1980 to July 1980 and another from July 1981 to November 1982. However, some economists argue that the two recessions should be considered as one \"double-dip\" recession. Verdict: The NBER classification provides a framework for understanding the duration of the recessions.", "Consultation with economists and historians": "The expert's verdict states that economists and historians were consulted to determine the accuracy of the claim. While the specific details of their input are not provided, their expertise and analysis likely played a role in evaluating the authenticity of the claim. Verdict: Expert consultation adds credibility and expertise to the verification process."}