{"The expert": "s verdict highlights that Seema Verma, the top Medicaid official in the Trump administration, based her comments on comparisons between the health of Medicaid recipients and people on Medicare or private insurance. However, experts questioned this parallel, suggesting that a better measure would be to look at health before and after states expanded Medicaid under the Affordable Care Act. Numerous studies show that people's health improved as a result of Medicaid coverage and that they were generally satisfied with it.", "Seema Verma supports changes to Medicaid that would give states the option to receive capped annual federal funding for some enrollees instead of open": "ended payouts based on enrollment and health costs. This proposed change would be a departure from how the program has operated since its inception in 1965. Verma argues that such changes are necessary because Medicaid is one of the top two biggest expenses for states, and its costs are expected to increase 500% by 2050.", "A CMS spokesperson provided a fact sheet comparing the health status of people on Medicaid to those with private insurance and Medicare": "The fact sheet showed that 43% of Medicaid enrollees reported their health as excellent or very good, compared with 71% of people with private insurance, 14% on Medicare, and 58% who were uninsured. However, several national Medicaid experts argued that using health status as a proxy for whether Medicaid helps improve health is flawed, as eligibility for Medicaid is based on low-income status, which can impact health in various ways.", "The Medicaid and CHIP Payment and Access Commission": "MACPAC), a congressional advisory board, released a 2017 report noting that Medicaid enrollees face more difficulty than low-income privately insured individuals in finding doctors who accept their insurance and making appointments. They also have more trouble finding specialist physicians who will treat them. This suggests that while Medicaid may face challenges in terms of access to care, it does provide essential coverage for low-income individuals."}