["More Info\n\n  I would like to contribute\n\n   _____________________\n   [ ] One Time\n   [ ] Monthly\n   [ ] Yearly\n   Join Now\n   Everytown for Gun Safety\n   stated on May 6, 2015 in a press release:\n   \"Once again, a police officer has been killed with an illegal gun from\n   Georgia – a state that last year did the NRA’s bidding and weakened its\n   already lax gun laws.\"", "\"Once again, a police officer has been killed with an illegal gun from\n   Georgia -- a state that last year did the NRA’s bidding and weakened its\n   already lax gun laws,\" Megan Lewis, the group’s vice president, said in a\n   May 6 press release..\n\n   Moore, 25, was shot in the face May 2 and died two days later.", "Our conclusion\n\n   Police have seized a gun stolen from Georgia nearly four years ago and\n   believe it was used  in the recent, tragic shooting death of a young NYPD\n   officer.", "Our Sources\n\n   Everytown For Gun Safety, \"Statement on NYPD Officer Brian Moore killed\n   with illegal gun stolen from Georgia,\" May 5, 2015\n\n   U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives, National Tracing\n   Center, accessed May 7, 2015\n\n   U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives, 2014 Federal\n   Firearm Licensee Loss/Theft Report, April 7, 2015\n\n   Law Center to Prevent Gun Violence, Reporting Lost or Stolen Firearms\n   Policy Summary, Aug. 21, 2013\n\n   The New York Times, \"A Gun From Georgia Is Linked to a New York Officer’s\n   Death, Again,\" May 5, 2015\n\n   New York Post, \"Shot NYPD cop dies,\" May 4, 2015\n\n   Phone interview with ATF Agent Charles J. Mulham, public information\n   officer for the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives’\n   New York field division, May 7, 2015\n\n   Phone interview with Lt. John Grimpel, public information officer for New\n   York Police Department, May 7, 2015\n\n   Emails with Erika Soto Lamb, communications director, Everytown for Gun\n   Safety\n\n    \n\n    \n\n    Read About Our Process\n\n   The Principles of the Truth-O-Meter\n\nBrowse the Truth-O-Meter\n\n  More by Nancy Badertscher\n\n   State Public Service Announcement\n   stated on December 28, 2015:\n   By the end of 2015, more than 1,300 people will have died on Georgia\n   roads."]