{"The author": "s personal experience and observations: The expert mentions that the author, Geoffrey Sant, based his article on his personal experience and conversations with others. Sant claims to have heard about the phenomenon of \"hit-to-kill\" in Taiwan in the mid-1990s, and he also refers to a friend who made comments about intentionally killing pedestrians in China. This aspect involves the author's direct involvement and firsthand accounts.", "CCTV footage and video evidence": "The expert notes that Sant's article relies heavily on CCTV footage and video evidence to support the claim. The article mentions security cameras capturing drivers intentionally driving over pedestrians to ensure their death. Sant also provides an example of a specific incident from 2008, where a driver reverses at high speed and hits a grandmother, causing her body to be thrown by the impact. This aspect involves the use of visual evidence to support the claim.", "Cultural adage and societal norms": "Sant refers to a Chinese adage that supposedly supports the claim, stating that \"it is better to hit to kill than to hit and injure.\" This adage suggests a cultural acceptance or normalization of intentionally killing pedestrians in hit-and-run accidents. The expert mentions that Sant's article draws conclusions based on assumptions about scenes captured in CCTV footage, which may be influenced by this cultural adage. This aspect involves the exploration of cultural norms and beliefs to understand the claim's authenticity.", "Legal and financial incentives": "The expert mentions that Sant argues that China's laws create a perverse incentive for drivers to intentionally kill pedestrians rather than gravely injure them. Sant claims that if a driver cripples a person, they would be financially liable for the injured person's ongoing care for a lifetime. However, if the driver kills the person, they would only have to pay once, like a burial fee. This aspect involves the examination of legal and financial factors that may contribute to the claim's authenticity."}