[":\n   Says \"the cascading effects\" of climate change contributed to the rise of\n   ISIS.", "(Reuters\n   Photo)\n\n   Linda Qiu\n   By Linda Qiu September 23, 2015\n\nFact-checking the link between climate change and ISIS\n\n   \"Absurd,\" \"embarrassing,\" and \"brazenly silly\" were some of the insults\n   hurled at Democratic presidential candidate Martin O’Malley when he\n   suggested in July that climate change contributed to the rise of ISIS.", "Our ruling\n\n   O’Malley argued that \"the cascading effects\" of climate change contributed\n   to the rise of ISIS\n\n   The O’Malley campaign referred us to a credible March 2015 study that\n   supports his point.", "Our Sources\n\n   Democracy Now!, \"Martin O’Malley: Climate Change Helped Spark\n   Destabilization of Syria, Rise of Islamic State,\" Sept. 10, 2015\n\n   Youtube, Martin O'Malley: Climate Change Created ISIS, July 20, 2015\n\n   Email interview with Stephen Lassiter, foreign policy director for\n   O’Malley for President, Sept. 18, 2015\n\n   Proceedings from the National Academy, \"Climate change in the Fertile\n   Crescent and implications of the recent Syrian drought,\" March 2, 2015\n\n   Phone interview with Colin Kelley, researcher at the University of\n   California Santa Barbara, Sept. 21, 2015\n\n   Email interview with Richard Seager, a professor of climatology at\n   Columbia University, Sept. 21, 2015\n\n   Email interview with Ali Khedery, chairman of Dragoman Partners, Sept. 21,\n   2015\n\n   Email interview with Michael Doran, senior fellow at the Hudson Institute,\n   Sept. 18, 2015\n\n   Email interview with Kenneth Pollack, senior fellow at the Brookings\n   Institution, Sept. 21, 2015\n\n   Email interview with Andrew Solow, senior scientist at Woods Hole\n   Oceanographic Institution, Sept. 21, 2015\n\n   Fox News, \"RNC rips O’Malley for linking rise of ISIS to climate change,\"\n   July 21, 2015\n\n   NewsBusters, \"Press Loved O'Malley's 'Climate Change Plan' in June,\n   Ignores His Linking It to the Rise of ISIS Now,\" July 21, 2015\n\n   Free Beacon, \"O’Malley Blames Climate Change for Rise of Islamic State,\"\n   July 21, 2015\n\n   Washington Post, \"O’Malley: Climate change helped create ISIS,\" July 21,\n   2015\n\n   The Atlantic, \"A Link Between Climate Change and ISIS Isn’t Crazy,\" July\n   22, 2015\n\n   National Geographic, \"Climate Change Helped Spark Syrian War, Study Says,\"\n   March 2, 2015\n\n   New York Times, \"Researchers Link Syrian Conflict to a Drought Made Worse\n   by Climate Change,\" March 2, 2015\n\n   The Guardian, \"How Isis came to be,\" Aug. 22, 2014\n\n   American Meteorological Society, \"Water, Drought, Climate Change, and\n   Conflict in Syria,\" Feb. 3, 2014\n\n   The Center for Climate and Security, \"The Arab Spring and Climate Change,\"\n   Feb. 2013\n\n    Read About Our Process\n\n   The Principles of the Truth-O-Meter\n\nBrowse the Truth-O-Meter\n\n  More by Linda Qiu\n\n   Danielle Nierenberg\n   stated on January 9, 2017 a tweet:\n   \"Tanzania farmers face 12 years in prison for trading seeds thanks to\n   foreign aid.\""]