{"Understate": "The claim may understate the impact of charter schools on student performance by stating that only 20% do better than community public schools. This suggests that a majority of charter schools are not significantly different from public schools, potentially downplaying any positive effects.", "Lack enough support": "The claim lacks specific evidence or data to support the percentages mentioned. It does not provide information on the methodology or source of the study, making it difficult to assess the validity and reliability of the claim.", "Problematic assumption": "The claim assumes that the performance of charter schools can be accurately compared to community public schools. However, there may be various factors that can affect student performance in both types of schools, making it challenging to make a direct comparison.", "Exist alternative explanation": "The claim does not consider alternative explanations for the differences in performance between charter schools and community public schools. It does not explore other factors that may contribute to the varying outcomes, such as differences in student populations, resources, or teaching methods.", "Contradict fact": "The claim contradicts the fact that some charter schools may actually perform worse than community public schools, as mentioned in the expert's verdict. This suggests that the claim may be oversimplifying the complex nature of charter school performance.", "Exaggerate": "The claim may be exaggerating the impact of charter schools by stating that 40% do worse than community public schools. Without proper evidence or context, this statement may overstate the negative effects of charter schools on student performance.", "Falters at times": "The claim may falter in providing a comprehensive and accurate representation of charter school performance. It presents a simplified and generalized view without taking into account the variations and complexities within the charter school system."}