{"Exaggerate": "The claim exaggerates the frequency of mass shootings by stating that they have become commonplace since the Virginia Tech massacre in 2007, suggesting that they occur frequently. The expert's verdict provides evidence that there have been 79 incidents over a three-year period, which contradicts the claim of \"dozens\" of incidents.", "Lack enough support": "The claim lacks sufficient evidence to support the statement that mass shootings have become commonplace since the Virginia Tech massacre. The expert's verdict provides statistical data to support their conclusion, but the claim itself does not provide any specific evidence or sources.", "Problematic assumption": "The claim assumes that the trend of mass shootings has been consistently increasing since the Virginia Tech massacre in 2007. However, the expert's verdict does not provide information about the trend over time, only the number of incidents in the years relevant to the claim.", "Exist alternative explanation": "The claim does not consider alternative explanations for the increase in mass shootings, such as changes in reporting or categorization of incidents. The expert's verdict does not address this bias specifically.", "Understate": "The claim may understate the severity of mass shootings by stating that \"hundreds have died\" without providing specific numbers or context. The expert's verdict provides some data on the number of incidents, but it does not provide a comprehensive analysis of the number of fatalities.", "Falters at times": "The claim falters by not providing specific evidence or sources to support the statement about the frequency of mass shootings. The expert's verdict also acknowledges the initial difficulty in finding published statistics on mass shootings.", "Contradict fact": "The claim contradicts the fact that mass shootings have become commonplace since the Virginia Tech massacre by exaggerating the frequency. The expert's verdict provides evidence that the claim is accurate in terms of the number of incidents, but it contradicts the claim of \"dozens\" of incidents."}