{"Lack enough support": "The expert's verdict mentions that the numbers aren't in on whether ranked-choice voting actually has a concrete impact on turnout or engagement in the long term. This suggests that there may not be enough supporting evidence to definitively claim that ranked-choice voting increases voter turnout and engagement.", "Problematic assumption": "The claim assumes that ranked-choice voting increases voter turnout and engagement without providing sufficient evidence or data to support this assumption. The expert's verdict questions whether ranked-choice voting is the silver bullet to voter turnout and engagement, indicating that the assumption may be problematic.", "Exist alternative explanation": "The expert's verdict mentions that ranked-choice voting is an umbrella term and that there are alternative titles and variations of ranked-choice voting, such as instant runoff voting, preferential voting, and the alternative vote. This suggests that there may be alternative explanations or factors that contribute to any observed increase in voter turnout and engagement, rather than solely attributing it to ranked-choice voting.", "Contradict fact": "The expert's verdict states that the 2016 study by professor David Kimball at the University of Missouri-St. Louis found that ranked-choice voting was associated with a roughly 9 percentage point increase in voter turnout in municipal elections, but did not find that ranked-choice had a significant impact. This contradicts the claim that ranked-choice voting increases voter turnout and engagement, as the study did not establish a significant impact.", "Understate": "The expert's verdict mentions that ranked-choice voting allows voters to rank candidates from best to worst on their ballot instead of voting for just one person. This may be an understatement of the potential benefits and impacts of ranked-choice voting on voter turnout and engagement, as it only focuses on the ranking aspect and does not fully explore other potential factors that may contribute to increased participation.", "Exaggerate": "No significant evidence or statements in the expert's verdict suggest an exaggeration bias in the provided claim.", "Falters at times": "No significant evidence or statements in the expert's verdict suggest a faltering bias in the provided claim."}