{"Lack enough support": "The claim that the television show \"My Secret Terrius\" predicted the 2020 COVID-19 outbreak lacks enough support. The expert explains that while the show mentioned the word \"coronavirus,\" it has been around for decades and there have been previous coronavirus outbreaks.", "Problematic assumption": "The claim assumes that the mention of the word \"coronavirus\" in the show is a prediction of the specific COVID-19 outbreak in 2020. However, the expert clarifies that the fictional coronavirus in the show is different from the actual strain of coronavirus causing the pandemic.", "Understate": "The claim may understate the differences between the fictional coronavirus in the show and the real COVID-19 virus. The expert points out that the show's version of the virus was \"tweaked\" to make it more deadly, which is not possible in reality.", "Exaggerate": "The claim may exaggerate the significance of the show's mention of the word \"coronavirus\" by presenting it as a prediction of the COVID-19 outbreak. The expert highlights that the word \"coronavirus\" has been in use for decades and does not necessarily indicate a prediction of the specific outbreak.", "Exist alternative explanation": "The claim may overlook alternative explanations for the show's mention of the word \"coronavirus.\" The expert suggests that the mention may not be a prediction but rather a reference to the broader group of coronaviruses that have been known for a long time.", "Contradict fact": "The claim contradicts the fact that the COVID-19 outbreak is not a human-made bioweapon. The expert mentions that the show's version of the virus was portrayed as being \"tweaked\" to make it more deadly, which is not possible in reality.", "Falters at times": "The claim falters at times by presenting inaccurate information. For example, it states that the coronavirus in the show has a 90% mortality rate, which is not accurate for COVID-19. The expert explains that the actual fatality rate varies and is influenced by various factors."}