{"Exaggerate": "The claim exaggerates the extent to which social distancing was not practiced at John Lewis's funeral. The expert's verdict provides evidence that social distancing measures were followed, with only the middle section of the church being closer due to the presence of Lewis's relatives.", "Understate": "The claim understates the adherence to social distancing guidelines at the funeral. The expert's verdict provides evidence that social distancing measures were in place throughout the church, with marked floors and seats, temperature checks, and nurses present.", "Problematic assumption": "The claim assumes that famous people like John Lewis and George Floyd are allowed to have funerals that violate social distancing policies, while regular folks cannot. The expert's verdict does not provide evidence to support this assumption and focuses on the specific circumstances of Lewis's funeral.", "Exist alternative explanation": "The claim does not consider alternative explanations for the seating arrangement at the funeral. The expert's verdict explains that the closer seating in the middle section was due to the presence of Lewis's relatives who chose to sit closer together for comfort and support.", "Lack enough support": "The claim lacks sufficient evidence or support to back up the assertion that social distancing was not practiced at the funeral. The expert's verdict provides multiple pieces of evidence, including statements from the church spokesperson, photographs showing empty space, and references to CDC guidelines being followed.", "Contradict fact": "The claim contradicts the fact that social distancing measures were indeed followed at John Lewis's funeral. The expert's verdict provides evidence from the church spokesperson, photographs, and statements made during the service to support this.", "Falters at times": "The claim falters in accurately representing the situation at the funeral by stating that social distancing was not practiced. The expert's verdict provides a comprehensive analysis of the measures taken to ensure social distancing and contradicts the claim."}