{"Exaggerate": "The claim may be exaggerating the severity of adverse events by stating that 21 percent of patients from the Moderna vaccine trial experienced severe adverse events. The expert's verdict clarifies that this percentage refers to a specific subgroup (those who received the highest dose) and that Moderna did not proceed with this dose due to the reactions.", "Lack enough support": "The claim lacks enough support as it does not provide any specific evidence or data to back up the claim that 21 percent of patients experienced severe adverse events. The expert's verdict explains that this percentage is based on a subgroup from the phase 1 trial and that the current dose used is lower.", "Problematic assumption": "The claim assumes that the 21 percent figure represents the overall rate of severe adverse events in the Moderna vaccine trial, without considering the specific subgroup or the fact that the dose was not used in subsequent trials. The expert's verdict clarifies the context and limitations of this percentage.", "Exist alternative explanation": "The claim does not consider alternative explanations for the reported adverse events, such as the specific dose used or the fact that Moderna did not proceed with that dose due to the reactions. The expert's verdict provides additional information and context to understand the adverse events in the trial.", "Understate": "The claim may be understating the overall safety profile of the Moderna vaccine by focusing only on the subgroup with severe adverse events. The expert's verdict explains that the trial did not identify trial-limiting safety concerns and that the vaccine candidate proceeded to large clinical trials.", "Contradict fact": "The claim contradicts the fact that the Moderna vaccine has received emergency authorization from the US Food and Drug Administration (FDA) and that the Pfizer-BioNTech vaccine, which uses the same mRNA technology, also received approval. The expert's verdict mentions the FDA approval of the Moderna vaccine."}