{"Exaggerate": "The claim may exaggerate the impact of distracted driving on fatal car crashes by stating that 11 percent of all fatal crashes in 2009 were attributed to distracted driving. The study cited in the article actually states that distraction was reported for 11 percent of the drivers involved in fatal crashes, not 11 percent of all fatal crashes.", "Lack enough support": "The claim lacks enough support as it only relies on one study conducted by the U.S. Department of Transportation. The article mentions that the data on distracted-driving-related crashes and resulting injuries and fatalities is limited and reporting inconsistencies exist.", "Problematic assumption": "The claim assumes that distracted driving is the sole cause of the reported fatal crashes. However, the study mentioned in the article states that the vast majority of distracted-driving related fatalities (84 percent) were associated with driving in a careless or inattentive manner, which could include various activities such as using cell phones, eating, or talking.", "Exist alternative explanation": "The claim does not consider alternative explanations for the reported fatal crashes. The study mentioned in the article indicates that distraction was reported for 11 percent of the drivers involved in fatal crashes, but it does not specify whether distraction was the primary cause or a contributing factor.", "Contradict fact": "The claim contradicts the fact that distraction figured into a bigger percentage of fatal crashes in 2009 (16 percent) according to the study, rather than the 11 percent mentioned by the claim.", "Falters at times": "The claim falters at times by not accurately representing the statistics and information provided in the study. It states that distraction figured into 11 percent of fatal crashes, while the study actually states that distraction was reported for 11 percent of the drivers involved in fatal crashes.", "Understate": "The claim may understate the impact of distracted driving by not considering other potential factors or causes of the reported fatal crashes."}