{"Exaggerate": "The claim exaggerates the potential consequences of thieves obtaining personal information from discarded boarding passes. The expert's verdict states that the personal information obtained is of marginal value and unlikely to allow thieves to tap into one's bank account.", "Understate": "The claim understates the potential risks of thieves obtaining personal information from discarded boarding passes. The expert's verdict acknowledges that a determined person might be able to obtain some nuggets of personal information, but does not fully emphasize the potential dangers.", "Lack enough support": "The claim lacks enough support to substantiate the claim that thieves can obtain specific personal details from discarded boarding passes. The expert's verdict mentions that the information obtained from a boarding pass barcode was limited to the person's name, frequent flyer number, and other personally identifiable information, but does not mention the other details mentioned in the claim (home address, banking details, email address, phone number).", "Exist alternative explanation": "The expert's verdict provides an alternative explanation by mentioning that the viral \"boarding pass\" items were mostly sourced from a less alarmist article, suggesting that the claim may have been exaggerated or sensationalized.", "Falters at times": "The expert's verdict suggests that the claim falters at times by mentioning that the breathless warnings about discarding boarding passes were reminiscent of other widely-circulated stories about hidden dangers, indicating a tendency to exaggerate or sensationalize.", "Problematic assumption": "The claim makes a problematic assumption that thieves can easily obtain personal details from discarded boarding passes. The expert's verdict highlights the complex series of steps involved in obtaining limited personal information from a boarding pass barcode, suggesting that it is not a straightforward or common occurrence.", "Contradict fact": "The claim contradicts the fact that the personal information obtained from a discarded boarding pass is unlikely to allow thieves to tap into one's bank account, as stated in the expert's verdict."}