{"Exaggerate": "The claim may exaggerate the statement made by the Oregon Department of Education (ODE) by stating that they explicitly told teachers that asking students to \"show their work\" in math class is a form of white supremacy. The ODE actually stated that expanding the ways in which teachers make students explain their question-answering process could help eliminate racial and language performance gaps.", "Problematic assumption": "The claim assumes that the ODE's promotion of the Pathway to Equitable Math Instruction project, which aims to address performance gaps between different groups of students, is equivalent to labeling the practice of asking students to show their work as white supremacy. This assumption is not supported by the evidence provided.", "Lack enough support": "The claim lacks sufficient evidence to support the assertion that asking students to show their work in math class is a form of white supremacy. The evidence provided only includes allegations and reports from conservative commentators and social media users, without any direct statements from the ODE explicitly making this claim.", "Exist alternative explanation": "The claim does not consider alternative explanations for the ODE's promotion of the Pathway to Equitable Math Instruction project, such as addressing educational disparities and improving teaching practices to support all students.", "Contradict fact": "The claim contradicts the fact that the ODE did not explicitly state that asking students to show their work is a form of white supremacy. The ODE emphasized the importance of expanding the ways in which students explain their question-answering process, rather than labeling the practice as such.", "Falters at times": "The claim falters by relying on online reports, conservative media outlets, and social media debates as sources of information, which may not always provide accurate or unbiased information.", "Understate": "There are no apparent instances of understatement in the claim."}