{"Understates": "The claim initially suggests that the images show mass graves being dug in New York to bury all victims of the COVID-19 pandemic, but the expert's verdict clarifies that not all local people who die from COVID-19 are automatically buried at this site. The claim understates the fact that Hart Island has been used as a burial site for deceased people with no next of kin for over 150 years.", "Lack enough support": "The claim lacks sufficient evidence or support to prove that the images depict mass graves specifically for COVID-19 victims. The expert's verdict mentions that the images show large trenches being dug on Hart Island to accommodate an influx of deceased individuals during the pandemic, but it does not explicitly state that these graves are exclusively for COVID-19 victims.", "Problematic assumption": "The claim assumes that the images show mass graves for COVID-19 victims without providing substantial evidence. However, the expert's verdict highlights that the burial site on Hart Island is used for individuals who have not been claimed by their next of kin, regardless of the cause of death. Therefore, assuming that all the burials in the images are related to COVID-19 is problematic.", "Exist alternative explanation": "The claim fails to consider alternative explanations for the images. While the claim assumes that the graves are for COVID-19 victims, the expert's verdict explains that Hart Island has been used for burials of deceased individuals without next of kin for a long time. This alternative explanation suggests that the graves may not be exclusively for COVID-19 victims.", "Contradict fact": "The claim contradicts the fact that not all people who die from COVID-19 in New York are buried at the site depicted in the images. The expert's verdict clarifies that the burial site is used for individuals who have not been claimed by their next of kin, regardless of the cause of death.", "Exaggerate": "The claim exaggerates the situation by suggesting that the images show mass graves being dug in New York. While the expert's verdict confirms that large trenches are being dug on Hart Island, it does not confirm that these trenches qualify as \"mass graves\" in the traditional sense.", "Falters at times": "The claim falters by not providing a comprehensive and accurate description of the situation. It fails to mention the historical context of Hart Island as a burial site for individuals without next of kin and does not clarify that the burials on the island are not limited to COVID-19 victims."}