{"Exaggerate": "The claim exaggerates the difference between Hillary Clinton's and Donald Trump's immigration plans by stating that \"illegal immigrants convicted of committing crimes get to stay\" under Clinton, while \"terrorists and dangerous criminals\" are \"kept out\" under Trump. The expert's verdict clarifies that Clinton has also expressed support for deporting violent criminals and terrorists, which contradicts the claim's exaggeration.", "Contradict fact": "The claim contradicts the fact that Clinton has stated she would deport violent criminals, terrorists, and anyone who threatens safety. The expert's verdict provides evidence of Clinton's stance on deporting such individuals.", "Understate": "The claim may understate the potential consequences of Clinton's support for allowing certain illegal immigrants who committed fewer than three misdemeanors to stay in the US. The expert's verdict mentions that Clinton supported measures, including the 2013 bipartisan Senate immigration bill, that would have allowed such individuals to stay under certain conditions.", "Problematic assumption": "The claim assumes that Clinton's plan allows all illegal immigrants convicted of committing crimes to stay, which is a problematic assumption. The expert's verdict clarifies that Clinton's support for allowing some individuals to stay is limited to those who committed fewer than three misdemeanors and met other requirements.", "Lack enough support": "The claim lacks enough support to demonstrate the extent to which illegal immigrants convicted of committing crimes would be allowed to stay under Clinton's plan. The expert's verdict provides more context by explaining the conditions under which certain individuals would be eligible to stay.", "Exist alternative explanation": "The claim fails to consider alternative explanations for the differences between Clinton's and Trump's immigration plans. The expert's verdict highlights that both candidates have expressed concerns about border security and deporting dangerous individuals, suggesting that their approaches may not be as different as the claim implies."}