{"Exaggerate": "The claim exaggerates the percentage of babies born to women who are not here legally at LBJ Hospital. The expert's research found that while many illegal immigrants give birth in the U.S., the incentive for coming here is based more on economic hopes rather than quick citizenship for U.S.-born babies.", "Lack enough support": "The claim lacks sufficient evidence to support the assertion that over 81 percent of babies born at LBJ Hospital are born to women who are not here legally. The expert's research found that the claim was based on an opinion article and hearsay from officials at the Harris County Hospital District.", "Problematic assumption": "The claim assumes that the primary reason for illegal immigrants to give birth in the U.S. is to obtain citizenship for their children. The expert's research found that economic hopes play a larger role in motivating illegal immigrants to come to the U.S.", "Exist alternative explanation": "The claim does not consider alternative explanations for why women who are not here legally give birth at LBJ Hospital. The expert's research found that economic reasons, rather than citizenship, are the primary motivator for illegal immigrants.", "Contradict fact": "The claim contradicts the fact that the incentive for illegal immigrants to come to the U.S. is primarily based on economic hopes rather than obtaining citizenship for their children. The expert's research found that the claim was not supported by evidence.", "Falters at times": "The claim falters in providing evidence to support the assertion that women who are not here legally routinely have babies in the U.S. to \"anchor\" their families. The expert's research found that the claim was not well-supported.", "Understate": "The claim may understate the complexity of the issue of illegal immigration and the motivations behind women giving birth in the U.S. The expert's research found that economic hopes play a significant role in motivating illegal immigrants to come to the U.S."}