{"Understate": "The claim may understate the gender pay gap by stating that women are paid 77 cents for every $1 men get for the same work. The expert's verdict mentions that the gap drops dramatically when factors like education levels, job titles, and time on the job are taken into account.", "Lack enough support": "The claim lacks enough support as it does not provide specific evidence or data to back up the statement. The expert's verdict mentions that other data, such as hourly wages tracked by the Bureau of Labor Statistics and data comparing the same jobs, yield smaller wage gaps.", "Problematic assumption": "The claim assumes that the gender pay gap is solely due to discrimination, without considering other factors such as occupation, time on the job, and education level. The expert's verdict mentions that the gap is influenced by these factors, and when they are taken into account, the wage gap shrinks to the low single digits.", "Exist alternative explanation": "The expert's verdict suggests that the gender pay gap may be explained by factors such as differences in occupation, time on the job, and education level. This implies that there may be alternative explanations for the wage gap, rather than solely attributing it to discrimination.", "Contradict fact": "The expert's verdict contradicts the claim by stating that former President Jimmy Carter's claim of women making 23 percent less than men for doing the same work was rated as Mostly False. This contradicts the claim that women are paid 77 cents for every $1 men get for the same work.", "Exaggerate": "The claim may exaggerate the gender pay gap by stating that women are paid 77 cents for every $1 men get for the same work without considering other factors. The expert's verdict mentions that the gap drops significantly when factors like education levels, job titles, and time on the job are taken into account.", "Falters at times": "The claim falters at times by not providing enough evidence or considering alternative explanations for the gender pay gap. The expert's verdict highlights the limitations of the claim and mentions other data that yield smaller wage gaps."}