{"Understate": "The claim states that over 17,000 adults arrested at the border had prior criminal records, while the expert's verdict mentions that only 6,259 individuals with criminal records were encountered by agents in between ports of entry in 2018. This suggests that the claim may be understating the actual number of individuals with criminal records at the border.", "Lack enough support": "The claim does not provide specific evidence or sources to support the numbers mentioned (17,000 adults arrested, 6,000 gang members). The expert's verdict also mentions that no credible evidence has been provided to support the claim that a \"major number\" of the deported gang members belonged to MS-13. This lack of supporting evidence suggests a bias in the claim.", "Exist alternative explanation": "The expert's verdict mentions that the claim includes individuals who were encountered at ports of entry and were denied entry due to routine checks. These individuals would not have crossed the border illegally, raising the possibility of alternative explanations for their inclusion in the claim.", "Falters at times": "The claim mentions \"many of them MS-13\" without providing specific evidence or numbers to support this statement. The expert's verdict states that no credible evidence has been provided to support the claim that a \"major number\" of the deported gang members belonged to MS-13. This suggests that the claim may falter in providing accurate information about the affiliation of the gang members.", "Exaggerate": "The claim uses the phrase \"over 17,000\" and \"6,000 gang members,\" which may imply a larger number than what the expert's verdict presents. The expert's verdict mentions that only 6,259 individuals with criminal records were encountered by agents in between ports of entry in 2018, indicating a potential exaggeration in the claim.", "Problematic assumption": "The claim assumes that the presence of individuals with prior criminal records at the border justifies the need for a wall. However, the expert's verdict highlights that a significant percentage of these individuals were encountered at ports of entry and were denied entry. This challenges the assumption that a wall would effectively address the issue of individuals with criminal records crossing the border."}