{"Exaggerate": "The claim may be exaggerating the impact of the change in COVID-19 testing guidelines by stating that \"one PCR test is not enough to diagnose COVID-19.\" The expert's verdict mentions that a second test and clinical correlation are required for a positive case, but it does not explicitly state that one PCR test is completely insufficient for diagnosis.", "Lack enough support": "The claim lacks sufficient support or evidence to back up the assertion that \"one PCR test is not enough to diagnose COVID-19.\" The expert's verdict provides information about the use of PCR tests and the change in guidelines, but it does not provide specific evidence or data to support the claim.", "Problematic assumption": "The claim assumes that the change in COVID-19 testing guidelines means that asymptomatic individuals and those who only underwent one test will not be considered positive cases. However, the expert's verdict does not explicitly state this assumption or provide evidence to support it. It is possible that the claim is making an assumption based on the information provided, but it is not clearly supported.", "Exist alternative explanation": "The claim suggests that the change in COVID-19 testing guidelines means that a single positive PCR test will no longer count toward new cases. However, the expert's verdict does not provide alternative explanations for the change in guidelines or the reasons behind it. It only mentions the need for a second test and clinical correlation for a positive case.", "Contradict fact": "The claim contradicts the fact that PCR tests have been used to distinguish COVID-19 positives from negatives since its global emergence over a year ago. The expert's verdict confirms the use of PCR tests for diagnosis but mentions the change in guidelines that now require a second test and clinical correlation for a positive case.", "Falters at times": "There is no clear evidence or indication that the claim falters at times or presents inconsistent information. The expert's verdict provides information about the use of PCR tests and the change in guidelines, but it does not highlight any inconsistencies or contradictions in the claim.", "Understate": "There is no clear evidence or indication that the claim understates the impact of the change in COVID-19 testing guidelines. The claim presents the change as a significant shift, but it may be exaggerating the impact without sufficient evidence or support."}