{"Lack enough support": "The claim lacks enough support as it is based on the presence of certain product codes on the World Bank's WITS website, but it does not provide evidence of actual purchases of Covid-19 test kits in 2018.", "Problematic assumption": "The claim assumes that the presence of certain product codes on the WITS website indicates that countries were purchasing Covid-19 test kits in 2018. However, the World Bank clarifies that these codes correspond to medical equipment used for other purposes and were classified as Covid-19 products by the World Customs Organization to facilitate monitoring.", "Exist alternative explanation": "The World Bank explains that the product codes mentioned in the claim correspond to medical devices used to diagnose or treat Covid-19, including diagnostic reagents and instruments used in clinical laboratories. This suggests an alternative explanation that these codes were used to track the movement of such medical devices during the pandemic, rather than indicating purchases in 2018.", "Understate": "The claim may understate the significance of the World Bank's explanation and the alternative explanation provided. It emphasizes the presence of product codes on the WITS website without giving enough weight to the World Bank's clarification that these codes correspond to medical equipment used for other purposes and were classified as Covid-19 products for monitoring purposes.", "Contradict fact": "The claim contradicts the fact that the presence of certain product codes on the WITS website does not prove that countries were buying test kits for Covid-19 prior to the detection of Sars-Cov-2 in December 2019 in China. The World Bank confirms that the product codes correspond to medical equipment used for a long time for other purposes.", "Exaggerate": "The claim may exaggerate the significance of the presence of certain product codes on the WITS website by implying that it proves countries were purchasing Covid-19 test kits in 2018, without considering the alternative explanation provided by the World Bank.", "Falters at times": "The claim may falter at times by not fully acknowledging the World Bank's explanation and alternative explanation, and by relying heavily on the presence of product codes on the WITS website as evidence of purchases in 2018."}