{"Lack enough support": "The claim that Rhode Island already gets more revenue per capita from gambling than any other state in the country lacks enough support. The expert's investigation found that the sources cited by the claimant were flawed and did not provide accurate comparisons or include revenues from other sources of gambling in other states.", "Problematic assumption": "The claim assumes that Rhode Island leads the nation in per-capita gambling revenue without providing sufficient evidence to support this assumption. The expert's investigation found that the sources cited by the claimant were flawed and did not provide accurate comparisons.", "Exist alternative explanation": "The claim does not consider alternative explanations or factors that could affect the per-capita gambling revenue in Rhode Island, such as the presence of casinos, card rooms, and racetracks in other states. The expert's investigation found that the sources cited by the claimant did not factor in revenues from these other sources of gambling.", "Contradict fact": "The claim contradicts the fact that Rhode Island reported only gross sales, while other states reported net sales figures that accounted for expenses. The expert's investigation found that the comparison made by the claimant using the National Conference of State Legislatures' report was flawed.", "Understate": "The claim may understate the financial benefits of gambling for Rhode Island by focusing on the social costs rather than considering the overall economic impact. The expert's investigation found that gambling is the state's third-largest source of revenue, bringing in about $355 million in the 2011 fiscal year.", "Exaggerate": "The claim may exaggerate the significance of Rhode Island's per-capita gambling revenue by stating that it is the national leader without sufficient evidence to support this claim. The expert's investigation found that the sources cited by the claimant were flawed and did not provide accurate comparisons.", "Falters at times": "The claim falters at times by relying on flawed sources and not providing sufficient evidence to support its assertion about Rhode Island's per-capita gambling revenue. The expert's investigation found that the sources cited by the claimant were flawed and did not provide accurate comparisons."}