{"Exaggerate": "The claim may be seen as exaggerating the extent of Sen. Pat Toomey's actions by stating that he \"tried to shut down the federal government\" in order to eliminate funding for Planned Parenthood. The expert's verdict suggests that whether or not Toomey was actually threatening to shut down the government may be rhetorical.", "Lack enough support": "The claim lacks sufficient evidence or support to prove that Sen. Pat Toomey indeed tried to shut down the federal government to eliminate funding for Planned Parenthood. The expert's verdict highlights the fact that Toomey voted against a spending bill containing language to defund Planned Parenthood, but this was not enough to pass.", "Problematic assumption": "The claim assumes that Sen. Pat Toomey's vote against the spending deal that didn't contain language to defund Planned Parenthood was an attempt to shut down the government. The expert's verdict suggests that this assumption may be rhetorical and not necessarily reflective of Toomey's actual intentions.", "Exist alternative explanation": "The claim does not consider alternative explanations for Sen. Pat Toomey's vote against the spending deal. The expert's verdict mentions that Toomey released a statement expressing his support for efforts to permanently stop government shutdowns, indicating that there may be other reasons behind his vote.", "Contradict fact": "The claim contradicts the fact that Sen. Pat Toomey's vote against the spending deal was not enough to cause a government shutdown. The expert's verdict states that the spending deal passed with a majority vote, with only 20 senators, including Toomey, voting against it.", "Understate": "The claim may be seen as understating the complexity of the debate over Planned Parenthood and the government shutdown. The expert's verdict provides additional context and details about the controversy surrounding Planned Parenthood and the various votes and positions taken by legislators.", "Falters at times": "The claim may falter at times in accurately portraying Sen. Pat Toomey's actions and intentions regarding funding for Planned Parenthood. The expert's verdict highlights the discrepancies between the claim and the actual events and statements made by Toomey."}