{"Understate": "The claim may understate the difference in spending by local councils between regions outside of London and London itself. The expert's verdict mentions that the difference in per capita spending is \"up to 40% lower,\" suggesting that the actual difference could be even higher.", "Lack enough support": "The claim lacks specific data or evidence to support the statement that spending by local councils is up to 40% lower across regions outside of London. The expert's verdict mentions HMRC statistics and comparisons made in the past, but it doesn't provide specific evidence for the claim itself.", "Exist alternative explanation": "The expert's verdict suggests that there could be alternative explanations for the difference in per capita spending, such as differences in government grants and local revenue-raising capacity. This indicates that the claim may not consider these alternative factors that could influence the spending disparity.", "Problematic assumption": "The claim assumes that per capita spending by local councils is the sole determinant of the quality or effectiveness of public services. However, the expert's verdict mentions that not all spending comes via councils and that there are limitations in how public money is allocated and earmarked for different regions.", "Falters at times": "The claim may falter at times in accurately representing the difference in spending between regions outside of London and London. The expert's verdict mentions the imperfect nature of statistics on transport infrastructure spending and the ambiguity in how public money is allocated to different regions, suggesting that the claim's representation of the difference may not be entirely accurate.", "Exaggerate": "The claim may exaggerate the difference in spending by stating that it is up to 40% lower across regions outside of London. The expert's verdict mentions that the difference in per capita spending is about 35% less, which is slightly lower than the claim's assertion.", "Contradict fact": "There is no evidence to suggest that the claim contradicts any facts or established information."}