{"Problematic assumption": "The claim assumes that the differing lockdown orders are the sole reason for the differences in COVID-19 cases, deaths, hospitalizations, job losses, and vaccination rates between New York and Florida. The expert's verdict highlights that there are other factors at play, such as the timing of the outbreak and the lessons learned from New York's experience.", "Lack enough support": "The claim lacks sufficient evidence to support its assertion that New York has more COVID-19 cases, deaths, hospitalizations, job losses, and lags on vaccinations compared to Florida. The expert's verdict mentions that some of the numbers in the graphic accompanying the claim check out, but it does not provide a comprehensive analysis of the data.", "Exist alternative explanation": "The claim suggests that the differences in COVID-19 data between New York and Florida can be attributed to the political affiliations of their respective governors. However, the expert's verdict points out that this is a simplistic explanation and that there are other factors, such as the timing of the outbreak and the lessons learned, that should be considered.", "Contradict fact": "The claim contradicts the fact that New York was the epicenter of the pandemic before Florida had significant numbers of cases. This contradicts the claim's implication that New York's higher COVID-19 figures are solely due to differing lockdown orders.", "Exaggerate": "The claim may exaggerate the differences in COVID-19 cases, deaths, hospitalizations, job losses, and vaccination rates between New York and Florida by presenting them as solely caused by the differing lockdown orders. The expert's verdict highlights that the comparison is fraught and that other factors should be taken into account.", "Understate": "No specific instance of understatement is evident in the claim or the expert's verdict.", "Falters at times": "The claim falters by oversimplifying the complex factors involved in the differences in COVID-19 data between New York and Florida. The expert's verdict points out the limitations of comparing the two states and highlights the need for a nuanced understanding of the situation."}