{"Exaggerate": "The claim may exaggerate the increase in the size of Wisconsin's \"rainy day fund\" by stating that it is \"165 times bigger than when we first took office.\" This suggests a significant increase, but without providing the actual initial amount of the fund, it is difficult to determine the true extent of the increase.", "Lack enough support": "The claim lacks enough support to fully evaluate its accuracy. While the governor's office cited two state reports to back the claim, these reports only provide the current and initial amounts of the fund without further context or details.", "Problematic assumption": "The claim assumes that the increase in the \"rainy day fund\" is solely attributable to the actions of Governor Scott Walker. However, the fund's growth is also influenced by legislative requirements and previous budget surpluses.", "Exist alternative explanation": "An alternative explanation could be that the increase in the \"rainy day fund\" is primarily due to the surplus in the final budget of Walker's predecessor, Democratic Gov. Jim Doyle. This suggests that the fund's growth may not be solely attributed to Walker's actions.", "Falters at times": "The claim falters in providing a clear and comprehensive explanation of how the \"rainy day fund\" has grown over time. It fails to mention the legislative requirements for surplus transfers and the impact of tax-cut legislation on contributions to the fund.", "Contradict fact": "The claim contradicts the fact that the \"rainy day fund\" was not significantly funded during the first 20 years of its existence, according to the nonpartisan Legislative Fiscal Bureau. This contradicts the notion that the fund's growth is solely attributed to Walker's actions.", "Understate": "The claim may understate the significance of the deposits made to the \"rainy day fund\" during Walker's tenure. While the claim mentions three deposits, it does not provide a comprehensive analysis of the fund's growth during this period."}