{"Understate": "The claim may understate the potential impact of the increasing requirement for college credentials on the job market by stating that \"soon\" 60 percent of jobs will require some college credential. The expert's verdict mentions that the forecast from \"Help Wanted\" report suggests that more than 60 percent of jobs nationally, 58 percent in Georgia, will require some form of postsecondary education by 2018.", "Lack enough support": "The claim lacks specific evidence or data to support the statement that \"soon\" 60 percent of jobs will require some college credential. The expert's verdict mentions two major reports that support the claim, but the claim itself does not provide direct evidence or sources.", "Problematic assumption": "The claim assumes that the increase in the requirement for college credentials in jobs is a crisis or a problem that needs to be addressed. This assumption may be debatable, as it does not consider alternative perspectives or potential benefits of having a more educated workforce.", "Exist alternative explanation": "The claim does not mention any alternative explanations for the increasing requirement of college credentials in jobs. It presents the statistic without considering other factors that may contribute to this trend, such as technological advancements or changes in the nature of work.", "Falters at times": "The claim may falter at times by not providing a clear timeline or specific timeframe for when \"soon\" the 60 percent requirement will be in effect. This lack of specificity can weaken the claim's credibility.", "Contradict fact": "There is no evidence to suggest that the claim contradicts any established facts. However, without specific data or sources, it is difficult to determine if the claim accurately represents the current and future job market requirements in Georgia.", "Exaggerate": "The claim does not appear to exaggerate any specific information or statistics. However, without further evidence or context, it is challenging to determine if the claim accurately represents the situation in Georgia."}