{"Lack enough support": "The claim lacks sufficient evidence or support to prove that a telecom bill could prevent the State Corporation Commission from obtaining rate-of-return information from electric utilities. The claim is based on statements made by House Minority Leader Ward Armstrong but does not provide any additional evidence or data to back up the claim.", "Problematic assumption": "The claim assumes that the telecom bill could hinder the State Corporation Commission's ability to regulate electric utilities without providing concrete evidence or a detailed explanation of how this would occur. It is based on the assumption that certain provisions in the bill could have a negative impact on the Commission's regulatory powers.", "Falters at times": "The claim may falter or lack clarity in explaining the connection between the telecom bill and the State Corporation Commission's ability to obtain rate-of-return information from electric utilities. It does not provide a clear and concise explanation of how the bill could directly impact the Commission's regulatory functions.", "Contradict fact": "The claim may contradict the fact that the telecom bill was approved by the General Assembly and is awaiting the Governor's decision. This suggests that the bill went through the necessary legislative process and was not deemed to hinder the State Corporation Commission's ability to regulate electric utilities.", "Understate": "The claim may understate the potential impact of the telecom bill on the State Corporation Commission's ability to obtain rate-of-return information from electric utilities. It does not provide a comprehensive analysis of all the provisions in the bill that could potentially affect the Commission's regulatory powers.", "Exist alternative explanation": "The claim does not explore alternative explanations for the concerns raised by House Minority Leader Ward Armstrong and the State Corporation Commission. It does not consider other possible reasons or factors that could have influenced their statements or positions."}