{"Exaggerate": "The claim may be exaggerating the cost of incarcerating individuals in Wisconsin by stating that it is \"actually cheap\" compared to the rest of the country without providing sufficient evidence or comparison data.", "Lack enough support": "The claim lacks enough support to back up the assertion that Wisconsin's per-inmate costs are among the cheapest in the nation. The evidence provided only includes the cost for adult male and female inmates in a specific year and does not provide a comprehensive comparison to other states.", "Problematic assumption": "The claim assumes that the cost of incarcerating individuals is the sole factor in determining whether it is better for taxpayers to reintegrate them into society or let them depend on government programs or commit another crime. This assumption oversimplifies the complex factors involved in rehabilitation and reentry programs.", "Exist alternative explanation": "The claim does not consider alternative explanations for the cost differences between states, such as variations in the size of the prison population, different funding priorities, or differing approaches to corrections.", "Contradict fact": "The claim contradicts the fact that comparing prison costs between states is complex and not easily determined. The expert's analysis highlights the challenges in obtaining accurate and comprehensive data for such comparisons.", "Understate": "The claim may understate the potential costs associated with incarcerating individuals by only providing a range of $30,000 to $40,000 per year per person. It does not take into account additional costs such as healthcare, education, and rehabilitation programs.", "Falters at times": "The claim falters at times by not addressing the criticisms raised by listeners regarding the focus on former inmates' reentry to society and potentially neglecting the concerns of those who have stayed out of prison. This could indicate a bias towards favoring individuals who have been incarcerated."}