{"Exaggerate": "The claim may be considered an exaggeration because it states that this would be the first time Congress would place limits on the commander-in-chief's ability to be commander-in-chief, while in reality, there have been instances in the past where Congress imposed limits on the president's use of military force.", "Lack enough support": "The claim lacks enough support as it does not provide sufficient evidence or examples to back up the assertion that this would be the first time Congress has placed limits on the commander-in-chief's ability to be commander-in-chief.", "Problematic assumption": "The claim assumes that the current debate over authorizing military action against the Islamic State is the only instance where Congress has placed limits on the commander-in-chief's authority. This assumption overlooks historical precedents and conflicts between the legislative and executive branches over military powers.", "Exist alternative explanation": "The claim does not consider alternative explanations for the current debate and the proposed limitations on the president's use of military force. It fails to acknowledge that some hawkish Republicans actually prefer giving the president wider leeway in going after the Islamic State, suggesting that there are differing opinions within Congress on this matter.", "Falters at times": "The claim falters at times by oversimplifying the complex relationship between Congress and the president regarding military powers. It fails to acknowledge the longstanding tension and conflicts that have existed since the Founding Fathers, as well as the various legislative methods through which military actions can be authorized.", "Understate": "The claim may understate the historical context and previous instances where Congress has imposed limits on the president's use of military force. It overlooks the fact that military operations since World War II have been conducted through authorizations for the use of military force, which have often included limitations on the president's authority.", "Contradict fact": "The claim contradicts the fact that there have been previous instances where Congress has placed limits on the commander-in-chief's ability to be commander-in-chief. It fails to acknowledge the 1800 Supreme Court case, Bas vs. Tingy, which established that Congress can set limits on military actions authorized by other legislative methods."}