{"Exaggerate": "The claim may be exaggerating the percentage of undocumented immigrants who come by plane and overstay their visas. The expert's verdict mentions that it is hard to prove how these immigrants travel, and the research on overstays was conducted in 1997, making it difficult to determine the current percentage accurately.", "Lack enough support": "The claim lacks sufficient evidence or data to support the assertion that almost 40 percent of undocumented immigrants come by plane and overstay their visas. The expert's verdict mentions that it is challenging to prove how these immigrants travel, and the available research is outdated.", "Problematic assumption": "The claim assumes that a wall would not be effective in stopping unauthorized immigration because a significant percentage of immigrants come by plane and overstay their visas. However, this assumption overlooks other potential alternative explanations for unauthorized immigration and the effectiveness of a wall.", "Exist alternative explanation": "The claim does not consider alternative explanations for unauthorized immigration, such as entries without inspection or other methods of illegal entry. The expert's verdict mentions that there are two groups of undocumented immigrants - overstays and entries without inspection - and the claim focuses only on overstays.", "Falters at times": "The claim may falter in accurately representing the percentage of undocumented immigrants who come by plane and overstay their visas. The expert's verdict mentions that the available research is outdated, and it is challenging to determine the current percentage accurately.", "Understate": "The claim may be understating the percentage of undocumented immigrants who come by plane and overstay their visas. The expert's verdict suggests that the actual percentage of visa overstayers might be higher than the claimed 40 percent.", "Contradict fact": "The claim does not directly contradict any known facts, but it relies on outdated research and lacks sufficient evidence to support the stated percentage."}