{"Lack enough support": "The claim lacks specific data or sources to support the statement that there were more than 10,000 unaccompanied children in United States government immigration detention centers as of May 2018. The expert's verdict provides information about the increase in the number of detained children, but it does not provide an exact number for May 2018.", "Problematic assumption": "The claim assumes that all unaccompanied children in government detention centers were separated from their parents as a result of the Trump administration's \"zero tolerance\" policy. The expert's verdict mentions that child separation has been increasing under the Trump administration, but it does not provide specific information on how many of the detained children arrived with parents from whom they were subsequently separated.", "Exist alternative explanation": "The claim does not consider other potential reasons for the increase in the number of unaccompanied children in government detention centers. The expert's verdict mentions the Trump administration's \"zero tolerance\" policy as a driving factor, but there could be other factors contributing to the increase as well.", "Contradict fact": "There is no contradiction of fact in the provided claim or expert's verdict.", "Exaggerate": "The claim does not appear to exaggerate the number of unaccompanied children in government detention centers. The expert's verdict provides information about the increase in the number of detained children, but it does not provide an exact number for May 2018.", "Understate": "The claim does not appear to understate the number of unaccompanied children in government detention centers. The expert's verdict provides information about the increase in the number of detained children, but it does not provide an exact number for May 2018.", "Falters at times": "There is no evidence to suggest that the claim falters at times or presents inconsistent information. The expert's verdict provides additional information and context related to the claim."}